[
    {
        "id": "000121d407675c38abe0bb07529610d8",
        "title": "China Strikes Back Over US Tariffs Imposed by Trump",
        "url": "https://www.newsweek.com/china-retaliates-tariffs-us-trump-2025656",
        "channel_text": "World",
        "user_author_name": "[\", Fox News and Bauer Media.\", \"The London Evening Standard\", \"Writers Page\", \"and\", \"Brendan Cole is a Newsweek Senior News Reporter based in London, UK. His focus is Russia and Ukraine, in particular the war started by Moscow. He also covers other areas of geopolitics including China. Brendan joined Newsweek in 2018 from the International Business Times and well as English, knows Russian and French. You can get in touch with Brendan by emailing b.cole@newsweek.com or follow on him on his X account @brendanmarkcole.\", \", where he primarily produced short-form and breaking-news videos for the Journal's X (Twitter) page, with a focus on business, finance and markets. He also produced longer videos for other platforms on a wide range of subjects, from the U.K. royal family's finances to the cost of tackling climate change. He has also worked for\", \"Brendan Cole\", \"Daniel Orton\", \"Daniel Orton is an editor on the live news team at Newsweek, based in London, U.K. He was previously a video news editor at the company between 2017 and 2019, before spending several years as a senior video journalist on the social news team at\", \"The Wall Street Journal\"]",
        "user_url": "https://www.newsweek.comjavascript:void(0);",
        "created_at": "2025-02-04T03:11:20-05:00",
        "description": "",
        "text": "China has announced its own set of tariffs on U.S. goods, in response to Washington imposing a 10 percent tariff on Chinese imports that took effect Tuesday.\nStarting February 10, China said it will implement a 15 percent tariff on American coal and liquefied natural gas (LNG), and a 10 percent tariff on crude oil, agricultural machinery, and large-engine cars imported from the U.S.\nNewsweek has contacted the White House for comment by email.\nTrump signed an order Saturday seeking to levy significant tariffs on America's largest trading partners, citing concerns over fentanyl flow and trade deficits.\nTariffs are taxes on imported goods, typically paid by the importing businesses, which can then pass costs onto consumers through higher prices. It means Trump's move—and China's response—threatens a trade war that could hit the pockets of Americans.\nIn a statement on Tuesday, China's U.S. embassy said that the tariff increase announced by Trump \"seriously violates [World Trade Organization] rules and is a typical act of unilateralism and trade protectionism.\"\nBeijing was in turn imposing \"completely justified and reasonable\" measures and had also filed a lawsuit with the WTO opposing Trump's move, it added.\nThe statement also said China was tough on counternarcotics and had given support to the U.S. on the issue and as such needed to solve its problems with fentanyl \"in an objective and rational war,\" instead of threatening countries with \"arbitrary tariff hikes.\"\nTrump's tariff decision \"undermines the foundation of China-U.S. economic and trade cooperation,\" the Chinese embassy's statement added.\nCraig Singleton, senior China fellow at the Foundation for Defense of Democracies (FDD), told Newsweek China's president Xi Jinping needed to project strength domestically in response to Trump's tariffs without hurting his country's economy.\nSingleton believes this would involve leveraging state-owned enterprises and reserves to absorb tariff shocks while betting on U.S. businesses and consumers to resist prolonged economic battles.\n\"Expect incremental retaliation—like agricultural import bans or regulatory roadblocks—carefully calibrated to sting without sparking an all-out trade war,\" he said.\nSingleton believed that China could respond to Trump by targeting areas where it dominates. These include advanced batteries, minerals, semiconductors, solar components, pharmaceuticals, and agriculture.\nChina could use these sectors to amplify costs for the U.S. while minimizing immediate domestic harm, showcasing China's strategic leverage in supply chains, he added.\nChina's embassy in Washington, DC: \"China calls on the U.S. to correct its wrongdoings, maintain the hard-won positive dynamics in the counternarcotics cooperation, and promote the steady, sound and sustainable development of China-U.S. relationship.\"\nCraig Singleton from the Foundation for Defense of Democracies told Newsweek: \"Xi will likely play the long game with calibrated defiance—retaliating just enough to save face while banking on U.S. divisions and Trump's tariffs burning out before China does. His message? Resilience over retaliation, patience over provocation.\"\nBeijing has called on Washington to enter negotiations and \"meet China halfway\" suggesting that it is interested in negotiations and Trump and Xi are scheduled to speak later this week, according to the White House.\n\nUpdate 02/04/25, 5 a.m. ET: This article has been updated with further information.\n\n",
        "image": "https://d.newsweek.com/en/full/2580269/china-us-national-flags.jpg?w=1200&f=21449ff2747a6d8f9c32ec73db239b44",
        "tag": "",
        "keyword": "[\"China\", \"Tariffs\", \"Donald Trump\"]"
    },
    {
        "id": "00061dde30f672f652bd752bd293d190",
        "title": "Medicare Plan's New Deductible Sparks Confusion: What to Know",
        "url": "https://www.newsweek.com/medicare-plans-new-deductible-sparks-confusion-what-know-2025980",
        "channel_text": "U.S.",
        "user_author_name": "[\"Writers Page\", \"Suzanne Blake is a Newsweek reporter based in New York. Her focus is reporting on consumer and social trends, spanning from retail to restaurants and beyond. She is a graduate of UNC Chapel Hill and joined Newsweek in 2023. You can get in touch with Suzanne by emailing s.blake@newsweek.com. Languages: English\", \"Suzanne Blake\"]",
        "user_url": "https://www.newsweek.comjavascript:void(0);",
        "created_at": "2025-02-04T12:29:03-05:00",
        "description": "",
        "text": "A specific Medicare Advantage plan has sparked confusion online after a new deductible took effect this year.\nThe Cigna True Choice Plus PPO Medicare Advantage plan is one of many available to millions of seniors who opt for the privatized version of traditional Medicare.\nHowever, as premiums and deductibles increase, some Medicare Advantage recipients find themselves cash-strapped and unable to afford necessities.\nSince the beginning of 2025, patients have complained about Cigna's new Medicare Advantage $500 deductible.\nFor the True Choice Plus Medicare PPO plan, the deductible is now $500, excluding insulin furnished through an item of durable medical equipment. That's compared to a $0 deductible in 2024.\nThe actual monthly premium increase for the Cigna plan was minimal, but now patients must meet that yearly deductible to obtain the same health coverage.\nNewsweek reached out to Cigna via email for comment.\nSmile Insurance Group CEO Chris Fong told Newsweek: \"This trend is more common in PPO plans compared to HMO plans. Previously, deductibles were typically applied only to out-of-network services in PPO plans. However, with the recent shift to include in-network services, we can only speculate that this change is influenced by the Inflation Reduction Act. Additionally, we anticipate more significant changes in 2026 with the removal of value-based benefits unless we see a change by the Trump administration.\"\nAlex Beene, a financial literacy instructor for the University of Tennessee at Martin, told Newsweek: \"As providers have struggled to bring in more profits on Medicare Advantage plans, we've seen some dramatic revisions to plans from when they first started...We're sadly going to see more of these increases in the years to come.\n\"Insurance providers are off-loading more of the up-front costs of care on their customers as they face higher costs in virtually every area of medical care. It's more important than ever for individuals who are signed up for Medicare Advantage to take a more active role in understanding changes to their plans and how they'll need to manage them within their current budgets.\"\nKevin Thompson, a finance expert and the founder and CEO of 9i Capital Group, told Newsweek: \"While the exact year-over-year increase remains unclear, some customers report their deductibles rising to $500 for their specific plans. The primary reason for this increase is the rising cost of health care, combined with inflationary pressures and insurers adjusting to higher medical expenses.\n\"As a result, patients will face higher out-of-pocket costs before their coverage takes effect. Over time, the overall cost of care will continue to rise, with premiums likely increasing on the back end as well.\"\nMichael Ryan, a finance expert and the founder of MichaelRyanMoney.com, told Newsweek: \"This is a classic case of 'the devil's in the details' that's catching many retirees off guard...Cigna kept their monthly premium increase modest. They just slipped in this $500 deductible. It's like getting a great deal on a car lease but finding out there's a hefty down payment you weren't expecting.\"\nWhile deductible changes are more likely to affect those on PPO plans, patients should look into which services count toward their deductible or not.\n\"Don't panic, but do the math,\" Ryan said. \"For some seniors, paying this deductible might still be cheaper than switching plans.\"\nFor those who are frequent health care users, the deductible could be met relatively quickly.\nAfter the Inflation Reduction Act, which capped prices for several Medicare-covered drugs and lowered the percentage of income spent on Medicare premiums, insurers have figured out other ways to push the higher cost burden to patients.\n\"This isn't just about Cigna. We're likely seeing the start of a trend where Medicare Advantage plans shift more costs to consumers while keeping premiums artificially low to attract enrollment,\" Ryan said. \"The real story here isn't just about a $500 deductible. It's about how the entire Medicare Advantage landscape is evolving. And it's not in favor of the consumer.\"\n",
        "image": "https://d.newsweek.com/en/full/2580896/cigna.jpg?w=1200&f=44fb0c21673875a1030c30504779b9ff",
        "tag": "",
        "keyword": "[\"Health Insurance\", \"seniors\", \"Medicare\", \"Health and Medicine\", \"Health Care\"]"
    },
    {
        "id": "001b21b87656636e217020c6941c9a08",
        "title": "A top Chinese official tours Thai-Myanmar border to highlight crackdown on scam centers",
        "url": "https://apnews.com/article/myanmar-china-online-scams-thailand-c91fce0ca0aeeb0f577e2e229d2fc6c6",
        "channel_text": "World News",
        "user_author_name": "",
        "user_url": "",
        "created_at": "2025-02-17T15:28:36",
        "description": "Efforts to shut down online scam centers in Myanmar appear to gain momentum with a visit by a top Chinese official to the border zone ahead of expected large-scale repatriations of workers in the illicit industry.",
        "text": "BANGKOK (AP) — Efforts to shut down online scam centers in Myanmar appeared to gain momentum on Monday as a top Chinese security official visited both sides of the Thai-Myanmar border ahead of expected large-scale repatriations of workers in the illicit industry.\nThe visit by Liu Zhongyi, China’s vice minister of public security and commissioner of the Criminal Investigation Bureau, was part of a stepped-up effort by the three countries to address the online scam problem, Thailand’s Deputy Prime Minister Phumtham Wechayachai told reporters. \nAreas of Myanmar bordering Thailand have been serving as havens for criminal syndicates employing an estimated hundreds of thousands of people from Southeast Asia and elsewhere who help carry out online scams including false romantic ploys, bogus investment pitches and illegal gambling schemes.\nSuch scams have cost victims around the world tens of billions of dollars, while the people recruited to carry them out have often been tricked into taking the jobs under false pretenses and find themselves trapped in virtual slavery.\nLast week, some 260 people from 20 nations, including many from Africa, crossed from Myanmar into Thailand after they were reportedly rescued from scam centers.\n\n\nOn a visit to China in early February, Thai Prime Minister Paetongtarn Shinawatra vowed along with China’s leader Xi Jinping to crack down on the scam networks. Just ahead of her visit, Thailand cut off electricity, internet and gas supplies to several areas in Myanmar along the border, citing national security and severe damage that Thailand has suffered from scam operations.\nThe repatriations of foreign workers from Myanmar have been organized by the Border Guard Force in Myawaddy, a militia of the Karen ethnic minority that exercises control over the area. However, critics have accused it of being involved in the criminal activities, at least to the extent of providing protection to the scam centers.\nThe group’s leader, Saw Chit Thu, denied in a news conference on Monday that his group was involved in scam activities, but acknowledged business links to some properties hosting the centers, which he said initially operated simply as resorts.\nThai media reported last week that Thailand’s Department of Special Investigation was considering seeking arrest warrants for Chit Thu and others for alleged human trafficking.\nThai officials have said as many as 7,000-10,000 more people may be repatriated, but Phumtham cautioned that Thailand would only receive those that are ready to be taken back right away by their home countries.\nThe Bangkok Post newspaper reported that an initial batch of about 600 Chinese nationals from scam centers are expected to be flown back to China on chartered flights when Liu concludes his visit.\nLiu visited the border areas in Thailand’s Tak province on Monday and appeared in Myawaddy in Myanmar, apparently at a location where hundreds of people believed to have been rounded up from several scam centers are being held awaiting repatriation.\nVideo of Liu’s visit showed hundreds of people there sitting on the ground with their belongings in a large open-walled hall.\n“ China is actively conducting bilateral and multilateral cooperation with Thailand, Myanmar, and other countries, taking comprehensive measures to address both the symptoms and root causes, and working together to block criminals from committing crimes in relevant countries,” Chinese Foreign Ministry spokesperson Guo Jiakun said in Beijing. \n“This is part of our joint efforts to eradicate the scourge of online gambling and telecom fraud, and to maintain the safety of people’s lives and property and the order of exchanges and cooperation among regional countries.”\nDramatic stories of Chinese people being lured to work in Thailand only to be trafficked into a scam compound in Myanmar spread widely on social media in China, causing alarm and denting Thailand’s reputation as a safe destination for Chinese visitors. \nAmong those trapped was Chinese actor Wang Xing, who arrived in Thailand on a promise of getting a job and was abducted to Myanmar. He was quickly rescued after the incident circulated on social media.\nAn earlier crackdown on scam centers in Myanmar was initiated in late 2023, after China expressed embarrassment and concern over illegal casinos and scam operations along its border in Myanmar’s northern Shan state.\nEthnic guerrilla groups with close ties to Beijing shut down many operations, and an estimated 45,000 Chinese nationals suspected of involvement were repatriated.\n",
        "image": "https://dims.apnews.com/dims4/default/17531a1/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2F41%2F4a0ebc2aced9f043cdbe7fc71604%2F9740ebcc4f5e4e7382cee319bfc3ce0a",
        "tag": "[\"Asia Pacific\", \"China\", \"Fraud\", \"General news\", \"Asia\", \"Thailand\", \"Myanmar\", \"China government\"]",
        "keyword": ""
    },
    {
        "id": "003976933f531bc2f67d70ce9524abf5",
        "title": "Deadly Ebola Outbreak Hits Ugandan Capital",
        "url": "https://www.wsj.com/world/africa/deadly-ebola-outbreak-hits-ugandan-capital-ce5cff3a",
        "channel_text": "world/africa",
        "user_author_name": "[\"\\n\\n\\n\\n                  Nicholas Bariyo\\n                 \\n\\n\"]",
        "user_url": "[\"https://www.wsj.com/news/author/nicholas-bariyo\"]",
        "created_at": "2025-01-30 15:49:00",
        "description": "Health officials worry the unusual strain will spread in crowded Kampala after the death of a male nurse.",
        "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n            Health authorities have identified 44 people who had contact with the victim around Kampala, Uganda.\n           \n\n\n\n             Photo:\n            \n            abubaker lubowa/Reuters\n           \n\n\n\n\n          KAMPALA, Uganda—Uganda reported an outbreak of the Ebola virus in its capital on Thursday, raising concerns the deadly disease might spread through the congested East African city.\n         \n\n          A 32-year-old male nurse died in Kampala the previous day and postmortem samples confirmed he had been infected with the Sudan strain of Ebola, an unusual variant for which there are no proven vaccines or cures, said Diana Atwine, permanent secretary at Uganda’s Health Ministry.\n         \n\n\n           It is the first recorded death from Ebola in Uganda since the last outbreak two years ago. The country has experienced seven Ebola outbreaks, including four of the Sudan strain.\n          \n\n           The nurse, employed at the government-owned Mulago National Referral Hospital in Kampala, developed flulike symptoms and sought treatment at various health facilities, including a traditional healer and a hospital in the coffee-growing district of Mbale, more than 150 miles of east of the capital, Atwine said.\n          \n\n\n\n\n\n\n\n\n             Doctors inside the Ebola isolation section of a hospital in Mubende, Uganda, in 2022.\n            \n\n\n              Photo:\n             \n             Hajarah Nalwadda/Associated Press\n            \n\n\n\n           “The patient presented with a five-day history of high fever, chest pain and difficulty in breathing which later progressed to unexplained bleeding from multiple body parts,” she said. “The patient experienced multi-organ failure and succumbed to the illness.”\n          \n\n           Health authorities have identified 44 people who had contact with the victim around Kampala, a city of five million. Among those contacts are 30 health workers and patients, as well as 11 family members. Ebola is transmitted through direct contact with infected bodily fluids and tissue.\n          \n\n           During Uganda’s last outbreak, the disease killed 55 people, while at least 142 were infected. The country’s worst Ebola outbreak killed some 224 people in 2001 in the northern district of Gulu.\n          \n\n           Most known outbreaks of Ebola, including one that killed 11,300 people in West Africa between 2013 and 2016, were caused by a different version of the virus, known as the Zaire strain.\n          \n\n\n\n\n\n\n\n\n             Diana Atwine, permanent secretary at Uganda’s Health Ministry, said postmortem samples confirmed the victim had been infected with the Sudan strain of Ebola.\n            \n\n\n              Photo:\n             \n             abubaker lubowa/Reuters\n            \n\n\n\n           A hemorrhagic fever virus, Ebola can cause uncontrolled bleeding and is fatal in about half of cases, according to Johns Hopkins University.\n          \n\n           Vaccines developed in recent years to combat the Zaire strain—one by U.S. drugmaker Merck and another by U.K.-based\n           \n\n\n\n             GlaxoSmithKline\n            \n\n           —have helped contain multiple outbreaks, including in Uganda, Congo and Guinea.\n          \n\n           Uganda is considering treating those who came in contact with the Kampala victim with three types of vaccine they have in stock from\n           \n            a 2022-23 outbreak\n           \n           , in the hopes that at least one of which will prove effective against the Sudan strain, the Health Ministry said.\n          \n\n           Health officials are urging the public to maintain social-distancing and follow hand-washing protocols.\n          \n\n           Write to Nicholas Bariyo at\n           \n            nicholas.bariyo@wsj.com\n           \n\n\n",
        "image": "[]",
        "tag": "",
        "keyword": ""
    },
    {
        "id": "003ed53dbe61d85bce466f31b5fff85f",
        "title": "To Win, Trump Needs a Trump New Deal. Luckily, He Created One in 2020 | Opinion",
        "url": "https://www.newsweek.com/win-trump-needs-trump-new-deal-luckily-he-created-one-2020-opinion-1909847",
        "channel_text": "Opinion",
        "user_author_name": "Darvio Morrow",
        "user_url": "https://www.newsweek.com/authors/darvio-morrow",
        "created_at": "2024-06-07T16:07:12-04:00",
        "description": "",
        "text": "According to most polls, former President Donald Trump is leading President Joe Biden in the 2024 election. And yet, in the midst of all of the chaos surrounding yet another historic presidential election cycle, the one thing that isn't being talked about enough is actual policy; Trump has spent much of the campaign dwelling on the very basket the Democrats seem to have put all their eggs in—his manifold criminal trials.\nIt's fair for Trump to talk about the veracity of the legal issues surrounding him, but he is mistaken if he thinks that he can coast to re-election on his own grievances. People are hurting, and if he wants to win, Trump needs to clearly articulate what he will do to improve the lives of the average American.\nTo that end, the Trump campaign should pursue a bold economic vision, one that could transform the country for years to come. He should plot out an aggressive economic plan targeting communities in the highest need and combine them into his version of FDR's \"New Deal\" to usher in a badly needed era of prosperity. The good news is, Trump doesn't have to look very far for the plan: His campaign introduced three in 2020 which would make an excellent foundation for a Trump New Deal. In 2020, they were called Revitalizing Rural America, the American Dream Plan, and the Platinum Plan.\nThe Platinum Plan called for increasing access to capital in Black communities, to the tune of $500 billion, as well as benefits for local hires, and increasing the number of Black owned contracting businesses and private equity investment funds with $40 billion in government funding and traditional private investment. The plan also called for connecting HBCU's with government research and development, potentially opening up billions to those institutions. It also called for allowing Black churches to compete for federal dollars for community and social programs, \"examining alternative ways to build credit, including rent, utilities and phone bills\" and other licensing reforms.\nThe Platinum Plan is a great place for Trump to start. Black businesses hire more Black people than non-Black owned businesses, and a recent Brookings Institution report pointed out that the underrepresentation of Black businesses is costing the American economy billions of dollars. The Platinum Plan's call for $500 Billion in capital to Black businesses alone would've been transformative for the community and the nation.\nThe American Dream plan was just as aggressive. That plan called for adding 500,000 Hispanic owned businesses to the economy, increasing access to capital and federal contracting opportunities, and creating 2 million new jobs in the Hispanic American community. It even called for making the Minority Business Development Agency permanent, a near-radical suggestion considering the number of so called conservatives attempting to tear down minority business incentives.\nSimilar to the Platinum Plan, the American Dream plan also called for giving Hispanic churches \"the ability to compete for federal resources for their communities,\" opening up new resources to those institutions.\nThe Revitalizing Rural America plan, which was part of the Trump White House's 2021 budget proposal introduced in 2020, would have invested billions into that part of the country. The proposal included a $1.5 billion loan level for rural business, $8.9 billion in farm loans, and $25 billion for a new 'Revitalizing Rural America' grant program \"to help areas with broadband, transportation, water and road and bridge projects.\"\nThe plan also included $614 million in funding for water and wastewater grants and loans, $5.5 billion in rural electric loans, $690 million in loans to finance broadband infrastructure, among other things.\nThe Trump campaign would be wise to pursue all of these proposals again. Not only would they change the country for the better, but they are smart politically. Combining the three into one overall New Deal type plan is also a way to unify people in order to get it done.\nThe three proposals would impact a large swath of the country, as Black Americans, Hispanic Americans, and rural Americans, who are overwhelmingly white, would all be well positioned to be full participants in a rebuilt American economy.\nIt makes sense to specifically target these groups for revitalization, as that is where the greatest need and growth potential is. America cannot continue to grow economically without ensuring that all of its citizens receive access to opportunity.\nIf they really want to set the country on the right path and ensure that Trump's high-for-a-Republican poll numbers among minorities aren't a mirage, they need to breathe new life into their previous plans, remove the saboteurs on their own side who are trying to destroy initiatives like this, and move forward.\n\nDarvio Morrow is CEO of the FCB Radio Network and co-host of The Outlaws Radio Show.\n\n\nThe views expressed in this article are the writer's own.\n\n",
        "image": "https://d.newsweek.com/en/full/2399173/donald-trump.jpg?w=1200&f=d3dd74d31c4f25c3649b29a4374ec8f3",
        "tag": "",
        "keyword": "Donald Trump"
    },
    {
        "id": "007ed1f69931b752fbfddf36aa673d5b",
        "title": "Steak 'n Shake Announces Major Change to Fries in RFK Jr.–Backed Move",
        "url": "https://www.newsweek.com/steak-n-shake-announces-major-change-fries-rfk-jr-backed-move-2016748",
        "channel_text": "U.S.",
        "user_author_name": "[\"James Bickerton\", \"James Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is covering U.S. politics and world politics. He has covered the intersection between politics and emerging technology, such as artificial intelligence. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\", \"Writers Page\"]",
        "user_url": "https://www.newsweek.comjavascript:void(0);",
        "created_at": "2025-01-17T11:16:47-05:00",
        "description": "",
        "text": "Steak 'n Shake has announced that by the end of February it will use \"100 percent beef tallow,\" or animal fat, for cooking its fries rather than vegetable oil, which has come under criticism on health grounds.\nNewsweek contacted Steak 'n Shake for comment Friday via the company's online inquiry form outside of regular office hours.\nIncoming president Donald Trump has nominated environmental campaigner Robert F. Kennedy Jr. to be the secretary of health in his administration.\nKennedy has been a staunch critic of certain types of seed oil, also known as vegetable oil, and has said Americans are being \"unknowingly poisoned\" by the product.\nSome companies have announced policy changes likely to curry favor with Trump since his election win, such as rolling back diversity, equity and inclusion (or DEI) programs.\n\nWhat To Know\n\nIn a Thursday post on X (formerly Twitter), Steak 'n Shake wrote: \"Steak n Shake to Use 100% Beef Tallow. No Cap.\"\nThe post went viral on the platform, racking up more than 7,000 reposts and 4.9 million views.\nSteak 'n Shake later added: \"By the end of February 2025, all locations will use 100% all-natural beef tallow. If veg oil broke your heart, our tallow will make you fall in love again [french fries and red heart emoji].\"\nSteak 'n Shake had 493 restaurants as of March 31, 2023, with the highest concentration in the Midwest, according to parent company Biglari Holdings. The restaurant chain, founded in 1934 in Illinois, specializes in burgers, including steak burgers, and hand-dipped milkshakes, hence its name.\nFollowing his election victory in November, Trump announced he'd selected Kennedy, who had been running as an independent candidate before dropping out and endorsing the Republican nominee, as his secretary of health pick.\nKennedy has vowed to improve public health in the U.S. as part of what has been dubbed his Make America Health Again (MAHA) campaign, a play on Trump's MAGA movement.\nHe was fiercely critical of seed oils in an October 21 X post in which he said Americans are \"being unknowingly poisoned by heavily subsidized seed oils.\" He added: \"It's time to Make Frying Oil Tallow Again.\"\nThe health impact of cooking with vegetable oils is a contentious issue. The American Heart Association says there is \"no reason\" to avoid them.\nSpeaking to Health.com, Missouri-based dietitian Kristen White said: \"Seed oils offer pros and cons. They're rich in polyunsaturated fats and vitamin E, which are beneficial in moderation.\"\nHowever, she added that seed oils are \"high in omega-6 fats, which may promote inflammation if consumed in excess, and they can become unstable at high heat, forming harmful byproducts.\"\nRobert F. Kennedy Jr. wrote on X in October: \"Fast Food is a part of American culture. But that doesn't mean it has to be unhealthy, and that we can't make better choices. Did you know that McDonald's used to use beef tallow to make their fries from 1940 until phasing it out in favor of seed oils in 1990? This switch was made because saturated animal fats were thought to be unhealthy, but we have since discovered that seed oils are one of the driving causes of the obesity epidemic. Interestingly enough, this began to drastically rise around the same time fast food restaurants switched from beef tallow to seed oils in their fryers.\"\nSpeaking about the health benefits of vegetable oil versus beef tallow, Emma Laing, a University of Georgia nutritional scientist, told Health.com: \"Choosing one over the other is nuanced and is dependent on a person's lifestyle, behavior, and environmental circumstances.\"\nIt remains to be seen whether Steak 'n Shake's move is a one-off change or the beginning of a broader industry trend toward using beef tallow instead of vegetable oil.\nIf the Senate confirms Kennedy as health secretary, he could use the position to encourage the broader adoption of beef tallow in the U.S.\n",
        "image": "https://d.newsweek.com/en/full/2567236/stake-n-shake.jpg?w=1200&f=cd2150356e4a8ff147dc47dd0fa3bbbe",
        "tag": "",
        "keyword": "[\"Robert F. Kennedy Jr.\", \"Restaurants\", \"Donald Trump\"]"
    },
    {
        "id": "00835716391a7f7563345cfd4381ed42",
        "title": "Dozens of Dead Pulled From Illegal South African Gold Mine After Standoff With Authorities",
        "url": "https://www.wsj.com/world/africa/dozens-of-dead-pulled-from-illegal-south-african-gold-mine-after-standoff-with-authorities-a5dca09c",
        "channel_text": "world/africa",
        "user_author_name": "[\"\\n\\n\\n\\n                  Alexandra Wexler\\n                 \\n\\n\"]",
        "user_url": "[\"https://www.wsj.com/news/author/alexandra-wexler\"]",
        "created_at": "2025-01-15 15:07:00",
        "description": "The prospectors were trapped underground for months as police, on orders from South Africa’s government, attempted to starve them out.",
        "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n            Workers during a rescue operation at an abandoned gold mine in Stilfontein, South Africa, on Tuesday.\n           \n\n\n\n             Photo:\n            \n            Themba Hadebe/Associated Press\n           \n\n\n\n\n          STILFONTEIN, South Africa—At least 78 people have died after authorities imposed a blockade on an illegal gold mine here, part of\n          \n\n\n           a monthslong standoff\n          \n          between prospectors and a government determined to force them to surface—often by cutting off their food and water.\n         \n\n          Workers have rescued 246 miners alive since beginning the full-scale recovery operation on Monday. The survivors were charged with trespassing and other crimes and were either arrested or taken for medical treatment. The prospectors were trapped underground for months as police, on orders from South Africa’s government, attempted to starve them out of the disused Buffelsfontein gold mine, which extends some 8,000 feet below ground.\n         \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                   Zambia\n                  \n\n\n\n                   Zimbabwe\n                  \n\n\n\n                   namibia\n                  \n\n\n\n                   Botswana\n                  \n\n\n\n                   moz.\n                  \n\n\n\n                   Pretoria\n                  \n\n\n\n                   Johannesburg\n                  \n\n\n\n                   Stilfontein\n                  \n\n\n\n                   Durban\n                  \n\n\n\n                   South Africa\n                  \n\n\n\n                   Indian\n                  \n\n                   Ocean\n                  \n\n\n\n                   Atlantic\n                  \n\n                   Ocean\n                  \n\n\n\n                   Port Elizabeth\n                  \n\n\n\n                   Cape Town\n                  \n\n\n\n                   400 miles\n                  \n\n\n\n                   400 km\n                  \n\n\n\n\n\n\n\n\n                   Zambia\n                  \n\n\n\n                   Zimbabwe\n                  \n\n\n\n                   namibia\n                  \n\n\n\n                   Botswana\n                  \n\n\n\n                   moz.\n                  \n\n\n\n                   Pretoria\n                  \n\n\n\n                   Johannesburg\n                  \n\n\n\n                   Stilfontein\n                  \n\n\n\n                   Durban\n                  \n\n\n\n                   South Africa\n                  \n\n\n\n                   Port Elizabeth\n                  \n\n\n\n                   Cape Town\n                  \n\n\n\n                   Indian\n                  \n\n                   Ocean\n                  \n\n\n\n                   Atlantic\n                  \n\n                   Ocean\n                  \n\n\n\n                   400 miles\n                  \n\n\n\n                   400 km\n                  \n\n\n\n\n\n                   Daniel Kiss/WSJ\n                  \n\n\n\n\n\n\n\n\n\n\n           The operation was part of what police call their “Close the Hole” plan to combat illegal mining, an acute problem in South Africa, once the gold-mining capital of the world. The country suffers from a 42% unemployment rate, leading many jobless people to take reckless measures to earn a living.\n          \n\n           The government has come under fire from community members in Stilfontein, 100 miles southwest of Johannesburg, as well as human-rights groups, for both its methods and its failure to act sooner.\n          \n\n           “It’s a bit too late,” said Zethu Hlatshwayo, spokesman for the National Association of Artisanal Miners, a group advocating for the formalization and regulation of the informal mining sector. “We should have started with this last year already. We could have saved so many lives before now.”\n          \n\n           On Monday, a South African miners’ rights group released video footage of what appeared to be dozens of bodies wrapped in plastic shrouds underground and other miners who were alive, but emaciated and begging for assistance.\n          \n\n           Some of the miners resorted to eating a paste of vinegar, toothpaste and toilet paper while they were underground, according to community members and advocacy groups.\n          \n\n           In August, police sealed off entrances to the shafts, blocked food and water deliveries, and stationed guards at the remaining openings to arrest any miners who made their way to the surface.\n          \n\n\n\n\n\n\n\n\n             Community and family members on the sidelines of the rescue operations at the abandoned gold mine.\n            \n\n\n              Photo:\n             \n             Leon Sadiki/Bloomberg News\n            \n\n\n\n           Police, however, made little or no effort to assist those stuck below. “They said, ‘Our operation is only to go there and stand on top of the hole,’” said Thembile Botman, a community leader from the nearby Khuma township. “They said they didn’t have the capacity to go down and no intention to rescue anyone underground.”\n          \n\n           Since then, more than 1,500 miners have voluntarily emerged from the shaft. Most of them are from neighboring countries, including Mozambique, Lesotho and Zimbabwe, as well as a few South Africans.\n          \n\n           Police said late Wednesday that the two volunteer rescuers who have been venturing deep into the shaft to retrieve both the living and dead believe that no one now remains alive in the mine. The police say the rescuers plan a final sweep on Thursday morning before they call an end to the operation.\n          \n\n           Advocacy groups say dozens of bodies might still be underground, but in locations inaccessible to the rescuers, who descend into the depths in an elevator-like cage and are restricted in how far they can move in the tunnels.\n          \n\n           The survivors from shaft 11—where a crane and cage are being used to hoist men to the surface—were stuck in a part of the mine that wasn’t easy to climb out of, according to rights groups and community members. Botman, the community leader, said locals first notified police that miners were stuck underground without supplies at the end of October.\n          \n\n\n\n\n\n\n\n\n             The entrance to an abandoned mine in Stilfontein.\n            \n\n\n              Photo:\n             \n             christian velcich/Agence France-Presse/Getty Images\n            \n\n\n\n           A police spokeswoman didn’t respond to a request for comment on Wednesday.\n           \n           Khumbudzo Ntshavheni\n           \n           , minister in the South African presidency, told reporters in November that the government wouldn’t help what she called criminals. “We are going to smoke them out,” she said at the time.\n          \n\n           In mid-November, Botman was part of a local civilian team that began pulling miners out of the shaft.\n          \n\n           Over two months, the team, whom the police forced to sign indemnity forms before beginning their rescue operation, hoisted miners up one-by-one with a rudimentary pulley system, where a simple rope would be wound around miners’ legs and torso. Ten dead bodies as well as 35 miners still alive were retrieved in this manner.\n          \n\n           “Most of them could not even speak,” Botman said of the survivors.\n          \n\n\n\n\n\n\n\n\n             A miner was transported on a stretcher after he was rescued from underground on Tuesday.\n            \n\n\n              Photo:\n             \n             Themba Hadebe/Associated Press\n            \n\n\n\n           South Africa’s apartheid government relied on the country’s gold reserves for revenue when it faced international trade sanctions, before the end of white-minority rule in 1994. Many of those mines, however, are no longer commercially viable and have closed. South Africa was the world’s top gold producer for decades until 2007, when it began its descent to ninth position today, as the industry confronts pressure from violent crime, growing costs and regulatory uncertainty, as well as tapped-out reserves.\n          \n\n           But trace amounts of gold remain in the shafts, which impoverished South Africans and migrants from nearby countries risk their lives to retrieve. Miners routinely spend months at a time working underground.\n          \n\n           Industry experts say these informal prospectors who toil thousands of feet below the earth are often the lowest-level workers for international criminal gangs that ultimately sell the gold overseas.\n          \n\n           The South African government estimates that illegal gold mining costs the country the equivalent of over $3.7 billion a year in lost revenue.\n          \n\n           Write to Alexandra Wexler at\n           \n            alexandra.wexler@wsj.com\n           \n\n\n",
        "image": "[]",
        "tag": "",
        "keyword": ""
    },
    {
        "id": "00a50e41661a48aae12b9601a9ad35e3",
        "title": "Trump says he's considering buying used planes to serve as Air Force One amid Boeing delays",
        "url": "https://apnews.com/article/trump-air-force-one-boeing-plane-355ed87b00d7d82a061297f68c4ed89b",
        "channel_text": "Politics",
        "user_author_name": "",
        "user_url": "",
        "created_at": "2025-02-20T03:30:42",
        "description": "President Donald Trump says he's considering buying used Boeing aircraft — perhaps from an overseas seller — to use as Air Force One when he’s aboard, as he fumes over the U.S. plane-maker’s delays in producing two specially modified ones for presidential use.",
        "text": "WASHINGTON (AP) — President Donald Trump said Wednesday he is considering buying used Boeing aircraft — perhaps from an overseas seller — to use as Air Force One when he’s aboard, as he fumes over the U.S. plane-maker’s delays in producing two specially modified ones for presidential use.\nSpeaking to reporters aboard one of the two nearly 35-year-old Boeing 747-200 aircraft in current use, Trump said, “We’re looking at alternatives, because it’s taking Boeing too long.”\n“We may go and buy a plane,” Trump said, adding that he could then “convert it.” He later clarified that he was ruling out purchasing aircraft of Airbus, the European company that is the only other global supplier on large wide-body aircraft, but would consider a second-hand Boeing plane. “I would not consider Airbus. I could buy one from another country perhaps or get one from another country.”\nBoeing has the contract to produce updated versions, based on the more modern Boeing 747-8, but delivery has been delayed while the aircraft maker has lost billions of dollars on the deal, which was negotiated by Trump during his first term in office. \nIt’s not the planes, rather the heavy modification to make them suitable for the requirements of presidential travel and the top-level security clearances required for those involved, that has added to the cost and delays. Trump already dropped a requirement for the new generation of planes, which will be known as the VC-25B, to be capable of air-to-air refueling, like the pair of existing VC-25As, which were designed during the Cold War. \n\n\nOther modifications include highly classified communications equipment suitable for the country’s commander-in-chief, survivability enhancements for a range of contingencies, and self-contained air-stairs, allowing for their use in austere landing environments. \nDelivery initially was set for 2024, but has been pushed to some time in 2027 for the first plane and in 2028 — Trump’s final year in office — for the second, according to the U.S. Air Force.\nTrump on Saturday toured a newer Boeing 747-800 airplane to check out new hardware and technology features and highlight the aircraft maker’s delay in delivering updated versions of the Air Force One presidential aircraft, the White House said Saturday. Trump visited the 13-year-old private aircraft that had been owned by the Qatari royal family while it was parked at Palm Beach International Airport.\nThe New York Times was first to report that Trump was considering purchasing and modifying used aircraft to serve as new presidential aircraft.\n",
        "image": "https://dims.apnews.com/dims4/default/01f681c/2147483647/strip/true/crop/3825x2152+0+199/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F7a%2F433300228879cc800a5d440456bf%2Fbee069de5f294d03b2f9ec66e60187d7",
        "tag": "[\"AP Top News\", \"General news\", \"Donald Trump\", \"District of Columbia\"]",
        "keyword": ""
    },
    {
        "id": "00aca3312fee30215cba669f4d7de793",
        "title": "Mass Federal Firings May Imperil Pets, Cattle and Crops",
        "url": "https://www.nytimes.com/2025/02/26/science/trump-plant-animal-health.html",
        "channel_text": "",
        "user_author_name": "[\"Emily Anthes\", \"Apoorva M\", \"avilli\"]",
        "user_url": "",
        "created_at": "2025-02-26T10:03:03.000Z",
        "description": "The terminations, which hit agencies involved in protecting the nation’s food supply and agricultural products, could have long-lasting consequences, experts said.",
        "text": "\n\n\n\n              Shortly after taking office for the second time, President Trump began making deep cuts to agencies and programs that play critical roles in human health, slashing funding for medical research, halting global health aid and firing scores of workers at the Centers for Disease Control and Prevention.\n             \n\n              But the campaign to downsize government, which has been led by Mr. Trump and Elon Musk, has also hollowed out agencies and programs devoted to protecting plant and animal health. The recent wave of mass firings hit federal workers responding to the nation’s growing bird flu outbreak, protecting crops from damaging pests and ensuring the safety of pet food and medicine, among other critical duties.\n             \n\n              Although the government has since rescinded some of these firings, the terminations — combined with a\n              \n               federal hiring freeze\n              \n              and\n              \n               buyout offers\n              \n              — are depleting the ranks of federal programs that are already short on employees and resources, experts said.\n             \n\n              The damage could be long-lasting. Workers whose jobs were spared said that the upheaval had left them eyeing the exits, and graduate students said they were reconsidering careers in the federal government. The shrinking work force could also have far-reaching consequences for trade and food security and leave the nation unequipped to tackle future threats to plant and animal health, experts said.\n             \n\n\n\n\n\n\n\n\n\n              “These really were indiscriminate firings,” said John Ternest, who lost his job at the U.S. Department of Agriculture, where he was preparing to conduct studies on honeybee health and crop pollination. “We don’t know what we’ve lost until it’s potentially too late.”\n             \n\n              Plant and animal inspectors\n             \n\n              The most recent wave of firings focused on\n              \n               the roughly 200,000 “probationary” employees\n              \n              across the federal government, who had fewer job protections because they were relatively new to their positions. (For some roles, the probationary period can be as long as three years, and it can also reset when longtime employees are promoted.)\n             \n\n              The exact size and scope of the job losses remain unclear, and the U.S.D.A. did not answer questions about the number of workers who had been terminated or reinstated at several of its agencies.\n             \n\n              But in an emailed statement, a U.S.D.A. spokesman said that Brooke Rollins, the new secretary of agriculture, “fully supports President Trump’s directive to optimize government operations, eliminate inefficiencies and strengthen U.S.D.A.’s ability to better serve American farmers, ranchers and the agriculture community.”\n             \n\n              Reports suggest that the department\n              \n               has lost thousands of employees\n              \n              .\n             \n\n              That includes roughly 400 people who worked in its Animal and Plant Health Inspection Service, according to one U.S.D.A. official who asked not to be named for fear of retaliation. The plant protection and quarantine program within APHIS was especially hard hit, losing more than 200 employees, including agricultural inspectors, entomologists, taxonomists and even tree climbers who surveyed for pests, the official said.\n             \n\n\n\n\n\n\n\n\n\n              Some of the fired workers were responsible for combating invasive, plant-killing insects, such as the Asian long-horned beetle, within the nation’s borders. Others worked to ensure that\n              \n               agricultural products entering\n              \n              and exiting the country were free of pests and pathogens. Exotic fruit flies pose a particular risk to American agriculture, including the citrus and berry industries.\n             \n\n              The terminations are already causing import delays at the nation’s ports, according to the U.S.D.A. official. Over the longer term, if agricultural pests and pathogens found their way into the country, they could infest the nation’s homegrown crops, threatening food security and reducing demand for American agricultural products abroad.\n             \n\n              “If the United States gets a reputation for having dirty products, does that mean other countries will also, you know, step in and say, ‘Hey, we don’t want to buy your goods’?” the official said.\n             \n\n\n\n\n\n\n\n\n\n                Image\n               \n\n\n\n\n\n\n\n                U.S.D.A. workers with the agency’s eradication program to combat the invasive Asian long-horned beetle’s spread in West Babylon, N.Y.\n               \n\n\n                 Credit...\n                \n\n\n                  Bryan Thomas for The New York Times\n                 \n\n\n\n\n\n\n\n\n\n              The firings also hit the agency’s veterinary services program, which inspects imported livestock for disease and plays a key role in the nation’s bird flu response, said Dr. Joseph Annelli, the executive vice president of the National Association of Federal Veterinarians.\n             \n\n\n\n\n\n\n\n\n\n              The U.S.D.A.\n              \n               has quickly rehired\n              \n              some of the employees who were involved in the bird flu response, suggesting that their firings had been a mistake. But even before the recent terminations, the government was short on veterinarians, Dr. Annelli said. “There has not been adequate staffing for at least 10 years,” he said. “We need more veterinarians, not less.”\n             \n\n              The agency was in the midst of hiring additional people to assist with the bird flu response, Dr. Annelli said, but the federal hiring freeze put that process on hold.\n             \n\n              The workers who remain are nervous about the long-term stability of their jobs. “I’m not very optimistic,” said one current veterinary services employee, who requested anonymity to avoid retaliation and has already applied for another position outside the U.S. government.\n             \n\n              Agricultural scientists\n             \n\n              Roughly 800 people, including the leaders of laboratories, were also fired across the Agricultural Research Service, the in-house scientific agency at the U.S.D.A., according to a department official who was not authorized to discuss the matter and spoke on the condition of anonymity.\n             \n\n              The firings brought a wide range of research projects to an abrupt halt and left the technicians and the students who worked in these labs in limbo.\n             \n\n\n\n\n\n\n\n\n\n              One New York lab was in the middle of investigating a potential outbreak of late blight, a potato disease, when the lead scientist was fired, said Isako Di Tomassi, a graduate student at Cornell University who worked in the lab. Potato samples from a large, commercial farm are now locked up in the shuttered lab, “untouched and untested,” Ms. Di Tomassi said.\n             \n\n              Scientists and statisticians working in the U.S. Meat Animal Research Center in Nebraska, which studies livestock genetics and breeding, were also terminated, including those working on research projects in food safety and salmonella testing. The firings have led to objections from Nebraska’s Republican congressional delegation and industry groups.\n             \n\n              “We understand and respect the federal government’s desire to cut wasteful spending, but the truth of the matter is, U.S. MARC does not fall in that category,” the Nebraska Cattlemen Association said in a statement. The work being done at the center, the statement continued, “has potential to reduce costs for the beef industry long term and improve food safety for consumers.”\n             \n\n              Some — but not all — of the agency’s scientists were reinstated this week. Still, the mass firings could do lasting reputational damage to the agency, they said.\n             \n\n              “I think that people that want to earnestly do science are going to be viewing and remembering these decisions and how scientists are being treated,” said one agricultural researcher who was fired and then rehired and requested anonymity to protect the job.\n             \n\n\n\n\n\n\n\n\n\n              In interviews, several graduate students in agricultural science said that they were no longer sure whether they could build research careers in the federal government.\n             \n\n              “My future as a scientist seems very uncertain right now,” Ms. Di Tomassi said.\n             \n\n              “Getting a federal scientist position is a big deal,” she added. “It’s not easy to do, and all of that investment is now being let go.”\n             \n\n\n\n\n\n\n\n\n\n                Image\n               \n\n\n\n\n\n\n\n                The C.D.C.’s headquarters in Atlanta.\n               \n\n\n                 Credit...\n                \n\n\n                  Alyssa Pointer for The New York Times\n                 \n\n\n\n\n\n\n\n\n\n              Animal health regulators\n             \n\n              Although the Centers for Disease Control and Prevention primarily concerns itself with human health, the agency also aims to prevent zoonotic diseases, including by regulating the entry of animals — particularly those than can carry pathogens — into the United States.\n             \n\n              For example, the agency does not permit dogs that have recently been in countries with a high prevalence of rabies to enter the United States unless they have been vaccinated against the disease. C.D.C. officers also examine animals at port stations, and isolate or quarantine those exposed to dangerous pathogens.\n             \n\n\n\n\n\n\n\n\n\n              But the Trump administration recently dismissed about half of the C.D.C. employees at the agency’s 20 port health stations, leaving some stations entirely unattended.\n             \n\n              Calls to the port station in San Juan, P.R., last week were rerouted to the station in Miami, where a C.D.C. employee who declined to be identified said that no one would be at the San Juan post “for a very long time.”\n             \n\n              Workers were also fired from the Food and Drug Administration’s Center for Veterinary Medicine. Among those affected were employees reviewing data on novel animal medicines and working to ensure that pet food and animal feed were free of contaminants.\n             \n\n              Those teams were already short-staffed, said two fired employees, who asked not to be identified because they are appealing their terminations. They worried that the losses could slow down the approval of new animal drugs and even cause dangerous products to fall through the cracks.\n             \n\n              “It’s a gap in the safety structure,” one of the employees said. “They’re big challenges and there’s no one else to take it on. That’s the job of government.”\n             \n\n              Linda Qiu\n              \n              contributed reporting.\n             \n\n\n\n\n",
        "image": "[\"https://static01.nyt.com/images/2025/02/25/multimedia/00ANIMAL-HEALTH-02-tbwl/00ANIMAL-HEALTH-02-tbwl-facebookJumbo.jpg\"]",
        "tag": "[\"The terminations, which hit agencies involved in protecting the nation\\u2019s food supply and agricultural products, could have long-lasting consequences, experts said.\"]",
        "keyword": ""
    },
    {
        "id": "e324205c558ffb56ac35f3ec3f0132fd",
        "title": "Anne Marie Hochhalter, Paralyzed in Columbine Shooting, Dies at 43",
        "url": "https://www.nytimes.com/2025/02/18/us/anne-marie-hochhalter-columbine-shooting-dies.html",
        "channel_text": "",
        "user_author_name": "[\"Michael Levenson\"]",
        "user_url": "",
        "created_at": "2025-02-18T22:58:57.000Z",
        "description": "Fiercely independent, she publicly discussed the long-term effects of gun violence and spoke of forgiveness.",
        "text": "\n\n\n\n              Anne Marie Hochhalter, who spoke publicly about the long-lasting effects of gun violence after she was paralyzed in the 1999 mass shooting at Columbine High School in Colorado, was found dead on Sunday at her home in Westminster, Colo. She was 43.\n             \n\n              The police said that officers had found Ms. Hochhalter after they were called for a welfare check. The Adams County coroner, which initially handled Ms. Hochhalter’s case, said it had been transferred to the Jefferson County coroner, “given that her death was likely related to complications of paraplegia associated with the Columbine shooting.” The Jefferson County Coroner’s Office said\n              \n\n              that autopsy results were not yet available.\n             \n\n              Sue Townsend, who became close to Ms. Hochhalter after her stepdaughter, Lauren Townsend, was killed in the shooting, said that Ms. Hochhalter had been dealing with lingering effects from her injuries, including a pressure sore and an infection.\n             \n\n              Ms. Hochhalter was eating lunch with friends when two students opened fire at Columbine High School in Littleton, Colo., on April 20, 1999, killing 12 other students and a teacher before fatally shooting themselves.\n             \n\n\n\n\n\n\n\n\n\n              Ms. Hochhalter, a junior who was 17, was shot twice — once in the chest and once in the back — and was paralyzed from the waist down. Her brother, Nathan Hochhalter, who was a freshman at Columbine, was trapped in the school for hours until a SWAT team arrived.\n             \n\n\n\n\n\n\n\n\n\n                Image\n               \n\n\n\n\n\n\n\n                Ms. Hochhalter, second from left, met the Canadian pop star Celine Dion after her performance in Denver in 1999, with two other Columbine High School students: Beth Ratay, left, and Kim Chlumsky, right.\n               \n\n\n                 Credit...\n                \n\n\n                  The Denver Post/Associated Press\n                 \n\n\n\n\n\n\n\n\n\n              Six months after the shooting, their mother,\n              \n               Carla June Hochhalter\n              \n              , walked into a pawnshop, asked to see a gun, loaded it and killed herself. The elder Ms. Hochhalter, 48, had been struggling with depression and other mental health issues before the Columbine shooting, her daughter later said.\n             \n\n              But her death was “very much harder than what happened at Columbine,” Ms. Hochhalter told\n              \n               U.S. News & World Report\n              \n              in 2009. “It shocked me because, you know, I was injured by a gun and the fact that, you know, she committed suicide with one was very hard to understand.”\n             \n\n              As Ms. Hochhalter dealt with the loss of her mother, she leaned on her faith to help her rebuild her life, emotionally and physically, she said. She became “fiercely independent” and learned to maneuver in a wheelchair, to drive and to live by herself, Ms. Townsend said.\n             \n\n\n\n\n\n\n\n\n\n              “She told me, ‘I can do anything you can do, it just takes me longer,’” said Ms. Townsend, who said she and her husband, Rick, had considered Ms. Hochhalter “our acquired daughter.”\n             \n\n              After initially offering to help the family with Ms. Hochhalter’s medical appointments, the Townsends formed a lifelong bond with her, spending holidays with her and taking her to Hawaii on a vacation, where she went into the ocean for the first time.\n             \n\n              “She never thought of herself as a victim,” Rick Townsend said. “She identified as a survivor.”\n             \n\n\n\n\n\n\n\n\n\n                Image\n               \n\n\n\n\n\n\n\n                Anne Marie Hochhalter with Gabrielle Giffords, a retired politician and fellow shooting survivor, at a remembrance ceremony in Denver last year for the 25th anniversary of the Columbine shooting.\n               \n\n\n                 Credit...\n                \n\n\n                  Marc Piscotty/Getty Images\n                 \n\n\n\n\n\n\n\n\n\n              In 2016, when Sue Klebold, the mother of one of the Columbine shooters, released\n              \n               a memoir\n              \n              , “A Mother’s Reckoning,” Ms. Hochhalter wrote\n              \n               a note addressed to Ms. Klebold\n              \n              on Facebook, saying she felt no ill will toward her.\n             \n\n              “Just as I wouldn’t want to be judged by the sins of my family members, I hold you in that same regard,” Ms. Hochhalter wrote. “It’s been a rough road for me, with many medical issues because of my spinal cord injury and intense nerve pain, but I choose not to be bitter towards you. A good friend once told me, ‘Bitterness is like swallowing a poison pill and expecting the other person to die.’ It only harms yourself. I have forgiven you and only wish you the best.”\n             \n\n\n\n\n\n\n\n\n\n              Ms. Hochhalter worked for a time at Bath & Body Works and counseled other people with disabilities, Ms. Townsend said. She also supported other victims of gun violence. In 2012, she attended a vigil after a gunman killed 12 people inside an Aurora, Colo., movie theater. Her message to survivors: “It does get better. But it never goes away,” she told The Associated Press.\n             \n\n              As she dealt with chronic pain, she was often reminded of the lingering effects of the Columbine shooting. Once, when checking out at a grocery store, a cashier asked her bluntly why she was in a wheelchair.\n             \n\n              Ms. Hochhalter responded just as bluntly that she had been one of the students injured in the Columbine shooting. Then a man behind her in line said he had been part of a SWAT team that was not allowed to enter the school until hours after the shooting. He told her he was sorry he had not been able to get to her sooner.\n             \n\n              “And I was able to tell him, ‘It’s OK,’” she told U.S. News & World Report in 2009. “‘No one blames you; I don’t blame you.’ It was one of the greatest moments of my life.”\n             \n\n              Kitty Bennett\n              \n              contributed research.\n             \n\n\n\n\n",
        "image": "[\"https://static01.nyt.com/images/2025/02/18/multimedia/18xp-hochhalter-cmfj/18xp-hochhalter-cmfj-facebookJumbo.jpg\"]",
        "tag": "[\"Fiercely independent, she publicly discussed the long-term effects of gun violence and spoke of forgiveness.\"]",
        "keyword": ""
    },
    {
        "id": "e4428587fd2898816773ddd499488234",
        "title": "Motorola Solutions acquires RapidDeploy, a cloud-native Next Generation 911 solution provider for public safety",
        "url": "https://apnews.com/press-release/business-wire/tricia-quinn-tim-yocum-mobile-apps-texas-north-america-7f4b2693e77e4fa1a74efa7d313d0b66",
        "channel_text": "",
        "user_author_name": "",
        "user_url": "",
        "created_at": "2025-02-23T15:01:52",
        "description": "CHICAGO--(BUSINESS WIRE)--Feb 23, 2025-- Motorola Solutions (NYSE: MSI) has acquired RapidDeploy, a complementary cloud-native 911 solution provider for public safety, based in Austin, Texas.",
        "text": "CHICAGO--(BUSINESS WIRE)--Feb 23, 2025--\nMotorola Solutions (NYSE: MSI) has acquired RapidDeploy, a complementary cloud-native 911 solution provider for public safety, based in Austin, Texas.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20250220738219/en/\nRapidDeploy’s Next Generation 911 product suite accelerates emergency response and enhances decision-making. Credit: Motorola Solutions\nRapidDeploy’s advanced Next Generation 911 (NG911) product suite accelerates emergency response and enhances decision-making. The suite includes Radius Mapping, precise real-time call location mapping that allows for faster and more focused dispatch of emergency resources. Its companion mobile application, Lightning, gives first responders direct access to critical 911 call data on their smartphones or tablets. Eclipse Analytics helps Public Safety Answering Points measure 911 call response times, queue times and provide the right levels of staffing based on expected call volumes.\n“In a crisis of any magnitude - a vehicle accident, medical emergency or active shooter - every second counts during the emergency response,” said Mahesh Saptharishi, executive vice president and chief technology officer, Motorola Solutions. “RapidDeploy’s technology connects first responders with critical information so they can reach those in need faster and be more prepared, saving valuable time in emergencies.”\nUsing RapidDeploy, 911 telecommunicators gain access to real-time data, including a caller’s GPS location, indoor floor plans, and communications like text, chat messaging and live video streams, which can be shared directly with a first responder in the field. RapidDeploy currently integrates with Motorola Solutions’ Rave suite to aggregate public safety data, intelligence sharing and notification capabilities to enhance the workflow of telecommunicators and first responders during critical emergencies.\nWith this acquisition, Motorola Solutions and RapidDeploy will help ensure public safety agencies have better access to data and increased situational awareness during emergency response so they can better serve their communities. Motorola Solutions expects to integrate RapidDeploy’s technology into its VESTA 911 call handling software and AI-powered VESTA NXT platform to further enhance telecommunicator speed and efficiency. RapidDeploy currently supports over 1,600 PSAPs/emergency communications centers in 24 states.\n“We are honored to join Motorola Solutions, a company that shares our commitment to public safety and our mission of saving lives by reducing response times,” said Steve Raucher, co-founder and CEO, RapidDeploy. “Together, we will continue to accelerate innovation in 911 technology, helping to make NG911 smarter, more unified and seamlessly integrated to empower first responders and help save more lives.”\nTerms of the transaction were not disclosed.\n\nAbout Motorola Solutions | Solving for safer\n\nSafety and security are at the heart of everything we do at Motorola Solutions. We build and connect technologies to help protect people, property and places. Our technologies support public safety agencies and enterprises alike, enabling the collaboration that’s critical for safer communities, safer schools, safer hospitals and safer businesses. Learn more about our commitment to innovating for a safer future for us all at www.motorolasolutions.com.\n\nMotorola Solutions Forward-Looking Statements\n\nThis press release contains “forward-looking statements” within the meaning of applicable federal securities law. These statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and generally include words such as “believes,” “expects,” “intends,” “anticipates,” “estimates” and similar expressions. The company can give no assurance that any actual or future results or events discussed in these statements will be achieved. Any forward-looking statements represent the company’s views only as of today and should not be relied upon as representing the company’s views as of any subsequent date. Readers are cautioned that such forward-looking statements are subject to a variety of risks and uncertainties that could cause the company’s actual results or events discussed in these statements to differ materially from the statements contained in this release. Such forward-looking statements include, but are not limited to, Motorola Solutions’ ability to integrate the products and services into its portfolio and offerings to customers. Motorola Solutions cautions the reader that the risks and uncertainties below, as well as those in Part I Item 1A of Motorola Solutions’ 2024 Annual Report on Form 10-K and in its other SEC filings available for free on the SEC’s website at www.sec.gov and on Motorola Solutions’ website at www.motorolasolutions.com, could cause Motorola Solutions’ actual results or events discussed in these statements to differ materially from those estimated or predicted in the forward-looking statements. Many of these risks and uncertainties cannot be controlled by Motorola Solutions and factors that may impact forward-looking statements include, but are not limited to, Motorola Solutions’ ability to successfully integrate and operate RapidDeploy. Motorola Solutions undertakes no obligation to publicly update any forward-looking statement or risk factor, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com:https://www.businesswire.com/news/home/20250220738219/en/\n CONTACT: Media Contact\nTricia Quinn\nMotorola Solutions\n\n[email protected]\n\nInvestor Contact\nTim Yocum\nMotorola Solutions\n\n[email protected]\n\nKEYWORD: UNITED STATES NORTH AMERICA ILLINOIS TEXAS\nSOURCE: Motorola Solutions\nCopyright Business Wire 2025.\nhttp://www.businesswire.com/news/home/20250220738219/en\n",
        "image": "https://dims.apnews.com/dims4/default/2def92c/2147483647/strip/true/crop/3784x2129+0+124/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2F5b%2F446818111a8390988739f6d33a89%2Fa3dc1a87be27a99a46e66510b41fa8c2",
        "tag": "[\"Texas\", \"North America\", \"Tim Yocum\", \"Tricia Quinn\", \"Mobile apps\", \"Chicago\"]",
        "keyword": ""
    },
    {
        "id": "e4616229058c63e6ae36c5d043a65457",
        "title": "Trump trade conflict casts shadow over access to vital elements needed by technology sector",
        "url": "https://apnews.com/article/trump-tariffs-tech-trade-rare-earth-1d9cc33df97e697d744ded0a2dd5d6ad",
        "channel_text": "Business",
        "user_author_name": "",
        "user_url": "",
        "created_at": "2025-02-20T11:00:39",
        "description": "Lithium and other elements that the U.S. needs for vital defense, energy and other applications could become harder to obtain if the Trump administration goes ahead with tariffs and other protectionist policies aimed at China.",
        "text": "NEW YORK (AP) — Lithium and other elements that the U.S. needs for vital defense, energy and other applications could become harder to obtain if the Trump administration goes ahead with tariffs and other protectionist policies aimed at China.\nChina refines more than 90% of the global supply of so-called “rare earth elements,” which include neodymium and dysprosium. Not actually rare, these 17 elements are difficult to mine and refine because they’re not often found in concentrated deposits. Some elements, like Lithium, are usually mentioned along with rare earth elements, because they are also critical for the tech sector.\nWithout them, cellphones wouldn’t vibrate and computer hard drives wouldn’t operate. They’re used in wind turbines, electric cars and other industries the U.S. has sought to develop.\nThe U.S. imports more than 80% of its rare earth elements, with most of those imports coming from China. A trade war impacts cellphone and other tech companies making their products in China when they have to ship those products to the U.S. and pay an import tariff.\n\n\nPresident Donald Trump imposed 10% tariffs on all Chinese imports to the U.S. earlier in February. That was on top of existing tariffs on specific Chinese goods dating back to Trump’s first term. China has since retaliated with up to 15% tariffs on a range of U.S. goods and more export controls on elements critical to the production of modern high-tech products. \nDevelopment and growth plans for smartphone makers, renewable energy companies and the broader technology sector all depend in part on access to rare earth elements. Apple has been increasing its use of recycled materials for its batteries and devices to help lower its need for newly mined and refined materials.\n\n\nDemand is only expected to grow over the next few decades, especially with advances in computing power and artificial intelligence technology.\nThe International Energy Agency expects total demand for rare earth elements to surge 72% to 134 kilotons between 2021 and 2030. Supply requirements are expected to rise at roughly the same rate, but the total amount would lag demand at 98 kilotons.\nRare earth metals have been behind some recent geopolitical issues as the U.S. and other nations try to access sources outside of China. The U.S. is the world’s second biggest producer of rare earth metals, with about 12% of the global total.\nPresident Donald Trump’s pitch to acquire Greenland comes amid climate change that is expected to make more of the Arctic island’s resources available. Melting ice is expected to make rich deposits of rare earth elements, lithium, and other natural resources more accessible.\nTrump has also mentioned future aid deals with Ukraine, another source of rare earth elements.\n",
        "image": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png",
        "tag": "[\"Engineering\", \"International trade\", \"China government\", \"China\", \"Global trade\", \"Donald Trump\", \"General news\"]",
        "keyword": ""
    },
    {
        "id": "e48a44c5d7ff5721a8e2d206c041ba78",
        "title": "Kansas bans gender-affirming care for minors after GOP lawmakers reverse the governor's veto",
        "url": "https://apnews.com/article/transgender-health-care-minors-kansas-07d1d75b82f3c7f9f6bc9b7daf02d8e9",
        "channel_text": "U.S. News",
        "user_author_name": "JOHN HANNA",
        "user_url": "https://apnews.com/author/john-hanna",
        "created_at": "2025-02-18T23:23:26",
        "description": "Kansas has become the latest state to ban gender-affirming care for minors. The Republican-controlled Legislature voted Tuesday to override Democratic Gov.",
        "text": "TOPEKA, Kan. (AP) — Kansas became the latest state to ban gender-affirming care for minors Tuesday after the Republican-controlled Legislature overrode the Democratic governor’s veto of the measure.\nKansas is the 27th state to ban or restrict such care. GOP lawmakers reversed Gov. Laura Kelly’s veto less than a month after President Donald Trump issued an order barring federal support for gender-affirming care for youth under 19.\n“I just held my 16-year-old daughter, and we cried while we watched them try to erase her existence,” Elise Flatland, a Kansas City-area mother of two transgender children, said in a text message after livestreams of the votes. \nThe new law is set to take effect this month, and critics have predicted that doctors or parents or both will file a state-court lawsuit challenging it. \n\n\nSupporters of such bans argued that they protect vulnerable children from what they see as a “radical” ideology about gender and from making irreversible medical decisions too young. \n“This is a fork in the road,” said Republican state Rep. Ron Bryce, a southeastern Kansas doctor who backed the ban. “This is who we are as a people, as a state.”\nThe Kansas law will prohibit puberty blockers, hormone therapies or surgery for a minor to transition away from their gender assigned at birth. State employees caring for children won’t be allowed to provide or encourage such treatment — or encourage social transitioning.\n\n\nThe votes to override Kelly’s veto were 85-34 in the House and 31-9 in the Senate. Republicans hold supermajorities in both, and only one GOP lawmaker voted against overturning the veto. \nGroups backing transgender rights immediately announced that they would provide financial assistance and other help to families seeking care for transgender youth outside Kansas.\n",
        "image": "https://dims.apnews.com/dims4/default/8c2f5cd/2147483647/strip/true/crop/4204x2365+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F1a%2F60c11f0d2f604e1fec5b16c08738%2Fff05aa7e6e4248deafd85c0b2b517627",
        "tag": "[\"Kansas\", \"Gender\", \"Laura Kelly\", \"General news\", \"U.S. Republican Party\", \"Donald Trump\", \"KS State Wire\"]",
        "keyword": ""
    },
    {
        "id": "e6b0787553af4709cb5e8567d041b7ef",
        "title": "Watch: Taiwan Lawmakers Brawl Over Controversial Bills",
        "url": "https://www.newsweek.com/taiwan-lawmakers-brawl-controversial-bills-2004233",
        "channel_text": "World",
        "user_author_name": "[\"Matthew Impelli\", \". Languages: English.\", \"Writers Page\", \"Matthew Impelli is a Newsweek staff writer based in New York. His focus is reporting social issues and crime. In January 2023, Matthew traveled to Moscow, Idaho where he reported on the quadruple murders and arrest of Bryan Kohberger. Matthew joined Newsweek in 2019 after graduating from Syracuse University. He also received his master's degree from St. John's University in 2021. You can get in touch with Matthew by emailing\", \"m.impelli@newsweek.com\"]",
        "user_url": "https://www.newsweek.comjavascript:void(0);",
        "created_at": "2024-12-20T12:15:41-05:00",
        "description": "",
        "text": "Taiwanese lawmakers broke out into a brawl this week over contested bills after lawmakers from a major political party, who had occupied the speaker's chair overnight, clashed with members of a rival party attempting to forcefully remove them from the chamber.\nSeveral lawmakers were injured during the confrontation, according to Taiwanese media reports, though the extent of their injuries remains unclear.\nThe dispute centers on three bills pushed by the Nationalist Party, or Kuomintang (KMT), including one that opponents argue could cripple the constitutional Court. Lawmakers passed a measure tightening requirements for voter petitions to recall elected officials, while debates on the remaining bills stretched into the night.\nOne of the pending proposals aims to redistribute tax revenues, allocating a greater share to local governments.\nDemocratic Progressive Party lawmakers, who argue the bills endanger Taiwan's democratic system, entered the legislature Thursday night by removing windows and seizing the speaker's area, according to Taiwan's Central News Agency. They barricaded the space with stacks of chairs to block access.\nPhotos and videos from the morning clash captured chaotic scenes as KMT lawmakers attempted to dismantle chair barricades or climb over a ledge leading to the speaker's area. Opposing lawmakers pushed back, hurling chairs and spraying mineral water at them from plastic bottles.\nClad in matching white windbreakers, the Nationalists eventually regained control of the chamber, clearing the way for Speaker Han Kuo-yu to assume his position.\nThe Democratic Progressive Party (DPP) sought to block votes on the proposed bills, escalating tensions with the KMT.\nNeither party secured a majority in the most recent legislative election, but the KMT, which won a slight edge in seats, has partnered with a smaller party to take control of the legislature. This power struggle puts the KMT at odds with Taiwan's President Lai Ching-te, who represents the DPP.\nA DPP leader acknowledged in a social media video Thursday night that the party's actions were extreme but said they had no other choice, according to the Central News Agency. Efforts to negotiate the bills have so far failed to bridge the divide between the parties.\nThousands of DPP supporters gathered outside the legislature Thursday night and into Friday to protest.\nTaiwan's legislature has a history of physical confrontations. In 2020, lawmakers hurled pig guts at each other during a heated dispute over the government's decision to lift a ban on U.S. pork and beef imports.\nOne protester, a postgraduate student Stevie Kuo: accused the KMT and its allies of attempting to cripple the courts, weaken the central government's finances, and tighten the rules for recalling elected officials. \"I think these three things will considerably harm Taiwan,\" Kuo said. \"The people do not want this to happen.\"\nIt is currently unclear if the two others bills will be passed by lawmakers in Taiwan.\n\nThis article includes reporting from The Associated Press\n\n",
        "image": "https://d.newsweek.com/en/full/2549045/taiwan.jpg?w=1200&f=e924ad1e19215fc7a7ffb97bb3bb6d50",
        "tag": "",
        "keyword": "[\"Taiwan\", \"Legislation\"]"
    },
    {
        "id": "e6d17753be31ca31b2d5226d11f375cb",
        "title": "‘I feel like cruelty is the point’: For many newly fired federal workers, the way they were let go made things much worse",
        "url": "https://www.cnn.com/2025/02/19/politics/federal-workers-callous-firing/index.html",
        "channel_text": "Politics",
        "user_author_name": "Sunlen Serfaty",
        "user_url": "",
        "created_at": "",
        "description": "",
        "text": "Demonstrators rally in support of federal workers outside of the Department of Health and Human Services on February 14 in Washington, DC.\nProbationary staff at the Office of Personnel Management were fired in a conference call on Thursday.\nMembers of the American Federation of Government Employees union protest against firings during a rally to defend federal workers in Washington, DC on February 11.\n",
        "image": "[\"https://media.cnn.com/api/v1/images/stellar/prod/ap25045542970704.jpg?c=16x9&q=h_833,w_1480,c_fill\", \"https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198374823.jpg?q=w_1110,c_fill\"]",
        "tag": "",
        "keyword": ""
    },
    {
        "id": "e70dd9b19881ace49007f62261f11730",
        "title": "Kremlin Responds to Zelensky Saying He's Open to Putin Talks: 'Empty Words'",
        "url": "https://www.newsweek.com/kremlin-responds-zelensky-saying-hes-open-putin-talks-empty-words-2026867",
        "channel_text": "World",
        "user_author_name": "[\"Jon Jackson\", \"Writers Page\", \"Jon Jackson is a News Editor at Newsweek based in New York. His focus is on reporting on the Ukraine and Russia war. Jon previously worked at The Week, the River Journal, Den of Geek and Maxim. He graduated Summa Cum Laude with honors in journalism and mass communication from New York University. Languages: English.\"]",
        "user_url": "https://www.newsweek.comjavascript:void(0);",
        "created_at": "2025-02-05T15:54:53-05:00",
        "description": "",
        "text": "Kremlin spokesperson Dmitry Peskov on Wednesday responded to Ukrainian President Volodymyr Zelensky's recent comments about being ready to have direct peace talks with Russian President Vladimir Putin, calling the remarks \"empty words.\"\nHowever, Peskov did say Moscow is open to negotiations in order to end the war in Ukraine.\nNewsweek reached out to the Ukrainian Ministry of Foreign Affairs via email on Wednesday for comment.\nU.S. President Donald Trump's return to the White House has amplified speculation about negotiations to end the war started by Putin in February 2022.\nOn January 24, Putin told reporters that Moscow is ready for talks with Trump on ending the war. However, he added that any peace deal with Kyiv would be invalid because of a decree by Zelensky.\nMoscow has repeatedly said Zelensky is an illegitimate leader stemming from the martial law he declared due to the war, which banned presidential, parliamentary and local elections. Before the decree, his five-year term was set to expire in May 2024.\nOn Tuesday, Zelensky said during an interview on Piers Morgan Uncensored that he is ready to sit at the negotiating table with Putin.\nThe Ukrainian leader said his country is ready for \"the end of the hot stage of the war\" and to move to the \"diplomatic track.\"\nHe added that \"at the negotiation table there must be the United States, Europe, Ukraine and Russia.\"\n\"We will be speaking with Putin. Don't we make too many compromises? Even the conversation with Putin is already a compromise,\" Zelensky said. \"Nobody knows how this conversation will start and how it will end. Nobody knows, but we believe that President Trump wants to succeed in this situation.\"\nWhen Piers Morgan asked how he would personally feel sitting opposite Putin at a negotiating table, Zelensky answered: \"If that is the only setup in which we can bring peace to the citizens of Ukraine and not lose people, definitely we will go for this setup for the meeting with these four participants.\"\nWhile speaking with journalists on Wednesday about Zelensky's interview, Peskov again questioned the Ukrainian president's legitimacy, seemingly alluding to the decree.\n\"Mr. Zelensky has big problems de jure in terms of his legitimacy, but even so, the Russian side remains open to negotiations,\" Peskov said, adding there must be a \"readiness and desire\" for peace talks.\nUkrainian President Volodymyr Zelensky told Piers Morgan on Tuesday about the prospect of having direct talks with Vladimir Putin: \"I will not be kind to him. I consider him an enemy. And to be honest, I believe he considers me an enemy as well.\"\nKremlin spokesperson Dmitry Peskov told journalists on Wednesday regarding Zelensky's comments about talks with Putin: \"So far this cannot be seen as anything but empty words.\"\nTrump has said he will soon be speaking with his Putin.\n",
        "image": "https://d.newsweek.com/en/full/2582311/dmitry-peskov-vladimir-putin.jpg?w=1200&f=d09eac8b20b7875144a8a42e2e904c9e",
        "tag": "",
        "keyword": "[\"Moscow\", \"Volodymyr Zelensky\", \"Russia\", \"Ukraine\", \"Vladimir Putin\", \"Dmitry Peskov\", \"Kremlin\", \"Russia-Ukraine War\"]"
    },
    {
        "id": "e72b9a313b423e8b0aaefebd19fd560d",
        "title": "US Flag Upside Down Outside State Department, Photo Appears to Suggest",
        "url": "https://www.newsweek.com/us-flag-upside-down-outside-state-department-photo-appears-suggest-2027065",
        "channel_text": "U.S.",
        "user_author_name": "[\"Writers Page\", \"James Bickerton\", \"James Bickerton is a Newsweek U.S. News reporter based in London, U.K. His focus is covering U.S. politics and world politics. He has covered the intersection between politics and emerging technology, such as artificial intelligence. James joined Newsweek in July 2022 from LBC, and previously worked for the Daily Express. He is a graduate of Oxford University. Languages: English. Twitter: @JBickertonUK. You can get in touch with James by emailing j.bickerton@newsweek.com\"]",
        "user_url": "https://www.newsweek.comjavascript:void(0);",
        "created_at": "2025-02-06T04:56:54-05:00",
        "description": "",
        "text": "A photograph purporting to show the American flag being flown upside down outside the State Department has gone viral on social media.\nThe user who first posted the photograph on Reddit on February 5 told Newsweek, \"The picture was taken at approximately 2 p.m., and stayed up for about 20 minutes before it was changed.\"\nNewsweek contacted the Department of State for comment.\nPresident Donald Trump vowed during his 2024 campaign to dismantle what he termed the \"deep state.\" Shortly after his electoral victory in November, he named billionaire tech tycoon Elon Musk as head of the newly created Department of Government Efficiency.\nSince Trump's inauguration last month, his administration has offered most of the federal government's 3 million employees deferred resignations and warned that those who remain risk being reassigned or laid off. Employees were also instructed to return to the office, with several telling Newsweek that morale had cratered and that they would refuse to obey any executive orders they believed were illegal.\nIt is unclear whether the viral photo is genuine or, if it is, whether the upside-down flag was a mistake or an act of protest by a disgruntled employee.\nUnder the U.S. Flag Code, the Stars and Stripes should \"never be displayed with the union down, except as a signal of dire distress in instances of extreme danger to life or property.\"\nOn Wednesday, Reddit user /u/DesperateCranberry38 shared a photograph they captioned, \"Outside the State Department.\" The photo, posted in the /r/economicCollapse subreddit, showed an upside-down U.S. flag flying at full-staff. The user later said the photograph had been \"taken by an acquaintance of a friend.\"\nSpeaking to Newsweek,/u/DesperateCranberry38, who did not provide their name, insisted the photograph was genuine.\nThey said: \"All I can tell you is that it was not taken by a federal employee. The picture was taken at approximately 2 p.m.\"\nUsing Google Maps and photographs from the area, another Redditor said the photograph was legitimate and had been taken outside the State Department in Washington, D.C. Newsweek has not independently verified the photo.\nAn analysis by Newsweek confirmed that the flagpole in the picture matched the one outside the State Department in the most recent Google Street View images, which were taken in November 2022.\nThe images show a flat top above the flag followed by a short, protruding pole on which sits a silver-looking ball.\nUsing TinEye, a reverse image search, Newsweek looked up the image and found no matches, indicating this is likely the first time it has been uploaded to the internet.\nUser @danzu72, whose bio said they were a military veteran, later posted the photo on X, formerly Twitter, writing in the caption, \"Flag flown upside down as sign of distress outside of State Department.\"\nThis post went viral on the platform, receiving more than 9,300 reposts, 87,000 likes and 2.6 million views.\nX user @JasonTruck45732 commented on the post: \"So sad to see but feel their pain!\"\nUser @P3Paul163929 wrote: \"The career government lemmings are panicking.\"\n User @danzu72 replied to @P3Paul163929's comment: \"Imagine having such a miserable existence that you want your fellow Americans out of work. Their distress is not going to make your p***-stained life any better.\"\nUser @CaptainWoosah wrote: \"American people do not feel like it's distress. We finally feel as if we are getting the answers that we've been looking for for years.\"\nUser @AmesOsaycnuc said of their flag: \"Mine has been upside down since the inauguration, and will stay that way.\"\nThe Department of State is likely to come under further pressure to comment on the legitimacy of the photo and, if it is genuine, how the flag came to be upside down.\nMusk has previously called for cuts to federal government spending of up to $2 trillion, making further tensions with some federal employees all but inevitable.\n\nUpdate 2/7/25, 6:18 a.m. ET: This story has been updated with additional information.\n\n\nUpdate 2/7/25, 9:42 a.m. ET: This story has been updated with additional information.\n\n",
        "image": "[\"https://d.newsweek.com/en/full/2582508/us-flag.jpg?w=1200&f=f9cc678bb20fe9324c5647e98ddd594a\", \"https://d.newsweek.com/en/full/2583588/google-street-view.jpg?w=1200&f=30ea6dfb43728906cc3fa9fe62de9dad\"]",
        "tag": "",
        "keyword": "[\"State department\", \"Washington D.C.\", \"Donald Trump\", \"DOGE\", \"Republican\", \"Elon Musk\"]"
    },
    {
        "id": "e77ad86267175259c252c4340b48d630",
        "title": "Trump Eyes Military Prisons to Expand Immigration Detention",
        "url": "https://www.newsweek.com/trump-eyes-military-prisons-expand-immigration-detention-2019444",
        "channel_text": "News",
        "user_author_name": "[\"a.daftari@newsweek.com\", \"Writers Page\", \". Languages: English and Farsi\", \"Amir Daftari\", \"Amir Daftari is a Newsweek reporter based in London, specializing in global affairs with a focus on the Middle East. He joined Newsweek in 2024 from the United Nations and has previously worked at CNN International. A graduate of the London School of Economics, Amir has received multiple awards for his reporting, including his coverage of the Arab Spring and the 2021 Iranian elections. You can get in touch with Amir by emailing\"]",
        "user_url": "https://www.newsweek.comjavascript:void(0);",
        "created_at": "2025-01-23T07:44:08-05:00",
        "description": "",
        "text": "President Donald Trump's plans to deport \"millions and millions\" of immigrants hinge on securing significant funding for detention facilities, including military prisons. With an estimated 11.7 million undocumented immigrants in the U.S., current Immigration and Customs Enforcement (ICE) funding supports only about 41,000 detention beds.\nThe Trump administration has not disclosed how many more beds would be required or the overall cost.\nThe push to expand detention infrastructure signals a major shift in U.S. immigration policy, with implications for human rights, federal spending, and the private prison industry. Critics argue that detaining undocumented immigrants on such a large scale risks creating a hyper-militarized system that could worsen safety and compliance issues within detention facilities.\nThe financial demands are enormous, with detention beds costing approximately $165 per day per adult. Additionally, the Department of Homeland Security (DHS) has estimated substantial costs for deportation logistics, including air transportation. The involvement of the military under Trump's emergency edict has sparked debate about its affect on national readiness.\nEfforts to expand detention capacity include leveraging the recently passed Laken Riley Act, which allocates $26.9 billion to add 110,000 beds. Named after a Georgia nursing student murdered by a Venezuelan man, the act mandates the detention of undocumented individuals accused of crimes.\nICE relies on a combination of its own processing centers, private detention facilities, and prisons under state and city contracts. However, it currently lacks facilities for detaining immigrant families, who constitute a significant portion of arrivals at the southern border.\nNewsweek has reached out the ICE for comment via email.\nThe American Civil Liberties Union (ACLU) has highlighted ICE's potential plans to expand detention capacity in eight states, including Texas, Kansas, and California. ICE may also repurpose previously used sites, including Carrizo Springs, Texas, and Dilley, Texas, to house detainees.\nDuring Trump's first administration, he authorized the use of military bases to detain immigrant children -- including Army installations at Fort Bliss, Texas, and Goodfellow Air Force Base. In 2014, Obama temporarily relied on military bases to detain immigrant children while ramping up privately operated family detention centers to hold many of the tens of thousands of Central American families caught crossing the border illegally.\nU.S. military bases have been used repeatedly since the 1970s to accommodate the resettlement of waves of immigrants fleeing Vietnam, Cuba, Haiti, Kosovo and Afghanistan.\nWith current budgets stretched, increasing capacity will likely require significant private investment and federal funding through Congress.\nJohn Sandweg, former acting ICE director: \"There's a limitation on the number of beds available to ICE. If the administration wants to make a major uptick in detention capacity, that's going to require the construction of some new facilities.\"\nEunice Cho, ACLU senior staff attorney: \"Under the Trump administration, Homeland Security will be working to try to detain everyone that it possibly can.\"\nThe Trump administration's reliance on military resources and private investors for detention expansion is set to escalate debates in Congress. With federal budgets already stretched, the scope and sustainability of mass deportations remain uncertain.\n\nThis article includes reporting from The Associated Press\n\n",
        "image": "[\"https://d.newsweek.com/en/full/2571483/migrants-deported-us.jpg?w=1200&f=14ad90160e16321c0323d81e7efb421c\", \"https://d.newsweek.com/en/full/2571475/trump-oval-office.jpg?w=1200&f=606754eaabea4089ca3b4c45c0230e5c\"]",
        "tag": "",
        "keyword": "[\"Immigration\", \"Dhs\", \"Illegal Immigration\", \"Aclu\", \"Donald Trump\", \"Mass Deportations\", \"Detention centers\", \"Detention\", \"Military\", \"ICE\"]"
    },
    {
        "id": "e7fd0ec055e5f4a997a154a1b8455ee8",
        "title": "Map Shows NATO Aircraft Carrier's Pacific Mission",
        "url": "https://www.newsweek.com/map-france-news-nato-aircraft-carrier-indo-pacific-deployment-2038635",
        "channel_text": "World",
        "user_author_name": "[\".\", \"r.chan@newsweek.com\", \"Writers Page\", \"Ryan Chan is a Newsweek reporter based in Hong Kong, where he previously had over a decade of experience at a local newspaper, covering China and current events around the world. His focus is on security and defense issues in the Western Pacific region. He is a graduate of Hong Kong Baptist University. You can get in touch with Ryan by emailing\", \"Ryan Chan\"]",
        "user_url": "https://www.newsweek.comjavascript:void(0);",
        "created_at": "2025-03-03T11:20:20-05:00",
        "description": "",
        "text": "A Newsweek map shows how an aircraft carrier sent by France, a NATO member, carried out its mission in the contested Western Pacific Ocean, including in the South China Sea.\nThe French Armed Forces did not immediately respond to a written request for comment.\nFrance dispatched its only aircraft carrier, the nuclear-powered FS Charles de Gaulle, for a five-month mission to the Indo-Pacific region in November last year. This marked the first French aircraft carrier deployment from Europe to the Pacific Ocean in over five decades.\nWhile China and the United States are competing for influence in the Indo-Pacific region, France has called itself an \"Indo-Pacific nation,\" as it is the only European Union member to have territories there, home to more than 1.6 million French citizens and 7,000 soldiers, according to Reuters.\nThe Charles de Gaulle and its strike group reached the edge of the Western Pacific Ocean in late January as it visited the Indonesian island of Lombok, following a multinational exercise conducted in the Eastern Indian Ocean around three waterways in Indonesia.\nThe French aircraft carrier then transited northward and reached the waters south and east of the Philippines—the Celebes Sea and the Philippine Sea—for a large-scale trilateral exercise with aircraft carriers sent by the United States and Japan from February 7 to 18.\nAfter the tri-carrier drill, the Charles de Gaulle entered the South China Sea, where the Philippines and China have territorial disputes, for an exercise with the Philippine military and made an \"unprecedented stopover\" in the Southeast Asian country on February 21.\nOn Sunday, the French aircraft carrier sent four fighter jets for an air combat exercise with six Malaysian combat aircraft over the South China Sea off the eastern coast of peninsular Malaysia, and it hosted senior officials from the Malaysian defense ministry and armed forces.\nThis showed the will of France to regularly deploy military units to the Indo-Pacific region from its mainland in Europe to enforce international law, defend sovereignty and protect free and open access to common spaces, the French Embassy in Malaysia said.\nThe French Embassy in Malaysia said in a statement on Monday: \"Malaysia and France are long-standing defense partners, and France highly values its defense cooperation with Malaysia, a cooperation which is nourished by high-level meetings.\"\nRear Admiral Jacques Mallard, commander of the Charles de Gaulle carrier strike group, said on February 23 during a visit to the Philippines: \"We are building experience in the area and we are constructing bonds. And there's nothing that is declared against anybody.\"\nFrance's Indo-Pacific Strategy read: \"The French strategy in the Indo‑Pacific seeks to maintain an area that is open and inclusive, free of all forms of coercion and founded on multilateralism and the respect of international law.\"\nIt remains to be seen whether other European nations will send their aircraft carriers to the Indo-Pacific region in the future. In addition to France, the United States has one aircraft carrier currently deployed in the Western Pacific Ocean and a second one stationed in Japan. China has two aircraft carriers in service.\n",
        "image": "https://d.newsweek.com/en/full/2599141/french-aircraft-carrier-visits-philippines.jpg?w=1200&f=4dcd44be8563b1d5788714553462da73",
        "tag": "",
        "keyword": "[\"Philippines\", \"Malaysia\", \"NATO\", \"South China Sea\", \"France\", \"Aircraft carriers\", \"Indonesia\", \"Pacific Ocean\"]"
    },
    {
        "id": "e847612228e17e924fd996754254f63c",
        "title": "Trump’s Barrage of Executive Orders Overwhelms Opponents",
        "url": "https://www.wsj.com/politics/elections/all-gas-executive-orders-put-trumps-opponents-on-back-foot-ddae594b",
        "channel_text": "politics/policy",
        "user_author_name": "[\"\\n\\n\\n\\n                  Josh Dawsey\\n                 \\n\\n\", \"\\n\\n\\n                  Brent Kendall\\n                 \\n\\n\"]",
        "user_url": "[\"https://www.wsj.com/news/author/josh-dawsey\", \"https://www.wsj.com/news/author/brent-kendall\"]",
        "created_at": "2025-03-02 04:00:00",
        "description": "The president has signed more than 75 executive orders to start his second term, spurring about 100 lawsuits so far. For now, most of the orders have survived. ",
        "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n            President Trump is leaning into the use of executive orders more than his predecessors did and much more than even he did in his first term.\n           \n\n\n\n             Photo:\n            \n            Yuri Gripas/Press Pool\n           \n\n\n\n\n          President Trump\n          \n          has signed more than 75 executive orders to start his second term, spurring about 100 lawsuits so far. For now, most of the orders have survived.\n         \n\n          The flood has overwhelmed opponents and forced courts to work overtime to try to keep up. That was by design.\n         \n\n\n           Trump’s closest advisers, including deputy chief of staff\n           \n           Stephen Miller\n           \n           , spent years crafting a playbook to avoid a repeat of the infighting and disorganization that defined the early months of Trump’s first term.\n          \n\n           The new directives from\n           \n\n\n            the second-term blitzkrieg\n           \n           have claimed greater White House control of previously\n           \n            independent agencies\n           \n           , steered the ousting of swaths of\n           \n            the federal government’s workforce\n           \n           , ended\n           \n            foreign aid\n           \n           across many parts of the globe, and reversed decades of\n           \n            diversity programs\n           \n           , among other conservative priorities. Others have been less serious, including ending the procurement and forced use of paper straws.\n          \n\n           Miller led plans for the barrage, rewriting many of the orders during the final weeks of the transition, according to people familiar with the effort. They were vetted by\n           \n           David Warrington\n           \n           , a transition attorney who is now White House counsel, and other lawyers, one administration official said. New orders are vetted by both the White House staff secretary’s office and the White House Counsel’s Office, the official said.\n          \n\n           Republicans for years criticized Presidents\n           \n           Barack Obama\n           \n           and\n           \n            Joe Biden\n           \n           for using executive orders to advance policies that wouldn’t make it through Congress, arguing that the assertion of unchecked power violated the separation of powers. Now, Trump is leaning into the practice much more than his predecessors did and much more than even he did in his first term, when he issued just 12 executive orders in his first month.\n          \n\n\n\n\n\n\n\n\n\n\n\n             President Trump signed an executive order instructing the Treasury and Commerce departments to examine creating a sovereign-wealth fund. Photo: Evan Vucci/Associated Press\n            \n\n\n\n           Miller and other Trump advisers were prepared for more lawsuits than have been filed, and have been surprised at the lack of litigation on some of the orders, advisers say.\n          \n\n           “The problem for the Democrats is he’s throwing so much out there so fast they can’t figure out who they want to be or what they want to go after,” said\n           \n           Brian Kemp\n           \n           , the governor of Georgia.\n          \n\n           Karoline Leavitt\n           \n           , the White House press secretary, described the effort this way: “All gas, no brakes.”\n          \n\n           “If you look at the massive number of orders the president has signed versus the minimal number of weak lawsuits we’ve faced,” Leavitt said, “we are confident they will be upheld in court.”\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                  Number of executive orders signed in first month of each presidential term\n                 \n\n\n\n\n\n\n\n\n\n                    Trump\n                   \n                   , 2025\n                  \n\n\n\n\n                    Biden\n                   \n                   , 2021\n                  \n\n\n\n\n                    Trump\n                   \n                   , 2017\n                  \n\n\n\n\n                    Obama\n                   \n                   , 2013\n                  \n\n\n\n\n                    Obama\n                   \n                   , 2009\n                  \n\n\n\n                   G.W. Bush\n                   \n                    , 2005\n                   \n\n\n\n\n                   G.W. Bush\n                   \n                    , 2001\n                   \n\n\n\n\n                   Clinton\n                   \n                    , 1997\n                   \n\n\n\n\n                   Clinton\n                   \n                    , 1993\n                   \n\n\n\n\n                   G.H.W. Bush\n                   \n                    , 1989\n                   \n\n\n\n\n\n                    Reagan\n                   \n                   , 1985\n                  \n\n\n\n\n                    Reagan\n                   \n                   , 1981\n                  \n\n\n\n                   0\n                  \n\n\n\n                   25\n                  \n\n\n\n                   50\n                  \n\n\n\n                   75\n                  \n\n\n\n\n\n\n\n\n\n                    Trump\n                   \n                   , 2025\n                  \n\n\n\n\n                    Biden\n                   \n                   , 2021\n                  \n\n\n\n\n                    Trump\n                   \n                   , 2017\n                  \n\n\n\n\n                    Obama\n                   \n                   , 2013\n                  \n\n\n\n\n                    Obama\n                   \n                   , 2009\n                  \n\n\n\n                   G.W. Bush\n                   \n                    , 2005\n                   \n\n\n\n\n                   G.W. Bush\n                   \n                    , 2001\n                   \n\n\n\n\n                   Clinton\n                   \n                    , 1997\n                   \n\n\n\n\n                   Clinton\n                   \n                    , 1993\n                   \n\n\n\n\n                   G.H.W. Bush\n                   \n                    , 1989\n                   \n\n\n\n\n\n                    Reagan\n                   \n                   , 1985\n                  \n\n\n\n\n                    Reagan\n                   \n                   , 1981\n                  \n\n\n\n                   0\n                  \n\n\n\n                   25\n                  \n\n\n\n                   50\n                  \n\n\n\n                   75\n                  \n\n\n\n\n\n\n\n\n\n                    Trump\n                   \n                   , 2025\n                  \n\n\n\n\n                    Biden\n                   \n                   , 2021\n                  \n\n\n\n\n                    Trump\n                   \n                   , 2017\n                  \n\n\n\n\n                    Obama\n                   \n                   , 2013\n                  \n\n\n\n\n                    Obama\n                   \n                   , 2009\n                  \n\n\n\n                   G.W. Bush\n                   \n                    , 2005\n                   \n\n\n\n\n                   G.W. Bush\n                   \n                    , 2001\n                   \n\n\n\n\n                   Clinton\n                   \n                    , 1997\n                   \n\n\n\n\n                   Clinton\n                   \n                    , 1993\n                   \n\n\n\n\n                   G.H.W. Bush\n                   \n                    , 1989\n                   \n\n\n\n\n\n                    Reagan\n                   \n                   , 1985\n                  \n\n\n\n\n                    Reagan\n                   \n                   , 1981\n                  \n\n\n\n                   0\n                  \n\n\n\n                   25\n                  \n\n\n\n                   50\n                  \n\n\n\n                   75\n                  \n\n\n\n\n\n\n\n\n\n                    Trump\n                   \n                   , 2025\n                  \n\n\n\n\n                    Biden\n                   \n                   , 2021\n                  \n\n\n\n\n                    Trump\n                   \n                   , 2017\n                  \n\n\n\n\n                    Obama\n                   \n                   , 2013\n                  \n\n\n\n\n                    Obama\n                   \n                   , 2009\n                  \n\n\n\n                   G.W. Bush\n                   \n                    , 2005\n                   \n\n\n\n\n                   G.W. Bush\n                   \n                    , 2001\n                   \n\n\n\n\n                   Clinton\n                   \n                    , 1997\n                   \n\n\n\n\n                   Clinton\n                   \n                    , 1993\n                   \n\n\n\n\n                   G.H.W. Bush\n                   \n                    , 1989\n                   \n\n\n\n\n\n                    Reagan\n                   \n                   , 1985\n                  \n\n\n\n\n                    Reagan\n                   \n                   , 1981\n                  \n\n\n\n                   0\n                  \n\n\n\n                   25\n                  \n\n\n\n                   50\n                  \n\n\n\n                   75\n                  \n\n\n\n\n\n\n\n\n\n                    Trump\n                   \n                   , 2025\n                  \n\n\n\n\n                    Biden\n                   \n                   , 2021\n                  \n\n\n\n\n                    Trump\n                   \n                   , 2017\n                  \n\n\n\n\n                    Obama\n                   \n                   , 2013\n                  \n\n\n\n\n                    Obama\n                   \n                   , 2009\n                  \n\n\n\n                   G.W. Bush\n                   \n                    , 2005\n                   \n\n\n\n\n                   G.W. Bush\n                   \n                    , 2001\n                   \n\n\n\n\n                   Clinton\n                   \n                    , 1997\n                   \n\n\n\n\n                   Clinton\n                   \n                    , 1993\n                   \n\n\n\n\n                   G.H.W. Bush\n                   \n                    , 1989\n                   \n\n\n\n\n\n                    Reagan\n                   \n                   , 1985\n                  \n\n\n\n\n                    Reagan\n                   \n                   , 1981\n                  \n\n\n\n                   0\n                  \n\n\n\n                   25\n                  \n\n\n\n                   50\n                  \n\n\n\n                   75\n                  \n\n\n\n\n\n                   Note: Data is from Jan. 20 through Feb. 20.\n                  \n\n\n                   Source: Federal Register\n                  \n\n\n                   Anna Deen/WSJ\n                  \n\n\n\n\n\n\n\n\n\n\n\n           Judicial scrutiny\n          \n\n           The early ride through the courts has in some cases been bumpy for the administration.\n          \n\n           Several judges have blocked Trump’s\n           \n            bid to end birthright citizenship\n           \n           for children of immigrants if neither parent is a U.S. citizen or a permanent resident.\n          \n\n           “Citizenship by birth is an unequivocal Constitutional right. It is one of the precious principles that makes the United States the great nation that it is,” U.S. District Judge\n           \n           John Coughenour\n           \n           in Seattle wrote in his decision. “The President cannot change, limit, or qualify this Constitutional right via an executive order.”\n          \n\n           Judges also have paused White House efforts to freeze some federal spending, eliminate some diversity programs and penalize hospitals that provide transgender healthcare.\n          \n\n           But in an array of other circumstances, litigants have fallen short. A judge in Boston said federal employee unions\n           \n            didn’t have proper standing\n           \n           to challenge Trump’s buyout program for federal workers. Another in Washington said employees can’t go to court now to challenge widespread reductions in the workforce.\n          \n\n\n\n\n\n\n\n\n             Workers lined up outside the U.S. Agency for International Development’s Washington headquarters this past week to gather their personal belongings.\n            \n\n\n              Photo:\n             \n             Manuel Balce Ceneta/Associated Press\n            \n\n\n\n           Judges have allowed\n           \n            Elon Musk’s\n           \n           Department of Government Efficiency to access data from the Labor and Education departments. One judge initially paused the administration’s efforts to dismantle the U.S. Agency for International Development, but later\n           \n            gave the administration the green light\n           \n           to proceed.\n          \n\n           One key challenge for litigants suing the administration: There is a high legal bar for judges to block executive-branch actions at the outset of a case. In some circumstances, judges have expressed concerns about Trump initiatives but said plaintiffs haven’t shown they are facing irreparable harm that couldn’t be addressed later if they win.\n          \n\n           Courts have a long list of hearings scheduled over the next couple of months that could provide a clearer picture on the durability of Trump’s orders.\n          \n\n           “Some he may know aren’t going to work, but he’s on an incredible high-octane steamroller over the federal government and institutions he doesn’t trust,” said\n           \n           Douglas Brinkley\n           \n           , a presidential historian at Rice University.\n          \n\n           ‘This took years’\n          \n\n           When Texas donor Doug Deason visited Mar-a-Lago last November, he saw a pile of executive orders being prepared for Trump to sign. “Every morning is like Christmas morning. It’s like Christmas morning three times a day,” Deason said.\n          \n\n           Some of Trump’s aides in 2017 joked they could barely find the light switches in the White House, and Trump was unaware of how some agencies functioned and what many of his aides did all day. One longtime Trump adviser recalled sitting in a meeting in the White House and listening to aides ask questions about how the Supreme Court worked.\n          \n\n           “We had nothing and a few weeks to get ready,” said\n           \n           Steve Bannon\n           \n           , who was Trump’s first counselor. The second-term push “took years in the making,” he said.\n          \n\n\n\n\n\n\n\n\n\n\n               SHARE YOUR THOUGHTS\n              \n\n\n\n\n                Do you think Trump’s executive orders will hold up in court? If so, what will be their impact on the U.S.? Join the conversation below.\n               \n\n\n\n\n\n\n           This time, the work was carried out by a constellation of groups and advisers to Trump from his first term, who outlined what he wanted in broad strokes but left the details to others. It was fueled by tens of millions of dollars in contributions from Republican donors who gave to groups previously run by Agriculture Secretary\n           \n           Brooke Rollins\n           \n           , Office of Management and Budget Director\n           \n           Russ Vought\n           \n           and Miller, among others.\n          \n\n           Miller had focused on the orders for years. On the final day of Trump’s first term, Miller sent a note to colleagues urging them to prepare for the next one. “This is not goodbye. Far from it,” he wrote. “I have no doubt very soon we will be fighting side-by-side together once more.”\n          \n\n\n\n\n\n\n\n\n             Stephen Miller, White House deputy chief of staff, focused on the executive orders for years, rewriting many of them during the final weeks of the transition.\n            \n\n\n              Photo:\n             \n             Andrew Harnik/Getty Images\n            \n\n\n\n           Trump’s speechwriter, Vince Haley, who is now head of the domestic policy council, kept a list of Trump’s promises and public comments in the months leading up to the election, according to people familiar with the list. If Trump would promise something new, Haley would add it. Orders sometimes flowed from the list. Industry lobbyists, including from oil and gas, proposed ideas for others.\n          \n\n           Miller in particular focused on diversity, equity and inclusion initiatives and\n           \n            immigration\n           \n           , people who spoke to him said. Some of the orders—such as one to shut the Education Department—Miller wanted Trump to sign immediately, only to see them delayed. Aides said Trump continues to plan new signings.\n          \n\n           Trump wasn’t involved in the early planning, believing it was superstitious to talk about the transition during the campaign. While he was occasionally briefed by the outside groups working on policy, he sometimes expressed little interest, people at the meetings said.\n          \n\n           Susie Wiles\n           \n           , the president’s chief of staff, suggested spreading the orders out over a greater number of weeks, but Trump wanted to sign as many as he could immediately, White House advisers said.\n          \n\n           Many of the orders mirror plans in Project 2025, the conservative second-term blueprint written by the Heritage Foundation and hundreds of Trump advisers from the first term, which came under fierce criticism from Democrats.\n          \n\n           The group stopped its work in 2024 after the Trump campaign disavowed it and threatened to blacklist any staffers who contributed, but many of those staffers are now working for Trump.\n          \n\n           Paul Dans\n           \n           , who led the project, resigned from the group amid the criticism. He lives in Charleston, S.C., and has no formal role in the Trump administration but is ebullient over the administration’s beginning days and said the administration had gone even further than he and Project 2025 hoped. “What’s happening now is more than many conservatives dared to dream,” he said.\n          \n\n\n\n\n\n\n\n\n             White House Chief of Staff Susie Wiles had suggested spreading executive orders out over a greater number of weeks.\n            \n\n\n              Photo:\n             \n             Samuel Corum/Press Pool\n            \n\n\n\n           Write to Josh Dawsey at\n           \n            Joshua.Dawsey@wsj.com\n           \n           and Brent Kendall at\n           \n            Brent.Kendall@wsj.com\n           \n\n\n",
        "image": "[]",
        "tag": "",
        "keyword": ""
    },
    {
        "id": "e8a7952af70f3b4257dd8792a4fec6e7",
        "title": "Waiting for wildflowers? Here’s the forecast for Southern California’s iconic blooms",
        "url": "https://www.latimes.com/lifestyle/newsletter/2025-03-01/what-to-expect-wildflowers-in-2025-lat-plants",
        "channel_text": "",
        "user_author_name": "[\"Jeanette Marantos\", \"Staff Writer\", \"By\"]",
        "user_url": "https://www.latimes.com/people/jeanette-marantos",
        "created_at": "March 1, 2025 8 AM PT",
        "description": "",
        "text": "Welcome to March, when Southern Californians start gearing up for colorful wildflower displays blanketing our deserts and hills. \nExcept not this year. Native flower experts predict few if any wildflowers for 2025 because our weather has been too dry. \nOur spate of rainy winters between 2022 and 2024 have made it easy to forget that Southern California’s rainfall is notoriously fickle. Those back-to-back rain seasons were the second wettest in recorded history for downtown Los Angeles, more than 52 inches of rain, nearly double the average rainfall for that area. \nRainfall so far this year in downtown L.A.? A paltry 5.58 inches, according to the National Weather Service, roughly half the average. \nWildflowers need three things to give us a copious spring bloom — seeds in the ground, plenty of moisture and a few weeks of mild, cool temperatures in the 60s and low 70s, according to botanist Naomi Fraga, director of conservation programs at the California Botanic Garden, the state’s largest botanic garden devoted to California native plants.\nWe’ve likely got the bank of seeds, but what little rain we’ve had this winter came very late in the season, which lowers the likelihood of gentle warming to coddle those emerging wildflower seedlings. Case in point: As I write this on Feb. 25, the forecast for the rest of the week is potentially record-breaking temperatures in the high 80s to low 90s. \nWildflowers need mild temperatures for an extended period so the seedlings have time to get strong enough to withstand warmer temperatures later in the spring. “If it gets hot too quickly,” Fraga said, those delicate seedlings can dry out very, very fast.” \nBottom line: Despite our recent rainstorms, our overall rainfall is still far below average. Anza-Borrego Desert State Park, for instance, has received less than an inch of rain this winter. The park’s annual average rainfall is about 5.5 inches, according to the California Department of Parks and Recreation, and during the big bloom years of 2017, 2019, 2020 and 2023, it averaged more than 6 inches of rain.\nAnd even if we get lots more rain in March, we’re likely pushing too far into spring to get the extended cool temperatures needed for a decent wildflower bloom. \nBut here’s some good news: There are still plenty of places to see beautiful flowers in March, said Tim Becker, horticultural director for the Theodore Payne Foundation, which produces the annual Wild Flower Hotline starting March 7 (see calendar below). \nIf you’re desperate to see carpets of wildflowers, you’ll likely have to head to Northern California, which has experienced another winter of above average rainfall, he said. \nBut in Southern California, shrubs and other perennial native plants such as monkey flowers, phlox, sages, buckwheats and manzanitas will start blooming beautifully in our wild places, Becker said. “It’s not a 10,000 acre carpet of orange [from California poppies], but it can still be inspiring and beautiful.” \nCalifornia Botanic Garden in Claremont, the state’s largest botanic garden devoted to California native plants, and the Santa Barbara Botanic Garden, the second largest, are easy ways to wander and find native blooms. California Botanic Garden is even hosting a free Native Plant Festival on March 29 from 10 a.m. to 3 p.m. to show off the beauty of blooming native plants, and their potential for landscaping. (If you think native flowers aren’t worthy of a vase, check out these bouquets created from flowers at California Botanic Garden.) \nThe region’s other botanic gardens have plenty of flowers to experience as well, as I noted in my calendar of 12 SoCal blooms to enjoy throughout the year. For instance, Descanso Gardens in La Cañada Flintridge plants 35,000 tulip bulbs in January, which start blooming en masse in March. Roses don’t begin blooming heavily until April, but check the bloom calendars at South Coast Botanic Garden, the Los Angeles County Arboretum & Botanic Garden, and the Huntington Library, Art Museum, and Botanical Gardens or any other SoCal garden to see what kind of color you can find. \nAlso note that the Flower Fields at Carlsbad Ranch opens today  through Mother’s Day (May 11), with a sweet pea maze and more than 50 acres of giant ranunculus in 13 dazzling colors. (They also sell bulbs so you can grow these beauties at home). \nWhich brings me to my final point: You can easily create your own wildflower bloom at home, in your yard or even in containers. “Everyone should be trying to do wildflower blooming at their own homes,” Becker said, not only for their joyful color but the support they provide to native birds and insects. \n“Seed is cheap,” said Becker. “Toss some out into your yard before the next rain, just to see if you can get some plants going, and do it again next year.” With a little irrigation and careful weeding (don’t pull up your seedlings!) you can create your own wildflower bonanza that will reseed and reappear year after year after year — an easy investment in spring happiness anyone can make. \nMarch and April Grow LA Gardens workshops, a series of four workshops taught by UC Master Gardeners of Los Angeles County at various locations around the county. Dates and times vary depending on the location and most classes are in-person, but one workshop starting April 5 will be conducted entirely online. The four workshops typically cost $70, or $30 for people who can’t afford the higher fee, although a couple of locations are only charging $55 ($25 for the discounted rate). Classes fill quickly. celosangeles.ucanr.edu \nTomatomania! returns for its 25th year. The pop-up vendor returns with more than 100 different varieties of tomatoes and peppers at 13 sites around Southern California this spring. Locations in March include Roger’s Gardens  nursery in Corona del Mar through March 9, the Water Conservation Garden in El Cajon March 7-8; Mission Hills Nursery in San Diego March 8-9; Fig Earth Supply in Mount Washington March 7-9; Otto & Sons Nursery in Fillmore, March 13-15; Tapia Brothers Farm Stand in Encino, March 21-23; Wachter’s Hay & Grain in Ojai on March 29 and Anawalt Lumber in Hollywood March 29-30. Visit the website for April dates and more details. tomatomania.com \nMarch 1-2Ikebana Show: the Japanese Art of Floral Arranging at Sherman Library & Gardens, 10:30 a.m. to 4 p.m. at the gardens in Corona del Mar. Ikebana arranging demonstrations each day from 11:30 a.m. to 12:30 p.m. The show is free with $5 admission to the garden (members and children 3 and under enter free). Reservations required for non-members ages 4 and older. thesherman.org \nMarch 1-June 1Daphne’s Wardrobe — Metamorphosis into Nature, an interdisciplinary exhibition of artworks exploring the transformations of the body into nature at Descanso Gardens’ Sturt Haaga Gallery and Boddy House, curated by Carole Ann Klonarides, who will be giving guided walk-throughs from noon to 1 p.m. and 2 to 3 p.m. on March 1. The exhibit is free with $15 admission to the gardens ($11 for seniors 65+ and students with ID, $5 children 5-12, free to members and children 4 and under). descansogardens.org \nMarch 2TreePeople presents a Public Family Tour of its trails, California native plants and watershed gardens from 10 to 11:30 a.m. in Beverly Hills. The tours are designed for families with elementary-aged children or youth groups. Participants are welcome to picnic at the site after the tour. All children must have adult supervision. Register online $10 per person, children 3 and younger enter free. treepeople.org \nMarch 6, 9, 11, 12 or 15Terrific Tomatoes / Tomatoes A-Z — a free class about the best ways to grow your own tomatoes, taught by the U.C. Cooperative Extension Master Gardeners of Orange County, at Mission Viejo on March 6, Anaheim on March 9, Laguna Woods on March 11, Huntington Beach on March 12 and Fullerton on March 15. Times vary depending on location. Register online. mgorange.ucanr.edu \nMarch 7-977th Santa Barbara International Orchid Show, 9 a.m. to 5 p.m. at the Earl Warren Showground in Santa Barbara. The show’s theme, Exotic Gardens, focuses on orchids in their natural habitats and includes plant vendors, exhibits and demonstrations in potting and caring for orchids. Tickets are $20 a day or $30 for a three-day pass. Kokedama workshops on Friday, Saturday and Sunday and an orchid mounting workshop on Saturday are an additional $45 each. sborchidshow.com \nMarch 7The Theodore Payne Foundation’s Wild Flower Hotline resumes with information about the best places to find wildflowers in Central and Southern California, every Friday through the end of May. Call (818) 768-1802 ext. 7 to hear weekly recorded reports, or read an illustrated report online. theodorepayne.org \nLawn Removal 101 and Applying for the Turf Rebate, a workshop taught by Sophie Pennes, founder of Urban Farms LA, an edible and native garden design company, 10 a.m. to noon at the Theodore Payne Foundation in Sun Valley. Register online, $39.19 ($28.52 for members). eventbrite.com \nIntro to California Native Plant Garden Design, a workshop covering the basics of landscape design taught by Tim Becker, horticulture director of the Theodore Payne Foundation, 1 to 4 p.m. at the foundation in Sun Valley. Register online, $60.54 ($55.20 for members). eventbrite.com  \nMarch 8Art in Nature Walk at Taft Gardens & Nature Preserve, led by artist Cassandra C. Jones, chair of Taft’s artist residency program, who will discuss the garden’s history, point out patterns in nature, identify unusual plants and show how the garden inspires regional artists. Register online, $40. taftgardens.org \nMarch 13Propagating California Native Plants from Seeds, a hands-on workshop taught by Ella Andersson, certified horticulturist and the Theodore Payne Foundation’s chief botanical technician, 9:30 a.m. to 12:30 p.m. at the foundation in Sun Valley. All materials provided; participants will take home the seeds they plant. Register online, $92.55 ($81.88 members). eventbrite.com \nMarch 14Propagating California Native Plants from Cuttings, a hands-on workshop taught by Theodore Payne Foundation horticulture director Tim Becker, 10:30 a.m. to 1:30 p.m. at the foundation in Sun Valley. Each participant will leave with a flat of 50 starts. Register online, $92.55 ($81.88 for members). eventbrite.com \nMarch 15How to Grow Tomatoes / The Vibrant Herb Garden, two hour-long workshops at Fig Earth Supply nursery in Mount Washington; a comprehensive guide to growing tomatoes from 11 a.m. to noon and a class in growing herbs from 2 to 3 p.m. Register online, tickets for each class are $5. figearthsupply.com \nTrees of the Theodore Payne Foundation: St. Patrick’s Day Edition, a walk and talk discussion about native trees around the Theodore Payne Foundation’s nursery in Sun Valley, led by arborist Alison Lancaster, 2 to 4:30 p.m. Learn about the care and physiology of native trees such as oaks, Western sycamores, California bay laurel, Torrey pine, Santa Cruz ironwood, Catalina cherry and palo verde. Register online, $44.52 ($33.85 for members). eventbrite.com \nMarch 16Field trip to the Laguna Coast Wilderness and Laurel Canyon with the Laguna Canyon Foundation, a free 3.25-mile hike co-sponsored by the Orange County Chapter of the California Native Plant Society, starting at 8 a.m. at the Laguna Canyon Foundation Headquarters in Laguna Beach. No registration is required. chapters.cnps.org \nMarch 17Annual Plant Design at Sherman Library & Gardens, a presentation about how the gardens’ horticulture staff designs and installs its plant displays every season, 9:30 to 10:30 a.m. at the gardens. experience.thesherman.org \nMarch 20California Native Plant Container Gardening, a workshop taught by Terrence Williams, nursery technician at the Theodore Payne Foundation, 10 to 11:30 a.m. at the foundation in Sun Valley. Register online, $39.19 ($28.52 for members). eventbrite.com \nMarch 21, 28, and April 4California Native Plant Landscaper Certification, a vocational, 20-hour course taught by the Theodore Payne Foundation in partnership with the California Native Plant Society, Fridays from 9 a.m. to 3:30 p.m. at the foundation’s nursery in Sun Valley. Register online, $350. eventbrite.com \nMarch 22Spring Equinox Extravaganza at Ganna Walska Lotusland, 1:30 to 4:30 p.m. at the botanic garden in Montecito. Authors Louesa Roebuck, a floral artist, and Dina Saalisi, a floral therapist and healer, will lead participants in an “immersive floral experience” creating arrangements and learning about the spiritual and artistic significance of flowers. Register online, $275. lotusland.org \nSpring Equinox Walkabout at Taft Gardens & Nature Preserve led by Herb Walks director Lanny Kaufer, from 9 a.m. to noon at the gardens near Ojai. Learn about Australian plants and their traditions starting in the Australian section of the garden and then climb up to a vista point in the nature preserve. Register online, $45. taftgardens.org \nSucculent Wreath Workshop, 2 to 3:30 p.m. at the Los Angeles County Arboretum in Arcadia. All materials provided. Register online, $55 ($50 for members). arboretum.org \nMarch 25Emergent Invasive Plants in Orange County, a presentation about invasive plant detection and management during a meeting of the Orange County Chapter of the California Native Plant Society, 7 p.m. at the Duck Club in Irvine. Open to the public, admission is free. chapters.cnps.org  \nMarch 27East Meets West: An Ikebana Workshop with California Native Plants, a hands-on class taught by Japanese artist Hiromi Sutton, 10:30 a.m. to 1:30 p.m. at the Theodore Payne Foundation in Sun Valley. Participants should bring their own “kaki” — vase, shallow bowl or plate — to place their arrangement. Plant materials will be provided and participants will take home their creations. Register online, $71.21 ($60.54 for members). eventbrite.com \nMarch 29Native Plant Festival at California Botanic Garden, a free, family-oriented event from 10 a.m. to 3 p.m. at the garden in Claremont, offering guided tours and mini-workshops by garden designers specializing in native landscapes, as well as a vendor market of plant-oriented artisans, craft stations, live music and food for purchase. calbg.org \nMy Patio Re-wild Potting Workshop, a Tree of Life Nursery class about planning, potting and maintaining a container garden, 10 a.m. to noon at the nursery in San Juan Capistrano. The $10 fee includes soil and landscape materials; plants and pottery sold separately. Register online, pay at start of class. eventbrite.com \nWe’ve lost another nursery in the Greater Los Angeles area. In January I listed four longime plant nurseries closing by the end of 2025, Nuccio’s Nurseries in Altadena, Tree of Life Nursery in San Juan Capistrano, San Marcos Growers in Santa Barabara and Idyllwild Lilac Garden in Idyllwild. Then I discovered another family-owned garden center, Hawthorne Nursery, closed at the end of February after nearly a century of operation. \nIs creating habitat and parkland along the L.A. River “woke”? City officials and House representatives fear the Trump administration’s efforts to freeze funds previously approved by Congress threaten the L.A. River revitalization effort. \nMany parts of Altadena and Pacific Palisades are still without drinking water after the fires that devastated those communities in January. My colleague Noah Haggerty explains why it’s taking so long to get those water systems cleaned and working again. \nFinally, I’ve spent hours reading my colleagues’ excellent and often heartrending articles about the Eaton and Palisades fires. But Hailey Branson-Potts’ story about 96-year-old Louvenia Jenkins, who lost her home of 57 years in the Pacific Palisades, is a beautiful and inspiring example of grace, resilience and hope for what’s to come.\n",
        "image": "[\"https://ca-times.brightspotcdn.com/dims4/default/4946dcd/2147483647/strip/true/crop/8192x5464+0+0/resize/1200x800!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F24%2F66%2F01a6a1954994bdfff692c94c9a8d%2F1420456-wk-native-plant-bouquets-dpm-233.jpg\", \"https://ca-times.brightspotcdn.com/dims4/default/1ddbbf6/2147483647/strip/true/crop/4200x2800+0+0/resize/1200x800!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9e%2Fa2%2Fedd363024cb0bab6ee76db4dd68d%2F1280495-looking-to-document-the-california-poppies-phenomena-7-ajs.jpg\", \"https://ca-times.brightspotcdn.com/dims4/default/31d62dd/2147483647/strip/true/crop/6000x4000+0+0/resize/1200x800!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd5%2Ff0%2F171570f24e799d4cf720c74ecf10%2Fla-photos-1staff-501621-hm-la-hm-descanso-gardens-02.FO.jpg\", \"https://ca-times.brightspotcdn.com/dims4/default/a941007/2147483647/strip/true/crop/3000x2000+0+0/resize/1200x800!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F83%2F7b%2F653ebb76488396919bccfc3d5599%2Fgardening-newsletter-march-2025-3.jpg\", \"https://ca-times.brightspotcdn.com/dims4/default/e03f0fc/2147483647/strip/true/crop/2407x2507+0+0/resize/1200x1250!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F91%2F97%2Fa7e531204cfa87005b37faa07083%2Fla-photos-handouts-tr-tomatomania-tomato-of-the-year-05.JPEG.JPG\", \"https://ca-times.brightspotcdn.com/dims4/default/ae85aca/2147483647/strip/true/crop/1500x1125+0+0/resize/1200x900!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd2%2F06%2F27b16d1844b189edbf22e15b32f8%2Fmore-monkeyflowers-2.jpg\", \"https://ca-times.brightspotcdn.com/dims4/default/8c7fae5/2147483647/strip/true/crop/4160x5984+0+0/resize/1200x1726!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F80%2F0b%2F2276e7c7432aa0f50185c7cfa256%2Fwk-plant-newsletter-march-001meier-a.jpeg\", \"https://ca-times.brightspotcdn.com/dims4/default/3d8102e/2147483647/strip/true/crop/4200x2800+0+0/resize/1200x800!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb1%2F79%2F83b83aab449b8b9dd300b3c5889e%2F1280495-looking-to-document-the-california-poppies-phenomena-21-ajs.jpg\", \"https://ca-times.brightspotcdn.com/dims4/default/6388c2a/2147483647/strip/true/crop/2291x3436+0+0/resize/1200x1800!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa7%2Fd1%2F747a3a174aaf8539b2ebee0e70dc%2Fwk-native-plant-bouquet-jm.jpg\", \"https://ca-times.brightspotcdn.com/dims4/default/6734a48/2147483647/strip/true/crop/3024x4032+0+0/resize/1200x1600!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fcf%2Fc9%2Fd20d155b49fb9b7bc5af79642b55%2Fimg-0064.jpg\", \"https://ca-times.brightspotcdn.com/dims4/default/5fd9f68/2147483647/strip/true/crop/4240x2832+0+0/resize/1200x802!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F69%2F09%2F6ea45253428bb35f24f23e75d1b4%2Fcalifornia-buckwheat-0505.jpg\", \"https://ca-times.brightspotcdn.com/dims4/default/1e23095/2147483647/strip/true/crop/8192x5464+0+0/resize/1200x800!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F11%2F46%2Fc853c6e1483fb0a0fa23d139c7ea%2F1252869-wk-paul-gripp-orchids-158.jpg\"]",
        "tag": "[\"Climate & Environment\", \"Water & Drought\", \"Travel & Experiences\", \"Plants\", \"Things to Do\", \"Lifestyle\"]",
        "keyword": ""
    },
    {
        "id": "e907827035a4813c2f7559cd76808905",
        "title": "Whose Job Is It To Protect Black People From AI? | Opinion",
        "url": "https://www.newsweek.com/whose-job-it-protect-black-people-ai-opinion-1888150",
        "channel_text": "Opinion",
        "user_author_name": "Nakeema Stefflbauer",
        "user_url": "",
        "created_at": "2024-04-09T07:00:01-04:00",
        "description": "",
        "text": "The governor of New York recently dispatched nearly 1,000 members of the National Guard into New York City subways, in response to a spike in crime. In similarly drastic fashion, Google has just reacted to public misfires of its text-to-image product Gemini by pulling it offline. Meanwhile, the victimization of Black people by artificial intelligence (AI) algorithms such as Google's Gemini remains ongoing, and neither elected officials nor tech companies demonstrate much interest in protecting Black people from AI.\nAlgorithmic tools, or AI, that spews lies, stereotypes, and worse is old news. Stories about AI issuing non-violent Black offenders higher recidivism scores than violent white offenders abound. In 2018, Safiya Noble demonstrated how typing \"Black girls\" yielded disproportionately high volumes of pornographic and derogatory content on Google. Meanwhile, AI health care algorithms recommend withholding medical treatments from Black patients at higher rates than for others. Whenever I prompt Midjourney, a visual AI platform, much like Gemini, to visualize a dark-skinned person from multiple angles, or with different positions or facial expressions, the algorithm lightens the subject's complexion with each subsequent pose. Eventually, I am presented with a subject with a white complexion and features.\nThese outputs don't display any pattern of exclusion or misrepresentation of white people, and tech companies maintain this status quo. Confronted with accusations of algorithmic racism and stereotyping, Big Tech companies tend to double down on the same technology. Occasionally, there may be an apology from Google (for algorithms labeling Black people as gorillas), or from Facebook (for algorithms labeling Black men as \"primates\"). Sometimes, the apology is a commercial decision, like IBM, Amazon, and Microsoft's temporary moratorium on selling AI facial recognition systems to U.S. law enforcement (after Gender Shades research proved that the tech worked poorly on Black and dark-complexioned people compared with white people). By contrast, none of the complaints or impassioned headlines about Google's Gemini depicting Nazis, superheroes, and U.S. founding fathers as non-white involve lasting or physical harm. If anything, pundits were outraged that an AI algorithm could project a reality so different from the one that they know.\nTo be sure, misrepresentation in popular culture and exclusion from the historical record hurts. Black people have long reported being harassed, subjected to unfair moderation and suspension policies, and forced by Big Tech companies to prove that they are employed by their employer.\nMore than just feelings are involved. In 2017, ProPublica found that Facebook's hate-speech detection algorithms allowed white men to post hateful, racialized content while flagging posts from Black children as hate speech. The Markup reported in 2021 about Google's social justice \"block list\" for advertisers on YouTube. It prohibited advertisers from marketing anything to viewers interested in \"Black Lives Matter\" and \"Black Excellence,\" but permitted advertisers to target viewers who followed \"White Lives Matter\" and \"White Power.\"\nIn More Than A Glitch: Confronting Race, Gender, and Ability Bias in Tech, New York University associate professor Meredith Broussard wrote that the most frequent victims of misrepresentations, stereotypes, and exclusion by the tech industry are not white people. This is important, given that irate right-wing talk show hosts have alleged that \"racism\" is behind Gemini's recent outputs—as if serious harm has occurred. It took less than a week for Google to issue a public apology and to block the public from using Gemini. If erasing people from U.S. history and popular culture is \"racist,\" why aren't tech companies rushing to pull racist algorithms off the market that inaccurately label Black people as criminals, sentence us unfairly, or struggle to recognize us at all?\nIt should be unlawful to sell algorithms that ignore, demean, and/or endanger people based on the color of their skin. Our elected officials have the power to take action, and just as they can deploy military forces to protect the peace, they can demand that tech companies fix or decommission algorithms shown to cause harm to entire communities. It is time for lawmakers to act, even if only because white people are unhappy that one technology has transformed them into outsiders. Legal interventions exist and should be used to mandate swift action when a company's technology threatens or unfairly excludes any of us.\n\nNakeema Stefflbauer, PhD, is the founder and CEO of the nonprofit \n\nFrauenLoop\n\n. She writes and speaks about how to center marginalized communities within digital ecosystems. She is currently a Public Voices Fellow on Technology in the Public Interest with The OpEd Project in partnership with The MacArthur Foundation.\n\n\nThe views expressed in this article are the writer's own.\n\n",
        "image": "https://d.newsweek.com/en/full/2375076/this-photo-illustration-gemini-ai.jpg?w=1200&f=c443d1b823ae51bdb51d5f2359f5f8b1",
        "tag": "",
        "keyword": "[\"Artificial Intelligence\", \"Black Lives Matter\", \"Racial Bias\", \"Tech\", \"AI\", \"Media Bias\", \"Internet and Technology\"]"
    },
    {
        "id": "e92d3aca116a2ea59cb13e5c669af359",
        "title": "Kremlin 'Trying to Sabotage' Trump-Zelensky Deal: ISW",
        "url": "https://www.newsweek.com/kremlin-trying-sabotage-trump-zelensky-deal-isw-2038821",
        "channel_text": "World",
        "user_author_name": "[\".\", \"Maya Mehrara\", \"Writers Page\", \"m.mehrara@newsweek.com\", \"Maya Mehrara is a News Reporter at Newsweek based in London, U.K.. Her focus is reporting on international news. She has covered Ukraine, Russia, immigration issues, and the revolution in Iran. Maya joined Newsweek in 2024 from the Londoners and had previously written for MyLondon, the Camden New Journal, BUST Magazine, and Washington Square News. She is a graduate of New York University and obtained her NCTJ at News Associates. Languages: English. You can get in touch with Maya by emailing\"]",
        "user_url": "https://www.newsweek.comjavascript:void(0);",
        "created_at": "2025-03-03T12:30:09-05:00",
        "description": "",
        "text": "Amid the ongoing Russia-Ukraine war, the Institute for the Study of War (ISW) has alleged in its Sunday assessment that the Kremlin is \"trying to sabotage\" the rare earths deal between President Donald Trump and Ukrainian President Volodymyr Zelensky.\nNewsweek reached out to the Ministry of Foreign Affairs of the Russian Federation for comment via email outside of business hours.\nIf the Kremlin is \"trying to sabotage\" the rare earths deal between the U.S. and Ukraine, it could jeopardize Kyiv's ability to come out of peace negotiations with territorial integrity following Moscow's February 2022 invasion.\nRussia's alleged efforts could have ramifications on Ukraine's economy for decades to come, depending on the outcome of the rare earths deal.\nIn its Sunday assessment, the ISW, a Washington, D.C.-based think tank, wrote that \"recent Russian official statements in response to the proposed US-Ukraine mineral deal indicate that the Kremlin is trying to sabotage the deal through narratives targeting Ukrainian and American audiences. The Kremlin is claiming that this mineral deal does not benefit Ukraine while also claiming that Russia can make a better offer to the United States, indicating that Moscow sees the deal as harmful to its objectives.\"\nThe ISW's allegation is based on several Russian figures pushing the idea that Ukraine will \"sell out\" the country by pursuing the deal with the U.S.\nSpeaking about the mineral deal on February 23, Kremlin spokesman Dmitry Peskov said Ukrainians in occupied territory decided \"long ago\" they wanted to join Russia so \"no one will ever sell off these territories.\" In the latter statement, the ISW posited that the Kremlin spokesman was implying that Zelensky may \"sell out\" other areas of Ukraine.\nIn a translation of the Russian state television evening news program Vesti, the ISW also alleged that they pushed the narrative that the U.S. is \"blackmailing\" Ukraine with the rare earths deal.\nThe ISW added: \"The Kremlin has a vested interest in preventing the United States and Ukraine from signing a mineral deal, as the deal will commit the United States to a long-term investment in Ukraine and Ukraine's sovereignty.\"\nTrump has been pushing Zelensky to sign a deal which would allow American companies to have 50 percent ownership of Ukraine's rare earth mineral deposits. Trump previously said that he wants \"the equivalent of $500 billion of rare earth\" in return for the continued provision of aid by the U.S.\nZelensky previously rejected the proposal presented by U.S. Treasury Secretary Scott Bessent on the basis that it did not include security guarantees for Kyiv. He later agreed to meet with Trump to discuss the deal and how to end the war with Russia in Washington.\nPrior to the meeting, Trump said he expected Zelensky to sign the minerals deal, while the Ukrainian president said a framework economic deal had been reached, but there was more to be discussed.\nThe two leaders met at the White House on February 28 to discuss the possibility of a ceasefire and security guarantees and engaged in a heated argument over these subjects. Zelensky expressed skepticism that Russian President Vladimir Putin would adhere to the terms of a ceasefire, and at one point, Trump accused the Ukrainian president of being \"disrespectful.\" Zelensky was asked to leave the White House and return when he was \"ready for peace.\"\nThe ISW also alleged on Sunday that Russia is trying to sabotage the U.S.-Ukraine minerals deal by presenting competing offers. Putin previously said he would allow Trump to access to rare earth metals in Ukraine's annexed regions as part of a future deal.\nPresident Donald Trump on Truth Social on Friday: \"We had a very meaningful meeting in the White House today. Much was learned that could never be understood without conversation under such fire and pressure. It's amazing what comes out through emotion, and I have determined that President Zelenskyy is not ready for Peace if America is involved, because he feels our involvement gives him a big advantage in negotiations. I don't want advantage, I want PEACE. He disrespected the United States of America in its cherished Oval Office. He can come back when he is ready for Peace.\"\nPresident Volodymyr Zelensky wrote on X, formerly Twitter, on Friday: \"Thank you America, thank you for your support, thank you for this visit. Thank you @POTUS, Congress, and the American people. Ukraine needs just and lasting peace, and we are working exactly for that.\"\nClint Russell, a podcast host, wrote on X on Saturday: \"Zelensky blew up the rare earth minerals deal that [Secretary of State Marco] Rubio had negotiated. Now, Putin is offering his own. It will be interesting to see how Trump handles this.\"\nNiranjan Shankar, a non-resident scholar at the Middle East Institute, wrote on X on Sunday: \"If Russia is desperate to sabotage the minerals deal, then Trump is onto something.\"\nIn a recent interview with Russian journalist Pavel Zarubin, regarding Ukraine's rare earth materials, Russian President Vladimir Putin said: \"Rare, rare earth metals are a very important component, very important resources for modern sectors of the economy. We are doing little in this direction so far, we must do more. And the meaning of today's meeting is aimed at concentrating administrative resources for work in this direction at the first stage. By the way, we would be ready to offer [cooperation] to our American partners—when I say 'partners,' I mean not only administrative and government structures, but also companies—if they showed interest in working together.\n\"We certainly have an order of magnitude—I want to emphasize this—an order of magnitude more resources of this kind than Ukraine. Russia is one of the undisputed leaders in reserves of these rare and rare earth metals....We would be happy to work together with any foreign partners, including the Americans. Regarding new territories, the same thing: we are ready to attract foreign partners, and our so-called new historical territories, which have returned to the Russian Federation, there are also certain reserves there. We are ready to work with our foreign partners, including the Americans, there.\"\nRussian state media and Moscow's allies celebrated following the contentious meeting between Trump and Zelensky.\nA joint press conference was canceled following the blow-up between Trump and Zelensky, leaving the future of relations between the two countries uncertain.\n",
        "image": "https://d.newsweek.com/en/full/2599263/kremlin-spokesman-dmitry-peskov.jpg?w=1200&f=e20cb120342fc7f7fcdfee3b3842a9b6",
        "tag": "",
        "keyword": "[\"Donald Trump\", \"Volodymyr Zelensky\", \"ISW\", \"Russia\", \"Ukraine\", \"Kremlin\", \"Russia-Ukraine War\", \"Vladimir Putin\"]"
    },
    {
        "id": "e93f57b2871451a100c41a9442a74f74",
        "title": "Governor Tells Donald Trump to His Face She's Taking Him to Court",
        "url": "https://www.newsweek.com/trump-janet-mills-transgender-ban-court-threat-2034660",
        "channel_text": "Politics",
        "user_author_name": "[\"Writers Page\", \"Dan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. He has covered immigration issues extensively, including the root causes of migration to the U.S., its impact on border communities and responses around the country. Dan joined Newsweek in 2024 from The Independent and previously worked at The Messenger, Business Insider and in U.K. local radio. He is a graduate of De Montfort University in Leicester, UK. You can get in touch with Dan by emailing d.gooding@newsweek.com. You can find him on X @DanGooding. Languages: English.\", \"Dan Gooding\"]",
        "user_url": "https://www.newsweek.comjavascript:void(0);",
        "created_at": "2025-02-21T17:11:38-05:00",
        "description": "",
        "text": "Maine Governor Janet Mills, a Democrat, told President Donald Trump on Friday that she would see him in court after he criticized her for defying his executive order regarding transgender athletes competing in girls and women's sports.\nMills was responding to Trump's threat to withhold federal funding from the Pine Tree State as he addressed a room full of governors at the White House.\nThe U.S. Department of Education (DOE) later said it had opened an investigation into Maine's DOE over allegations it was continuing \"to allow male athletes to compete in girls' interscholastic athletics and that it has denied female athletes female-only intimate facilities, thereby violating federal antidiscrimination law.\"\nThe public clash between Mills and the president comes as the Trump administration has made it clear that it wants all state and local leaders to comply with executive orders signed by the president in his first month in office. The administration is already suing Illinois, the city of Chicago, and New York state over sanctuary laws which it sees as defying the president's wishes and federal law.\nTrump's executive order—one of several signed within his first few days back in the Oval Office—sought to ban transgender women from competing in women's and girls' sports, with the argument that those athletes were biological men.\nThe order uses Title IX to back its reasoning—a civil rights law enacted in 1972 to prohibit sex-based discrimination in schools or education programs receiving federal funding.\nThe dispute was directly linked to a threat on Thursday where the president told Republican governors he could withhold education funding for Maine if it didn't comply.\nTrump asked Mills, who previously said Maine would not bar transgender groups from competing in categories matching their gender identity, whether she would comply with the order.\nShe responded that she was complying with state and federal law. Maine has an anti-discrimination law which prevents organizations enacting a ban like the one Trump ordered.\n\"We are the federal law,\" Trump said. \"Well, you better do it, because you're not going to get any federal funding at all if you don't. And by the way your population even though it is somewhat liberal, although I did very well there, your population doesn't want men playing in women's sports.\"\nMills simply responded: \"See you in court.\"\nTrump then said: \"Good I'll see you in court. I look forward to that. That should be a real easy one.\"\nMills has been governor of Maine since 2019 and is serving her second term. She was the first woman in the state elected to the office.\nShe previously served two terms as the state's first woman attorney general, from 2009-2011 and then again from 2013-2019.\nAt the White House on Friday, Trump told Mills he hoped she would enjoy her life after being governor because he did not think she would be reelected. The Democrat cannot seek another term, anyway, as the post is term-limited, and she will leave office in 2026.\nThe order allows federal agencies to withhold funding from organizations that do not comply with Title IX as interpreted by the Trump administration, which defines \"sex\" as the gender assigned at birth.\nThe inclusion of transgender athletes in women's sports has faced increasing criticism from conservative groups who say it creates an unfair competitive advantage and raises safety concerns. The issue became a central talking point in Trump's presidential campaign last year, despite transgender athletes making up a small minority in college sports.\nWhile the order focuses on prohibiting transgender women from participating in women's sports, it does not cite transgender men, who would participate in men's sports and are presumably not affected by the mandate.\nFollowing the order, the National Collegiate Athletic Association (NCAA) updated its policies to say that only those declared female at birth could participate in women's sports. It meant transgender people previously allowed to compete as female athletes were now prohibited from doing so.\nOn Monday, a transgender athlete won a pole-vaulting competition in Maine, sparking controversy, in part because she had competed in the male category two years ago.\nLater Friday, the federal DOE's Office for Civil Rights announced an investigation into Maine's education department over the alleged breach of Title IX. It is also including Maine School Administrative District #51 in its probe, following Monday's competition.\nIn its announcement, the DOE said state law did not override federal law, rendering Maine's anti-discrimination rules defunct under Trump's new ban.\nA letter was sent to Maine Department of Education Commissioner Pender Makin announcing the investigation Friday afternoon.\nGovernor Janet Mills in a statement on Friday: \"If the President attempts to unilaterally deprive Maine school children of the benefit of Federal funding, my Administration and the Attorney General will take all appropriate and necessary legal action to restore that funding and the academic opportunity it provides. The State of Maine will not be intimidated by the President's threats.\"\nSenator Susan Collins, a Maine Republican, in a statement to News Center Maine: \"I oppose the President's attempt to curtail funding for Maine, and will advocate vigorously for our fair share of federal funding for Maine schools. And again, I believe that we must treat transgender people with respect and dignity. But it is important for state officials to remember not only the success that has resulted from Title IX, but the original intent behind that landmark law.\"\n Craig Trainor, acting assistant secretary for civil rights at the DOE, in a press release: \"Let me be clear: If Maine wants to continue to receive federal funds from the Education Department, it has to follow Title IX. If it wants to forgo federal funds and continue to trample the rights of its young female athletes, that, too, is its choice. OCR will do everything in its power to ensure taxpayers are not funding blatant civil rights violators.\"\nThe U.S. Department of Education has begun challenging local and state organizations seen to be ignoring Trump's order, including in California and Minnesota. It was not immediately clear which side would bring a lawsuit over the dispute in Maine.\n\nUpdate 02/21/25, 6:13 p.m.: This article was updated with new information and further context.\n\n",
        "image": "https://d.newsweek.com/en/full/2593348/janet-mills-donald-trump.jpg?w=1200&f=667408d59eec0d0c5e171a64f1ca13df",
        "tag": "",
        "keyword": "[\"Governors\", \"U.S. Politics\", \"Maine\", \"Donald Trump\", \"White House\", \"Court\", \"Trump administration\", \"LGBTQ rights\"]"
    },
    {
        "id": "e98e5215d92d89a840bc1a82fe0fa1c0",
        "title": "Bird Flu Map Update as Nevada's First Human Case Is Detected",
        "url": "https://www.newsweek.com/nevada-bird-flu-human-case-avian-influenza-h5n1-2029088",
        "channel_text": "Health",
        "user_author_name": "[\"Writers Page\", \"You can get in touch with Amanda by emailing a.castro@newsweek.com.\", \"Amanda M. Castro is a Newsweek Live Blog Editor based in New York. Her focus is reporting on U.S. politics, breaking news, consumer topics, and entertainment. She specializes in delivering in-depth news and live blog reporting and has experience covering U.S. presidential debates, awards shows, and more. Amanda joined Newsweek in 2024 from the The U.S. Sun and is a graduate of the University of New Haven.\", \"Languages: English, Spanish\", \"Amanda Castro\"]",
        "user_url": "https://www.newsweek.comjavascript:void(0);",
        "created_at": "2025-02-10T16:55:49-05:00",
        "description": "",
        "text": "Health officials in Nevada have confirmed the state's first human case of avian influenza A (H5N1) in a person who had contact with infected dairy cattle, at a farm in Churchill County. The patient experienced conjunctivitis but had no other symptoms and is recovering.\nThe case marks a continuation of the H5N1 outbreak affecting multiple states. While the Centers for Disease Control and Prevention (CDC) has assessed risk to the general public as low, farmworkers and those in close contact with infected animals remain at higher risk.\nFollowing the confirmed case in Nevada, health officials have begun monitoring and contacting individuals who may have been exposed at the affected farm. Workers have been provided with personal protective equipment, testing and antiviral medications as a precaution. No additional cases have been confirmed in the state.\nAlthough the general public is at low risk, those who work with birds, poultry or cattle—or have recreational exposure to potentially infected animals—should take extra precautions. The Central Nevada Health District advises avoiding direct contact with sick or dead animals and their droppings, keeping pets away from wild birds, and ensuring all food is properly cooked.\nOfficials also warn against consuming unpasteurized raw milk or cheese, as the virus can spread through contaminated dairy products. Farmworkers are encouraged to consult health care providers about seasonal flu vaccinations, which may help reduce the risk of coinfection with other influenza strains.\n\nSince the outbreak last year, 66 confirmed human cases of H5N1 have been reported across 11 states:\n\nArizona and Delaware have reported probable cases, though CDC testing did not confirm the presence of H5N1 in those samples. The virus has primarily spread through contact with infected birds and livestock, with no evidence of human-to-human transmission at this time.\nThe outbreak has also had significant economic consequence. Egg prices have surged primarily due to the ongoing bird flu outbreak, which has devastated poultry farms across the U.S. Millions of egg-laying hens have been culled to prevent the spread of the virus, drastically reducing supply. Additionally, supply-chain disruptions, transportation costs and new state regulations requiring cage-free egg production have all contributed to higher prices.\nHealth officials will continue monitoring the outbreak, conducting surveillance and ensuring protective measures are in place for at-risk workers. The CDC and state agencies will provide updates as needed.\n",
        "image": "[\"https://d.newsweek.com/en/full/2585367/bird-flu.jpg?w=1200&f=5c655e0a2be7285f59f62c77e39adbf1\", \"https://public.flourish.studio/visualisation/21561909/thumbnail\"]",
        "tag": "",
        "keyword": "[\"Bird Flu\", \"Health and Medicine\", \"Nevada\"]"
    }
]