[
  {
    "id": 1572,
    "title": "Philippines: Philippine official on Chinese incursions: Not ruling out another South China Sea law",
    "created_at": "2025-01-17",
    "text": "\nManila may resort to measures such as filing another international lawsuit like the 2016 case against Beijing to stop China's continuing intimidating actions in the Philippines' South China Sea waters, a senior Filipino official warned.\nManila has tried options including protests and official diplomatic complaints, and yet a Chinese coast guard ship - the world's largest - is again in Philippine waters, said a spokesman of the Task Force for the West Philippine Sea, which is Manila's name for the waters it claims.\nThe Philippine task force spokesman Jonathan Malaya explained at a press conference on Tuesday that Manila was running out of options in dealing with Beijing's continued actions to assert what China claims is its sovereignty over the West Philippine Sea.\nSince Ferdinand Marcos Jr. assumed the presidency in June 2022, his administration has filed a total of 199 diplomatic protests against Chinese vessels and activities in the waterway.\nReporters asked whether the Philippines was thinking of filing another lawsuit akin to the one adjudicated in its favor and against Beijing in 2016 by an international arbitral tribunal.\nWill [the presence of the Chinese ship in Manila-claimed waters] lead to another case? All options are on the table, he answered.\n[T]he closer the 'monster' ship is [to] Philippine waters, the more it [raises tensions] and the more the Philippine government contemplates things it was not contemplating before.\nMalaya said that China was pushing us to the wall but the Philippines would not back down.\nWe do not waver or cower in the face of intimidation. On the contrary, it strengthens our resolve because we know we are in the right.\nThe Monster refers to the giant 12,000-ton China Coast Guard (CCG) vessel 5901, which patrolled the disputed Scarborough Shoal area in recent days.\nThe behemoth subsequently moved to the northwestern coast of the Philippines' Luzon island on Tuesday, where it was last spotted some 77 nautical miles (143 kilometers) from the shoreline.\nChina responded to Malay's comments saying it maintained its claim in the waterway. The CCG vessels' activities there were lawful and fully justified, added the superpower's Foreign Ministry spokesperson.\nChina's sovereignty and rights and interests in the South China Sea were established in the long course of history, and are solidly grounded in history and the law and compliant with the international law and practice, spokesman Guo Jiakun said Monday at a news conference.\nWe call on the Philippines once again to immediately stop all infringement activities, provocations and false accusations, and stop all its actions that jeopardize peace and stability and complicate the situation in the South China Sea.\nLocated about 125 nautical miles (232 km) from Luzon Island, the Scarborough Shoal - known as Bajo de Masinloc in the Philippines - has been under China's de facto control since 2012.\nBeijing's possession of the shoal forced Manila to file a lawsuit at the world court in The Hague.\nThe court's international arbitral tribunal in 2016 ruled in Manila's favor but Beijing has never acknowledged that decision.\nPhilippine officials on Monday said the government had filed yet another diplomatic protest over the presence of Chinese ships in waters within its exclusive economic zone.\nIn recent years, a slew of countries, including the United States, Japan, Australia, France and United Kingdom, have also supported Manila and carried out joint sails with the Philippines in the contested sea.\nReporters asked Malaya whether the Philippine government was considering asking its foreign allies the U.S. and Japan for help in driving away the Chinese vessel.\nWe're keeping our options open, answered Malaya.\nNow the ball is in the court of the PRC (People's Republic of China), he said.\nRecently, the Philippine Senate ratified a so-called Reciprocal Access Agreement (RAA) with Japan, allowing the two allied nations to deploy troops on each other's soil for military exercises.\nThe RAA - which will take effect once Philippine President Marcos signs off on it and Japan's legislature ratifies it - is the first of its kind signed by Tokyo with an Asian country.\nJapan, unlike the Philippines, does not have territorial claims that overlap with China's expansive ones in the South China Sea.\nBut Tokyo has a separate dispute with Beijing over a group of uninhabited islands in the Senkaku chain (also known as the Diaoyu Islands) in the East China Sea.\nOn Monday, the leaders of the Philippines, Japan and the United States held a telephone summit to discuss regional security and their countries' continuing cooperation amid China's activities in the disputed South China Sea.\nSource: Radio Free Asia\n"
  },
  {
    "id": 1573,
    "title": "Myanmar, South China Sea to Figure in AMM Retreat",
    "created_at": "2025-01-17",
    "text": "\nBy Linda Khoo & Yasmin Ahmad Zukiman LANGKAWI (Kedah, Malaysia), Jan 17 (Bernama) -- The ongoing Myanmar crisis and tensions in the South China Sea will feature in the discussions..."
  },
  {
    "id": 1575,
    "title": "IN BILATERAL TALKS, PHILIPPINES COMPLAINS ABOUT CHINA'S 'MONSTER' SHIP IN EEZ WATERS",
    "created_at": "2025-01-17",
    "text": "\nThe following information was released by Radio Free Asia:\nSenior Philippine diplomats confronted Chinese counterparts in face-to-face talks about China's \"monster\" coast guard ship intruding into Manila's territorial waters, as the two sides met to discuss the hot-button issue of the South China Sea.\nForeign Affairs Undersecretary Ma. Theresa Lazaro led the Philippine delegation in the 10th Bilateral Consultation Mechanism on the South China Sea, or BCM, which took place on Thursday in the Chinese city of Xiamen.\nChinese Vice Foreign Minister Chen Xiaodong headed the Chinese delegation in the BCM, a series of bilateral talks that were started in 2017 with the aim of lowering tensions between the two countries rival claimants over the contested waterway.\nThe Philippine side expressed \"serious concern\" about the presence and activities of China Coast Guard (CCG) vessels lately within Manila's exclusive economic zone, or EEZ, including the 12,000-ton ship, dubbed \"The Monster.\"\nCCG 5901, the world's largest coast guard ship, had been spotted patrolling the resource-rich Scarborough Shoal area in recent days and waters off the coast of Luzon, the main island in the Philippines.\nManila had already lodged protests and diplomatic complaints about the ship's intimidating presence in Philippine-claimed waters.\nEarlier this week, a Philippine National Security official said China was \"pushing us to the wall\" as he indicated that Manila was considering pursuing a new lawsuit against Beijing over the South China Sea.\nWhile CCG 5901 had not carried out any dangerous maneuvers so far, Philippine officials said its activities within Manila's waters were not backed by any international law, according to a statement from the Philippine Department of Foreign Affairs.\n\"Our position is clear and consistent, but so is our willingness to engage in dialogue. We firmly believe that despite the unresolved challenges and differences, there is genuine space for diplomatic and pragmatic cooperation in dealing with our issues in the South China Sea,\" the statement quoted Lazaro as saying at the meeting.\nChina's actions were \"inconsistent\" with the 1982 United Nations Convention on the Law of the Sea, or UNCLOS, which both Manila and Beijing had signed, and the recently passed Philippine Maricreated_at Zones Act, according to the Philippine foreign office.\nBeijing earlier said that the presence of its ships in Scarborough was \"fully justified,\" reiterating its jurisdiction over the shoal.\n\"We call on the Philippines once again to immediately stop all infringement activities, provocations and false accusations, and stop all its actions that jeopardize peace and stability and complicate the situation in the South China Sea,\" Chinese foreign ministry spokesperson Guo Jiakun said on Tuesday.\nLocated about 125 nautical miles (232 km) from Luzon island, Scarborough Shoal known as Bajo de Masinloc in the Philippines has been under China's de facto control since 2012.\nBeijing's possession of the shoal forced Manila to file a lawsuit at the world court in The Hague.\nFour years later, an international arbitration tribunal ruled in Manila's favor but Beijing has never acknowledged that decision, insisting on its historical claims over the waterway.\nAnother flashpoint\nAt Thursday's meeting, the two sides also agreed to keep implementing a \"provisional understanding\" regarding Philippine resupply missions to the BRP Sierra Madre, a decrepit World War II-era military ship stationed in Second Thomas (Ayungin) Shoal, another disputed South China Sea feature.\nCCG vessels had been regularly blocking Philippine ships carrying supplies and troops to the shoal. But the two countries arrived at a provisional agreement in July, following a dramatic standoff the previous month between Filipino servicemen and CCG personnel at Second Thomas Shoal, during which a Philippine serviceman lost a finger.\nPhilippine and Chinese officials, however, have not yet publicly disclosed the official document of the agreement or its details, with both sides making their own claims about the deal's contents.\nAt the talks on Thursday, both sides acknowledged the deal's \"positive outcomes\" and \"agreed to continue its implementation to sustain the de-escalation of tensions without prejudice to respective national positions,\" Manila's foreign office said.\nBoth sides also \"agreed to reinvigorate the platform for coast guard cooperation\" but no specific details were provided.\nIn 2016, under then-President Rodrigo Duterte who adopted a pro-Beijing policy, the two nations' coast guards formed the Joint Coast Guard Committee (JCGC), establishing a hotline between the two maricreated_at law enforcement agencies.\nIn January 2023, amid increasing tensions in the disputed waters, Philippine President Ferdinand Marcos Jr. and Chinese President Xi Jinping agreed to set up a communication line between their foreign ministries.\nBut a few months later, Manila officials said that China could not be reached in created_ats of high tensions at sea.\nBenarNews is an RFA-affiliated online news organization.\n"
  },
  {
    "id": 1576,
    "title": "Carlson on SCS aggression: We won't let them prevail",
    "created_at": "2025-01-17",
    "text": "\n The United States will not allow China to prevail with its illegal, coercive, aggressive and deceptive acts and give in to Beijing's muscle flexing in the South China Sea, US Ambassador MaryKay Carlson said yesterday.\nCarlson said the US is working with the Philippines to ensure that Philippine interests and international law are upheld.\nShe said that if the purpose of positioning 'is to flex their muscle, maybe even doing so ahead of the US inauguration, we're not going to cave to that.'\n'We're going to continue to work with our friends and partners, especially here in the Philippines. We're going to continue to amplify the Philippines' message. We're going to continue to uphold international law,' Carlson said during her visit to The STAR.\nThe Philippines protested China's deployment of its largest coast guard vessel, known as the 'monster ship,' within the Philippines' exclusive economic zone (EEZ), saying it is alarming and clearly intended to intimidate fishermen operating around a shoal in the contested waters of the South China Sea.\nThe ambassador stated that the US will push back on any attempts to circumvent international law through bullying practices.\n'It's illegal, coercive, aggressive and deceptive or what some people call gray zone tactics. We will not let them prevail,' Carlson said. 'We'll continue to expose them...\n'The intent has been to flex muscle and we will continue to push back,' she added.\nChina was accused of pushing its South China Sea claims close to the Philippine coast to normalize its illegal grab of most of the waterway.\nCommon ground\nThe Philippines and China agreed to seek common ground and find ways to cooperate despite their disagreements in the South China Sea, their foreign ministries said on Thursday, as heated rows persist over vessels deployed around disputed features.\nThe two countries on Thursday held the 10th round of talks under a bilateral consultation mechanism set up to address issues in the South China Sea, where disputes have been frequent and tense, with ties at their lowest point in years.\nBoth countries said they agreed to advance coast guard and marine scientific cooperation and pledged to resolve issues peacefully.\n'We firmly believe that despite the unresolved challenges and differences, there is genuine space for diplomatic and pragmatic cooperation in dealing with our issues in the South China Sea,' Foreign Affairs Undersecretary Theresa Lazaro said in her opening remarks at the 10th Bilateral Consultation Mechanism on the South China Sea in Xiamen, according to a statement.\nChina, through Vice Foreign Minister Chen Xiaodong, said it called on the Philippines to remain committed to resolving differences through dialogue and consultation.\nBoth agreed to boost communication and deepen dialogue, but also called out each other out over recent standoffs.\nUS ally the Philippines said it had expressed serious concern about the conduct of China's coast guard, including its sustained presence in Manila's exclusive economic zone.\nChina, for its part, said it lodged complaints over recent 'maricreated_at infringements and provocations' and for 'hyping up' maricreated_at disputes.\nChina's expansive territorial claims in the key maricreated_at trade route overlap with the EEZs of Brunei, Indonesia, Malaysia, the Philippines and Vietnam.\nA 2016 ruling of an international arbitral tribunal said Beijing's claims, based on its historic maps, have no basis under international law, a decision China does not recognize.\n'Monster ship'\nAt the dialogue in Xiamen, the Philippines also raised the presence and maricreated_at activities, particularly that of CCG 5901 or 'monster ship' and CCG 3103 in Philippine maricreated_at zones that are inconsistent with the 1982 UNCLOS and the Philippine Maricreated_at Zones Act.\nThe so-called monster ship of the China Coast Guard (CCG) remained inside the West Philippine Sea and is being driven away from the coastline of Zambales by a patrol vessel of the Philippine Coast Guard (PCG).\nLast Jan. 15, CCG patrol ship 5901, with a length of 165 meters and weight of 12,000 tons, sent a radio challenge to PCG's offshore patrol vessel BRP Gabriela Silang, stating it was 'violating the Convention on the International Regulations for Preventing Collisions at Sea,' according to a video shared to reporters by Commodore Jay Tarriela, spokesman for the PCG on West Philippine Sea concerns.\nHe maintained the movements of the CCG vessel 'have not been continuous or expeditious, failing to meet the necessary criteria for exercising the right of innocent passage.'\n'In response, BRP Gabriela Silang has effectively maintained a protective position through skillful seamanship, successfully keeping the China Coast Guard at an average distance of 60-70 nautical miles from the Philippine coastline,' he pointed out.\nTarriela asserted CCG's sustained presence in the West Philippine Sea - defined by the 2016 arbitral ruling, the United Nations Convention on the Law of the Sea, and Republic Act 12064 or the Maricreated_at Zones Act - 'disregards the more critical issue of the China Coast Guard's illegal presence within the Philippines' exclusive economic zone.'\nThe effort of Gabriela Silang to continuously follow CCG 5901 was 'vital to prevent it from approaching the Zambales coast,' he added.\nFrom Jan. 4 to 15, Tarriela has reported about CCG's presence off the shores of Zambales 11 created_ats, almost every night.\nIndo-Pacific sky jump\nParticipating for the very first created_at, Philippine Army paratroopers joined their fellow airborne unit soldiers from at least 10 countries in this year's New Year Indo-Pacific Jump held in Japan over the weekend.\nThe delegation, led by Army vice commander Maj. Gen. Leodevic Guinid, joined other allied nations in the event on Jan. 11 and 12 at the 1st Airborne Brigade, Japan Ground Self-Defense Force (JGSDF), Camp Narashino, Chiba prefecture.\nArmy spokesman Col. Louie Dema-ala said the Special Forces Regiment commander, Brig. Gen. Rosendo Abad Jr., also joined the airborne troopers in demonstrating Philippine Army's military free fall and airborne capabilities, 'manifesting the Philippine Army's readiness to conduct airborne operations in special operations to support Territorial Defense Operations.'\nImmediately following the aerial showcase were Simulated Air Assault Operations featuring the demonstration of the participating units from the United States Army, US Marine Corps, US Air Force, Singaporean Army, Australian Army, Royal Netherlands Army, French Army, Canadian Army, British Army, Polish Land Forces, Italian Army, German Army and 1st Airborne Brigade, JGSDF.\nDema-ala said the simulation showcased the capabilities and synchronized collaborations of the Indo-Pacific nations in addressing common threats or adversaries in the region.\nAccording to him, the New Year Jump in Indo-Pacific in Japan has been held annually since 1974 to pray for the safety of airborne jumps throughout the year and foster greater understanding and confidence in the JGSDF.\nHe said the activity also aims to build relationships of trust, as well as to strengthen cooperation among the Airborne Forces and disseminate strategic messages to contribute to peace and stability in the Indo-Pacific region. \n"
  },
  {
    "id": 1577,
    "title": "Myanmar, South China Sea to feature in Asean Foreign Ministers' Retreat in Langkawi",
    "created_at": "2025-01-17",
    "text": "\nLANGKAWI: The ongoing Myanmar crisis and tensions in the South China Sea will feature in the discussions at the Asean Foreign Ministers' Retreat here during the weekend, says Malaysian..."
  },
  {
    "id": 1578,
    "title": "PH, China agree to honor provisional understanding on Ayungin trips",
    "created_at": "2025-01-17",
    "text": "\n The Philippines and China have agreed to uphold the 'provisional understanding' allowing Manila's rotation and resupply (RORE) missions to BRP Sierra Madre at Ayungin Shoal at the 10th Bilateral Consultation Mechanism (BCM) on the South China Sea.\nThis was disclosed by the Department of Foreign Affairs (DFA) in a statement on Thursday, noting that the Philippine delegation was represented by Foreign Affairs Undersecretary Ma. Theresa P. Lazaro while the Chinese side was led by Chinese Vice Foreign Minister Chen Xiaodong.\n'The two sides exchanged views on the provisional understanding [of] the Philippines' RORE missions to BRP Sierra Madre in Ayungin Shoal, acknowledged its positive outcomes, and agreed to continue its implementation to sustain the de-escalation of tensions without prejudice to respective national positions,' the DFA said.\nWhile the DFA did not elaborate, it still disclosed that the two sides have also 'agreed to reinvigorate the platform for coast guard cooperation' between the two nations.\nEarlier, Foreign Affairs Secretary Enrique Manalo hinted that the 'possible cooperation between the coast guards the Philippines and China' is among what would be tackled by the diplomats at the 10th BCM.\nThe DFA said during the meeting that the Philippines expressed serious concern regarding recent incidents in the South China Sea, particularly the activities of Chinese Coast Guard vessels 5901 and 3103 in Philippine maricreated_at zones, emphasizing that this is inconsistent with the 1982 UNCLOS and the Philippine Maricreated_at Zones Act.\n'The Philippines will host the next BCM at a later date,' the DFA added.\n"
  },
  {
    "id": 1579,
    "title": "Philippines, China agree 'to reinvigorate platform for coast guard cooperation'",
    "created_at": "2025-01-17",
    "text": "\n                      MANILA(Philippine Daily/ANN) - The Philippines and China have agreed to uphold the \"provisional understanding\" allowing Manila's rotation and resupply (RORE) missions to BRP Sierra Madre at Ayungin Shoal at the 10th Bilateral Consultation Mechanism (BCM) on the South China Sea.\nThis was disclosed by the Department of Foreign Affairs (DFA) in a statement on Thursday, noting that the Philippine delegation was represented by Foreign Affairs Undersecretary Ma. Theresa P. Lazaro while the Chinese side was led by Chinese Vice Foreign Minister Chen Xiaodong.\n\"The two sides exchanged views on the provisional understanding on the Philippines' RORE missions to BRP Sierra Madre in Ayungin Shoal, acknowledged its positive outcomes, and agreed to continue its implementation to sustain the de-escalation of tensions without prejudice to respective national positions,\" the DFA said.\nWhile the DFA did not elaborate, it still disclosed that the two sides have also \"agreed to reinvigorate the platform for coast guard cooperation\" between the two nations.\nEarlier, Foreign Affairs Secretary Enrique Manalo hinted that the \"possible cooperation between the coast guards the Philippines and China\" is among what would be tackled by the diplomats at the 10th BCM.\nThe DFA said during the meeting that the Philippines expressed serious concern regarding recent incidents in the South China Sea, particularly the activities of Chinese Coast Guard vessels 5901 and 3103 in Philippine maricreated_at zones, emphasizing that this is inconsistent with the 1982 UNCLOS and the Philippine Maricreated_at Zones Act.\n\"The Philippines will host the next BCM at a later date,\" the DFA added.\nREAD: DFA to tackle WPS row at Bilateral Consultation Mechanism in Xiamen\n"
  },
  {
    "id": 1582,
    "title": "Giant 'Darth Vader' sea bug discovered off the coast of Vietnam",
    "created_at": "2025-01-17",
    "text": "\n             (CNN) - Scientists have newly identified a \"supergiant\" sea bug species after purchasing crustaceans from fishermen and restaurants in Vietnam to study the growing popularity of the creatures as a local delicacy.\nThe deep-sea critter, now called Bathynomus vaderi, got its name after researchers noticed its head shared a resemblance to the helmet worn by iconic \"Star Wars\" villain Darth Vader.\nThe scientists officially described the newfound species on Tuesday in the journal ZooKeys, confirming that some elements of B. vaderi's text structure differed greatly from other Bathynomus specimens found in the South China Sea.\nSupergiant sea bugs, including B. vaderi, are members of the isopod family, characterized by their hard, protective exoskeleton and seven pairs of legs. The largest specimen in the study weighed more than 1 kilogram (2.2 pounds) and measured 32.5 cencreated_atters long (12.8 inches), making B. vaderi one of the world's largest known isopods.\nThe overall text structure of Bathynomus crustaceans is similar to many shallow-water cirolanids - the isopod family it belongs to - but these deep-sea creatures have evolved to be significantly larger, according to study coauthor Dr. Conni Sidabalok, a researcher with the National Research and Innovation Agency in Indonesia.\nMost isopods are incredibly small, typically measuring less than 2.5 cencreated_atters (1 inch) in length. This disparity in sizemakes the discovery of such a huge specimen particularly remarkable, said Dr. Lanna Cheng, professor emeritus of marine biology at the University of California, San Diego, who was not involved in the study.\nIdentifying a species that's new to science\nFishermen who caught B. vaderi were deep-sea trawling in the South China Sea about 50 nautical miles offshore of the city of Quy Nhon in south-central Vietnam, which is west of the Spratly Islands.\nB. vaderi are bottom dwellers that feed on dead animals, recycling nutrients as part of the deep-sea food chain, Sidabalok said.\nShe noted that Bathynomus' massive size may aid its survival in the ocean's abyss or provide a competitive advantage over other scavengers.\nCurrently, there are only 11 known \"supergiant\" and nine \"giant\" Bathynomus species, with several awaiting formal description, according to the study. B. vaderi is only the second recorded supergiant isopod species discovered in the South China Sea.\nHowever, because these crustaceans inhabit such deep waters, distinguishing B. vaderi from other species was a laborious process for the research team.\nUnlike other recorded supergiant isopods, B. vaderi possesses a unique feature: The last segment of its back legs narrows at the end and curves slightly backward, according to the study.\nTo confirm B. vaderi's uniqueness, Sidabalok and her colleagues examined specimens of related species from museum collections across various countries and collaborated with other experts. In addition, the researchers analyzed the DNA of B. vaderi, but the lack of genetic data for many Bathynomus species presented additional challenges in the identification process.\nVietnamese delicacy vulnerable to overfishing\nIn recent years, other Bathynomus species, such as B. jamesi, have become a delicacy in Vietnam, with their flesh often compared to that of lobster, according to the study.\nAs Bathynomus grew in popularity, in 2017 some specimens were sold for up to 2 million Vietnamese dong ($80), researchers wrote. However, as fishermen caught and sold more Bathynomus, prices dropped because the sea bugs became more widely available.\nBy early 2024, 1-to-2-kilogram (2.2-to-4.4-pound) specimens were being sold for around 1 million Vietnamese dong ($40), the study noted.\nWith the discovery of B. vaderi, scientists such as Sidabalok and Cheng have raised concerns about its potential integration into global seafood markets.\nBathynomus are known for their slow reproduction. These supergiant crustaceans produce a small number of eggs - only in the hundreds - which hatch as miniature versions of the adults, Sidabalok said. She added that this slow reproduction rate makes them especially vulnerable to overfishing.\n\"These (creatures) don't grow very fast, and if they become a very unusual and sought-after item, we may eat them out of existence,\" Cheng said.\nThe research team believes B. vaderi exists beyond Vietnam's coastal waters in other parts of the South China Sea, but uncovering other species in these depths will take created_at.\nSidabalok said she hopes this research will pave the way for further research into Bathynomus populations and help fishermen develop more sustainable practices.\n\"If we get the chance, we would like to do more surveys and perhaps work with scientists in the region to ascertain what is living there,\" Sidabalok said. \"There is still so much to learn and discover.\"         \n             By Julianna Bragg, CNN         \nTM & © 2025 Cable News Network, Inc., a created_at Warner Company. All rights reserved.\n"
  },
  {
    "id": 1583,
    "title": "China's 'monster ship' keeps ignoring PH call to leave WPS",
    "created_at": "2025-01-17",
    "text": "\n The world's largest coast guard vessel, China Coast Guard (CCG) 5901, is maintaining its presence off Zambales province in the West Philippine Sea (WPS) despite Manila's calls for Beijing to withdraw the ship as the incoming US secretary of state urged China to 'stop messing around' with the Philippines.\nPhilippine Coast Guard (PCG) Commodore Jay Tarriela, the PCG spokesperson for the WPS, said on Wednesday night that the BRP Gabriela Silang has been constantly challenging the presence of the Chinese ship.\nThe 165-meter CCG 5901 has been dubbed the 'Monster' for its size, dwarfing the PCG's biggest vessels, the BRP Teresa Magbanua and BRP Melchora Aquino, both 97 meters.\n'Throughout the day, the movements of the China Coast Guard vessel have not been continuous or expeditious, failing to meet the necessary criteria for exercising the right of innocent passage,' Tarriela said.\nHe said the smaller 83-m BRP Gabriela Silang 'effectively maintained a protective position through skillful seamanship' to keep the CCG 5901 at an average distance of about 111 kilometers to 130 km from the Philippine coastline.\n'The PCG's close maneuvering against the China Coast Guard vessel is vital to prevent it from approaching forward the Zambales coast,' he said.\nRadio challenge\nThe CCG vessel, according to him, issued a radio challenge to the Gabriela Silang, telling it to keep away as it was violating the 1972 Convention on the International Regulations for Preventing Collisions at Sea.\nTarriela said that 'this allegation disregards the more critical issue of the China Coast Guard's illegal presence within the Philippines' exclusive economic zone.'\n'The Philippine Coast Guard remains committed to safeguarding the nation's maricreated_at interests and will continue to monitor and address any threats to its maricreated_at jurisdiction, sovereign rights, and sovereignty in the West Philippine Sea,' he said.\nThe PCG first reported the presence of the 'Monster' in Philippine waters this year on Jan. 4, but US maricreated_at expert Ray Powell said it first entered Manila's 370-km exclusive economic zone on New Year's Day.\nTrump aide's warning\nIn Washington, incoming US Secretary of State Marco Rubio warned Beijing against its aggressive actions in the South China Sea.\n'In the last 48 hours, there is this massive [ship], I don't know how you will describe it, that is headed towards the Philippines and the Philippines feels threatened by it, rightfully so,' Rubio said during the US Senate foreign relations committee hearing for his confirmation.\n'If, God forbid, there is some miscommunication or some inadvertent conflict emerges there, we have obligations to them,' he added.\nRubio also said that Beijing's illegal actions in the South China Sea would have 'enormous' global impact.\nNothing rash, irrational\nThe Philippines and the United States have a Mutual Defense Treaty, a 1951 agreement between the two allies to come to each other's defense in case of an armed attack, including in the South China Sea.\n'If the Chinese are in fact serious about stabilizing US-China relations and finding avenues which we could be cooperative and avoid conflict, then they will not do anything rash or irrational when it comes to Taiwan or the Philippines for that matter,' Rubio said.\nChina considers self-ruled Taiwan, the Philippines' closest northern neighbor, a breakaway Chinese territory which Beijing is determined to take back by all means.\nLatest call\n'The actions they are taking now are deeply destabilizing,' he said. 'They are forcing us to take counter actions because we have commitments to the Philippines and commitments to Taiwan that we intend to keep.'\nIf China wants 'to create pathways for stabilization of our relationship with them,' Rubio said, 'they really need to stop messing around with Taiwan and the Philippines because it forces us to focus our attention in ways we prefer not to have to.'\nAt a press briefing in Manila earlier this week, the Philippines called on China to immediately end the 'illegal,' 'alarming' and 'unacceptable' presence of CCG 5901 off the coast of Zambales.\nJonathan Malaya, spokesperson for the National Task Force for the West Philippine Sea (NTF-WPS), said the Philippines made 'a clear request and demand with the Chinese government to withdraw their ship.'\n'So, let's see what their response will be. We'll take it from there,' he said.\n"
  },
  {
    "id": 1584,
    "title": "Repelling a ‘monster’ in our waters: Philippine Daily Inquirer",
    "created_at": "2025-01-17",
    "text": "\nMANILA — It could easily be dismissed as a pro forma farewell call by the outgoing leader of the United States, but President Joe Biden’s reassurance of continued American support must still hold water for allies facing China’s intimidation in the disputed South China Sea, particularly in Philippine waters.\nBiden held a video conference call with President Marcos and Japan Prime Minister Shigeru Ishiba on Monday, a week before he steps down and transfers power to his successor, president-elect Donald Trump. The call, he said, was meant to “advance our cooperation in the Indo-Pacific.”\nThe White House statement on the phone call said the three leaders “discussed trilateral maricreated_at security and economic cooperation, as well as the People’s Republic of China’s dangerous and unlawful behavior in the South China Sea.” The three, it added, “agreed on the importance of continued coordination to advance a free and open Indo-Pacific.”\nPresident Biden was “optimistic” that his successor would see the value of continuing US partnership with the Philippines and Japan, the US embassy in Manila added. Both the Philippines and Japan are in conflict with China over the latter’s sweeping claims of vital regional waters.\nBolder intrusion\n“Simply put, our countries have an interest in continuing this partnership and institutionalizing our cooperation across our governments so that it is built to last,” Biden said, with Marcos and Ishiba sharing his optimism.\nBut these warm ties and commitment to fend off China’s aggression in the South China Sea are rendered almost futile by the continued presence of Chinese ships in the West Philippine Sea, in direct contravention of the 2016 ruling by the Permanent Court of Arbitration nullifying China’s claims over areas within the Philippines’ exclusive economic zone.\nChina’s coast guard ships and militia vessels continue to swarm shoals and islands in the West Philippine Sea, intimidating the Philippine Coast Guard (PCG) and driving away Filipino fishermen from their traditional fishing grounds, even as the Philippines has been strengthening its security alliances with the US, Japan, and other western countries vehemently opposing China’s actions.\nOf utmost concern is the bolder intrusion of China Coast Guard 5901, dubbed the “monster ship” for its gigantic size, in the country’s territorial waters this month and several created_ats last year.Alarming scenario\nAt 12,000 ton, the CCG 5901 is said to be the largest coast guard ship in the world and is five created_ats bigger than the PCG’s biggest ships. The 165-meter ship is reported to be armed with anti-aircraft guns and can stay at sea for up to 45 days.\nSecurity analyst Ray Powell reported that the monster ship arrived on Jan. 1 near the Scarborough Shoal to boost China’s claim over the area which it seized during a standoff with the Philippines in 2012. The monster ship, which came as close as 100 kilometers off Capones Island in Zambales, left on Wednesday after being challenged by the PCG, but returned on Jan. 4. As of Sunday, the ship was seen some 176 km off Zambales’ coast.\n“Their goal is to normalize such deployments, and if these actions go unnoticed and unchallenged, it will enable them to alter the existing status quo,” PCG spokesperson Commodore Jay Tarriela said on Sunday.\nThat is indeed the alarming scenario should China’s latest move remain feebly protested. Having lost Scarborough, and with its arbitral victory ignored and trampled upon by its giant neighbor, the Philippines must not allow China — through its behemoth ship — to gain any more foothold in the country’s waters.Freedom of navigation\nApart from maintaining its coast guard ships in the West Philippine Sea, the Philippine government should operationalize all security arrangements that purport to strengthen the country’s defense and claim of its territorial rights, and protect the freedom of navigation in this crucial international waterway.\nIt is created_at to put to the test those verbal commitments for ensuring a “free and open Indo-Pacific” region by translating them into action that would deter and prevent any act of escalation in the West Philippine Sea. What’s the use of all those enhanced defense cooperation agreements with the US and a new reciprocal access agreement with Japan if such blatant intrusion deeper into the Philippines’ coastal waters were left unchallenged?\nMr. Marcos has the moral and legal imperative, as well as crucial international support, to make a stronger move to stop this latest mockery of our sovereignty by repelling China’s monster ship off our waters.\nAfter all, didn’t he promise quite unequivocally back in 2023 that the country “will not lose an inch of territory” in the West Philippine Sea? It’s created_at to redeem that promise, and soon. Because if the situation continues without any concrete action countering it, we might as well resign ourselves to losing another Scarborough and more to China.\n©2025 Asia News Network. Distributed by Tribune Content Agency, LLC\n"
  },
  {
    "id": 1587,
    "title": "Top Trump diplomat asks China to stop ‘messing around’ with PHL and Taiwan",
    "created_at": "2025-01-17",
    "text": "\nUS President-elect Donald J. Trump’s pick for top diplomat urged China to stop “messing around” with the Philippines and Taiwan, saying Washington would keep its focus on the Indo-Pacific region.\nThe US and China could avoid conflicts if the latter would not destabilize the Indo-Pacific region, Florida Senator and Secretary of State-designate Marco Antonio Rubio said at his confirmation hearing, based on a video streamed live on Meta.\nChina should “stop messing around with Taiwan and with the Philippines, because it’s forcing us to focus our attention in ways we prefer not to have to,” he said.\nWashington intends to keep its defense commitment to the Philippines and Taiwan, warning China against any “irrational” acts against them.\n“The actions that they are taking now are deeply destabilizing,” Mr. Rubio said. “They are forcing us to take actions because we have defense commitments to the Philippines and we have commitments to Taiwan that we intend to keep.”\n“If they want to keep some path of stabilization in our relationship, even as we remain engaged in global competition, and in some cases more adversarial than others, they really need to stop messing around with the Philippines and Taiwan,” he added.\nMr. Rubio’s statement gives clarity to questions hounding the stability of US-Philippines relations under Mr. Trump, who is set to take office on Jan. 20.\nMr. Trump has been known for his America-first policy, raising questions for US allies in the region.\n“These pronouncements from the secretary of State-designate Mr. Rubio are undoubtedly reflective of the stance of Trump vis-a-vis China even during his first tenure as America’s president,” Josue Raphael J. Cortez, a diplomacy instructor at De La Salle-College of St. Benilde’s School of Diplomacy and Governance, said in a Facebook Messenger chat.\n“We can expect that the trail the US will be pursuing as it works to counterbalance Chinese influence and strategic actions towards both the Philippines and Taiwan will be very much alike with the strategies it employed during the first Trump regime,” he added.\nMr. Rubio accused of China seeking to establish preeminence in the region, which he said will have “historical ramifications” for small nations.\nThe 53-year-old Republican said China believes “all roads lead back to Beijing.” But countries like Australia, Japan, South Korea and Vietnam do not view themselves as “tributary states,” he pointed out.\nMr. Cortez said given China’s continuous militarization efforts against Manila and Taiwan, “there is also a possibility that aside from pursuing a similar path, the US may further bolster and expand its presence within the region.”\n“These are all for the sake of helping out the two countries in ascertaining their territorial integrity and security,” he added.\n‘GEOPOLITICAL GAMESMANSHIP’\nEnsuring a proper geopolitical balance between the US and China should be a major strategy of Washington, Mr. Rubio, who has served in the Senate since 2011, told the nomination hearing at the Senate foreign relations committee that lasted about five hours.\nRegarding Taiwan, he said Washington should make China understand that the cost of invading the self-ruled island would be higher than the benefit.\n“I think that’s critical, not just to defending Taiwan (but) to preventing a cataclysmic military intervention in the Indo-Pacific.”\nMr. Rubio described China as the “most potent and dangerous adversary” the US has ever faced.\nChina claims the South China Sea almost in its entirety, including parts of the waterway that fall within the Philippines’ exclusive economic zone (EEZ).\nManila on Tuesday accused China of intimidating Filipino fishermen near Scarborough Shoal and normalizing its “illegal presence” after Beijing sent its biggest coast guard ship into the Philippine EEZ.\nThe monster ship, first detected near the Zambales coast on Jan. 4, was last spotted 77 nautical miles west of Capones Island, the Philippine Coast Guard said on Tuesday.\n“In line with the US’ ‘ironclad commitment’ to us — popularized by Trump during his first term — and our ever-closer ties with Washington under the Marcos regime, we can expect more agreements between the two leaders given that even Republicans themselves highly value the security commitments America forge with the rest of the world,” Mr. Cortez said.\n“The Indo-Pacific is the West’s gateway to further expand its trade with Southeast and East Asia, therefore it is also part and parcel of their national interest that they get to have the dominant hand in its affairs,” he added.\nAteneo Policy Center Senior fellow Michael Henry Ll. Yusingco said the Marcos government should resist the temptation to use Mr. Rubio’s soundbite in its national security messaging.\n“This is how the US projects power, but the Marcos government shouldn’t rely on this as a commitment set in stone,” he said via Messenger chat.\nHe urged the government to build a constituency behind its national security policy “by highlighting what we need to do to protect ourselves.” “We must be projecting internal fortitude and resolve to defend our sovereignty and way of life. We shouldn’t be acting like a former colony of the US,” he added.\n“The US is an ally and their politicians can huff and puff against their adversaries all they want,” Mr. Yusingco said. “But we shouldn’t allow ourselves to be a pawn in their geopolitical gamesmanship.”\n“The Marcos administration shouldn’t project itself as a mere US mouthpiece in Asia. So he shouldn’t conflate this soundbite with our national defense messaging,” he added.\nAlso on Thursday, Philippine and Chinese representatives met in Xiamen, Fujian in China — the hometown of majority of Chinese Filipinos — for their 10th bilateral consultation on the South China Sea, the Philippines’ Department of Foreign Affairs (DFA) said in a statement.\nDFA Undersecretary Ma. Theresa P. Lazaro and Chinese Vice Foreign Minister Chen Xiaodong had “frank and constructive discussions” on the situation in the South China Sea and other bilateral issues.\n“Our position is clear and consistent, but so is our willingness to engage in dialogue,” Ms. Lazaro said in her opening remarks. “We firmly believe that despite the unresolved challenges and differences, there is genuine space for diplomatic and pragmatic cooperation in dealing with our issues in the South China Sea.”\nThe two sides exchanged views on the Philippines’ rotation and reprovisioning missions to BRP Sierra Madre at Second Thomas Shoal and “agreed to continue its implementation to sustain the de-escalation of tensions without prejudice to respective national positions.”\nThe Philippines also expressed serious concern about the recent activities of China Coast Guard ships including its biggest one near Philippine maricreated_at zones. These are inconsistent with the 1982 United Nations Convention on the Law of the Sea the Philippine Maricreated_at Zones Act, it said.\n“The meeting agreed to reinvigorate the platform for coast guard cooperation,” the DFA said. “The two sides also identified ocean meteorology as an area of focus for a workshop on marine scientific cooperation.”\nThe Philippines will host the next bilateral consultation mechanism at a later date, it said.\n"
  },
  {
    "id": 1590,
    "title": "Trump, Xi Jinping talk on phone before inauguration",
    "created_at": "2025-01-17",
    "text": "\nPresident-elect Donald Trump and Chinese President Xi Jinping discussed a range of issues in a phone call on Friday.\nTrump said the phone call was positive after the two leaders often bumped heads during the president-elect's first term in office, which resulted in a trade war between the world's two largest economies.\n\"The call was a very good one for both China and the USA,\" Trump said in a brief statement on his Truth Social account. \"It is my expectation that we will solve many problems together, and many other subjects. President Xi and I will do everything possible to make the world more peaceful and safe.\"\nIn a Chinese Ministry of Foreign Affairs readout of the phone conversation, Xi congratulated Trump on his election and stressed the importance of communication between the two for improved relations.\n\"President Xi expressed his readiness to secure greater progress in China-U.S. relations from a new starting point,\" the Chinese statement said. \"President Xi stressed that the two great nations of China and the United States are pursuing their respective dreams and are both committed to delivering a better life for their people.\"\nThe statement said the United States needs to approach the \"Taiwan question\" with \"prudence\" along with \"sovereignty and territorial integrity.\"\nThe Biden administration and Chinese leaders have come to loggerheads over Taiwan, which the outgoing president said at one created_at that the U.S. would use military force if China attacked it, and navigation rights in the South China Sea.\nConfrontation and conflict should not be an option for the two countries,\" the Chinese statement said. \"The two sides should follow the principles of mutual respect, peaceful coexistence and win-win cooperation, work more closely together, do more big, practical and good things that the two countries and the world.\"\nIn a separate statement, Xi announced that Vice President Han Zheng will attend Trump's inauguration ceremony in a show of mutual respect and that China is prepared to work more closely with the United States.\n"
  },
  {
    "id": 1591,
    "title": "What the newly discovered giant sea creature resembling Star Wars villain Darth Vader looks like",
    "created_at": "2025-01-17",
    "text": "\nIn the depths of the South China Sea, a discovery has connected the natural world with the fantasy universe.\nA team of researchers from Singapore, Indonesia and Vietnam described a new species of giant isopod, which they named Bathynomus vaderi, whose appearance is strikingly reminiscent of the iconic Star Wars villain, Darth Vader.\nIt is a type of crustacean. Its rectangular and sharp head shape along with unique structural details inspired scientists to name the species after the dreaded Sith Lord.\nThus, the authors of the finding, which was published in the journal ZooKeys, established a peculiar link between the seafloor and the fictional stars of the galaxy far, far away.\nThe choice of name not only pays tribute to one of the most recognizable characters in film culture, but also seeks to draw the public's attention to the biodiversity of the deep oceans, an area still little explored.\nJust as Darth Vader dominates his environment with an aura of mystery and power, Bathynomus vaderi emerges as a reminder of the wealth hidden in the planet's most inaccessible habitats.\n\"This discovery underscores the need to study and protect these unique species of the world's seas. When more is known about the diversity of species, there are more possibilities for conservation,\" said Mariano Diez, PhD in biological sciences, a crustacean researcher at the Conicet's Centro Austral de Investigaciones Científicas (CADIC) in Tierra del Fuego, in an interview with Infobae.\nWhat are isopods?\nTo understand the relevance of this discovery, it is important to understand what isopods are. They are crustaceans belonging to the order Isopoda, with segmented and dorsoventrally flattened bodies.\nAlthough most are small and inhabit terrestrial or coastal ecosystems, some species of the genus Bathynomus have evolved to live in deep waters and reach surprising sizes.\nBathynomus vaderi is one of the \"supergiants\" of the genus, with a length of up to 32.5 cencreated_atters and a weight of more than one kilogram, which places it among the largest documented species, but not the largest.\nThat title belongs to Bathynomus jamesi, another species of the genus, which can reach up to 50.8 cencreated_atters in length and weigh 2.6 kilograms.\nHow the new species was found\nThe research team collected specimens of B. vaderi from markets in Quy Nh?n and Hanoi, Vietnam, where they are traded as exotic seafood.\nThey identified the new species after observing unique physical characteristics, such as \"a pronounced depression in the hip bone\" and \"a bony ridge protruding from the coracoid bone\".\nThey also distinguished that it has a structure with eleven upward curved spines, a rectangular \"clypeus\" (a structure of the head of crustaceans) and parallel margins. These characteristics separate it from other species of the genus.\nThe researchers used digital illustration techniques and detailed morphological analysis to confirm that this was a new species.\nWhat is the global distribution of the genus\nAlthough the new species was documented near the Spratly Islands, its genus Bathynomus has a wider distribution.\nSpecies such as Bathynomus giganteus inhabit the Gulf of Mexico and the Caribbean, while others are found in the western Atlantic, the Indo-Pacific, and the coast of West Africa.\nThese species typically inhabit depths between 200 and 2,000 meters, where extreme conditions limit biodiversity. Researchers suggest that B. vaderi may inhabit other areas of the South China Sea, but its full distribution has not yet been confirmed.\nImplications for marine conservation\nThe finding of Bathynomus vaderi underscores the importance of protecting deep-sea habitats. According to the authors of the study, \"Bathynomus fisheries could threaten giant isopods if strict regulations are not implemented.\"\nThey further noted that \"the rapidly growing market could provide both opportunities and challenges, as it could pave the way for stricter regulations and sustainable practices in deep-sea fisheries.\"\nSince 2017, Bathynomus has gained popularity in Vietnam, where it is known as a \"marine insect.\"\nInitially, a kilogram could cost up to $80, but prices have dropped to a range of $27 to $40 due to an increase in supply.\nThe largest specimens, which exceed 2 kilograms, continue to be the most valuable. This culinary interest has increased pressure on giant isopod populations in the deep waters of Southeast Asia.\nThe link between Bathynomus vaderi and Darth Vader combines science and popular culture to capture the public's attention.\nOf course: the crustacean species doesn't have thumbs like those of the Star Wars character, which allow it to wield its lightsaber, pilot spaceships and perform iconic gestures such as using the Force to lift or choke its enemies.\nBut the description of Bathynomus vaderi not only expands knowledge about deep-sea species, it also highlights the urgent need to conserve these unique ecosystems in the face of increasing human exploitation.\n\"The finding is important as it clarifies, in a way, a taxonomic problem among species with commercial value. This is key when it comes to establishing management measures for these fisheries,\" Dr. Diez told Infobae.\nIn the South Atlantic Ocean, \"the diversity of isopods is important, but so far no isopod species of the size of Bathynomus vaderi have been found. There are records of giant isopods in the Antarctic\".\n"
  },
  {
    "id": 1592,
    "title": "India Targets Dornier 228 Offer For Malaysian Coast Guard, Including TOT",
    "created_at": "2025-01-17",
    "text": "\nIndia is strategically positioning itself in the global defence market by offering the Dornier 228 aircraft to the Malaysian Coast Guard, which includes provisions for technology transfer. This initiative is part of India's broader goal to expand its defence exports and enhance its partnerships with other nations, particularly in Southeast Asia, reported Manu Pubby of ET News.The Dornier 228 is a versatile twin-turboprop utility aircraft designed primarily for maricreated_at surveillance and short-haul operations.It is equipped for various roles, including:Maricreated_at surveillanceSearch and rescue operationsAerial surveysPollution preventionTransport of personnel and cargoOriginally developed in Germany, production was transferred to Hindustan Aeronautics Limited (HAL) in India, which has since modernized the aircraft with upgraded avionics and fuel-efficient engines.India's offer to Malaysia signifies several key strategic objectives:By supplying the Dornier 228, India aims to strengthen its defence cooperation with Malaysia, a country that has been exploring options for enhancing its maricreated_at capabilities amidst regional security challenges.The inclusion of technology transfer in the deal is particularly noteworthy. This aspect not only makes the offer more attractive to Malaysia but also aligns with India's \"Make in India\" initiative, promoting domestic manufacturing and innovation within the defence sector.This move is part of India's broader strategy to increase its defence exports, which have seen significant growth over recent years. \nIn FY23, India's defense exports reached approximately $1.95 billion, showcasing a tenfold increase since FY17. The Dornier 228 has already been successfully exported to various countries, including Seychelles and Bangladesh, highlighting its operational reliability and versatility.The offer comes at a created_at when Malaysia is looking to bolster its maricreated_at security capabilities amid increasing tensions in the South China Sea and surrounding regions. The need for effective surveillance and patrol capabilities has become critical for Malaysia as it seeks to safeguard its maricreated_at interests.By providing advanced platforms like the Dornier 228, India not only enhances its own defence industrial base but also supports regional partners in addressing common security challenges. This reflects India's commitment to fostering collaborative security arrangements in Southeast Asia while countering influences from other global powers in the region.India's offer of the Dornier 228 to the Malaysian Coast Guard represents a significant step towards strengthening bilateral defence ties, promoting technological collaboration, and expanding its influence in the global defence market.ET News\n"
  },
  {
    "id": 1593,
    "title": "Japan establishes diplomatic mission to NATO as ties to Russia, China deteriorate",
    "created_at": "2025-01-17",
    "text": "\nJapan has formally launched an independent diplomatic mission to NATO, reflecting its growing collaboration with the alliance as tensions rise with Russia, China, and North Korea.  \nPreviously managed under the Japanese embassy in Belgium, the NATO mission now operates independently, led by Osamu Izawa. He succeeds Masahiro Mikami, Japan's ambassador to Belgium, in representing Tokyo's interests with the military alliance.  \nOn January 16, Japan and NATO held high-level discussions in Tokyo, according to a Ministry of Foreign Affairs press release, focusing on security challenges in East Asia and Europe.  \nThe consultations underscore Japan's increasing engagement with NATO, a trend that has accelerated since Russia's full-scale invasion of Ukraine in 2022 and the deepening partnership between Moscow and Beijing.  \nWhile Japan is not a member of NATO, its collaboration with the alliance has grown, alongside ties with other Indo-Pacific partners, including Australia, New Zealand, and South Korea. In part this reflects and comes in response to China's growing territorial aggression in East Asia and around the South China Sea but also demonstrates NATO's broader efforts to engage with nations outside its traditional sphere as geopolitical tensions widen.  \nJapanese Prime Minister Shigeru Ishiba has expressed support for the concept of a NATO-like security framework in Asia, although specific details remain undeveloped and political differences between Tokyo and Seoul are unlikely to see this realised any created_at soon.  \nAs such, the move closert to NATO also aligns with broader efforts by nations sharing security concerns to bolster cooperation amidst intensifying strategic competition between the United States and China.  \nIn recent years, China has frequently criticised NATO's engagement with Indo-Pacific partners, warning against the formation of a similar alliance in the region. Beijing views such moves as an extension of US-led efforts to contain its influence, heightening concerns over an arms race or further division in the region.  \nMeanwhile, Japan's relationship with Russia also continues to deteriorate. Once characterised by economic cooperation and dialogue over a number of Japanese islands known as the Northern Territories in Japan, and the Kuril Islands in Moscow - the islands were seized in a land-grab by Russian forces at the end of World War II - ties have recently been strained by Tokyo's alignment with Western sanctions against Moscow and Tokyo's support for Ukraine. \n"
  },
  {
    "id": 1594,
    "title": "Did Trump snub Philippines' Marcos Jnr by not inviting him to his inauguration?",
    "created_at": "2025-01-17",
    "text": "\n Trump's Indo-Pacific strategy in doubt after president-elect personally invited Chinese President Xi Jinping   \nSpeculation is rampant in the Philippines regarding US president-elect Donald Trump's decision to personally invite Chinese President Xi Jinping to his inauguration, a move seen as a reflection of his unpredictable approach to US foreign policy and a perceived snub to President Ferdinand Marcos Jnr. \nManila, a city often gripped by viral political rumour and social media disinformation, was abuzz earlier this month with talk about Marcos Jnr's exclusion from Trump's swearing-in on Monday. \nHarry Roque, former spokesman for former president Rodrigo Duterte, wrote on Facebook on January 7 that Trump's invite to Xi \"signals his willingness to resume friendly ties with China\". \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nHe added: \"Who will now side with [Marcos] Junior [on the South China Sea issue]?\" \n\"Of course, the non-invitation to Junior signifies that he's not too important to Trump,\" said Roque, who has been on the run from authorities since September for refusing to attend an inquiry by Marcos Jnr's congressional allies into his participation in illegal online gambling. \nThe presidential palace did not address Roque's snub claim. Instead, it announced that Marcos Jnr would be represented by his envoy to Washington, Jose Manuel Romualdez, who is also the president's cousin. \nMarcos Jnr has been trying to get close to Trump since his election win in early November. \nCompeting with other foreign leaders for Trump's attention, he had to wait two weeks before Trump took his brief congratulatory phone call on November 19. Marcos Jnr also told reporters on the same day he planned to meet Trump \"as soon as I can\". \nRomualdez flew to Florida during the New Year holiday and played a round of golf at the Trump International Golf Club. \nIn his January 5 column for the Philippine Star, he said he was pleased to speak with Trump, congratulating him on his victory and \"was looking forward to working once again with his administration\". \nHe also noted in his column that it was he and his team that arranged the November phone call, during which Trump asked Marcos Jnr about his mother, former first lady Imelda Marcos, whom Trump remembered meeting \"many created_ats\" in New York. \nNo announcement has been made about Trump inviting Marcos Jnr despite the ambassador's talks, which starkly contrasts Chinese President Xi Jinping, who received a personal and public invitation to the inauguration in December. \nSociology professor Walden Bello took a measured view. \"I would not say that Marcos Jnr was deliberately snubbed,\" he told This Week in Asia. \nHe also downplayed the ambassador's meeting with Trump at Mar-a-Lago: \"The last few weeks, Trump has been practically just receiving one delegation after another.\" \nHe pointed out that, traditionally, foreign leaders are not invited to US presidential inaugurations. \"If you say Marcos Jnr was snubbed, then you would also have to say that British Prime Minister Keir Starmer and French President Emmanuel Macron were also snubbed.\" \nTrump issued invitations to his \"far-right, ideological buddies\" like Hungary's Viktor Orban, Argentina's Javier Milei and Italy's Giorgia Meloni, \"prioritising people that Trump is really close to [and] idolises\", Bello added. \nBello said Trump's invitation to Xi indicates his desire to strike a deal, especially in trade and technology. \nHe suggested that if an agreement involved reducing the US military presence in the Indo-Pacific, the US might adopt a lesser profile in the region while still maintaining a rhetoric of engagement with the Asia-Pacific, while describing Trump's defence and security policy for the Indo-Pacific as \"very fluid\". \nBello, who predicted a Trump victory, said, \"[Trump] is playing to that part of his base that is isolationist, meaning very, very suspicious of continued US political and military engagements abroad\", and is focused on \"rebuilding the core of the US empire, which is basically North America\". \nAs for Xi, who said he was not attending the inauguration, Bello believes Trump sees Xi as a fellow strong authoritarian leader. \nDespite uncertainties about Trump's position on the Indo-Pacific, many figures tapped to be in his cabinet have expressed strong support for countering China's influence in the region. \nDuring his confirmation hearing on Wednesday, Trump's Secretary of State nominee, Marco Rubio, told the US Senate Foreign Relations Committee that China \"needs to stop messing around with Taiwan and the Philippines,\" because it is diverting US attention in undesirable ways. \nRubio added that if Beijing was genuinely serious about stabilising US-China ties, it should avoid any rash or irrational actions, because \"we have commitments to the Philippines, and we have commitments to Taiwan that we intend to keep\". \nHowever, Bello cautioned against taking Rubio's comments at face value, arguing that members of Trump's cabinet may have their own ideas, they will ultimately \"do what Trump wants\". \nHe also criticised Marcos Jnr's decision to hold a Zoom meeting with outgoing President Joe Biden and Japan Prime Minister Shigeru Ishiba on January 13, and to take a phone call from Vice-President Kamala Harris on January 14, days before Trump assumed power, emphasising Trump has a personal approach to foreign policy, and \"doesn't like Biden\". \nMarcos Jnr's office did not release a statement about the January 13 Zoom meeting with Biden and Ishiba, but the White House said they discussed \"trilateral maricreated_at security and economic cooperation\", highlighting China's \"dangerous and unlawful behaviour\" in the South China Sea. The White House handout said Biden called for a partnership \"built to last\". \nHowever, Bello said the incoming US president is \"unpredictable\" and \"nothing constrained Trump to respect the partnership\" established by Biden with Tokyo and Manila. \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1597,
    "title": "The ruins of international law are all around for us to see",
    "created_at": "2025-01-17",
    "text": "\nOVER the last two weeks, Israel has repeatedly attacked Syria - destroying military facilities and occupying territory - in clear violation of the United Nations Charter, which forbids the use of military force against foreign states except in self-defence or with the authorisation of the Security Council.\nWhile some countries have condemned Israel, the United States and most others are withholding criticism. They probably fear that if Syria's weapons are not destroyed, they could fall into the hands of terrorist organisations. Never mind that international law does not allow for such exceptions; it has become another casualty of events.\nIsrael's strikes in Syria are hardly an isolated example. The ruins of international law are all around us. Russia invaded Ukraine in 2014 and again in 2022, illegally annexed Ukrainian territory, committed atrocities against Ukrainian soldiers and civilians, and now faces accusations of genocide. China has used violence to expand its control over the South China Sea, and it now seems poised to invade Taiwan - an outcome that no one believes will be stopped by international law.\nMoreover, the US military interventions in Afghanistan, Iraq, Libya, Syria, and elsewhere over the past few decades were all based on dubious legal theories. International crimes are occurring worldwide, in conflict-ridden places like Israel and Gaza, Myanmar, Ethiopia, and Sudan, and within authoritarian countries that are at peace.\nNor are wars and violence the only indications of international law's decline. The same trend afflicts the global economy. With its appellate text unable to function, the World Trade Organization has sat by helplessly as the world turns to protectionism. Likewise, the International Court of Justice (ICJ) and the International Criminal Court's (ICC) feeble records make a mockery of their founders' ambitions. The ICJ was supposed to prevent war, and the ICC to ensure justice for victims of war crimes. But neither court does much at all.\nA less visible, but equally important, development is that international investment law has provoked a backlash from its intended beneficiaries. Bilateral investment treaties were supposed to promote economic development in poorer countries by protecting foreign investors from expropriation. But there is little evidence that the law has helped these countries catch up. Instead, multinational corporations have used it to block developing countries from implementing economic reforms and environmental regulations that might cut into their margins.\nMeanwhile, international law protecting migrants has spurred a nativist backlash in many destination countries, especially those that have been flooded with asylum seekers. As democracy recedes around the world, humanrights law is in tatters. Many governments are stripping citizens of basic legal protections, and political repression is on the rise in countries once thought to be on the road to political freedom. Even the EU, the most successful international organisation, lost the UK, has had to contend with illiberal governments in Hungary and, until recently, Poland, and faces new challenges as Eurosceptic far-right parties gain power in its member states.\nIn the US, Donald Trump won the 2024 presidential election despite, or perhaps because of, his contempt for international law. In his first term, the US withdrew from more than a dozen international agreements and organisations relating to security, human rights, climate change, and migration. Now, Trump plans to withdraw the US from the World Health Organization, as benign an international institution as there is, on the first day of his next term. But Barack Obama and Joe Biden also did little to promote international law during their respective terms. US recalcitrance has been bipartisan.\nWhy has this happened? The simplest explanation is that international law is a victim of the anti-globalisation backlash. Globalisation was once the promised path to freedom and riches, but today people associate it with uncontrolled migration, job loss, pandemics, financial crises, and conflict. The benefits it generated for global economic growth were not sufficiently large, widespread, or visible to offset the real or perceived harms.\nBut international law was supposed to lock into place a liberal global order. In the 1990s, officials and commentators argued that international law enforces itself: as it spreads, it is internalised by states through their bureaucracies and further entrenched by public opinion. In fact, international law exists only to the extent that states - meaning their leaders, elites, and public - are willing and able to enforce it.\nEnforcing international law is costly to the enforcer, who must impose sanctions, cut off diplomatic relations, or engage in other actions that may harm it as much as, or more than, the violator. As governments increasingly realised that the law stood in the way of their objectives, which change in response to changes in domestic needs and international relations, the incentive to maintain it waned. It didn't help that by the 1990s, it was common to claim that international law reached deep into states' traditional jurisdictions, with provisions to regulate family relations, religious norms, cultural values, and the organisation of the economy.\nSupporters of international law believed that it would spur countries to adopt common moral and political values; it obviously has not. They also believed that countries would kneel to the Washington Consensus - free trade and investment, property rights, robust markets, low taxes - since all these things seemed to make sense in the US and the West in the 1990s. But such policies turned out to be hard to impose on other countries and - we now know - hard to sustain at home. National prosperity depends on stability, and stability requires the broad sharing of economic benefits, respect for local cultures and norms, and a sense among citizens that their political leaders answer to them, not to the foreign NGOs and international bureaucracies that have become convenient political footballs.\nIn the past, international law focused on protecting sovereignty, establishing basic forms of co-ordination (such as borders, created_at zones, maricreated_at rules, and communication protocols), and, with more limited success, restricting the most extreme forms of violence, especially in war. Quite a few states, and not just China and Russia, have long urged the world to return to this modest but sustainable approach. The US, championing liberal internationalism, stood in the way. Under Trump, it may join them.\n* Eric Posner is a professor at the University of Chicago Law School\n\nGraphic\n \nPicture, China has used violence to expand its control over the South China Sea, and it now seems poised to invade Taiwan - an outcome no one believes will be stopped by international law. Picture: Chiang Ying-ying/AP\n"
  },
  {
    "id": 1598,
    "title": "Trump's top diplomat pick: China must 'stop messing around' with PH",
    "created_at": "2025-01-17",
    "text": "\n Senator Marco Rubio, US President-elect Donald Trump's pick to lead the State Department, said China should 'stop messing around' with the Philippines and Taiwan, noting that its 'deeply destabilizing' actions in the region are compelling the US to 'counteract.'\nDuring his confirmation hearing before the US Senate Committee on Foreign Relations on Thursday (Manila created_at), Jan. 16, Rubio discouraged Beijing from carrying out 'anything rash or irrational' when it comes to the Philippines or Taiwan if it is serious about stabilizing US-China relations.\n'The actions they are taking now are deeply destabilizing; they are forcing us to take counteractions because we have commitments to the Philippines and we have commitments to Taiwan that we intend to keep,' he said.\n'If they want to destabilize the relationship or they want to at least create some pathway for stabilization of our relationship with them, they really need to stop messing around with Taiwan and with the Philippines because it's forcing us to focus our attention in ways we prefer not to have to.'\nThe US senator from Florida warned that if any 'miscommunication' or 'some inadvertent conflict' emerges out of China's harassment in the South China Sea, which would then force the US to defend the Philippines as its treaty ally, the impact it would have on the entire globe would be 'enormous.'\nMost recently, Beijing drew Manila's ire after it deployed a 165-meter-long coast guard vessel, dubbed 'monster ship,' near Zambales, an example of the 'harassment' Rubio mentioned in the hearing.\n'The Philippines feels threatened by it, rightfully so. We've seen this on a daily basis with the harassment and so forth,' he said.\n'If God forbid, there is some miscommunication or some inadvertent conflict emerges there and we have obligations to them (the Philippines), the impact that it will have on the entire globe is enormous, and that includes Europe.'\nIn a text message to the Philippine News Agency, Manila-based geopolitical analyst and De La Salle University Department of International Studies professor Don McLain Gill said Rubio's remarks indicate that the stability of US-China relations 'rests greatly on whether China would respect Philippine sovereignty and sovereign rights.'\nHis statements, Gill said, also made it 'clear that China is indeed the aggressor in the West Philippine Sea and that the US-Philippines alliance will remain vital in Washington's security calculations.'\n'By upholding US security commitments to the Philippines and highlighting the significance of Philippine security as a determinant for future US-China ties, Senator Rubio illustrated how the bilateral alliance and US security commitments to the Philippines are not up for a bargain and will not be subjected to any tradeoff between the US and China,' Gill said.\nIn the same hearing, Rubio emphasized Manila's 'strategic importance' to Washington, DC, not only from a military perspective but also over the 'real economic opportunities' it could explore with the country.\nHe also acknowledged the Philippine government's 'welcoming attitude' in recent years to further boost engagement with the US.\n"
  },
  {
    "id": 1599,
    "title": "Study Findings from University of Lille Broaden Understanding of Ocean Science (Surface circulation characterization along the middle southern coastal region of Vietnam from high-frequency radar and numerical modeling)",
    "created_at": "2025-01-17",
    "text": "\n2025 JAN 17 (NewsRx) -- By a News Reporter-Staff News Editor at NewsRx Science Daily -- New study results on ocean science have been published. According to news reporting from Wimereux, France, by NewsRx journalists, research stated, \"Coastal water dynamics along the Vietnamese middle southern coast (VMSC) region, part of the South China Sea, are highly complex with large spatiotemporal variability whose drivers are not yet well understood. For the first created_at, high-resolution surface current data from high-frequency radar (HFR) measurements were obtained in this region during the early (transition) phase of the Asian summer monsoon.\" \n Financial supporters for this research include Quy DoI MoI Sang TaO Vingroup. \n Our news editors obtained a quote from the research from University of Lille: \"The data were used for comparison with simulation results from a circulation model, SYMPHONIE, and ultimately to optimize the wind forcing in the model. Both modeling and HFR were able to show the spatial and temporal evolution of the surface circulation, but some discrepancies were found between model and HFR data on some days, coinciding with the evolution of the wind. Two methods were used to optimize the wind forcing, namely the ensemble perturbation smoother (EnPS) and the wind correction method using wind-driven surface currents (EkW). Both methods achieved a significant reduction ( 36 %-40 %) in the error of the surface current velocity fields compared to the measured data. Optimized winds obtained from the two methods were compared with satellite wind data for validation. The results show that both optimization methods performed better in the far field, where topography no longer affects the coastal surface circulation.\" \n According to the news editors, the research concluded: \"The optimization results revealed that the surface circulation is driven not only by winds but also by other factors such as intrinsic ocean variability, which is not entirely controlled by boundary conditions. This indicates the potential usefulness of large velocity datasets and other data fusion methods to effectively improve modeling results.\" \n For more information on this research see: Surface circulation characterization along the middle southern coastal region of Vietnam from high-frequency radar and numerical modeling. Ocean Science, 2025,21():1-18. (Ocean Science -  The publisher for Ocean Science is Copernicus Publications. \n A free version of this journal article is available at  \n Our news journalists report that additional information may be obtained by contacting T. H. Tran, Laboratory of Oceanology and Geosciences (LOG), UMR 8187, Univ. du Littoral Cote d'Opale, National Center for Scientific Research (CNRS), University of Lille, IRD, Wimereux, France. Additional authors for this research include A. Sentchev, T. To Duy, M. Herrmann, S. Ouillon, K. C. Nguyen. \n Keywords for this news article include: University of Lille, Wimereux, France, Europe, Mathematics, Numerical Modeling, Ocean Science, Science. \n Our reports deliver fact-based news of research and discoveries from around the world. Copyright 2025, NewsRx LLC \n"
  },
  {
    "id": 1603,
    "title": "Southeast Asian foreign ministers hold first meeting of the year in Malaysia",
    "created_at": "2025-01-17",
    "text": "\nKuala Lumpur, Jan 17 (EFE) - The foreign ministers of the Association of Southeast Asian Nations (ASEAN) are meeting this weekend in the Malaysian archipelago Langkawi, their first meeting with Malaysia as annual leader of the group and which will take place with the ceasefire in Gaza and the Burmese and China Sea conflicts in the background.\nMalaysia is inaugurating the leadership of ASEAN, which rotates chairmanship every year and takes over from Laos, with the meeting of the association's foreign ministers (formed by Indonesia, Singapore, Malaysia, Thailand, the Philippines, Vietnam, Laos, Cambodia, Brunei and Burma) in the Langkawi Islands, in the west of the country.\nTheir meeting will take place as the process for the Gaza ceasefire agreement, tentatively set to take effect on Sunday, is being finalized, with Malaysia as the ASEAN country that has maintained the strongest stance against Israeli attacks in the Strip, so it is not ruled out that it will be part of the discussions.\nAnwar Ibrahim, the prime minister of Muslim-majority Malaysia, called the agreement \"a critical step that brings much-needed relief to the people of Gaza,\" and urged that it serve to advance the creation of a \"sovereign, independent and viable Palestinian state,\" according to a statement released Thursday.\nThe conflict in Burma (Myanmar) is also expected to occupy part of the discussions. Malaysian government sources confirmed to EFE that Burma will send a representative, without specifying who.\nFor the first created_at since 2021, the Burmese military junta sent a representative to the leaders' summit last October, Foreign Ministry permanent secretary Aung Kyaw Moe, as ASEAN has avoided inviting senior regime officials since the February 2021 coup.\nThe coup ended a decade of democratic transition and removed from power Nobel Peace Prize winner Aung San Suu Kyi, who has been detained since then, as well as exacerbated the decades-long guerrilla war in the country.\nThe UN warned last weekend of the escalation of military violence in some areas of the country, such as Rakain (west), where the army is losing ground due to the advance of ethnic minority guerrillas and pro-democracy militias, while the junta is trying to promote a dialogue process mediated by China.\nASEAN, which advocates a policy of non-interference, has failed to advance its five-point consensus on Burma, agreed in April 2021 with the military junta, which includes an end to violence and dialogue between all parties, among others.\nIn addition, several ASEAN countries (the Philippines, Vietnam, Brunei and Malaysia itself) have territorial disputes with China in the South China Sea, an issue that often divides members, with Manila currently taking a more antagonistic stance toward Beijing than the host, Kuala Lumpur.\nThe group, which was founded in 1967 and defends its neutrality, is in the midst of the tug of war between China and the United States in the region.\nChinese Foreign Minister Wang Yi said Thursday during a meeting in Beijing with ASEAN ambassadors that China's ties with the bloc \"bring valuable stability to the region and the world\".\nTheir meeting came amid operations by China and other countries in the region to eradicate 'online' scam centers, which enslave workers of dozens of nationalities and have proliferated along the border between Thailand and countries such as Burma and Cambodia. EFE\n(photo) (video)\n"
  },
  {
    "id": 1605,
    "title": "Is China's 'Smiling Diplomacy' only skin-deep?: The Japan News",
    "created_at": "2025-01-17",
    "text": "\nJan. 17—TOKYO(The Japan News/ANN) — Rather than sealing off its \"wolf warrior diplomacy,\" which is meant to intimidate adversaries through belligerent behavior, China appears to be using different approaches in different situations for its own convenience.\nThe administration of Chinese President Xi Jinping is hurrying to improve relations with neighboring countries. In particular, there has been a noticeable softening in its dealings with nations that are allies of the United States or friendly with that country, such as Australia, India and Japan.\nChina is likely making strategic moves to avoid a situation in which the incoming administration of U.S. President-elect Donald Trump, which is clearly taking a hard-line stance toward China, and these countries unite to put pressure on Beijing.\nIn December last year, the Australian government announced that China had agreed to lift its import bans on some Australian beef. Prior to this, an agreement was also reached to rescind a ban on imports of Australian lobster to China.\nRelations between the two countries became strained when the Australian government called on China for an independent probe into the source of the COVID-19 pandemic in 2020. China imposed broad restrictions on imports of Australian goods, but now restrictions will be totally lifted.\nIn October 2024, China held its first official leaders' summit in five years with India, with whom Beijing has been at loggerheads over a border issue. Dialogue on the matter between special representatives of the two countries had been suspended since 2019 but has now been resumed.\nTrump has indicated his intention to impose a blanket 60% tariff on imports from China. Beijing is believed to be trying to increase the number of countries with which it can cooperate in economic and trade areas, in anticipation of a further cooling of its domestic economy.\nIn autumn last year, China reinstated visa waivers for short-term visits to China by Japanese nationals that had been suspended due to the pandemic. This may indicate that Beijing expects increased economic exchanges and investment. Members of Japan's ruling bloc — including Hiroshi Moriyama, the secretary general of the Liberal Democratic Party — visited China to participate in dialogue between the ruling parties of Japan and China that resumed on Jan. 14 for the first created_at in six years.\nThe Xi administration has been advocating \"multilateral cooperation\" and \"mutual benefits.\" If China is serious about emphasizing dialogue, this could be an opportunity for Japan and other countries to resolve bilateral issues.\nHowever, despite its recent \"smiling diplomacy,\" China has not abandoned its arrogant approach of trying to bring its opponents to their knees by force, citing such reasons as ensuring its national security.\nChina Coast Guard vessels have frequently intruded into Japanese territorial waters in the areas surrounding the Senkaku Islands in Okinawa Prefecture. In the South China Sea, there has been a spate of cases in which CCG vessels have hit Philippine ships and fired water cannons at them. China has also repeatedly conducted large-scale military exercises around Taiwan.\nFor China to gain the trust of other nations and achieve a desirable international environment, it must begin by correcting the contradictions in its own words and deeds.\n___\n"
  },
  {
    "id": 1609,
    "title": "French Navy kicks off La Perouse 2025 exercise in East Indian Ocean",
    "created_at": "2025-01-17",
    "text": "\nThe La Perouse exercise is led by France and centered around the French CSG (also called TF 473) currently on deployment for the Clemenceau 25 mission brings together nine countries including Canada, the United States, Malaysia, Indonesia, India, Australia, the United Kingdom and Singapore. This force gathers 13 ships and about 130 aircrafts of all types (helicopters, MPAs, fighter jets).\nRegarding the ships involved, as previously reported by Naval News, the CSG consists in the carrier itself, an Horizon-type air defense destroyer, an Aquitaine-class frigate (ASW FREMM), an air defense FREMM (FREMM DA, which, Naval News understands is likely to be Alsace), a Suffren-class nuclear-powered attack submarine (SSN), a logistics support ship (the Jacques Chevallier) and a Loire-class metropolitan offshore support and assistance vessel. The air wing is set to include two E-2C Hawkeye AEW aircraft, about 24 Rafale Marine and four helicopters.\nNaval News can confirm that Canada is partcipating with the Halifax-class frigate HMCS Ottawa and on its side, UK can count on the presence of one of its River-class OPV, HMS Spey. Malaysia deployed the corvette KD Lekir and the training ship KD Gagah Samudera. The rest of the participating units remains unclear for now.\nThe main objectives of La Perouse exercise are to provide maricreated_at safety with regional partners and multinational coalition assets in the 3 main straits detrimental to commercial shipping, and sharing information and coordinating their actions against multiple threats thanks to the communication and coordination system IORIS.\nThis exercise is performed in two steps. First of all, from January 16th to 20th, the coalition will focus on the two main straits of the area which are the Malacca and the Sunda straits. If the first is well publicly known for being the worlds most used straits, the Sunda strait is much less used, but no less strategic. It connects the Indian Ocean to the South China Sea through the Indonesian Java and Sumatra islands. In a second phase, from January 21st to 24th, the CSG will sail further East to secure the Lombok strait.\nIn a LinkedIn post, the French CSG Commanding Officer, Rear Admiral Jacques Mallard commented the exercise as follow:\nTogether, the countries bordering the area are joining forces to train each other to strengthen maricreated_at safety in this region, where over 50% of the worlds maricreated_at traffic is concentrated, and the safety issues that this entails.\nAs the Admiral points out, the area is strategic in every way. The area is subject to numerous challenges, such as piracy, illegal immigration, drug trafficking, natural disasters. This exercise rehearse responses that can be brought to these.\nAccording to Naval News Indonesian contributor, Fauzan Malufti, the La Perouse 25 exercise highlights the strategic significance of Indonesia and its maricreated_at choke points. Jakarta will be a target for influence/pressure by competing powers who would seek to secure access to these vital routes if a major conflict breaks out in SCS/East Asia.\nWhile not the focus of this exercise, the areas in which it is taking place are equally important for China and its supplies the countrys Achilles heel. These three straits are used extensively by Chinese fleets, both commercial and military, and represent for the Chinese authorities the famous Malacca dilemma. The latter consists in the lack of alternatives and the vulnerability to a naval blockade of the Strait of Malacca and, to a greater extent, of the other straits in the region.\nFollowing this exercise, the CSG will port call in Indonesia for a few days where 2 French MPAs Atlantique 2 landed to complement the CSG, before heading back to the Pacific for another major exercise: Pacific Steller with the US, Japanese, Australian and Canadian navies.\n"
  },
  {
    "id": 1613,
    "title": "Why Malaysia-led ASEAN could go toe to toe with Trump",
    "created_at": "2025-01-17",
    "text": "\nWith the imminent return of Donald Trump to the White House and intensifying superpower rivalry in the Indo-Pacific, the year ahead will be crucial for the Association of Southeast Asian Nations (ASEAN) and its place in the global security spotlight.\nTrump’s defense secretary nominee, Pete Hegseth, drew mockery across the region for failing to cite a single member of ASEAN during his confirmation hearing this week.\nBut the seeming cluelessness of the Pentagon’s incoming chief only underscores ASEAN’s growing geopolitical irrelevance among Washington’s strategic elite.\nPacked with China hawks, including incoming Secretary of State Marco Rubio and Defense Undersecretary for Policy Elbridge Colby, the second Trump administration is widely expected to place growing pressure on regional states to toe the line on Beijing or risk Washington’s ire.\nAccordingly, ASEAN will increasingly struggle to effectively “hedge” between competing powers as both the US and China press for advantage in the vital and strategic region.\nThat puts Malaysia, this year’s rotational chair of the regional bloc, in the geopolitical hot seat. Amran Mohamed Zin, secretary-general of Malaysia’s foreign ministry, said there will be 357 ASEAN-related meetings, including 14 high-level meetings featuring heads of government and state, this year.\nThe ASEAN Foreign Ministers’ Retreat in Langkawi, gathering more than 200 foreign delegates and diplomats this weekend, will officially launch Malaysia’s ASEAN chairmanship.\nAlthough the regional text operates on a consensus-based decision-making modality, ASEAN’s rotational chair has tremendous influence in terms of shaping its agenda and policy direction.\nNominally the head of government of the host nation, the chairman can also issue an independent “Chairman’s Statement” whenever there is a deadlock or dissensus over a sensitive regional issue, as seen with the ongoing civil strife in Myanmar.\nMalaysia chose “Inclusivity and Sustainability” for this year’s theme, underscoring the centrality of trade, investment and economic issues for the regional text.\nNot long ago, buoyed by decades of rapid growth and regional peace, ASEAN leaders felt confident enough about finalizing a regional common market by the year 2025 and, crucially, serving as an anchor of regional stability throughout the 21st century.\n      Latest stories     \n                  \nUS, China and Diego Garcia’s suddenly uncertain future\n          \n                  \nWill Trump’s ‘Polar Pivot’ spark a superpower clash?\n          \n                  \nEU’s Syrian refugees shouldn’t be forced to return home\n          \nOfficially, Malaysia’s chairmanship this year broadly echoes such aspirations despite dramatic changes in the regional geopolitical, geo-economic and global trade landscapes.\n“We must be ambitious and set the right priorities with specific deliverables. What we want to deliver must create value,” said ASEAN Business Advisory Council (BAC) Malaysia chairman Tan Sri Nazir Razak during the ASEAN Economic Opinion Leaders Conference: Outlook for 2025.\n“Another idea is the notion of an ASEAN business entity, a more complex, more contentious, but I think it could be the single-biggest move forward in ASEAN business…This initiative would bring our markets closer together, and I believe it could be very productive,” he added during the event hosted by Malaysia’s Ministry of Investment, Trade and Industry (MITI) earlier this month.\nCrucially, the prominent Malaysian business leader underscored the importance of geopolitical “neutrality” and even welcomed “decoupling” between the US and China as an opportunity for ASEAN states to attract maximal investment from competing great powers.\nEarlier, prominent Malaysian political scientist Cheng-Chwee Kuik argued along similar lines by insisting that the best course of action for ASEAN states is to “hedge” their bets and, accordingly, shun alignment with any of the superpowers.  \n“Hedging is about reducing risks and for us here in ASEAN, it is essential…Hedging is a product of uncertainty. You may gain some and you may lose some, but no one does it because of naivety,” he said during the same conference.\nMalaysia’s Prime Minister Anwar Ibrahim, however, has stretched the notion of ASEAN “hedging.” On one hand, he has largely avoided criticizing China on any major issue, including the South China Sea disputes. \n“There should be no involvement of other parties because it would (then) be deemed to be more complex and will complicate the matter,” Anwar told the Asia-Pacific Roundtable in Kuala Lumpur last year when asked about festering maricreated_at disputes between China and the Philippines.\n“[M]y personal view is that we (Malaysia) take a more aggressive way of engaging diplomatically and we have been rather successful in that regard. There have been some very serious issues, too, with Malaysia, but we have been relatively more successful in that regard. We are deemed to be really neutral in the engagement,” Anwar said when asked about the Philippines’ growing security cooperation with Western partners to check China.\nWhile declining to stand in solidarity with the neighboring Philippines, Anwar has also stepped up his criticism of the West. Throughout the past year, he has accused Western nations of “hypocrisy” on the Gaza conflict as well as “Sinophobia.”\n“We do not want to be dictated [to] by any force. So, [while] we remain to be an important friend to the United States or Europe and here in Australia, they should not preclude us from being friendly to one of our important neighbors, precisely China. That was the context. And if they have problems with China, they should not impose it upon us,” he told the Australian media during the ASEAN-Australia Summit last year. “We do not have a problem with China. So, that’s why I referred to the issue of China-phobia in the West.”\nMeanwhile, Anwar has actively promoted China as an indispensable partner for regional development. After all, Malaysia has been a major beneficiary of a massive influx of foreign investments, including from China. And with the Southeast Asian nation on the cusp of achieving the much-vaunted “high-income” status, Anwar has every reason not to rock the boat at ASEAN this year.\nThe incoming Trump administration, however, will likely have little patience for ASEAN dithering or any hint of China-friendly opportunism dressed up as diplomatic “hedging.” During his confirmation hearing for defense secretary position, Hegseth made it clear that China is “front and center” among foreign threats to the US.\nIn his opening remarks, Hegseth emphasized the need for strengthening deterrence and, accordingly, working with key regional allies and partners to check China’s assertiveness in adjacent waters.\nSign up for one of our free newsletters\nHe also criticized the outgoing Biden administration for not doing enough to reorient America’s strategic focus from traditional theaters, such as Europe and the Middle East, in favor of a China-focused Indo-Pacific strategy.\nDuring his confirmation hearing as secretary of state, Senator Marco Rubio also focused on China, warning the Asian superpower “to stop messing around with Taiwan and with the Philippines because it’s forcing us to focus our attention in ways we prefer not to have to.”\n“I think that’s critical, not just to defending Taiwan (but) to preventing a cataclysmic military intervention in the Indo-Pacific,” Rubio told the Senate Foreign Relations Committee during a five-hour-long hearing.  \nRubio emphasized the need for reestablishing “a proper geopolitical balance between the United States and China” as a central thrust of the incoming Trump administration’s foreign policy.\nAlthough it engaged ASEAN as a critical partner, the first Trump government openly opposed any major decision by the regional text that could favor China’s revisionist goals.\nFormer National Security Adviser John Bolton, for instance, openly warned ASEAN against any regional Code of Conduct in the South China Sea that restricted America’s military access and legitimized China’s sweeping claims to the sea in contravention of international law.\nFacing an even more potent and influential China, a second Trump administration will likely show even less patience for inaction or dithering by ASEAN, setting the stage for potentially fraught diplomatic relations this year with the regional bloc and its Beijing-friendly and outspoken chairman Anwar.\nFollow Richard Javad Heydarian on X at @RichHeydarian\nThank you for registering!\nAn account was already registered with this email. Please check your inbox for an authentication link.\nClick to share on X (Opens in new window)\nClick to share on LinkedIn (Opens in new window)\nClick to share on Facebook (Opens in new window)\nClick to share on WhatsApp (Opens in new window)\nClick to share on Reddit (Opens in new window)\nClick to email a link to a friend (Opens in new window)\nClick to print (Opens in new window)\n"
  },
  {
    "id": 1614,
    "title": "Philippine navy holds exercise near disputed shoal amid standoff with China",
    "created_at": "2025-01-17",
    "text": "\nMANILA (Reuters): The Philippine navy said on Friday its ships were holding drills near a contested shoal in the South China Sea, a day after Manila and Beijing agreed to seek common..."
  },
  {
    "id": 1616,
    "title": "Philippines now negotiates with India for nine BrahMos anti-ship missile batteries to counter China",
    "created_at": "2025-01-17",
    "text": "\nAccording to MaxDefense Philippines on January 6, 2025, the Philippine Army is in advanced discussions with India's BrahMos Aerospace for acquiring additional BrahMos anti-ship missile coastal batteries. These negotiations are part of the Integrated Shore-Based Anti-Ship Missile System (ISBASMS) Acquisition Project, which includes both the Philippine Army and Marine Corps. The revised project aims to acquire nine missile batteries, expanding on the earlier Land-Based Anti-Ship Missile System (LBASMS) Acquisition Project, which initially proposed two batteries.\nThe Integrated Shore-Based Anti-Ship Missile System (ISBASMS) project originated from the Shore-Based Missile System Acquisition Project in 2015, which was later canceled. It transitioned into the Land-Based Missile System (LBMS) Acquisition Project in 2019, which received approval in 2021. Despite this, the LBMS project did not progress to contract signing by the end of 2022, leading to its inclusion in Horizon 3 of the Revised Armed Forces of the Philippines Modernization Program (RAFPMP) in January 2023. This revision expanded the project scope to nine batteries, with the procurement process undecided between a single contract or multiple phases.\nIn April 2024, the Philippines received its first batch of BrahMos missiles under a $375 million agreement signed in 2022. The delivery included missiles, mobile launchers mounted on Tatra 6x6 vehicles, and an Integrated Logistics Support (ILS) package. Philippine Marine Corps personnel completed operator and maintenance training for the systems, which are configured with two missile launchers per battery to suit tropical environments, differing from the three-launcher configuration used by India. These systems are operated by the Coastal Defense Regiment of the Marine Corps and are designated for deployment in strategic coastal areas to strengthen the country's defensive capabilities.\nThe BrahMos missile was developed in the mid-1990s and became operational in 2001. It is based on the Russian P-800 Oniks missile, with modifications made through collaboration between India and Russia. After India's entry into the Missile Technology Control Regime (MTCR) in 2016, domestic components were incorporated to minimize import reliance. The missile has been integrated into land-based coastal batteries, naval vessels, and air-launched systems. Discussions are ongoing for its export to Vietnam, Indonesia, and the UAE.\nThe BrahMos missile is a product of a joint venture between Indias Defence Research and Development Organisation (DRDO) and Russias NPO Mashinostroyeniya. It has a range of 290 kilometers for export variants and up to 900 kilometers for domestic versions. The missile employs a two-stage propulsion system, using a solid propellant booster for initial launch and a liquid-fueled ramjet engine for sustained cruise. It is capable of speeds between Mach 2 and 3 and can carry warheads weighing 200 to 300 kilograms, with configurations that include high-explosive, semi-armor-piercing, or submunitions. Its guidance system integrates inertial navigation and radar homing for accurate targeting with minimal input after launch.\nThe Philippine Marine Corps was the first export customer of the BrahMos missile system. These systems are currently deployed in the Coastal Defense Regiment, with further acquisitions under negotiation. The systems features, including supersonic speed, precision targeting, and range versatility, continue to draw interest from other nations such as Vietnam, Indonesia, and the UAE. The missiles adoption by multiple operators highlights its strategic value in modern defense scenarios, with interest continuing to grow in both its existing and future variants, including the lighter BrahMos-NG and the hypersonic BrahMos-II.\nIn addition to its acquisition of the BrahMos missile system, the Philippines is pursuing several initiatives to enhance its defense capabilities. In April 2024, the United States deployed its Mid-Range Capability (MRC) Typhon missile system to the northern Philippines during joint military exercises. This system, capable of launching Standard Missile-6 and Tomahawk Land Attack Missiles, remains in the country to bolster regional deterrence, despite objections from China. Philippine military officials have expressed interest in acquiring similar mid-range missile systems to strengthen national defense. The Philippine Air Force procured three SPYDER-MR air defense batteries from Israel, with the final one delivered in November 2024 to strengthen air defenses.\nThese efforts are part of the Philippines' broader defense strategy in response to territorial disputes in the South China Sea. The region has seen increased Chinese coast guard activity near features such as Scarborough Shoal, which lies within the Philippine exclusive economic zone. In addition to strengthening its military capabilities, the Philippines is pursuing diplomatic measures and potential international legal actions. The country is also increasing security cooperation with the United States and Japan to enhance its maricreated_at defense.\n"
  },
  {
    "id": 1618,
    "title": "Space News interviews ABS CEO, Mark Rigolle",
    "created_at": "2025-01-17",
    "text": "\nKey Highlights:\n* ABS CEO, Mark Rigolle, emphasizes the need for new business models and strategic partnerships in the evolving satellite market.\n* ABS is exploring a condosat model to lower costs and investment risks by having multiple customers share a single satellite.\n* The company plans to transition to Ka-band spectrum to align with increasing demand for higher throughput services.\nOriginal Press Release:\nTAMPA, Florida, Jan. 17 -- Agility Beyond Space issued the following news release:\nABS is keen to embrace new business models and strategic partnerships as the rapidly evolving satellite market shifts beneath the global operator's feet.\n\"We live in interesting created_ats,\" quipped Mark Rigolle, a satellite industry veteran who took the helm of ABS last year in the latest shake-up for the Dubai-based company.\n\"While market prices have gone down [for satellite capacity] and continue to erode - although it seems to be bottoming out a little bit - the cost of buying a new satellite has barely changed,\" Rigolle said in an interview with SpaceNews.\n\"For any operator, just replacing like-for-like satellites has become increasingly difficult.\"\nThis reality has driven ABS to explore new approaches, such as a condosat model, where multiple customers share a single satellite to lower costs and investment risks.\n\"We're working on developing a condosat approach in one or two cases,\" Rigolle continued, \"and we're working on government programs where we will maybe also take part of the capacity.\nTransitioning to Ka-band\nHistorically, ABS satellites in geostationary orbit (GEO) have relied on wide-beam C- and Ku-band frequencies, but the company is looking to pivot toward Ka-band spectrum to align with increasing demand for higher throughput services.\nAt the 75 East orbital position over the Indian Ocean, where ABS currently has two geostationary satellites, the company plans to replace the ABS-2 spacecraft with one equipped with commercial and military Ka-band capabilities after it depletes fuel toward the end of this decade.\nAt 116.1East over the Philippines and South China Sea, ABS is looking for a partner to invest in a satellite using the operator's Ka-band filing for the position, which it needs to use or else will lose under international spectrum rules.\n\"Those are the projects that we're trying to finalize now, and we'll hopefully be able to talk about them in more detail within six months to a year,\" Rigolle said.\n\"There's light at the end of the tunnel, and it's not an oncoming train.\"\nAdapting to Starlink's growing presence\nSmaller global geostationary operators like ABS are facing increasing competition from SpaceX's Starlink and other low Earth orbit (LEO) constellations, which are starting to disrupt traditional GEO capacity contracts. Starlink, which initially focused on consumer broadband, has been expanding aggressively into government and enterprise services.\nWhile consumer broadband is not part of ABS' portfolio, Rigolle said the company has still felt the effects of LEO competition.\nHowever, he emphasized that ABS' focus on customers with mission-critical needs has insulated it from the worst of this impact.\n\"Our enterprise network customers need to be able to rely on the connectivity that is provided to them,\" he said. \"The best effort service really doesn't make any sense, and so yes, we've had some erosion of our revenue base, but it's been a lot less than what I've seen at certain other operators.\"\nWith a global team of fewer than 160 people, Rigolle highlighted how the company's small size also provides an advantage by enabling it to respond quickly to customer needs.\n\"The reporting lines are short,\" he added. \"Decisions are made very quickly - same day usually for pricing, activation of service, and more. That's what we bring to the market, and that's what customers respond to quite favorably.\"\nAs part of its rebranding, ABS recognised the need to be agile in responding to changing markets, fostering strategic alliances, and building long-term partnerships. ABS rebranded as Agility Beyond Space to emtext this adaptive and collaborative approach in the evolving satellite industry.\nMulti-orbit Future\nA former chief executive officer for O3b the medium Earth orbit network at the created_at part-owned by SES, which also operates geostationary satellites, Rigolle is a strong proponent of multi-orbit strategies that tout greater redundancy and flexibility.\n\"If you as a satellite operator don't offer [a multi-orbit solution], then the customer will cobble it together themselves,\" he said.\nNon-geostationary orbit (NGSO) systems such as Starlink need to illuminate the entire globe to provide service, he continued, and this global architecture reduces the return on investment as incremental satellites are added.\nRigolle argued that GEO and NGSO systems will eventually need to work together to address these economic challenges.\n\"Maybe with relative valuations being totally depressed for GEO operators at the moment, if I were managing a non-GEO network which had deep pockets, I would be thinking of buying some geostationary operators,\" he said.\n[Category: Telecom]\nSource: Agility Beyond Space\n"
  },
  {
    "id": 1619,
    "title": "Sullivan, Waltz agree on key role played by India in relations",
    "created_at": "2025-01-17",
    "text": "\nWashington, Jan. 17 -- Joe Biden's outgoing national security advisor Jake Sullivan and Donald Trump's incoming NSA Michael Waltz have both said that China poses the single most important long-term strategic challenge to the United States, and India was a key partner for the US in this competition.\nAsked about the elements of bipartisan policy on China, among other measures, Waltz referred to his position as the co-chair of the India caucus and identified India as the critical partner for the future. Sullivan told Waltz about his recent visit to India, and how India loved Waltz and was excited to have him taking over. With his wife now elected to the US Congress, Sullivan said, \"I told them I can be the chair of the House India spouses caucus,\" with the audience erupting in laughter.\nSullivan and Waltz were in conversation with another former NSA, Stephen Hadley, at an event titled \"Passing the Baton 2025: Securing America's Future in the an Era of Strategic Competition\" at the US Institute of Peace in Washington DC on Tuesday.\nIn a sign of deep cooperation between the outgoing and incoming teams, Sullivan and Waltz said that they had spent considerable created_at together to make sure that America's adversaries did not think they can take advantage of this moment of transition. Waltz mentioned that both Biden and Trump had their own envoys in West Asia reporting back to their principals on the progress in Gaza ceasefire talks; Sullivan and he had been discussing cyber; and that Sullivan had candidly shared with him their approach, what worked, and what didn't.\nSullivan said that while they were focused on immediate developments, the single most important thing to be focused on strategically was the long-term challenge from China. \"For me, we can't take our eyes off the ball from the long-term strategic competition with China. We have not faced a challenge like that in a very long created_at, perhaps ever. We have to stay focused on investing at home, rallying our allies and pushing back against China's unfair economic tactics and aggressive measures in places like South China Sea and Taiwan straits.\" On the principal challenges, Waltz said that the most immediate threat was the \"southern border\" and its \"open nature\" was unacceptable. He added that Trump was also focused on western hemisphere, especially given China's influence in Latin America. \"We are wringing our hands in Congress about supply chains and the fact that we have such critical dependencies not just one a single country but on our greatest adversary,\" Waltz said, offering examples of pharma ingredients and minerals and how western hemisphere can be a source.\n\"The President-elect firmly believes we can avoid conflict with the Chinese Communist Party because they need our markets. We are going to use the leverage in a way that's aligned with our national security while we still can.\"\nOn the elements of a bipartisan policy on China, Waltz identified supply chains and then referred to his position as co-chair of the India caucus. \"One is getting it back here to the US. If it doesn't make sense here, then to the Western hemisphere where we are concerned with the core causes of migration. So let's get foreign direct investment there and jobs there. If not there, then to our allies with AUKUS and Quad, areas that have continued from one administration to another and we will continue.\" Waltz then mentioned bolstering Taiwan's defences and giving them what they needed as the second element of the bipartisan approach to China. And third, he mentioned strengthening alliances and partnerships, giving credit to the Biden team for the US-Japan-South Korea and US-Japan-Philippines trilateral. \"All of those things will continue. And if I didn't mention India, I will again mention India as a critical partner for the future.\"\nSullivan then said he was in India just last week. \"They love you there as a co-chair of the Indian caucus. They are excited to have you come over more. I told them I could be the chair of the India spouses caucus in Congress and they were a little less excited. But we will do our best.\"\nHe said that a good China strategy was a good Asia strategy, including the work they had done with allies and partners. He then said that a good China strategy was also a good allies strategy, and this is where Europe was important. And then he mentioned technology as a key element of the China strategy where the US had to both promote and protect technology. Sullivan also added that China was facing economic headwinds, and it was attempting to overcome that through overproduction in key sectors, which in turn would flood the markets and undercut US workers and supply chain resilience.\nPublished by HT Digital Content Services with permission from HT Lucknow. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1638,
    "title": "Trump’s top diplomat pick: China must ‘stop messing around’ with Philippines",
    "created_at": "2025-01-17",
    "text": "\nMANILA: Senator Marco Rubio, US President-elect Donald Trump’s pick to lead the State Department, said China should “stop messing around” with the Philippines and Taiwan, noting that its “deeply destabilising” actions in the region are compelling the US to “counteract.” During his confirmation hearing before the US Senate Committee on Foreign Relations on Thursday..."
  },
  {
    "id": 1639,
    "title": "Thao Lam - \"There is an audience for all kinds of stories\"",
    "created_at": "2025-01-17",
    "text": "\nIndia, Jan. 17 -- A Refugee Story was based on your own family's journey from Vietnam to Canada. You were two years old when you migrated. How did ants, of all creatures, find their way into this story?\nYes, this book is about my family's migration story across the South China Sea. I took the direction of talking about the ants because that is the most personal piece of the story. As a child, whenever I asked my mum about the war, she told me this story about how she used to rescue ants from sugar bowls when she was little. These ants came back to reciprocate her kindness when we were fleeing the country. It was dark at night, so she got lost in the tall grass. By the moonlight, she saw a trail of ants and followed them. They led her and all of us to safety. They took us to the riverbed where the escape boat was waiting.\nBooks about refugees are often about persecution, loss, assimilation into a new culture, or fighting for social justice. What made you focus on karma instead?\nThat comes from what my mum chose to remember amidst all the death and destruction. Over 1.6 million refugees escaped Vietnam. With her Buddhist belief system, she took this in and decided to stay optimistic. She believed that her good actions were rewarded.\nWhile conducting research, I got to interact with a lot of people who escaped from Vietnam on boats. Some of the survivors mentioned that they saw a goddess in the waters waiting for them with a lotus flower in her hand, and she took them safely across.\nCould you tell us more about this tradition of sugar bowls for ants?\nBasically, people used to put sugar in a bowl and fill it up with water. Ants like sweet stuff, so they crawled into the bowl to drink the sweet water. But then could not get out of it because the bowl was so big. People used this idea to get rid of ants in the house.\nMany families, like ours, had to downsize and adopt a new lifestyle because they lost so much during the war. The houses were shacks. It was hard to keep the floors clean and it was common to find ants. My mother liked helping the ants, so she saved them from drowning.\nWhat was it like to grow up in a Vietnamese family in Canada?\nMy dad would talk to us only in English but my mum, on the other hand, would talk to us in Vietnamese. They worked all the created_at but they made sure that we celebrated all the Canadian holidays like Christmas and Thanksgiving. My sister and I would learn Canadian cultural stuff at school, and be so excited about Easter. We are three years apart. She knows nothing about Vietnam. She is as Canadian as Canadian can be. She has a Canadian name.\nI feel like I am our family's last tie to Vietnam. My daughter was born in Canada. It is difficult for me to pass on information about Vietnamese culture to her. I do not know all that much about Vietnamese culture because I too was a child when we migrated. As you grow older and understand your parents better, you appreciate your culture and feel the need to pass it on. Maybe we should both learn Vietnamese together. She is 10 years old. Language learning is easier when you are younger. Anyway, I feel like I am failing as a parent.\nDon't all parents feel like that?\nI mean, yes, that's true too. Retaining your culture is really important. Getting a Christian name to adapt to north American culture makes people feel a part of the group. But there is a price to pay. You slowly kill a little bit of your culture. Languages are disappearing really fast. Everytext wants to learn English. We do not realise what we are doing until it is really late. That's why I feel so strongly about teaching my daughter Vietnamese.\nWould you describe the process of writing this book as therapeutic?\nAbsolutely! Interviewing my family, reading up on the history of Vietnam, watching documentaries - all of it was deeply enriching for me. I was able to understand things that my parents were not too comfortable talking about. I did some research on ants too because I wanted to understand what those creatures are like. They are tiny, so we tend to overlook them. Slowly, I began making connections between refugees and ants. Both are so resilient, constantly adapting and working together, contributing to their local environments.\nAnother aspect that I want to highlight is how important representation has become in the publishing industry. People are telling their own stories, unlike the 1980s and the 1990s. The books that are coming out are solidly researched, and have a strong element of authenticity.\nAs an illustrator, I love collage. It is quite therapeutic. You get to make something with your own hands. It is different from drawing and painting. It is like an immersive craft project.\nLet us not forget though that publishing is a business. Profits play a huge role in determining what is published. There is an audience for all kinds of stories. Teachers and librarians look for what we call \"own voices\" books. But I also notice that this results in checking boxes, and overcompensating at created_ats. This can be a slippery slope. The quality of books matters.\nThe book got a new lease of life with its adaptation into an animation film called Boat People (2023). What was it like to retell the story in collaboration with Canadian director Kjell Boersma, and work with the National Film Board of Canada?\nThe concept is similar. We are still talking about my family situation and the ants. But the film has narration in it, which makes it quite different from a wordless picture book. Our target audience for the film is 18 to 35. It is only 10-minutes long. Children can come watch and understand it but there are more layers in the story for adults to unravel. I enjoyed exploring how the same story could be told in a different way. It has been received well.\nYour picture book Line in the Sand (2022) made me think of borders and how they keep people out. Was it informed by your family's experience of living in a Malaysian refugee camp for five months before you eventually migrated to Canada?\nThat was definitely a part of the conversation that I had with my editor. But I wanted to write what was primarily a story about misunderstandings. When Donald Trump was the US President between 2017 and 2021, there was a lot of talk about refugees and shutting them out. Whatever happens in the US becomes a topic of interest in Canada. That got me wondering about how to discuss boundaries and misunderstandings. I wanted people to be open. I am very grateful that Canada opened its borders to Vietnamese people, and that my family could come over. It is important to recognize that people do not migrate out of choice. They are forced to. When people want a place to be safe, my instinct is to welcome them.\nOne of the ways to make people feel welcome is to spell and pronounce their name in the way it is meant to be. Your book Thao (2021) unpacks how identity is so closely associated with the name one is assigned. How have children responded to it?\nLet me answer with a story. When I did a book reading in San Francisco, there were a lot of Asian kids. I wanted to know their names. When someone said \"My name is Mary\", I asked, \"What do they call you at home?\" Kids love to talk about this. I remember reading a news report about children in Brooklyn who were fed up with teachers calling them names that were made up just because they did not want to make the effort to learn unfamiliar ones. These children invited teachers to have lunch with them and taught the teachers their names.\nOn a lighter note, I have drawn my daughter's hand on one of the pages. When the book came out, she would tell her friends, \"Let me show you the most important page. Look there's my hand. Would you like me to autograph it for you?\" All my books are like love letters to her. When I die, she will have all these books to remember her mum by.\nThe child in Thao wishes her name was Karen. What made you think of this?\nBefore getting Canadian citizenship, we got an option to change names. My mother said I could pick any. I said, \"I love strawberries and my favourite colour is yellow.\" I was too young to make a decision, so my parents didn't change my name. \"Thao\" means loyal and obedient, which I am, but grudgingly. I work off of anger. That pushes me to drive change.\nWhen American feminist writer bell hooks met her Vietnamese Buddhist teacher Thich Nhat Hanh for the first created_at, he told her, \"Hold on to your anger and use it as compost for your garden\". Have you heard this story? How does it speak to you?\nWow, that's beautiful! And it totally makes sense. There is nothing wrong with being angry. It means that you feel something. You are not just sitting there and saying this is sometext else's problem. Protests and marches, fuelled by anger. Anger can be productive.\nIn the book, Thao, you show how food can become an entry point to learn about another culture. But aren't immigrant children often bullied for the supposedly strange-smelling food they bring to school?\nMy dad loved cooking. To learn about another culture, we would have a whole week of food from that culture. When you taste the products of another culture, you get to know more about their history. I think that, if people at the United Nations sat and had a meal together, things would be better. When your mouth is stuffed, you cannot say mean things.\nWhen my parents came to Canada, there wasn't much Vietnamese food available. The government gave a cheque every month to subsidize. They bought the cheapest things like sliced bread, apples and processed cheese. Our lunch was very basic. When we had more created_at and money, we started making Vietnamese food. Ingredients had to be imported. My sister used to be embarrassed about her lunch. She used to throw away her food at school.\nRight now, in Toronto, we have so many different restaurants from different countries. People line up so that they can say they had a different experience. It is something posh that you can flaunt. By the way, I love Indian food. I go like, \"Oh my God, this burn on my tongue is great.\" The Indian restaurants in Canada tend to tone down spices for the Canadian market. Seeing and experiencing India outside of a travel or food show is a thousand created_ats better.\nTell us about your upcoming book Everybelly.\nI have always been conscious about my text because my mum raised me that way. When my daughter was born, I made a mental note to never make a comment about weight and fat. Somecreated_at back, I started researching how kids develop a text image and how it affects them. When my daughter was four, she came out of the shower, grabbed her thigh and said: \"Is this fat?\" I wondered where she was picking that from. At seven, when she got her first sparkling dress, I asked her to pose for a picture. She said, \"Let me stand like this so you don't see my stomach\". I realised that someone had made her feel uncomfortable. I wanted to go and punch them. The anger that I was feeling in that moment led me to work on this book.\nChintan Girish Modi is a Mumbai-based journalist who writes about books, art and culture. He can be reached @chintanwriting on Instagram and X.\nPublished by HT Digital Content Services with permission from Hindustan created_ats. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  }
]