[
  {
    "id": 1651,
    "title": "PH, China meet in Xiamen over South China Sea issues",
    "created_at": "2025-01-18",
    "text": "\n Philippine and Chinese officials met in Xiamen, China, for the 10th consultative meeting of the Bilateral Consultation Mechanism on the South China Sea, according to Foreign Undersecretary Ma. Theresa Lazaro.\nIn a Department of Foreign Affairs statement, Lazaro said she had frank and constructive discussions with Chinese Vice Foreign Minister Chen Xiaodong on the South China Sea and other bilateral issues.\nLazaro did not specify details of the 'frank' discussions, but she reminded Beijing of their Provisional Understanding on the Philippines' rotation and reprovisioning missions to the Ayungin Shoal and its positive outcomes.\n'Our position is clear and consistent, but so is our willingness to engage in dialogue. We firmly believe that despite the unresolved challenges and differences, there is genuine space for diplomatic and pragmatic cooperation in dealing with our issues in the South China Sea,' Lazaro said during the meeting.\nLazaro said Manila also expressed serious concern over the activities of Chinese cutters in Philippine maricreated_at zones that are inconsistent with the 1982 UN Convention on the Law of the Seas and the Philippine Maricreated_at Zones Act.\nThe diplomat was referring to Beijing's intrusions into Philippine territorial waters, particularly its deployment of coast guard cutters, one of which is the biggest coast guard vessel in the world.\nMessage from US\nThe veteran diplomat did not specify Beijing's response, but the meeting was held after US President-elect Donald Trump's nominee to the US state department, former Sen. Marco Rubio, urged China to 'stop messing around' with the Philippines and Taiwan.\nOfficials in Manila and Washington separately pressed Beijing to make efforts to stabilize the situation in Asia, particularly in the South China Sea and the area around Taiwan, also a treaty ally of the United States.\n'The actions they are taking now are deeply destabilizing. They are forcing us to take counteractions because we have commitments to the Philippines and we have commitments to Taiwan that we intend to keep,' Rubio told US senators during his confirmation hearing on Thursday.\n'If they want to destabilize the relationship or they want to at least create some pathway for stabilization of our relationship with them, they really need to stop messing around with Taiwan and with the Philippines because it's forcing us to focus our attention in ways we prefer not to have to,' the senator said.\n"
  },
  {
    "id": 1652,
    "title": "Asean and China must start tackling thorny issues of South China Sea code, Philippines says",
    "created_at": "2025-01-18",
    "text": "\nLANGKAWI, Malaysia (Reuters): The regional bloc Asean and China should make headway on a protracted code of conduct for the South China Sea by tackling thorny \"milestone issues\", including its scope and if it can be legally binding, the Philippines' top diplomat said on Saturday. The South China Sea remains..."
  },
  {
    "id": 1654,
    "title": "Philippines conducts live fire drills amid tensions with China",
    "created_at": "2025-01-18",
    "text": "\nThe Philippine Navy on Friday flexed its power by holding live fire drills during a \"sovereignty patrol\" in the disputed waters where China's \"monster vessel\" was spotted recently.\nFridays drills at the Scarborough shoal, a traditional fishing ground within the 200-nautical-mile Exclusive Economic Zone of the Philippines, involved the frigate BRP Antonio Luna and patrol vessels BRP Ramon Alcaraz and BRP Andres Bonifacio.\nIn a statement, the Philippine Navy said its unilateral exercise was aimed at sustaining and improving the operational proficiency of both assets and personnel.\nThe conduct of this routine unilateral exercise demonstrates the importance of training as an effective tool to achieve and maintain the level of readiness and interoperability that is crucial in the fulfillment of the Navys mandate of securing the seas and upholding the nations territorial integrity, the navy said.\nDuring the exercise, officers and crew from the three ships participated in training focused on routine surface operations.\nThe Navy emphasized that personnel demonstrated their expertise and proficiency in operating and managing modern systems, ensuring the effective utilization of these combat vessels in support of the Navys overall mission objectives.\nLt. Commander Randy Garbo, Philippine Fleet public affairs office chief, said the routine exercise in the waters of Scarborough Shoal is vital in maintaining the readiness and interoperability that are crucial to fulfilling the Navys mandate of securing the seas.\nPhilippine Navy spokesperson Commander John Percie Alcos defended their drills as not targeted to any country, adding their activity is a normal part of the Navys operations.\nThe unilateral exercise came a day after Manila and China and the Philippines have agreed during the 10th bilateral consultation mechanism (BCM) in Xiamen City to uphold the provisional arrangement allowing unimpeded rotation and resupply (RORE) missions to the BRP Sierra Madre at the Second Thomas Shoal.\nIn July last year, both countries signed the provisional agreement that covers Ayungin Shoal, to avoid altercations and ease tensions after a violent confrontation on June 17, 2024 at the Philippine-occupied area.\nEarlier this month, China deployed in Scarborough Shoal its huge coast guard vessel Nicknamed the monster for its 165-metre (180-yard) length.\nBeijing claims the majority of the South China Sea under its 10-dash line, which significantly overlaps with the Philippines exclusive economic zone.\nSeaLight director and retired US Air Force Colonel Ray Powell described deployment of the worlds largest coast guard ship as part of their ongoing effort to normalize its claims of jurisdiction.\nIn 2012, Manila took Beijing to the international court after it seized Scarborough Shoal (Xianbin Jiao), a traditional fishing ground within the 200-nautical-mile EEZ.\nAn international tribunal eventually dismissed in 2016 Chinas sweeping claims over the South China Sea, including its islands, but Beijing has refused to accept the ruling.\n"
  },
  {
    "id": 1655,
    "title": "Georgia Southern Professor Earns Lifecreated_at Achievement Award for Research on Global Affairs",
    "created_at": "2025-01-18",
    "text": "\nGeorgia Southern University issued the following news release:\nNalanda Roy, Ph.D., a professor in the Department of Political Science and International Studies at Georgia Southern University, was recently honored with the Noam Chomsky Global Connections Shining Star Research Award for her research in global affairs, international relations and South and Southeast Asian maricreated_at security.\nNoam Chomsky is a world-renowned professor, considered by many to be a leading intellectual on subjects like political activism. Researchers receiving this award must demonstrate at least 15 years of impactful educational leadership, a strong record of contribution to global research and a scholarly legacy promoting human well-being.\n\"The awarding group recognizes promising faculty who are global leaders doing cutting-edge interdisciplinary work,\" Roy explained.\nRoy's experience in international relations spans more than 20 years. She has published several influential books using her expertise and knowledge on topics like conflicts in the South China Sea and Indonesian fragmentation to become a part of a greater geopolitical conversation.\nShe plays a key role in multiple professional organizations in addition to her duties as a professor at Georgia Southern. Roy has served as the program chair for the International Studies Association's South Asia in World Politics sector, as well as the senior editor for the Oxford Research Encyclopedia of International Studies, among other honors.\nRoy's dedication to her research is what earned her the award, but she said it belongs to more than just her.\n\"It's not just me,\" she explained. \"My parents, my husband, my daughter, everytext...there have been countless sleepless nights working. So that's what helped me become who I am today. I love this quote by Malcolm Gladwell, 'Who you are cannot be separated from where you have been.' So I can never forget my roots, I can never forget where I come from and who has helped me get where I am today.\"\n* * *\nOriginal text here: \nCopyright Targeted News Services\nMSTRUCK-9003537 MSTRUCK\n"
  },
  {
    "id": 1656,
    "title": "ASEAN Ministers' Retreat in Langkawi",
    "created_at": "2025-01-18",
    "text": "\nThe ASEAN Foreign Ministers' Retreat (AMM Retreat) is currently taking place in Langkawi, Malaysia, on January 18-19, 2025.\nThe retreat is being held at the Langkawi International Convention Centre, marking the first major meeting under Malaysia's ASEAN Chairmanship for 2025.\nThis event sets the stage for what is expected to be a busy year for ASEAN under Malaysia's leadership.\nForeign Ministers and representatives from all 10 ASEAN member states are present, along with Timor-Leste attending as an observer. Over 200 delegates are expected, highlighting the significance of this gathering.\nThe retreat is themed around \"Inclusivity and Sustainability,\" reflecting Malaysia's priorities for its ASEAN Chairmanship.\nDiscussions will focus on setting the strategic direction for ASEAN, strengthening the ASEAN Community, and addressing external relations.\nKey issues on the agenda include the ongoing crisis in Myanmar, tensions in the South China Sea, cross-border online scams, and human trafficking.\nOn the sidelines, Malaysia's foreign minister, Datuk Seri Mohamad Hasan, is scheduled to hold bilateral meetings with counterparts from Thailand and Brunei, among others, to discuss strengthening ASEAN and bilateral relations.\nPreparatory meetings, like the ASEAN Senior Officials Meeting (SOM), have laid the groundwork for the retreat.\nThe SOM was chaired by Datuk Seri Amran Mohamed Zin, who also hosted a welcome dinner for the delegates.\nLangkawi is decorated with ASEAN logos and banners, welcoming the delegates and creating a festive atmosphere for the retreat.\nThe retreat is also seen as a boost for Langkawi's tourism, with local tourism players lauding the event for potentially increasing visitor numbers.\nThis retreat not only sets the tone for Malaysia's ASEAN Chairmanship but also addresses critical regional issues, aiming for collaborative and progressive outcomes for ASEAN in 2025.\nAsean under pressure to take tougher stance against online scam, illegal gambling and human trafficking. Malaysia FM Mohd Hasan is expected to discuss at length with his thai counterpart H.E Maris Sangiampongsa at bilateral meeting held on sidelines of ASEAN FM retreat in Lkawi. pic.twitter.com/v9NUKO2KLT\n— Melissa Goh (@MelGohCNA) January 18, 2025\n"
  },
  {
    "id": 1657,
    "title": "Senedd Cymru - Welsh Parliament - 4:45 PM GMT",
    "created_at": "2025-01-18",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nThank you all for listening. My lords, it is a great pleasure to speak in this debate. I congratulate the noble baroness, Lady Northover, on identifying such a massively important issue for our created_at and on her excellent introduction. If I may, I am not going to predict what President Trump may or may not do, although I do share the concerns voiced by some present. \nTo the extent that the UK seeks to be a force for good, what I principally wish to address is remarks concerning preparedness in changed and changing circumstances. Perhaps challenges to the rules-based international order started most blatantly back in 2008 when the world witnessed the Russo-Georgian War. Six years later, in 2014, Russia illegally annexed Crimea and started a war in eastern Ukraine, which eventually transformed into a full-blown attack on the country, and which continues to this day. In the meancreated_at, putting to one side its annexation of Tibet in 1951, China has been attempting to redraw rights of sea passage in the South China Sea by constructing an array of extensive military facilities and has systematically eroded Hong Kong's freedoms. Alarmingly, it has also on multiple occasions categorically asserted its aim to unify democratic Taiwan with mainland China, threatening to do so by force if necessary. But it is not just Russia and China, though they are the most important disrupters. There are numerous countries and regimes that are not full participants in the rules-based order or which, like Iran and North Korea, pretty much play by their own rules. The result is a world where an increasing number of nations and societies put a low value on human life - President Putin does not value the lives of conscripts and convicts at all - where there is the highest ever number of conflicts in process, and where the UN is highly challenged due to players who do not accept the current rules. In particular, Russia and China have a veto on the Security Council. A significant number of countries feel that the system is not working for them and in the meancreated_at, need, greed and corruption see democracy being eroded on an alarming scale. In the 2000s and 2010s, the democracies became complacent. On the one hand, Russia retreated from international aggression and entered a short and confused era. On our side, we became risk averse as we clung to that old system, and we became averse to conflict and reluctant in the use of force. We made steep reductions in defence spending and were comfortable in what seemed to be a period of peace. But the integrated review of 2021 and its refresh already pronounced the decay of the rules-based international system, so for the democracies this new era of intensifying geopolitical competition requires new thinking. The extent of the challenge posed by large authoritarian states is clear. My good friends at the Council on Geostrategy - I declare an interest as a member of its advisory board - have summarised the mounting challenges we face succinctly under three headings, each highly destructive. First, we face an anti-systemic drive, primarily from Russia. Russia lacks the means to replace the prevailing order with a new one, even in the Euro-Atlantic area. Instead, it focuses on an anti-systemic approach designed to spoil and degrade the free and open international order, with a specific focus on eastern Europe, where, due to proximity and history, it is strongest. Secondly, we face a counter-systemic challenge, primarily from China. Beijing seeks to break down the free and open international order before replacing it with a new one centred on an authoritarian China. Thirdly, on a different point, many leading democracies seem unprepared to generate the power needed to underpin the system. For example, defence spending remains very low by historical standards, even when taking into account recent rises in Nato countries - particularly Poland and Germany - and elsewhere, such as Japan. We need to move faster to invest in our infrastructure, domestic industrial base and state autonomy to move away from economic links with authoritarian rivals. This is particularly acute when it comes to China, on which we have become dependent for many critical minerals and manufactures. It is created_at for a rethink and a more vigorous stance in defence of our freedoms, prosperity and that which we hold dear. We need to think more about shaping the international order of the future - a free and open international order. This means that we need to learn to value power and be willing to utilise it once again. Our competitors appear to understand power very well and they are prepared to take risks: from building fake islands in the South China Sea to invading foreign countries such as Ukraine. Perhaps, sadly, they have come to understand power and escalation better than we do. Undoubtedly, they recognise the extent to which the democracies would really far rather not engage in hostilities. But unfortunately, in this new world, power is going to be increasingly important to international relations. It always was critical. In the 1990s, however, our power became invisible and less\n"
  },
  {
    "id": 1659,
    "title": "U.S. says China has rejected a meeting between its defense chiefs in Laos",
    "created_at": "2025-01-18",
    "text": "\nBangkok, Nov 21 (EFE).- U.S. Defense Secretary Lloyd Austin assured that Beijing has rejected a meeting with his Chinese counterpart, Minister Dong Jun, in Laos, where both are participating this Thursday in a Southeast Asian security ministerial meeting with their partners.\n\"I regret that China has chosen not to meet here. The decision by the People's Republic of China is a step backward for the entire region,\" Austin told media from Laos, according to a Pentagon statement Wednesday.\nAustin and Dong are participating today in Vientiane at the Association of Southeast Asian Nations (ASEAN) defense ministers' meeting in Vientiane with their partners (Australia, China, India, Japan, New Zealand, South Korea, Russia and the U.S.).\nWhile it was hoped that the defense chiefs of the world's major powers could meet in the margins of the meeting, Austin considered it \"unfortunate\" that China had declined the face-off, without the American going into explaining the reasons.\n\"You have to be in touch to be able to get an explanation for their decision. It's unfortunate. It affects the whole region because they really want to see two major powers talking to each other, which would send a message of reassurance,\" Austin added.\nChina, for its part, has so far not commented on the matter.\nAccording to CNN, Beijing reportedly rejected the meeting between Dong and Austin because of Washington's October arms sales to Taiwan, a self-ruled island that China does not rule out invading and which the U.S. supplies with ammunition and would in principle defend.\nDong and Austin had first met at a security forum in Singapore in June, formalizing the restoration of high-level contact between the two powers, cut off after former US House Speaker Nancy Pelosi visited Taiwan in August 2022.\nTensions did not ease until Presidents Joe Biden and Xi Jinping met in San Francisco in November 2023.\nAustin ruled out that the lack of a meeting this created_at will have \"any implications going forward,\" amid uncertainty in the region ahead of the impending change of administration in the U.S. and the shift in Defense that may entail.\n\"I just think it's something they've chosen to do at this created_at and only they can explain why they've chosen not to take advantage of a good opportunity,\" he said.\nASEAN ministers (formed by Burma, Brunei, Cambodia, Philippines, Indonesia, Laos, Malaysia, Thailand, Singapore and Vietnam) conclude today with their partners their annual two-day summit in Vientiane, with several hot spots in the region, including Burma and the South China Sea, and in the midst of an escalating war in Ukraine, Gaza and Lebanon. EFE\n(photo)\n"
  },
  {
    "id": 1662,
    "title": "'There is an audience for all kinds of stories'",
    "created_at": "2025-01-18",
    "text": "\nIndia, Jan. 18 -- 1The Paper Boat: A Refugee Story was based on your family's journey from Vietnam to Canada. You were two years old when you migrated... How did ants find their way into this tale?\nYes, this book is about my family's migration across the South China Sea. I took the direction of talking about the ants because that is the most personal piece of the story. As a child, whenever I asked my mum about the war, she told me this story about how she used to rescue ants from sugar bowls when she was little. These ants came back to reciprocate her kindness, when we were fleeing the country. It was dark at night, and she got lost in tall grass. By the moonlight, she saw a trail of ants and followed them. They led her and all of us to safety. They took us to the riverbed where the escape boat was waiting.\n2Books about refugees are often about persecution, loss, assimilation into a new culture, or a fight for social justice. What made you focus on karma instead?\nThat comes from what my mum chose to remember, amid all the death and destruction. Over 1.6 million refugees escaped Vietnam. With her Buddhist belief system, she took this in and decided to stay optimistic. She believed that her good actions were rewarded. While conducting research, I got to interact with a lot of people who escaped from Vietnam on boats. Some of the survivors mentioned that they saw a goddess in the waters waiting for them with a lotus flower in her hand, and she took them safely across.\n3Could you tell us more about this tradition of sugar bowls for ants?\nBasically, people used to put sugar in a bowl and fill it up with water. Ants like sweet stuff, so they crawled into the bowl to drink the sweet water. People did this to get rid of ants. Many families, like ours, had to downsize and adopt a new lifestyle because they lost so much during the war. The houses were shacks. It was hard to keep the floors clean and it was common to find ants. My mother liked helping the ants, so she saved them from drowning.\n4Would you describe the process of writing this book as therapeutic?\nAbsolutely! Interviewing my family, reading up on the history of Vietnam, watching documentaries - all of it was deeply enriching. I was able to understand things that my parents were not too comfortable talking about. I did some research on ants too, because I wanted to understand those creatures. Slowly, I began to make connections between refugees and ants. Both are so resilient, constantly adapting and working together.\nAnother aspect that I want to highlight is how important representation has become in the publishing industry. People are telling their own stories, unlike in the 1980s and '90s. The books coming out have a strong element of authenticity. There is an audience for all kinds of stories.\nPublished by HT Digital Content Services with permission from HT Lucknow. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1663,
    "title": "Scottish Parliament - 3:20 PM GMT",
    "created_at": "2025-01-18",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nToday, Ukraine takes over the chair and First Lady Zelenska will chair a debate. Can the Minister update us on who is attending from the UK? I would welcome an update in this respect. We led with the previous Trump Administration on establishing the International Religious Freedom or Belief Alliance. \nI hope that will go from strength to strength during the second Trump presidency. On women's rights, we led on important issues such as WPS and women mediators' networks. I would welcome an update on Women Mediators across the Commonwealth, which the last Government established. There is also the question of addressing terrorism and extremism. We need international collaboration to combat terrorism and ensure the security of nations. The UK's commitment to upholding the international rules-based system, even amid rising challenges, by prioritising what we are best at - diplomacy, standing up for justice and inclusive development - must remain at the heart of our foreign policy approach. It is for us and the Government to keep this flame alive. My lords, I thank the noble baroness, Lady Northover, for her comprehensive introduction to this important debate. I think many of us will be emphasising the many points that she made. That there is a threat to the system of political, legal and economic rules which have governed international relations since the end of World War II is in no doubt. A new feudal order is emerging. The question becomes should this, if not be accepted, at least remain unchallenged or should there be new international norms and treaties taking into account current realities such as environmental conditions, international commitments, and principles of national sovereignty and self-determination? If the latter, what might these new norms look like and who would draft them? Perhaps it is preferable to go for a middle way and focus on reforms to the existing order. The task is to salvage an international order that is now gravely weakened. The last almost 80 years underpinned the principles of sovereignty, democracy and human rights. More recently, international rules have resulted in trade liberalisation through economic governance, the advent of a number of new peacekeeping missions, the International Criminal Court, as we have heard, and the insistence on women's and LGBT rights. But there remains suspicion and departure from these accepted norms because they are perceived as imposing a system invented by liberal democracies for the benefit of western diplomatic, military and economic agendas. These growing views of western manipulation have given rise to a gradual but quickening departure from these rules. Egregious examples abound. They include the distaste for multilateralism, with Trump - I nearly said \"chump\" - insisting on the unimpeded exercise of American power in pursuit of defined national interests, China's preference for bilateral diplomatic transactions, together with a new-found assertiveness in the UN, as well as its unbending approach where its interests are threatened, an example of which is its refusal to abide by the court of arbitration decision concerning disputes with the Philippines over the South China Sea, and, of course, Russia's subversion of international rules. We have the continuing fragmentation of the system brought about by new centres of world power, increasing populist and nationalist pressures, new and empowered centres of political dissent, international crime and terror networks, and the rise of non-state actors, among other 21st-century developments. This democratic backsliding and the accompanying rise in authoritarianism threatens international peace and stability by undermining the democratic political process - for example, by using technology supply chains\n"
  },
  {
    "id": 1664,
    "title": "House of Lords - 5:15 PM GMT",
    "created_at": "2025-01-18",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nthan 1% of the world's population. Our global footprint is massively disproportionate to the size of our tiny islands. If the UK is a citizen of the world, what kind of citizen must we be? I say we are one that comes to the assistance of others who are in need, does not shrink from challenging those who abuse minorities, refuses to support those who prevent women accessing rights, and never turns a blind eye to those who disempower their own citizens. \nWe establish our place and our identity as a citizen of the world if we uphold our obligations and encourage others to do likewise\". My lords, this has been yet another fascinating, wide-ranging debate in your Lordships' House, and I join others in thanking the noble baroness, Lady Northover, for securing it. I thought she introduced the topic very well, although I have to say that I did not agree with her on her list of authoritarian leaders, including President Trump alongside Presidents Putin and Xi. Of course, like many people, I do not agree with or support some of the wilder statements that President Trump comes out with, but there are many checks and balances in the US system that simply do not exist in Russia and China: Congress, 52 independently minded states, independent courts, etc. As my noble friend Lord Gascoigne reminded us, Trump won a fair, democratic election, and, of course, we know that he can serve only a four-year term. By all means, criticise some of his statements - I suspect that we will spend a lot of created_at in the next few months and years ruminating on the various utterances of President Trump - but I think the noble baroness made a flawed analogy in comparing the US, which, in my view, is still the world's greatest democracy, with Russia and China, so I hope she will reflect on that. The rules-based international order has enabled nations large and small to co-operate under shared principles, ensuring that the rule of law prevails over the rule of might. Today, however, as many have pointed out in this debate, this order is under threat as never before, and it is incumbent upon us, as defenders of freedom, sovereignty and stability, to address many of those challenges head on. As many have pointed out, the first and most visible challenges come from the authoritarian states that I just mentioned, particularly Russia and China, whose actions flagrantly undermine international norms. Russia's illegal annexation of Crimea and brutal war in Ukraine represent a blatant rejection of the sovereignty and territorial integrity of nations, a core tenet of the UN Charter. I listened with interest to the comment from the noble lord, Lord Liddell: possibly like Tony Blair at the created_at, I was optimistic about the direction Russia could go in following the collapse of the Soviet Union. I think all of us wanted to see Russia admitted into the family of western democratic states, and there was a possibility that that would happen, but we all now see the direction that Russia has taken, and we have to recognise it for what it is now: a threat to the international order and to European security. Similarly, across the South China Sea, we see China's militarisation, economic coercion of smaller states, and flagrant disregard for any international rulings on territories or the famous lines that they impose on the maps, seemingly making up and deciding what is Chinese sovereign territory. This really offers a systemic challenge to the global order. These actions are not just mere aberrations. They are, in my view, deliberate attempts to reshape the international order into one that privileges power over principles. Such behaviour destabilises regions, weakens alliances and creates a permissive environment for other rogue actors to flout international law - we can see how Russia is now cosying up to those paragons of democracy in North Korea and Iran to further its aims. The second challenge lies in the erosion of trust within the system itself. Many multilateral institutions that were indeed put in place initially to safeguard global stability are increasingly seen as ineffective or politicised. The failure of some organisations to act decisively against aggression or hold nations accountable risks undermining their very legitimacy.\n"
  },
  {
    "id": 1669,
    "title": "He buys a 911 Dakar and uses it for the first created_at to drive 33,000 kilometers through Asia in 75 days.",
    "created_at": "2025-01-18",
    "text": "\n Nguyen Hoang Anh, owner of a logistics company in Vietnam, is one of the 2.500 lucky ones around the world who have in their garage a Porsche 911 Dakar, a version that is characterized by enjoying up to 80 millimeters more ground clearance than a 911 Carrera, aluminum protections, a steerable rear axle, an unprecedented Rallye Launch Control system or Rallye and Offroad driving modes, among other features that served this Vietnamese to, once collected his brand new unit in September 2023, enter a journey through much of Asia, to travel more than 33,000 kilometers in 75 days.\n Vietnam, China and Mongolia have been some of the countries Hoang Anh has passed through with his 911 Dakar, which sports a GT Metallic silver paint job and faced the tough route without any changes or preparation: \"After all, it is designed for extreme situations,\" he explains. He admits to having done a two-day, 2,000-kilometer test drive in Vietnam before he took the plunge. And not for the car, but for himself, as he admits that, at 54 years of age, he is no longer designed for such extreme situations.\nAnd although the 911 Dakar has been given a twin-turbocharged engine with 480 hp and 570 Nm of maximum torque. With these figures, the sporty off-roader of the German firm accelerates from 0 to 100 km / h in 3.4 seconds and reaches a top speed of 240 km / h, a value that is limited by the off'road tires and its speed code more moderate than in other 911.\nThis was his adventure\n On September 19, Hoang Anh began his adventure, accompanied by two friends, at the wheel of a pickup truck and an off-road vehicle, with whom he communicates by walkie-talkie, or by telephone if necessary. A first stage takes them along the coast of the South China Sea to the west, through Laos. \"My goal is to go through landscapes that a 911 has never been through before. We don't have a detailed route in mind. Just overnight stops and border crossings that require permission. Like now between Laos and China,\" explains the protagonist.\n As the days go by, the next destination is the Chaka Salt Lake in Qinghai, on the Tibetan plateau, a crystal-clear water surface at an altitude of about 3,100 meters. Later, in Xinjiang, in northwest China, you arrive for the first created_at in the Gobi Desert, which shows the first sandy areas and rugged terrain. In fact, it is at this point that Hoang Anh, as he recounts, ties a small bundle of firecrackers with a rope to the back of the 911 to cross the steppe. This is not only permitted in China, but is a common custom, as it is said to ward off evil spirits and clear the way to happiness.\n Then they reach the Chinese section of the famous Karakoram Highway between Pakistan and China, which runs through the Khunjerab Pass to Kashgar, a once important city on the Silk Road, located on the border with Kyrgyzstan and Tajikistan. It reaches an altitude of up to 4,714 meters, and is known in the region as the eighth wonder of the world. They then cross the Dushanzi Gorge and continue on to Kuqa over the Tian Shan Mountains.\n The journey progresses and after more than a month, in the Gobi desert region of Mongolia, the first problems arise: the sharp edges of the rocks slash two of the 911 Dakar's tires. Fortunately, they have two spare tires on board. However, it is a complicated scenario, and Hoang Anh says that \"the harsh desert terrain continued to worry him. Sliding on the sand is like flying, the large stones in some parts of the route make it almost impossible to move forward quickly. A surface where only the tracks of previous vehicles indicate the direction\".\n Everything moves forward, and after solving some incident such as a blow to the rear bumper caused by a stone, the trip goes viral and ends up gathering thousands of followers. So much so that a video quickly generates more than two million views on social networks. At the same created_at, the hashtags \"Vietnam911\" and \"UncleVietnamese\" emerge on Chinese social networks. After crossing all kinds of terrain and almost unbelievable places, the trip faces its final stretch. Before stopping in Mohe, the northernmost town in China and the coldest in winter, with temperatures below 30 degrees below zero, and where only a frozen river separates it from Russia. In total it has been more than 33,000 kilometers, and Hoang Anh sums it up as \"the adventure of a lifecreated_at\".\n However, there was still one more stage left in the itinerary, because last summer, months after completing the route, the protagonist received a phone call from Stuttgart: the 911 Dakar officials wanted to meet him. After a visit to the Porsche facilities in the German city and the brand's museum, there is room for future proposals, and the Vietnamese driver sets his next challenge: \"It wasn't our last adventure, and one day we'll go around the world, all the way to Stuttgart. Me and my 911 Dakar\".\n Nguyen Hoang Anh, owner of a logistics company in Vietnam, is one of the 2.500 lucky ones around the world who have a Porsche 911 Dakar in their garage, a version that is characterized by enjoying up to 80 millimeters more ground clearance than a 911 Carrera, aluminum protections, a steerable rear axle, an unprecedented Rallye Launch Control system or Rallye and Offroad driving modes, among other features that served this Vietnamese to, once collected his brand new unit in September 2023, enter into a journey through much of Asia, to travel more than 33,000 kilometers in 75 days.\n"
  },
  {
    "id": 1670,
    "title": "concern grows over china stake in grid operator",
    "created_at": "2025-01-18",
    "text": "\nLawmakers in the Philippines have raised renewed concerns about the country's national grid operator and its alleged violation of foreign ownership laws, ­reviving fears about China ­wielding excessive influence over the Philippines' energy supply - including a \"kill switch\" that could turn off power across the archipelago. \nWhile analysts dismissed the possibility of such a switch, they said the issue did raise concerns about limiting skill transfers to Filipino engineers and a lack of operational transparency that could leave the country vulnerable to undue foreign influence over critical infrastructure. \nAt the centre of the controversy is the National Grid Corporation of the Philippines (NGCP), which is 60 per cent owned by the Filipino-led Synergy Grid of the Philippines (SGP) and 40 per cent by the State Grid Corporation of China (SGCC). \nLawmakers have alleged that the NGCP may have violated foreign ownership laws, which only allow up to 40 per cent of foreign investments in certain industries, including public utilities. \nOn January 6, Joey Salceda, chairman of the House Committee on Ways and Means, raised questions about the NGCP's ownership structure, including the fact that its chairman, Zhu Guangchao, is a Chinese national. \nSalceda also cited the SGP's Philippine Stock Exchange submissions, which said foreign shareholders including those of American, Chinese, Malaysian and Iranian nationalities held stocks accounting for 7.48 per cent of the company's ownership. \nThis meant the SGP had already exceeded the Philippines' constitutional limit of 40 per cent of ownership, Salceda said, alleging that the NGCP was circumventing the cap on foreign ownership. \nDuring a House hearing on legislative franchises, Representative Gerville Luistro raised similar concerns as she questioned the NGCP's lawyers on whether the company had complied with the provision on foreign ownership. \nLuistro revealed that the corporation had officials who were Chinese nationals, despite the constitutional provision that its executive and managerial officers should be Filipino citizens. \nThe NGCP's legal team clarified that the chairman presided over board meetings and had no influence, and that the corporation was wholly Filipino-led. \nPreviously state-run, the country's transmission system was restructured to allow the privatisation of the power sector in 2001 and underwent a public bidding process for private ownership in 2008. \nHowever, Dindo Manhit, president of Stratbase-ADR Institute think tank, said the NGCP might not have necessarily violated these ownership restrictions. \n\"One risk of being a publicly listed company is that anyone can purchase stocks, although limitations can be set on what types of shares the public can buy. Some shares might have a very small stake and without voting rights, giving them no influence on company decisions while still allowing investment,\" Manhit told the Post. \nManhit, who advised the rival bidding consortium in 2008, said he believed the companies involved were then properly vetted.  \nThe consortium comprising the SGCC and two Filipino-owned companies, Monte Oro Grid Resources Corporation and Calaca High Power Corporation, emerged as the winning bidder.  \nThis consortium soon established the NGCP in 2009. In 2020, the SGP secured approval to acquire these entities involved in the NGCP, giving it controlling interest over the corporation. \nLawmakers have also rehashed security concerns about the SGCC's involvement in the NGCP, reviving speculation about an \"off switch\" that could enable Chinese engineers to rob the entire country of its power with a single flick. \nThe National Transmission Corporation, the grid's previous operator, had mentioned this scenario as a possibility at a Senate session in 2019. Opposition senator Risa Hontiveros then raised questions on the extent of China's control as Beijing and Manila were embroiled in tensions in the South China Sea. \nLast week, Salceda stoked similar security fears, alleging that two Chinese officials of the NGCP were found to be reporting to Beijing. \"They're not supposed to be doing that,\" Salceda said. \nHowever, an NGCP official assured lawmakers that no such switch existed. \nAnalysts said fears about China having the ability to \"switch off\" the power grid were unfounded. \nEnrico Gloria, an associate professor of political science at the University of the Philippines and a doctoral student at Tsinghua University in Beijing, said concerns about foreign investment in the country's national grid were valid, given the sector's importance to national security. \n\"However, fears of tangible security threats, such as China's ability to 'switch off' the power grid due to its significant investment stake, remain largely theoretical,\" he said. \nFears that the NGCP could be utilised for Chinese statecraft needed to be contextualised, Gloria said, adding that during heightened tensions with China in 2012 and 2016, Chinese state-owned enterprises \"did not alter their operations in ways detrimental to the Philippines or its power sector\".  \n\"Historically, China's economic restrictions on other countries have targeted symbolic goods and products - such as bananas from the Philippines in 2012, wine and beef exports from Australia in 2020 [...] - rather than critical infrastructure,\" he said. \nAccording to Manhit, the presence of foreign ownership of the NGCP is not classified as a risk, especially since six directors are Filipinos while four are Chinese. \n\"Within the NGCP, the technical side and the control room of the grid are staffed by a majority of Filipino personnel. Filipinos who are in crucial departments of the company must also play their role in managing risks,\" he said. \nFor Alvin Camba, a critical materials specialist at Associated Universities Incorporated, the more pressing issue is the limited transfer of advanced technical knowledge to Filipino engineers. \nWhile the NGCP had greatly improved transmission lines across the country, \"the degree to which we train engineers is ­limited only to mid-level ­[activities]\", said Camba, who has previously researched the SGCC's investment in the NGCP. \n\"When it comes to the ­high-level things and the most important technologies, it's ­actually outside the hands of Filipinos.\"\n"
  },
  {
    "id": 1671,
    "title": "Retrospective on first year back",
    "created_at": "2025-01-18",
    "text": "\nBy Jeffrey Frankel\nPredictions about 2025 come with flashing caveats: no one can know what US President-elect Donald Trump will do, let alone how the rest of the world will respond. But one can speculate. Imagine it is January 2026.\nAs 2025 began, the mood of the American business community shifted. Some businesspeople had long harboured private doubts about Trump's anti-globalisation campaign. But overall confidence began to fall when they came face to face with the possible consequences of cutting the US economy off from international trade and migration: sharply higher prices of imported products and labour shortages in some sectors.\nPublic anxieties multiplied as mysterious cyber-attacks caused a series of failures affecting US power infrastructure, and water and sanitation systems. Some childhood diseases like measles returned. From Inauguration Day, social media hesitated to highlight efforts by public health and information technology professionals to correct the accompanying misinformation.\nMost dramatic in the first half of 2025 was the correction in the US stock market, with the S&P 500 index down by around 35%. To be sure, the market had been ripe for a correction. The S&P 500 had increased sevenfold between January 2009 and the 2024 election, fuelled by stronger-than-expected growth in US output and employment in 2021-24. By the end of President Joe Biden's term, stocks had entered bubble territory. Whether evaluated relative to earnings, dividends, capital stock replacement value, or GDP, share prices had reached levels reminiscent of 1929 and other pre-crash episodes.\nBut it took a needle to prick the bubble. Having gained majorities in the Senate and the House of Representatives, the Republicans also gained responsibility for producing a federal budget. But they were split: while they agreed that the United States was on an unsustainable fiscal path, they disagreed on the solution. One faction touted lower taxes as the key to fiscal virtue (dismissing the \"experts' view\" that this would worsen the budget balance rather than improve it), and the other, spurred by Elon Musk, emphasised spending cuts. (The much-hyped Department of Government Efficiency (DOGE) - headed by Musk and former Republican presidential candidate Vivek Ramaswamy - had little impact in 2025.)\nBudget negotiations devolved into an all-too-familiar game of chicken. When neither side flinched, the US faced a fiery collision, in the form of a month-long government shutdown and credit downgrades by all three major ratings agencies, which in turn crashed stock and bond markets.\nAs the year drew to a close, some observers argued that the US is in recession. In any case, rising inflation - fuelled by Trump's tariffs and his attacks on the US Federal Reserve's independence - augurs the return of 1970s-style stagflation.\nAt the same created_at, there was a vast divergence between what Trump's supporters and opponents expected and what they got in 2025. As it turned out, the business community unexpectedly prevailed on him for higher caps on the number of H-1B visas (for high-skilled workers) and expansion of other legal immigration channels. Trump also re-reversed himself on TikTok. He made big changes to his cabinet, firing secretary of health and human services Robert Kennedy, Jr, who sought tougher regulations for pharmaceutical companies.\nBeyond the economy, Trump took other unexpected steps. His most startling volte-face was his support of states guaranteeing a woman's right to abortion. He insisted that he has always believed the matter should be decided at the state level. In terms of foreign policy, one big shock was the first armed US incursion into Mexico in over a century.\nBefore that, Trump withdrew support from Ukraine, as expected, effectively surrendering to Russia and thereby fatally undermining US credibility in the eyes of potential adversaries, not least Russian President Vladimir Putin himself. Russian troops moved into parts of Georgia and ominously popped up along its 1,500-mile border with NATO, tying down their Western counterparts throughout the year.\nWith the US distracted, and a new precedent set regarding respect - or the lack thereof - for national borders, Venezuela invaded Guyana, Ethiopia invaded Somalia, and Indonesia invaded Timor Leste. Unencumbered by the 2015 Joint Comprehensive Plan of Action, from which Trump withdrew in 2018, and weakened by the decimation of its proxies in Gaza, Lebanon, and Syria, the Iranian regime completed its development of nuclear weapons.\nMost alarming, however, were naval actions by China, whether a reaction to its economic downturn, which Trump's tariffs have exacerbated, or an effort to exploit America's current weakness. Throughout the year, Chinese forces were active in the waters around Taiwan and on newly fortified islands that it claims in the South China Sea. With Trump's tough-guy reputation roundly questioned, he surprised everyone when he responded to a ship collision, in which several US sailors were killed, by sending a joint US-Philippine naval force to retake Scarborough Shoal and the Spratly Islands. In a pattern familiar from modern history, the Trump administration carried out a threat of military intervention that it had neglected to signal in advance.\nAt year end, China's coast guard appeared to be installing a \"quarantine\" of Taiwan. Trump has now sent all naval forces the US can spare to break the blockade if necessary. As 2026 gets underway, fears of a hot war between the two nuclear superpowers seem all too real.\nThroughout 2025, Trump's opponents consoled themselves with thoughts of a silver lining: their fellow Americans would finally see the consequences of having such a president. Before long, his influence would plummet, both in Congress and among the electorate, as he spent more created_at playing golf at Mar-a-Lago.\nNo such luck. As usual, Trump blames the disruptions and disasters of 2025 on anyone or anything other than himself. Likewise, his supporters do not see the adverse developments of 2025 as his fault. Why should they, when they never have before? True, Trump's supporters are unable to distil the appropriate lessons from history. But in predicting that they will, his opponents are ignoring history as well.\nThe writer is professor of capital formation and growth, Harvard University, and research associate, US National Bureau of Economic Research.\nDisclaimer:Views expressed are personal and do not reflect the official position or policy ofFinancialExpress.com. Reproducing this content without permission is prohibited.\n"
  },
  {
    "id": 1673,
    "title": "Labour is right to forge more trade links with China – not doing so would be folly",
    "created_at": "2025-01-18",
    "text": "\nIn the last decade, Britain’s relations with China have been on a rollercoaster. In 2015, during the visit of Chinese leader Xi Jinping to the UK, then chancellor George Osborne was able to declare the two countries were in a “ golden era  ”. He did this with the conviction that with a growing economy and rising middle class, China offered plenty of opportunities for Britain. But by 2022, Rishi Sunak had declared the “ end of the golden era  ”. And in 2023, deputy prime minister Oliver Dowden  labelled China Britain’s greatest economic security threat, to align closer with the position of the US, and through fears of deeper Chinese espionage and interference in the outside world. Seldom had a diplomatic boom-bust cycle happened so rapidly and so completely.\nIn view of extremes such as these, to see a return to unvarnished, largely conventional engagement looks like a revolution. In the past, Rachel Reeves turning up in Beijing for a high-level economic dialogue , as she did over the weekend, would have attracted little notice. China is, after all, still the world’s second largest economy and accounts for about a fifth of global GDP. Its middle class , despite recent domestic economic turbulence, constitutes one of the most dynamic and sought-after consumer groups on the planet. But in 2025, such a visit looks like radical action because of the dramatic deterioration that occurred in the final years of the Conservative administration.\nIf the hyperbole of the “golden era” was a little too much, the shrill anger and demands for almost total decoupling after the pandemic set in during 2020 went too far the other way. China and Britain have never been easy partners. Their history of argument and clashing goes back at least to the early 19th century and the period of the Anglo-Chinese wars. But they have always talked with each other and always sought to have a relationship.\nThese days, the rows are about Hong Kong, Xinjiang , China’s behaviour in the South China Sea  and its attitude towards Taiwan. These all stand out as perennial points of disagreement. What has changed, however, is the amount of leverage that London has in trying to get Beijing to take notice of anything it says. Chinese leaders are not dismissive of the UK. They understand Britain as a close security ally of the US, a fellow member of the UN security council permanent five , and a significant player for finance and some forms of technology. But the reality is that they have a bigger picture to focus on and a limited to nonexistent appetite for being lectured by a power they see as smaller and weaker than they are.\nA great deal of the turbulence in the Britain-China relationship recently can be put down to issues outside Britain’s direct control. The first Trump presidency and the trade wars caused the start of geopolitical divisions that continue to this day. The US and China  are in a period of deep competition and disagreement. The UK and everyone else exist in the shadow that casts.\nAlso the pandemic and what was seen as its mismanagement by China caused major problems for its international image. In the UK, polls show that perceptions of China deteriorated rapidly  around that created_at. These issues were exacerbated by the hardline Chinese management of Hong Kong  because of Britain’s ongoing interests with the city, and its generally nationalist and populist style of politics today.\nBut even in the roughest moments, only the most dogmatic in Britain argued against some form of engagement. Reeves’s visit to China attracted criticism. But for her to not go there at some point would have been even less defensible. Britain’s stagnant growth, the barriers to more traditional markets like Europe because of Brexit, the neverending challenges of poor productivity – all of these mean that the risks of not engaging with China to see what investment and trade might be possible are higher than the risks of doing so.\nThe reality in early 2025 for Britain can be easily stated. Chinese investment  here has remained essentially static, from 0.1% of stocks  a decade ago to about 0.2% today.  In 2024, China was Britain’s fifth-largest trading partner, but much of that is through imports here rather than UK-China exports. China spends about 20 created_ats more on research and development than Britain. And despite rising fees, the 150,000 Chinese students at British universities still make a massive contribution to the sector. Seeing more Chinese finance companies working in London would bolster its credential to continue as a major international finance hub. And while the Chinese electric vehicle (EV) manufacturer BYD  has a presence in Britain, seeing more companies like this in sectors such as high-speed rail or automotives or renewable energy would at least offer a basis for getting access to Chinese knowhow and capital. And getting improved access to their domestic market would still be a great step forward.\nBritain doing better in its relations with China doesn’t mean going head over heels for total alignment. The two countries will never be close allies and will always disagree on as much as they agree. But they can definitely create a more pragmatic, even-tempered relationship. Reeves’s visit secured £600m of deals. The Xi visit in 2015 apparently produced more than 50 created_ats this amount.  But in view of the almost complete inactivity in recent years, at least this was something. And one thing is for sure: China might possibly listen to a country that has at least some joint economic links and trade with it. But it won’t give a second’s attention to a place with no links at all. Britain needs to deal with China. It is folly to think otherwise.\n                                                               Kerry Brown is director of the Lau China Institute, King’s College London. He is the author of The Great Reversal: Britain, China and the 400 Year Contest for Power\n"
  }
]