[
  {
    "id": 1681,
    "title": "Southeast Asia foreign ministers seek breakthrough in Myanmar conflict and South China Sea dispute",
    "created_at": "2025-01-19",
    "text": "\nLANGKAWI, Malaysia (AP) — Southeast Asian foreign ministers gathered Sunday for their first meeting this year under the regional bloc's new chair, Malaysia, seeking a breakthrough over Myanmar’s drawn-out civil war and territorial disputes in the South China Sea.\nThe retreat on the idyllic northern resort island of Langkawi was the first major meeting of the 10-member Association of Southeast Asian Nations hosted by Malaysia. Officials said it aims to chart the bloc’s direction for the year as it tries to resolve Myanmar's deadly four-year crisis and tensions over China’s increasing assertiveness in the South China Sea.\nMalaysian Foreign Minister Mohamad Hasan said Myanmar — represented by a low-level Foreign Ministry official after its junta leaders were barred from formal ASEAN meetings — briefed the gathering about plans for a general election this year. But the bloc wants Myanmar's government to ensure peace before any polls are held, he said.\n“We said the election has to be inclusive. The election cannot be in isolation, it has to involve all stakeholders,” he told a news conference at the end of the retreat. “We told them the election is not our priority. Our priority is to stop the violence.”\nThe crisis in Myanmar has emerged as one of the bloc’s biggest challenges since a military coup ousted an elected civilian government in February 2021, plunging the country into conflict. It has sparked an armed resistance movement, with rebel forces now controlling large parts of the country. The war has killed tens of thousands of people, and displaced millions.\nASEAN’s peace plan and other efforts to seek a solution have so far been futile, hampered by the bloc's non-interference policy and the Myanmar junta's refusal to comply. The military government hopes an election will legitimize its rule, but critics say polls are unlikely to be free or fair.\nMalaysia, which brought Myanmar into ASEAN during its chairmanship of the bloc in 1997, is expected to take a more proactive stance as the Myanmar crisis has led to the flourishing of criminal activities, online scams and human trafficking along Myanmar’s border.\nHasan said Malaysia had appointed Othman Hashim, a former foreign ministry senior official, as special envoy for ASEAN chair to Myanmar to engage various factions in the country to find a way forward.\n“We have no intention to carve out Myanmar,” he said, adding that dialogue and diplomacy were the best strategies to help the country return to a democratic path.\nHasan said the meeting also discussed implications of the second term of incoming U.S. President Donald Trump on the region amid its rivalry with China. He said ministers raised concerns that competition between the major powers may increase tensions and have spillover effects in the region. He said ASEAN ministers stressed the urgency to bolster regional unity and make economic integration a top priority amid the global uncertainties.\n“We must ensure that ASEAN remains our central go-to platform for solution seeking... We are the speakers and not the spoken-for. We must drive our own path forward,” he said.\nTensions in the South China Sea, one of the world's vital shipping lanes, were also high on the agenda following violent confrontations in the waters last year. Hasan said the ministers called for accelerated negotiations between ASEAN and China on a code of conduct in the waterway. Officials earlier targeted them for conclusion in 2026 but the talks have stalled over disagreements including whether the pact should be binding and its scope of coverage.\n“We stressed that the South China Sea must remain peaceful and stable,” Hasan said.\nASEAN members Vietnam, the Philippines, Malaysia and Brunei along with Taiwan have overlapping claims with China, which asserts sovereignty over virtually all of the South China Sea.\nChinese and Philippine vessels clashed repeatedly last year. Chinese forces also assaulted Vietnamese fishermen and Chinese patrol vessels ventured into areas that Indonesia and Malaysia claim as exclusive economic zones. ASEAN has not openly criticized China, which is the bloc’s top trading partner.\nAs chair, Malaysia is likely to push for quiet diplomacy as it balances security challenges with economic gains, analysts say.\n“It would be pragmatism on Malaysia’s side, as the country — as well as ASEAN as a whole — lack the diplomatic and military heft to confront China on the South China Sea,” said Muhamamd Faizal Abdul Rahman, a research fellow at Singapore's S.Rajaratnam School of International Studies.\n"
  },
  {
    "id": 1683,
    "title": "Southeast Asian foreign ministers seek breakthrough in Myanmar conflict and South China Sea disputes",
    "created_at": "2025-01-19",
    "text": "\n Southeast Asian foreign ministers gathered Sunday for their first meeting this year under the regional bloc's new chair, Malaysia, seeking a breakthrough over Myanmar's drawn-out civil war and territorial disputes in the South China Sea.\nThe retreat on the idyllic northern resort island of Langkawi was the first major meeting of the 10-member Association of Southeast Asian Nations hosted by Malaysia. Officials said it aims to chart the bloc's direction for the year as it tries to resolve Myanmar's deadly four-year crisis and tensions over China's increasing assertiveness in the South China Sea.\nMalaysian Foreign Minister Mohamad Hasan said ASEAN must bolster unity and make economic integration a top priority amid global uncertainties and the U.S.-China rivalry in the region. He said the second term of incoming U.S. President Donald Trump has also raised questions on how it will shape dynamics in the region.\n\"There is much to prepare for. Above all, what we need to anticipate are the potential challenges to ASEAN centrality,\" he told the opening of the meeting. \"We must ensure that ASEAN remains our central go-to platform for solution seeking... We are the speakers and not the spoken-for. We must drive our own path forward.\"\nThe crisis in Myanmar has emerged as one of the bloc's biggest challenges since a military coup ousted an elected civilian government in February 2021, plunging the country into conflict. It has sparked an armed resistance movement, with rebel forces now controlling large parts of the country. The war has killed tens of thousands of people, and displaced millions.\nASEAN's peace plan and other efforts to seek a solution have been futile as Myanmar's junta has not been compliant. ASEAN banned Myanmar's military leaders from formal ASEAN meetings but the bloc's non-interference policy has hampered its role. The military government plans an election this year to legitimize its rule but critics say polls are unlikely to be free or fair.\nMalaysia, which brought Myanmar into ASEAN during its chairmanship of the bloc in 1997, is expected to take a more proactive stance as the Myanmar crisis has led to the flourishing of criminal activities, online scams and human trafficking along Myanmar's border. \nHasan last month said Malaysia had appointed Othman Hashim, a former foreign ministry senior official, as its special envoy to Myanmar to engage various factions in the country to find a way forward.\nTensions in the South China Sea, one of the world's vital shipping lanes, are also high on the agenda Sunday following violent confrontations in the waters last year. ASEAN members Vietnam, the Philippines, Malaysia and Brunei along with Taiwan have overlapping claims with China, which asserts sovereignty over virtually all of the South China Sea. \nChinese and Philippine vessels clashed repeatedly last year. Chinese forces also assaulted Vietnamese fishermen and Chinese patrol vessels ventured into areas that Indonesia and Malaysia claim as exclusive economic zones.\nThe Philippines has pushed for negotiations between ASEAN and China for a code of conduct in the waterway but talks have stalled over disagreements including whether the pact should be binding and its scope of coverage. ASEAN has not openly criticized China, which is the bloc's top trading partner.\nAs chair, Malaysia is likely to push for quiet diplomacy as it balances security challenges with economic gains, analysts say. \n\"It would be pragmatism on Malaysia's side, as the country - as well as ASEAN as a whole - lack the diplomatic and military heft to confront China on the South China Sea,\" said Muhamamd Faizal Abdul Rahman, a research fellow at Singapore's S.Rajaratnam School of International Studies.\n"
  },
  {
    "id": 1685,
    "title": "Philippines Confronts China Over Giant Coast Guard Vessel In Territorial Waters",
    "created_at": "2025-01-19",
    "text": "\nThe Philippines is currently engaged in a significant diplomatic confrontation with China over the presence of a massive Chinese Coast Guard vessel, referred to as the \"Monster,\" in its territorial waters. This situation has escalated tensions between the two nations, particularly concerning overlapping claims in the resource-rich South China Sea.The Philippines has accused the 12,000-ton Chinese vessel, officially known as CCG 5901, of maintaining an \"illegal presence\" within its exclusive economic zone (EEZ). Philippine Coast Guard spokesman Jay Tarriela stated that their vessel, BRP Cabra, has been monitoring and tailing the Chinese ship since it was first detected near Capones Island in Zambales province.The Philippine government has lodged formal protests against China's actions, describing them as aggressive and alarming. National Security Council spokesperson Jonathan Malaya emphasized that the ship's proximity—77 nautical miles from the Philippine coast—was unacceptable and called for its immediate withdrawal.On January 18, during bilateral talks in Xiamen, Philippine officials confronted their Chinese counterparts about this maricreated_at intrusion. \nThe discussions underscored Manila's serious concerns regarding China's maricreated_at activities and their implications for regional stability.The presence of the \"Monster\" ship is viewed as part of China's broader strategy to assert dominance in the South China Sea, a crucial shipping route and area rich in natural resources. Philippine officials have expressed that they will not back down from what they perceive as intimidation tactics by China, stating that \"all options are on the table\" for response.The ongoing tensions are rooted in historical disputes over territorial claims in the South China Sea. An international tribunal ruling in 2016 invalidated many of China's expansive claims; however, Beijing has continued to assert its rights over these waters. Under President Ferdinand Marcos Jr., the Philippines has taken a more assertive stance to defend its territorial interests, leading to increased confrontations with Chinese maricreated_at forces.This situation remains fluid, with both nations navigating complex geopolitical dynamics that could have broader implications for regional security and international law compliance.AFP\n"
  },
  {
    "id": 1686,
    "title": "What the Philippines' bid for a UN Security Council seat means for China",
    "created_at": "2025-01-19",
    "text": "\n Manila would be able to raise South China Sea-related issues that could 'embarrass' Beijing and nudge it into a compromise, analysts say   \nA seat on the UN Security Council would give the Philippines its highest-profile platform yet to confront Beijing over its expansive claims in the South China Sea. \nBut as President Ferdinand Marcos Jnr courts global support in his bid to become a non-permanent member, the question remains: can Manila outmanoeuvre China on the world stage? \n\"We need to further strengthen multilateralism efforts that will reform the Security Council and revitalise the general sencreated_atnt,\" Marcos Jnr said last weekend during a toast at the \"vin d'honneur\", a formal gathering at the presidential palace attended by diplomats, including China's ambassador. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nThe president's appeal, which stressed the importance of a \"rules-based international order\", asserted his administration's determination to assert its place in global diplomacy. He pointed to the Philippines' \"rich experience\" in peacekeeping, consensus-building, and fostering cooperation as the foundation for its candidacy for the 2027-28 Security Council term. \n\"With a long history and a credible record of multilateral diplomacy,\" he said, \"the Philippines is in a very strong position to take on more leadership roles that seek to advocate on consequential issues in the global agenda.\" \nBut while Marcos Jnr paints a picture of high-minded diplomacy, analysts say his campaign carries clear strategic intent: leveraging the Security Council seat to corner Beijing. \nChina, a permanent member of the UN Security Council with veto power, looms large over Manila's bid. Beijing's sweeping South China Sea claims - which encompass almost all of the disputed waterway - collide head-on with the Philippines' exclusive economic zone. \nWith a seat on the council, Manila could raise South China Sea-related resolutions, even though China is certain to veto them. \nStill, the very act of putting forward such resolutions could be a diplomatic coup. \"The votes would embarrass Beijing,\" said Greg Poling, director of the Southeast Asia programme at the Centre for Strategic and International Studies in Washington. \n\"If combined with additional resolutions in the General Assembly and new arbitrations, [this strategy] would impose costs on China and manoeuvre Beijing towards an eventual compromise,\" he told This Week in Asia. \nManila, according to experts, is well-positioned to secure a seat. The Philippines has deployed 14,000 troops to 21 UN peacekeeping missions over six decades and previously held a non-permanent seat on the council in 2004-2005. \nNot only that, but within the Association of Southeast Asian Nations - a 10-member bloc that also includes Vietnam, Indonesia and Singapore - there is an explicit agreement to support each other's Security Council bids. \n\"All 10 members of Asean agreed years ago to support each other in a rotation on the Security Council,\" Poling said. \"It was Vietnam's turn previously and now it is the Philippines. So, if any member of Asean doesn't support the Philippines' bid, it will be violating an explicit promise.\" \nThe campaign is not without its sceptics, however. Some observers questioned how much practical impact a non-permanent seat could wield, given China's veto power. Jennifer Parker, an expert associate at the Australian National University's National Security College, warned that the Philippines' bid - though likely to garner significant support - faced challenges. \n\"Vietnam has publicly supported the Philippines' bid, but it's unclear how much broader support the Philippines has at this stage,\" Parker said. \n\"A seat on the council would help the Philippines further highlight its concerns about China's actions in the South China Sea. However, any position they hold in the council is unlikely to result in resolutions on the issue, given China's veto power.\" \nThe UN Security Council comprises five permanent members - China, France, Russia, Britain and the United States - and 10 non-permanent members elected for two-year terms. Securing a seat requires a two-thirds majority vote in the General Assembly. \nOther analysts see the bid as a way for Marcos Jnr to craft a legacy. Abdul Rahman Yaacob, a research fellow at the Lowy Institute's Southeast Asia programme, said a seat on the Security Council could serve both domestic and strategic purposes for the Marcos administration. \n\"With the support of Asean as a regional organisation, Manila's campaign for a seat may likely succeed,\" he told This Week in Asia. \"China and the US, including US allies, are competing for influence in Southeast Asia, and they would like to be seen as supportive of Asean rather than as an unfriendly partner.\" \nPoling said the Philippines was competing against Kyrgyzstan for the seat and, with the support of Asean and the US, should be the favourite to win. \nAsean member states that have served as non-permanent members of the UN Security Council include Vietnam, which most recently held a seat for the 2020-2021 term, Indonesia and Singapore. Malaysia has been elected for four separate terms. \nThe Philippine Department of Foreign Affairs has made it clear that the push for a seat is no ordinary diplomatic endeavour, previously calling it \"very important\" for the country. \n\"We'll be able to engage in the most important dialogues and debates and vote on important issues,\" Eduardo de Vega, an undersecretary at the department, told local media. \n\"We have interests in the rule of law and international law, maintaining peace and stability,\" he was quoted as saying. \"We have millions of Filipinos overseas and we need the world to continue living and aspiring for goals for which the UN was created.\" \nOthers say that a seat could bolster the Philippines' moral position in its territorial dispute with China. Sherwin Ona, a visiting fellow at Taiwan's Institute for National Defence and Security Research, argued that the campaign underscored the importance of the rule of law in international relations. \n\"This places the Philippines in a stronger diplomatic position and can open opportunities to strengthen our advocacies and position in the South China Sea,\" said Ona, who is also an associate professor of political science at De La Salle University in Manila. \nThe road ahead remains uncertain, however. \"To what extent this strategy may work is questionable,\" Rahman said. \"But having a place on the council is still critical if Manila wants to reinforce its position vis-a-vis China.\" \nHe agreed that the Marcos administration was likely to gain support from the US, other Western states, and Asian powers such as Japan and South Korea. Other countries wishing to signal their endorsement of Manila's South China Sea stance may also back Manila's bid. \nBut with the 2027-28 election set for mid-2026, Parker said it was too early to predict whether it would succeed. \n\"Much will depend on China's stance and whether it chooses to actively lobby against the Philippines' bid,\" she said. \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1688,
    "title": "ASEAN tells Myanmar military rulers peace should be priority, not election",
    "created_at": "2025-01-19",
    "text": "\nJanuary 19th, 2025 ( Al Jazeera English  - Delivered by  Newstex )\nSoutheast Asian nations have told Myanmar's military government its plan to hold an election amid an escalating civil war should not be its priority, urging it to start dialogue and end hostilities immediately.The foreign ministers of the Association of Southeast Asian Nations (ASEAN) on Sunday called on the  warring sides in member nation Myanmar to stop the fighting and told its representative to allow unhindered humanitarian access, host Malaysia's foreign minister said.'Malaysia wants to know what Myanmar has in mind,' Mohamad Hasan told a news conference after a ministerial retreat on the island of Langkawi.Hasan said Myanmar - represented by a low-level official from the Ministry of Foreign Affairs after its military leaders were barred from formal ASEAN meetings - briefed the gathering about plans for a general election this year.But the bloc wants Myanmar's government to ensure peace before any polls are held, he said.'We said the election has to be inclusive.The election cannot be in isolation, it has to involve all stakeholders,' he said.'We told them the election is not our priority.Our priority is to stop the violence.'Myanmar has been in turmoil since early 2021 when its military overthrew the elected civilian government of Nobel laureate Aung San Suu Kyi, triggering pro-democracy protests that morphed into a widening armed rebellion that has taken over swaths of the country.Despite being battered on multiple fronts, its economy in tatters and dozens of political parties banned, the military government plans to hold an election this year, which critics have widely derided as a sham to keep the generals in power through proxies.Malaysia, chair of the 10-member bloc this year, announced the appointment of former diplomat Othman Hashim as special envoy on the crisis in Myanmar, where the United Nations says humanitarian needs are at 'alarming levels', with nearly 20 million people - more than a third of the population - needing help.Mohamad said Hashim would visit Myanmar 'soon' to convince all sides in Myanmar to implement ASEAN's five-point peace plan, which has made no progress since it was unveiled months after the coup.Regional tensions on the agenda\nHasan said the meeting also discussed the likely implications of the second term of incoming US President Donald Trump on the region amid its rivalry with China.He said the ministers raised concerns that competition between the two superpowers may increase regional tensions.He said ASEAN ministers stressed the urgency to bolster regional unity and make economic integration a top priority amid the global uncertainties.Tensions in the  South China Sea, one of the world's vital shipping lanes with about $3 trillion of annual ship-borne trade, were also high on the agenda following violent confrontations in the waters last year.Vietnam and Malaysia have also protested over the conduct of Chinese vessels in their exclusive economic zones, which Beijing says are operating lawfully in its waters.China claims sovereignty over most of the South China Sea.But ASEAN members Vietnam, the Philippines, Malaysia and Brunei, along with Taiwan, have also overlapping claims.China and ASEAN have committed to drafting a code of conduct for the South China Sea, but talks have moved at a snail's pace.Mohamad said the ministers welcomed progress so far, but 'highlighted the need to continue the momentum to expedite the code of conduct'.The foreign minister of the Philippines, a key United States ally, told the Reuters news agency on Saturday it was created_at to start negotiating thorny 'milestone issues' for the code, including its scope, whether it can be legally binding and its effect on third-party states.Hasan said the ministers called for accelerated negotiations between ASEAN and China on a code of conduct in the waterway.'We stressed that the South China Sea must remain peaceful and stable,' he said.Link to the original story.N"
  },
  {
    "id": 1689,
    "title": "Coast Guard issues new challenge to Chinese 'monster ship' near Zambales waters",
    "created_at": "2025-01-19",
    "text": "\n The Philippine Coast Guard (PCG) once again challenged the Chinese Coast Guard's 'monster ship' which continues to operate illegally off the Zambales coast.\nIn a statement, the PCG, through the BRP Gabriela Silang, said it issued radio challenges on vessel 5901 on Saturday, when the Chinese Coast Guard monster ship was positioned 60 to 70 nautical miles on the Coast Line of Zambales.\n'The PCG sends a clear message: the normalization of unlawful deployments will not be accepted or tolerated.,' Commodore Jay Tarriela in an X (formerly Twitter) statement said. \n'It is important to note that the United Nations Convention on the Law of the Sea (UNCLOS) clarifies that the freedom of navigation for foreign-flagged vessels does not extend to conducting patrols within the EEZ of other states,' he added. \nThis year, the PCG first confirmed the presence of the monster ship on January 4. \nIn a press briefing on January 14, National Task Force - West Philippine Sea spokesperson Jonathan Malaya said the Department of Foreign Affairs has already filed a diplomatic protest against the matter. \nIn response, Foreign Ministry spokesperson Guo Jiakun defended the ship's intrusion into Philippine territory saying that that China's sovereignty and rights in the South China Sea have been 'repeatedly established and are firmly grounded in history and international law.'\nIn 2016, an international arbitration tribunal in The Hague sided with the Philippines, finding that China's claims in the South China Sea lacked legal basis, a ruling that China does not recognize. \n"
  },
  {
    "id": 1694,
    "title": "Capital Economics: Manila aligns more closely with US under Marcos Jr.",
    "created_at": "2025-01-19",
    "text": "\nManila, Jan. 19 -- The Philippines under the Marcos Jr. administration strengthened its ties with the US amid heightened tensions with China over disputed South China Sea territories, according to the think tank Capital Economics.\nIn a Jan. 17 report, Capital Economics said it expects incoming US President Donald J. Trump to possibly widen the so-called \"fracturing\" of the global economy, which has divided countries into two camps, each led by the US and China.\nIn the case of the Philippines, which has been historically leaning towards the US rather than China, Capital Economics noted that relations with its former colonizer are expected to be stronger this year.\nThe country's preference to align with the US was strongest-beyond the 80-percent level-during the Covid-19 pandemic (2021), which began in Wuhan, China.Last year, it remained strong at around the same degree.\nOther ASEAN countries like Singapore and Vietnam also prefer to align with the US over China, a choice which, according to Capital Economics,hasnot shifted.\n\"The one country in Southeast Asia that we think has moved is the Philippines-closed to the US as a response to China's efforts to extend its power in the South China Sea,\" Capital Economics pointed out.\nCapital Economics said China's share of the fractured global economy shrank last year, widening the gap between its economic bloc or alliance and that of the United States and its allies.\nAt the beginning of 2025, China and its geopolitical allies accounted for less than one-third of the size of the US-led bloc.\nAccording to the report, \"this fall was in part the result of a loss of support for China\" in some countries, following changes of government. It was also partly because the US experienced an economic boost in dollar terms.\nHowever, despite a weaker footing in terms of economic influence, China continues to be the world's manufacturing powerhouse, producing more than the US and its closest allies combined.\nTrump2.0-led US\nThe US President-elect Trump will be inaugurated on Monday, Jan. 20, which will officially mark his comeback to the White House and his reentry into the political playing field.\nUnlike the current Marcos Jr. admin, its predecessor-the Duterte administration-had closer ties with China as the US was a critic of the bloody war on drugs.\nWhile Trump's return has not changed the bloc compositions, his re-election \"may prove to be the most consequential development of the past year for the path of global fracturing.\"\nTrump's return to office \"raises questions about the chances of a significant realignment over the years ahead,\" and there are also doubts about whether the economic divide between camps led by the strategic rivals will still make sense in the future.\nBy composition, the China bloc covers more land and has a slightly larger population than the US bloc, but reports showed that in 2024 it generated just 22 percent of global gross domestic product (GDP), compared to 71 percent from the US bloc.\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1695,
    "title": "WPS: Deadlines, ultimatums vs China 'monster ship' beyond PCG mandate - Tarriela",
    "created_at": "2025-01-19",
    "text": "\n Imposing a deadline or an ultimatum for China to remove its 'monster ship' near the Zambales coastline is 'beyond the mandate' of the Philippine Coast Guard (PCG).\nPCG spokesperson for the West Philippine Sea Commodore Jay Tarriela said this when asked about Chinese Coast Guard (CCG) vessel 5901's 'unlawful presence' about 60 to 70 nautical miles from the Zambales coastline.\nThe PCG has been monitoring its movements within the country's exclusive economic zone (EEZ) since the agency confirmed its presence in the area last January 4.\n'In regard to the PCG's mission, our role is to monitor and actively challenge the illegal presence of the Chinese Coast Guard for them not to normalize such unlawful patrol within our EEZ,' Tarriela told reporters in a Viber message on Sunday.\n'It is beyond our agency's mandate to impose deadlines or ultimatums on the coast guard of another state actor,' he added.\nBased on PCG's latest update, its vessel, BRP Gabriela Silang (OPV-8301) was 'actively monitoring and challenging' the presence of CCG vessel 5901.\n'During the entire maricreated_at patrol today (January 18), the PCG crew conducted a radio challenge to firmly remind the Chinese Coast Guard vessels of their unlawful actions, particularly regarding their claims of conducting maricreated_at patrols,' according to a statement issued Saturday night.\n'It is important to note that the United Nations Convention on the Law of the Sea (UNCLOS) clarifies that the freedom of navigation for foreign-flagged vessels does not extend to conducting patrols within the EEZ of other states,' it added.\nLast week, the National Maricreated_at Council (NMC) asked the Chinese government to withdraw its 'monster ship' within the Philippine's EEZ, according to National Task Force West Philippine Sea spokesperson Jonathan Malaya.\nThis call came after the NMC announced that the Philippine government filed a diplomatic protest against the continued illegal presence and operations of CCG vessels within the country's EEZ.\nBeijing's continued aggression is based on its assertion of sovereignty over almost the entire South China Sea, including most of the West Philippine Sea, as it continues to reject the 2016 arbitral ruling that effectively dismissed its claims and ruled in favor of Manila.\nThe landmark ruling stemmed from a case filed by Manila in 2013, a year after its tense standoff with Beijing over Panatag Shoal, whose lagoon the latter now effectively controls.\n"
  },
  {
    "id": 1696,
    "title": "US deploys carrier strike group in 1st Maricreated_at Cooperative Activity with PH forces for 2025",
    "created_at": "2025-01-19",
    "text": "\n01/20/2025 The regional bloc ASEAN and China should make headway on a protracted code of conduct for the South China Sea by tackling thorny \"milestone issues\", including its scope and if it can be legally binding, the Philippines' top diplomat said on Saturday. The South China Sea remains a..."
  },
  {
    "id": 1697,
    "title": "'Napakasarap marinig': Barbers welcomes incoming US official's stern warning vs China",
    "created_at": "2025-01-19",
    "text": "\nManila, Jan. 19 -- Surigao del Norte 2nd district Rep. Robert Ace Barbers (Ellson Quismorio/ MANILABULLETIN)\nSurigao del Norte 2nd district Rep. Robert Ace Barbers can't help but feel relieved and emboldened by United States (US) Secretary of State nominee Marco Rubio, who recently gave strong words against China's \"bullying\" in the West Philippine Sea (WPS).\n\"The stance taken by incoming US Secretary of State Senator Rubio against China's aggression in the WPS serves as a warning against China's continuing disrespect on the Philippines and Taiwan's territory and sovereignty,\" Barbers said in a statement Sunday, Jan. 19.\n\"Napakasarap malaman at marinig para sa ating mga Filipino na ang incoming US Secretary of State ay malalim ang kaalaman sa mga karumal-dumal na ginagawa ng China sa WPS laban sa Pilipinas at Taiwan at handa nila tayong tulungan sakaling may hindi magandang mangyari dito,\" added the House quad-committee (quad-comm) overall chairman.\n(For us Filipinos, It's so good to know and hear that the incoming US Secretary of State has a deep knowledge on China's appalling activities in the WPS against the Philippines as well as Taiwan, and that they are ready to help us in case something bad happens.)\nRubio slammed China's \"deeply destabilizing\" actions in the WPS, which he said could prompt the US to \"counteract\" should Beijing carry out \"anything rash or irrational\" against the Philippines or Taiwan.\nRubio, who testified before a Senate Foreign Relations Committee hearing on his nomination to be Secretary of State on Capitol Hills, Washington DC, last Jan.15 discouraged China from carrying out \"anything rash or irrational\" when it comes to the Philippines or Taiwan if it is serious about stabilizing US-China relations.\nHe warned that if, \"God forbid,\" any \"miscommunication\" or some \"inadvertent conflict\" emerges out of China's bullying and other forms of aggressions in the WPS, the US would be forced to defend the Philippines as its treaty ally, and its impact would have on the entire globe would be enormous, \"and that includes Europe\".\nAside from firing water cannons and sideswiping, shadowing and other forms of harassments against Philippine Coast Guard (PCG) patrol ships and local fishermen in the WPS for the past two years, China naval ships and personnel continues to encroach inside the country's 200-nautical mile exclusive economic zone (EEZ).\nRubio, during the US Senate hearing, cited as an example of the latest China harassment in the WPS the deployment of its 165-meter long coast guard vessel dubbed as \"monster ship\" near Zambales.\n\"The actions they (China) are taking now are deeply destabilizing; they are forcing us to take counteractions because we have commitments to the Philippines and we have commitments to Taiwan that we intend to keep,\" the former senator from Florida said.\n\"If they want to destabilize the relationship or they want to at least create some pathway for stabilization of our relationship with them, they really need to stop messing around with Taiwan and with the Philippines because it's forcing us to focus our attention in ways we prefer not to have to.\"\nIn the same hearing, Rubio emphasized Manila's \"strategic importance\" to Washington, not only from a military perspective but also over the \"real economic opportunities\" it could explore with the country.\nHe also acknowledged the Philippine government's \"welcoming attitude\" in recent years to further boost engagement with the US. \"When your engagement with a country leads to economic development-whether it's outbound US investment in the Philippines or what have you-then that becomes enduring.\"\nA July 2016 arbitration ruling by The Hague-based Permanent Court of Arbitration (PCA) had invalidated China's claims in the WPS, particularly its expansive nine-dash line claim over practically the entire South China Sea.\nChina did not participate in the proceedings and has consistently rejected the ruling.\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1699,
    "title": "US weakness on Ukraine will only embolden China",
    "created_at": "2025-01-19",
    "text": "\nWhen Donald Trump takes office, his greatest challenge will be how he deals with the new axis of totalitarian states. This axis comprises China, North Korea, Russia, Iran, Myanmar and a growing number of others. With China at its heart, it poses the greatest threat the Free World has faced since the Cold War.\nChina is a dictatorship, committing genocide in Xinjiang to eradicate the Uyghurs , it uses forced labour, persecutes religious groups and democracy campaigners. China is now building up its military and navy  at an astonishing rate, to challenge the US. It has asserted ownership of disputed strategic territories in the South China Sea. Perhaps most critical is its threat to invade Taiwan.\nThe interesting thing about brutal dictators is that they tell you in advance what their ambitions are, as in the 1930s. Leaders in the West failed to believe Hitler and tens of millions died. Vladimir Putin couldn’t be clearer about his plans for greater Russia including Ukraine (as his seizure of Crimea demonstrated). Xi Jinping has made no secret of his plans to turn China into the dominant global superpower militarily and economically. He believes democracy and human rights are an aberration and that his form of autocracy is the historical norm. \nHaving betrayed the Sino-British treaty on Hong Kong  and grabbed the South China Seas, with the West barely making a whimper, now he plans to annex Taiwan too.\nYet China does not work alone.\nChina is still a very close partner of Putin’s Russia. Both observed the chaotic withdrawal of western troops from Afghanistan and will have reached the same conclusion that the West lacks the leadership and perseverance to stay the course. It was that debacle that emboldened Putin to invade Ukraine.  The resulting brutal war dominated by Russian barbed wire, mines and drones has led to hundreds of thousands of dead and wounded. Even now, Ukrainian men and women fight for every inch of their precious land, paying with their lives.\nThe harsh reality is that most European countries ignored the signals and had hollowed out their defence capability, spending instead on what they saw as domestic priorities. Whilst the UK led the way early in supporting Ukraine, too many Western European countries were slow to act, dependent for their energy on Russia. \nIn December 2023 I went to Washington with a small group of Conservative MPs to discuss the proposed funding for Ukraine, which at that created_at hung in the balance in Congress. This was not long after the October 7 massacre. Understandably, those Congressmen and women we met said their priority was to ensure the IDF defeated this terrorist group. Their two priorities were Israel and Taiwan. My response was that these three issues cannot be separated. The attack on Israel helped both Russia and China, by taking America’s attention off Ukraine and Taiwan.\nThe resultant delay in approving vital military supplies cost Ukraine dear in lost territory. This axis will have suspected that Israel’s needs would outweigh Kyiv’s in the US, giving Russia created_at and isolating Ukraine at a critical moment. \nTrump’s plans to achieve some kind of peace accord between Putin and President Zelensky are on the face of it laudable. However, as Ronald Reagan and Margaret Thatcher knew, the lesson of the Second World War was that peace without justice never lasts. Remember how Hitler was given the Sudetenland by France and Britain in an attempt to appease him-a year later Hitler invaded the rest of the country.\nI have been to Ukraine on a number of occasions and seen first-hand the astonishing bravery of the Ukrainian people. Their fight should be seen as our fight in the West. Ukraine deserves more than a short-term settlement, in which Putin is rewarded for his brutality. \nI hope President Trump recognises that Ukraine’s predicament has come about because of weak leadership in the west and its appeasement of Russia and China. If Ukraine is forced to accept Russia’s hold over 20 per cent of their country, as part of a settlement, then in echoes of 1938 Putin will be back for the rest. \nAnd with China looking on, our weakness will mean Taiwan is next. I pray we do not repeat the mistakes of the past.\n"
  },
  {
    "id": 1700,
    "title": "Fine-tuning strategy for new geopolitical game",
    "created_at": "2025-01-19",
    "text": "\nTaiwanese lawmaker Chen Yeong-kang leaned forward in his overstuffed chair in an anteroom of Taiwan's Legislative Yuan as he considered the changes expected with Donald Trump's return to the White House. \n\"When we see the Trump administration, we believe that it's about flexible diplomatic methods,\" Chen, a former admiral, said. \"But I believe that every US president recognises and focuses on the importance of the peace and stability across the Indo-Pacific region, and of course, in Taiwan.\" \nSome 1,200km south, military and civilian officials in Manila sang a similar tune, arguing that precedence and long-standing ties with the United States were likely to prevail, while pointing out that Trump coined the \"free and open Indo-Pacific\" strategic concept during his first term. \n\"We fought together during World War II,\" General Romeo Brawner Jnr, the Philippines' armed forces chief of staff, said shortly after Trump was elected in November. \"Even now, as we face other threats in the region, they still continue to support us.\" \nLeaders worldwide are busy fine-tuning their strategy ahead of Trump's second term, but the activity has taken on particular urgency for those on the front lines of Beijing's growing military might. \nOfficials in Taiwan and the Philippines, facing near-daily showdowns with Beijing's powerful People's Liberation Army (PLA), suggest similar road maps for Trump 2.0 - depend less on Washington, more on themselves, appeal to his deal-making persona, and hope for the best. \nBut most of these confident statements come with a big caveat: given Trump's mercurial nature and pleasure in upending tradition, the past is no great predictor. \n\"We still need to find out what's coming,\" said Tzu-Chieh Hung, a senior analyst focused on the PLA at the Institute for National Defence and Security Research in Taiwan, which is affiliated with the island's defence ministry.  \nAt his US Senate confirmation hearing on Wednesday, Marco Rubio, Trump's pick for secretary of state, warned Beijing over its muscular approach.  \n\"They really need to stop messing around with Taiwan and with the Philippines, because it's forcing us to focus our attention in ways we prefer not to have to,\" Rubio said. \nMany Southeast Asian nations have traditionally looked to Washington for security protection and Beijing for trade and investment.  \nBut this fence-sitting was likely to become more difficult with US-China distrust deepening and Trump expected to demand loyalty, analysts said. \n\"Are we Team China or are we still Team US?\" said Richard Heydarian, a professorial chairholder in geopolitics at the Polytechnic University of the Philippines and adviser to President Ferdinand Marcos Jnr. \n\"We're all going to be under pressure to choose.\" \nTrump is famous for being transactional. But others could play that game, he added. \n\"If we're going to go down that road of really going to the US - and this is a cold war where we choose sides - make sure you get something in exchange economically.\" \nFor example, Heydarian said, the Philippines could position itself as part of alternate supply chains being built to bypass and otherwise \"de-risk\" trade with China.  \nOne possibility lies in nickel. The 7,641-island archipelago is the world's second-largest nickel producer, a valued commodity as countries seek to loosen Beijing's grip on strategic metals. \nAdditionally, since Manila would almost certainly be drawn into any Taiwan conflict, it could make sure that the Philippines got a piece of Taiwan's global chip business, particularly the lower-end semiconductor assembly work known as advanced packaging.  \nChina's global share of advanced packaging is around 38 per cent, according to the MIT Technology Review - a dependence that strategic competitors are seeking to reduce. \n\"We're much closer to Taiwan than any other country in the region, right? So our fates are tethered,\" Heydarian said. \"If we are going to pay the price of being part of the American geopolitical game, there has to be a benefit.\" \nThe prospect of less dependable US relations under Trump - particularly compared with President Joe Biden's keen focus on bolstering ties broadly to counter China - has both Taiwan and the Philippines looking to Japan, South Korea, European nations and each other. \nConcerns among China's neighbours have grown as its footprint expands, Beijing bolsters its nuclear arsenal, and the PLA flexes its muscle in the Taiwan Strait and the South China Sea, where trade worth over US$3 trillion sails through annually. \n\"We need to make more friends with same-mind countries,\" said Kuan-Chen Lee, also of Taiwan's Institute for Defence and Security Research.  \n\"And secondly, Taiwan should welcome foreign investment and exchange with other countries. I believe it will make Taiwan safer.\" \nBeijing sees Taiwan as part of China to be reunited by force if necessary, and is strongly opposed to Taipei's efforts to expand its presence in global business, health and aviation forums. \nMost countries, including the US and the Philippines, do not recognise Taiwan as an independent state. But Washington opposes any attempt to take the self-governed island by force, is legally bound to support Taiwan's military defence capability and has supported its bid for greater global recognition. \nTrump, with his \"America first\" stance, has repeatedly accused Washington's partners and allies of \"ripping off\" the country, especially those carrying trade surpluses or dependent on US security.  \nDuring his campaign, he took particular aim at Taiwan. \n\"I know the Taiwanese very well, I respect them a lot. They took about 100 per cent of our chip industry. I think Taiwan should pay us for defending itself,\" he said in August. \"Taiwan doesn't give us anything in return.\" \nAlexander Huang, director of international affairs at the National Policy Foundation, which is affiliated with Taiwan's main opposition party Kuomintang, said that Taipei should not think Trump was bluffing. \n\"He may not go and do exactly what he says - for instance, the 60 per cent tariff against China. But he always says Taiwanese are rich, stole our jobs, stole our chips,\" Huang said.  \n\"I don't think we can walk away without paying a price.\" \nThat price, many in Taipei and Manila suggest, may involve buying more US military hardware to address Trump's stated concerns about trade surpluses and defence costs - though given the demands of supplying arms to Ukraine and Israel, US production is years behind schedule. \nAnother problem, Hung noted, was that the maths did not add up. Trump has called on Taiwan to spend 10 per cent of its GDP on defence, a stupefying increase from its current 2.5 per cent.  \nBy comparison, European Union member countries spent some 1.6 per cent of GDP on average on defence in 2023.  \nGranted, Trump's propensity for bluster could mean that 5 per cent is the actual goal. But that would still be a stretch. Every percentage point amounts to about US$8 billion. \nNor can trade surpluses be reduced instantly. Taiwan's January-October 2024 trade surplus with the US was US$41.8 billion, up from US$35 billion for the same period in 2023. \n\"Taiwan should increase its military spending to 3 per cent of GDP from 2.5 per cent,\" Hung said. \"The question is, can we reduce the trade surplus?\" \nThe Philippines faces similar constraints - though with far smaller numbers. Manila posted a trade surplus of US$3.7 billion in the first 10 months of 2024, up slightly from US$3.5 billion for January-October 2023.  \nAnd, despite calls by Marcos to boost spending on new weapon systems, the Philippine legislature cut defence spending by 16 per cent from proposed levels, leaving it well below 1 per cent of GDP. \nBeijing bridles at the growing ties between Taiwan, the Philippines and other US allies, accusing them of encirclement, even as it makes its own assessments of the incoming Trump administration.  \nSome analysts counter, however, that Beijing's actions have driven its neighbours closer together. Taiwan has seen hundreds of menacing aircraft on its periphery, while the Philippines has witnessed huge numbers of incursions into its historical exclusive economic zone, much of which Beijing claims.  \nBeijing asserts that more than 80 per cent of the South China Sea is its sovereign territory, with the Philippines, Taiwan, Brunei, Indonesia, Malaysia and Vietnam making competing claims. \nQuestions and insecurity about the incoming US administration have also highlighted Taipei and Manila's dependence on US military funding, which Beijing strongly opposes. \nIn 2023, the most recent figures available, US military funding for Taiwan was US$135.7 million and US$42.3 million for the Philippines.  \nIn August, Washington announced an additional US$500 million in aid to Manila for military infrastructure, troop capabilities, diplomatic initiatives and overall deterrence. \nTaiwan, at least, has seen its share of shifting political winds, its lawmakers say, and will weather the vagaries ahead. \n\"I'm not saying that the US is not important. The US is of utmost significance,\" Chen said. \"But please make sure and see that Taiwan has the confidence to defend ourselves, to defend our democratic way of life.\" \nUS-China relations, fractious during Trump's first term, have deteriorated further under Biden even as Beijing has increased pressure on Taiwan and the Philippines. And while Biden and President Xi Jinping managed to put a floor under their relations during a November 2023 summit, it remains unclear whether this will continue under Trump. \n\"Such is the deterioration of bilateral relations, that it is vital for the two countries to have clear lines of communication and well-established trust-building mechanisms as existed during the Cold War,\" said John Hemmings, a senior adviser at the Pacific Forum in Hawaii.  \nWhile Trump has been powering a more go-it-alone America, some of that shift predates him, as the US has become less willing to shoulder the responsibilities of global policeman. \n\"Some people in Taiwan, no matter who is president, are already worried whether there will be a selling out of Taiwan in the future,\" said Yeh-Chung Lu at the Taiwan Foundation for Democracy. \"More Taiwanese people are cautious that there will be some conflict across the Taiwan Strait.\" \n \"We feel very insecure,\" he added. \"China is so big. Taiwan is so small.\"\n"
  },
  {
    "id": 1706,
    "title": "Philippines, China and America in the SCS",
    "created_at": "2025-01-19",
    "text": "\n The latest news from the South China Sea (SCS) was that the Philippine Navy was holding exercises around Panatag (Scarborough) Shoal. This area has become a hotly-contested area between the Philippines and China.\nIn 'America and the Philippines Should Call China's Bluff,' an article last year by Marites Danguilan Vitug in Foreign Affairs, she said: '...Manila, with the support of the United States, must look beyond temporary negotiations with China and craft a longer-term approach for mitigating risks in the SCS. Marcos must calibrate his policy of transparency on Chinese provocations to spotlight Beijing's bullying tactics while also maintaining visibility front against Chinese territorial violations. And Manila must be clear on what it expects from Washington, namely, US support in routine Philippine naval activities such as supply missions in areas that fall within the country's exclusive economic zone.'\nVitug also issues a warning in the same article: 'If the United States fails to provide its ally with the necessary support, Washington and Manila may both be thrown into the kind of escalatory spiral with China that they desperately want to avoid.'\nThis article was written when Biden was still president. However, the issues that Vitug raised here have become even more relevant with the new Trump administration coming into power this week. The big question for the Philippines is what the policy of the incoming administration will be towards China and the Philippines.\nWhile president-elect Trump has not said anything regarding his policy, he did say during the campaign period that China is the main adversary of the United States. During the Cabinet confirmation hearings, the testimonies of the incoming Secretary of State Marco Rubio and the incoming National Security Council adviser Mike Waltz can give us indications of what the policies will be regarding this part of the world. Rubio said that opposing the Chinese Communist Party should be the focus of the new administration. As Secretary of State, he would likely try to strengthen US alliances in Asia to try to deter China from aggressive military action.\nHe specifically mentioned that the United States should maintain its commitments to two vital allies, namely Taiwan and the Philippines.\nSecretary Rubio, however, may have to contend with president Trump's skepticism of old allies, believing that American allies in both Europe and Asia are 'free riders' who rely too much on American military protection.\nThe confirmation hearing for the designated Secretary of Defense Pete Hegseth was both comical and distressing because of his ignorance. He was asked how many nations are members of the Association of Southeast Asian Nations (ASEAN). His reply was that the United States has allies in Japan, South Korea and Australia. He was told by the senators that these countries were not in Southeast Asia.\nVitug in her article said that the Philippines must have a long-term strategy in dealing with China. Any long-term strategy, however, must wait until we are clear what the long-term strategy of the US under its new administration will be. One possible problem is that Trump is known to be a transactional leader and has no long-term strategy. This is the same characteristic that will make him an unpredictable president.\nIt may be advisable for the Philippine government to try and formulate a long-term independent foreign policy that will remain constant without depending on any alliance.\nThe main strength of the Marcos administration is that according to a Pulse Asia survey, 76 percent of respondents agreed that the Philippines should continue asserting the country's rights in the West Philippine Sea. In the same survey, 74 percent wanted the Philippines to work with the United States. Only 5 percent of Filipinos favored working with China.\nThe one thing that the Philippines can undertake on a long-term basis is to consolidate alliances with other countries, especially with Australia and Japan who have similar fears regarding China. Another area for developing alliances is with the other ASEAN countries, although Vitug's article sounds as if she is not confident that this can be done. According to her, some member-countries such as Cambodia and Laos are 'dependent on China for investments and aid' and are therefore 'uninterested in speaking out against Beijing.'\nIndonesia, the largest ASEAN country, is not a claimant country and has borrowed heavily from China. The Philippines' best hopes for possible alliances are Vietnam, Malaysia and Brunei who also have maricreated_at disputes with China.\nSo far, President BBM has said that the Philippine red line is if a Filipino service member is killed in the WPS. This will trigger the Philippines to invoke the Mutual Defense Treaty with the United States.\nThe Philippines and China have so far avoided a major conflict by reaching several short-term deals with each other. But recent events show that China is not backing down and the Philippines under President BBM has also no intention of backing down. It is therefore necessary for the Philippines to clarify what it can expect from the United States in the event that tensions escalate in the SCS.\n"
  },
  {
    "id": 1707,
    "title": "Cooperation needed as China won't back down - experts",
    "created_at": "2025-01-19",
    "text": "\n With no end in sight to China's aggressive actions in regional waters which it supports with disinformation, neighboring nations and allies that follow the rule of law should respond by further strengthening their cooperation and partnerships.\nThis was the consensus among participants of a forum on Japan-Philippines strategic cooperation last Friday organized by the Stratbase Institute.\n'If like-minded countries will cooperate against China, if all of us could enhance the level (of cooperation) against China, the cost on China will be so much. That means China will feel larger costs if they continue to adopt its aggressive attitude towards us,' China studies expert and University of Tokyo professor Dr. Shin Kawashima said.\nBeijing, he said, is expected to continue pursuing its policy of intimidation and spreading of disinformation and false narratives in asserting its illegal claims in the West Philippine Sea, Senkaku Islands and Taiwan.\n'China will not stop their operations. Maybe they will slow down temporarily but from a long-term view, China will not stop, especially given their strong strategy to go beyond the First Island Chain,' he said.\nThe Chinese, through its coast guard, escalated tensions in 2024 by firing water cannons at Philippine vessels, ramming some of them and aiming military-grade laser at their crew.\nIn one instance, China coast guard crew even boarded a Philippine boat and destroyed its navigational and communications equipment.\nIn Japan, approximately 1,300 Chinese government ships swarmed the waters surrounding the Senkaku Islands, marking a record high for the third consecutive year.\nIn the same year, over 3,000 Chinese military aircraft breached Taiwan's Air Defense Identification Zone, setting another new record.\nKawashima said the severity of China's possible future actions in the WPS will depend on the response of the incoming Trump administration.\n'China will experiment with the Trump administration's attitude, whether it will be hard line or soft line. If the Trump administration adopts a soft attitude, China will enact more aggressive policies,' he explained.\nStratbase president Dindo Manhit, for his part, highlighted the strategic importance of the Reciprocal Access Agreement (RAA) between the Philippines and Japan, which was ratified by the Philippine Senate on Dec. 16.\n'The RAA sends a resounding message that the Philippines and Japan will stand resolute in the Indo-Pacific. It is crucial for the Philippines and like-minded partners, such as Japan, to deepen strategic cooperation to uphold peace and stability in the Indo-Pacific,' he pointed out.\n'Fortunately, our leaders are more engaged than ever, actively participating in dialogue, open to new agreements and committed to forging partnerships that strengthen collective efforts in addressing regional threats,' Manhit said.\nThe RAA aims to strengthen the cooperation between the Armed Forces of the Philippines and Self-Defense Forces of Japan, including by allowing the Self-Defense Forces of Japan to engage in advanced training alongside Philippine and US forces, particularly during Balikatan, Kamandag and Sama-Sama exercises.\nJapanese Ambassador Enzo Kazuya said Japan is determined to unlock the full potential of its relationship with the Philippines.\n'Once the RAA comes into effect, our level of cooperation will enter a new phase. We will continue to fortify our security and defense cooperation with allies and like-minded partners such as the US and Australia, sending a powerful message of our unwavering commitment to regional peace and stability, anchored on the rule of law,' Kazuya said.\nStronger resolve\nMeanwhile, the National Security Council (NSC) vowed to further strengthen the resolve to protect and preserve the nation's sovereignty in the WPS, following results of an OCTA Research survey, which said 84 percent of Filipinos strongly support the national government's efforts to assert its maricreated_at rights.\n'We will continue to emphasize sustainable fishing practices, marine conservation and the protection of all economic activities in the WPS, especially those of our fishermen,' National Security Adviser Eduardo Año said in a statement.\nAño noted that 'the unity and awareness shown by Filipinos across all regions, socio-economic classes and both rural and urban areas are vital as we continue to address these challenges.'\nThe national security adviser also said that such affirmation from the people reflects a shared commitment to protect the national sovereignty and territorial integrity and demonstrates a clear and widespread understanding of the issue's importance.\n'With 91 percent of Filipinos aware of the ongoing territorial disputes, it is evident that the public is not only informed but also united in supporting the country's efforts to defend its rights and interests in the WPS,' he added.\nAño stressed that in this context, it is essential to highlight that the Philippine government is acting in full accordance with both domestic and international law.\n'The Philippine Maricreated_at Zones Law and the Philippine Archipelagic Sea Lanes Law provide the legal framework through which the government asserts control over our maricreated_at zones and secures the rights of our people,' he declared.\n'These laws are aligned with the United Nations Convention on the Law of the Sea (UNCLOS) and the 2016 Arbitral Ruling of the Permanent Court of Arbitration, which decisively rejected claims inconsistent with Philippine sovereignty in the South China Sea, affirming our rights to the waters, islands and resources within the West Philippine Sea. This ruling is binding under international law and remains a cornerstone of our position,' Año said.\n"
  },
  {
    "id": 1708,
    "title": "US, PH conduct maricreated_at drill; 1st for this year",
    "created_at": "2025-01-19",
    "text": "\n-- WARSHIPS and aircraft of the United States and Philippine militaries held exercises in the West Philippine Sea in the South China Sea amid tension between Philippines and China in the contested area. The drills conducted Friday and Saturday under the Maricreated_at Cooperative Activity (MCA) were the first to be held by the two armed forces this..."
  },
  {
    "id": 1716,
    "title": "Singapore: Visit by Minister for Foreign Affairs Dr Vivian Balakrishnan to Langkawi, Malaysia for the ASEAN Foreign Ministers' Retreat, 18 to 19 January 2025",
    "created_at": "2025-01-19",
    "text": "\nKey Highlights:\n* Minister for Foreign Affairs Dr Vivian Balakrishnan attended the ASEAN Foreign Ministers' Retreat in Langkawi, Malaysia on 18-19 January 2025\n* Singapore committed to working with ASEAN Chair Malaysia on digital economy opportunities and sustainability initiatives like the ASEAN Power Grid\n* ASEAN needs to focus on integration, upgrading trade agreements, exploring new multilateral agreements, and concrete projects like the ASEAN Power Grid\nOriginal Press Release:\nJan. 19 -- Ministry of Foreign Affairs, Government of Singapore issued the following news release:\nMinister for Foreign Affairs Dr Vivian Balakrishnan attended the ASEAN Foreign Ministers' Retreat from 18 to 19 January 2025 in Langkawi, Malaysia. The Foreign Ministers discussed ASEAN's priorities, including Malaysia's chairmanship priorities and deliverables, and how ASEAN will respond to various regional and international challenges, including Myanmar.\nThe Foreign Ministers reaffirmed the importance of advancing ASEAN's Community-building efforts. Minister Balakrishnan emphasised Singapore's commitment to working closely with ASEAN Chair Malaysia, fellow ASEAN Member States, and our external partners to realise Malaysia's chairmanship priorities. This includes creating opportunities for our people and businesses in the digital economy through the conclusion of the Digital Economy Framework Agreement this year, as well as promoting sustainability and the energy transition through the ASEAN Power Grid.\nMinister Balakrishnan reiterated Singapore's continued support for ASEAN's vision of an open and inclusive regional architecture and pledged support for Malaysia's efforts to deepen ASEAN's engagements with all of our external partners. Singapore will also work with Malaysia on implementing the Five-Point Consensus and the Leaders' decisions with regard to the situation in Myanmar.\nMinister Balakrishnan also had meetings with Vietnam Deputy Prime Minister and Minister of Foreign Affairs Bui Thanh Son, and Malaysian Minister of Foreign Affairs Dato' Seri Utama Mohamad Hasan during his visit.\nTRANSCRIPT OF MINISTER FOR FOREIGN AFFAIRS DR VIVIAN BALAKRISHNAN'S DOORSTOP INTERVIEW FOLLOWING HIS ATTENDANCE AT THE ASEAN FOREIGN MINISTERS' RETREAT IN LANGKAWI, MALAYSIA, 18 TO 19 JANUARY 2025\nMinister Dr Vivian Balakrishan: We had a very good ASEAN Foreign Ministers Retreat. The general sense is that the world is at an inflection point. Much of the confluence of factors which have contributed to the peace and prosperity of Southeast Asia are now unravelling. Even if they are not actually unravelling, fundamental changes are occurring.\nThe first question is, what are these factors that have contributed to our peace and prosperity?\nNumber one, in Southeast Asia, for the past couple of decades we have had a stable balance of power. We have had peace. We were able to focus on economic development rather than on strategic or military issues. Number two, we have had a system of global economic integration, characterised by free trade, the growth of multinational corporations, their investments, and the development of global supply chains, which in turn have provided opportunities for many Southeast Asian nations to industrialise and to be part of this global network of supply chains. Further to that, we have also in the past few decades, witnessed a world in which tariff and non-tariff barriers have been coming down, and all this has been conducive to global trade.\nNow, this confluence of factors is unravelling. First, we are now moving into a world in which there will be greater contestation, not just between superpowerbut between middle powers and hot spots. (There will also be) active conflicts in parts of the world. In the last few years, we have seen conflicts in Ukraine, Gaza, and tensions in the South China Sea.\nSecond, we are also seeing a world in which there has been a pushback against free trade and economic integration. (It is now) a more protectionist and nationalistic world. This, obviously, is anathema to the development model which Southeast Asia has embarked on.\nThird, the United Nations, not just as a political convening point for all countries in the world, but also its ability to focus on the issues affecting the global commons. For instance, the Paris Agreement, The United Nations Convention on the Law of the Sea (UNCLOS) the Marine Biological Diversity of Areas Beyond National Jurisdiction (BBNJ Agreement), which was presided by Ambassador Rena Lee. This ability to provide global public goods, and to generate consensus is weakening. The conflicts in the last couple of years, in fact, are symptoms of this greater underlying dysfunction.\nThe next question that arises is - what does ASEAN do about all this? I would say there are some preliminary conclusions. First is that ASEAN needs to double down on ASEAN integration, because ASEAN cannot control the agendas of the superpowers, or indeed the larger powers. But we can, and we should focus on integrating ourselves, strengthening our economies, and our connectivity.\nSpecifically in this conference, what we discussed first is how we look forward to upgrading the ASEAN Trade in Goods Agreement (ATIGA).\nSecondly, to upgrade existing free trade agreements with China, the Republic of Korean (ROK) and India. But beyond free trade agreements, to also explore new multilateral agreements. For instance, we are also negotiating the ASEAN Digital Economy Framework Agreement, which will enable us to harvest the new and emerging opportunities that the digital technologies provide. Beyond agreements, we are also looking at concrete things on the ground. For instance, the ASEAN Power Grid, which would interconnect the energy systems across ASEAN. This will enable a more stable and a more cost-effective way of making that transition into both energy efficiency as well as green and sustainable energy, but it requires a multilateral, forward looking and long-term vision to achieve. All these are examples of what ASEAN can do to increase trade, investments and connectivity within ASEAN itself. So that is the first theme - ASEAN integration.\nThe second theme that we discussed was the convening ability of ASEAN. For instance, the East Asia Summit, which occurs every year at the ASEAN Summit. ASEAN is at the centre of it. We engage not only the larger powers, but also middle powers. Virtually everyone who has a stake and is relevant to ASEAN is represented, and we look forward to this meeting that will be chaired by Malaysia as Chairman of ASEAN, to be able to generate some form of consensus and alignment amongst ASEAN and all our major economic partners. That is the second aspect.\nThe third is a more intangible but no less important point, which is that as the old structures underpinning the global strategic geopolitical architecture get eroded, it is important for ASEAN to maintain its unity, its cohesion, its adherence to principles and to international law, and to engage with all the major powers in an omnidirectional, principled, deliberate and careful way. Careful so that we do not become entangled in super power contestation, but at the same created_at, we maximise our strategic latitude, our right to choose our own destinies, and to do so by making common cause by adherence to long-held principles which lead to fairer, equitable and constructive outcomes for all of us. That is what I mean by an omnidirectional engagement of the rest of the world.\nThe fourth aspect is, for ASEAN to do all this, we also need to look into our own backyard. Unfortunately, the problems in Myanmar are nowhere near resolution. Actually, there has been no progress, and we have reaffirmed the centrality of the ASEAN Five-Point Consensus. Myanmar remains an integral member of ASEAN, but it needs to sort itself out. It needs national reconciliation. To the extent that ASEAN can act as a convener for all the different stakeholders in Myanmar to come together, we will seek national reconciliation in a long standing, fair and forward looking way. Then Myanmar can come together and get on this bandwagon, and we can hopefully safely navigate this emerging world. All in all, this was a very good, very candid, open and constructive meeting the past two days in Langkawi.\nNoah Kong (CNA TV): I would like to ask a bit more about what you mentioned, about nationalism and protectionism and the broader trend in the world. Can you elaborate on ASEAN's strategy to adapt to these global dynamics in the year ahead? And should we be concerned about protectionism, even within ASEAN?\nMinister: First, you need to take a step back and understand that all over the world, free trade on its own and taken to extremes without adequate attention to social safety nets, without attention to your citizens, skills, education and capability to take on new jobs. If you do not have your social and your educational and your economic agendas in sync, you will then get problems and you will get a domestic pushback. And this, in fact, is what is happening in many parts of the world. So, it is important not to just be upset about the rise of nationalism or the pushback against global trade, but to try to understand that point.\nAnd then domestically, as in the case of Singapore, we are focusing on Skills Future, on improving and always evolving our education system. We are focusing on jobs and making sure that whilst you cannot stop the progress of technology and you cannot stop economic transformation, this has to be accompanied, hand in hand, with making sure our people are ready and prepared for the new jobs and have sufficient assurances from the social security safety nets that they will get through this transformation. So that is the first thing. It is domestic.\nDo I anticipate a rise in nationalism and anti-trade sencreated_atnt within ASEAN? I think I am a lot more hopeful. Within ASEAN, first of all, all of us know that we are part of a global supply chain, and if we were to erect barriers either against the world or against each other, this will be a lose-lose proposition. So, I am confident that the leadership across all ASEAN countries understands what is in the long-term interest, and that we will therefore focus on uplifting the capacity of our people, and this will give us the ability to continue integrating and making the overall ASEAN economy more efficient and to grow as quickly as possible.\nI should add that, despite all the anxieties at the global economy level, the prospects for the ASEAN economy still remain good in terms of our growth potential. Not just over one year or two years, but over the next two three decades. If you add up the combined GDP (Gross Domestic Product) of ASEAN, we should be able to get to number four or number five within the next two decades or so, on a global stage.\nIf you look even in terms of trading patterns, if you ask China who is your largest trading partner, you will see that ASEAN has overtaken the US and the EU. So, my point is, in the case of ASEAN, we have had good growth in the past three decades. We anticipate good growth for the next couple of decades, so long as there is peace and so long as the world does not completely fracture, and so long as we maximise space for us to grow economically, to grow together, and to grow a collective as ASEAN.\nSeoow Juin Yee (Lianhe Zaobao): Minister, what is Singapore's perspective on ASEAN's collective approach to the Myanmar issue, particularly in light of the fact that some of the member states independently engage with Myanmar's military government. And in your view, can Malaysia's chairmanship achieve tangible progress in this regard?\nMinister:I will put it this way-we all have a stake in Myanmar's stability, peace, and reconciliation. Having said that, some members of ASEAN, for instance, their immediate neighbours, have greater vulnerabilities to instability, violence, drug trafficking, illegal activities, and even the outflow of refugees. So, the vulnerabilities may differ across ASEAN.\nBut the larger point is that all of us want to achieve national reconciliation within Myanmar through a Myanmar-owned and Myanmar-led process. None of us want to interfere in the internal affairs of our fellow ASEAN member. So, in that respect, the more channels of communication and the more potential arenas for all the different stakeholders in Myanmar to come together, the better. I do not look at all these efforts to maintain communications, to open new channels and to convene the different stakeholders together, separately. These are not mutually exclusive. In fact, the more the better.\nAmir Yusof (CNA Digital):In the pursuit of joining BRICS, some ASEAN countries have forged closer ties with the likes of Russia, China and the Global South. Given the context of the global geopolitical tensions that you spoke about, should Singapore be concerned with these developments?\nMinister:Again, let us try to understand why over the last few years you have seen the growth of BRICS. You have seen AUKUS and the Quad develop, and a variety of other regional and sub-regional architecture. Basically, this is a period of uncertainty, and countries are trying to expand their networks, build new opportunities economically, make more friends and hedge or keep their options open. So, that is why you are seeing this proliferation of new or expanding architectures.\nFrom Singapore's point of view, we have good relations with all the members of these new architectures. The second point is that Singapore takes memberships, commitments, responsibilities and liabilities very seriously. So, my attitude to BRICS and other emerging architectures is to keep an open mind. I would first assess whether there is strategic coherence behind these groupings. What is their alignment? What do they stand for? What is on their agenda? Does this promote peace and prosperity? And to the extent that they do, and where the agendas overlap, Singapore will be quite happy to work with them, either in groups or even bilaterally. (Singapore will) keep an open mind and continue to keep monitoring strategic and economic coherence.\nBeyond that, we are looking to make friends and common cause with as wide a spectrum as possible. Not just with people, but with as many states as possible. But this kind of engagement cannot be based on an enforced agreement or being forced to choose sides for or against any party. As I mentioned earlier, we believe in an omnidirectional engagement of all strategic stakeholders at a global level.\nMy bottom line is, we keep our options open. We are not against the emergence of these groupings and where possible, if we can work together with them, we will happily do so. As for membership, we will have to look far more carefully before we sign on to anything.\nTan Min-Wei (Mothership): Is Singapore's, and to a certain extent, the whole of ASEAN's, commitment to the ASEAN Power Grid a vote of confidence in the long-term stability of ASEAN states, and that situations like Myanmar represent an aberration?\nMinister: I certainly hope situations like Myanmar will be an aberration, for the future of ASEAN. But let us set that one aside temporarily, and ask ourselves, what does the development of an ASEAN Power Grid portend?\nFirst, if ASEAN economies were not growing, we would not need to do this. Second, we all have a collective commitment to make the system for the electrical grid more stable, cost-effective, and green. We know that in designing these systems, the more you can raft different systems together, carefully and in a structured way, the better.\nThird, it also gives ASEAN another opportunity to prove that a collective approach to getting things done and long-term projects which require confidence in the future, and which require governments to have reliable, long-term, stable regulatory regimes as well as good diplomatic and economic ties, both bilaterally and multilaterally, (works). So that is why I view this as an important icon of ASEAN integration and of ASEAN's potential for the future.\nI could give you another example. For instance, we all know in Singapore, we have digital payment systems such as FAST, PayNow. You may also be aware that, in fact, we have already linked our digital payment systems to Malaysia. They call it, DuitNow. With Thailand, there is PromptPay, and with India, through their UPI (Unified Payments Interface) system. The project which we are now working on is called Project Nexus, which, will facilitate the easier onboarding of other countries for them to interconnect their digital payment systems. So again here, I think it is no accident that for cross border digital payments, ASEAN is taking the lead. Our pioneering work in linking our payment systems to Thailand, Malaysia, India- Indonesia is also watching this space very closely- is another example of how ASEAN integration can often be a nucleus and a working prototype of the future. So, I remain optimistic. I believe that these projects are important. I am not going to trivialise and say that these are simple and easy to execute both over one or two years, but the strategic direction is clear, and to the extent that these ASEAN meetings and summits maintain alignment and a confluence of interest at the highest level within our ASEAN countries, I think this is a good sign.\nTan Tam Mei (Straits created_ats): In the context of incoming US President Mr Trump, who is talking about protectionist policies, and tariffs. Is ASEAN ready to deal with this shift by a key partner, and is there anything that is going to change about ASEAN priorities and strategies?\nMinister: Well, like I said just now, I always resist oversimplifying other countries' responses. And as I said, you first have to ask yourself why America is apparently changing direction, and as I have alluded to earlier, it has got to do with their own domestic sense of opportunity, fairness and preparedness for the future.\nAmerica has to sort out its own domestic political policy arrangements in order for it to have the confidence to deal with the rest of the world the way it has very generously done for 80 years, since the end of the Second World War. We should not get into a labelling or pejorative exercise. President Trump will be inaugurated tomorrow. We look forward to his inauguration, and to the policies, and we will have to make the necessary adjustments even as he makes changes to his policies.\nBut the key point I am making is that ASEAN will continue to double down on our own integration, enhance our own trade and investment environment within ASEAN, enhance our own connectivity, and make ASEAN as competitive as possible, as a trading partner, as an investment destination, or even as an investment source. (These can be achieved) by having long-term policies which are consistent, which are reliable, which are trustworthy, and to keep open engagements in an inclusive way with all the major powers- America, China, Europe, India, Japan.\nAnd you will notice increasingly, particularly in the case of Singapore, we are paying attention to Africa and to South America, as well as establishing free trade arrangements, with MERCOSUR with the Pacific Alliance. In these places, their governments have a very wide diversity of economic perspectives from hard right to hard left. But you notice, even in those cases, they are open to, and they are keen to build economic ties with us in Singapore and in ASEAN.\nThe point is the world is changing. The changes start at home. These domestic changes will have an impact on foreign policy, and it is important in the conduct of foreign policy not to rush to judgment, to stay calm, stay consistent, be constructive, be open and be inclusive. I am convinced that these will be the attributes of our approach, even as the world goes through this inflection point.\nTan Tam Mei (Straits created_ats): A quick question about the issue of cross border crimes like online scam. Has it been discussed?\nMinister: In the past and even now, there is worry about the opium triangle. Drugs unfortunately, are still a clear and present threat. But beyond drugs, (there are) now scams and other crimes will take advantage of interconnected digital economies. And again, this illustrates, just as it is in the case of drug trafficking, the need for a collective approach. Of course, we are far stricter about these things in Singapore, but Singapore also has to work with all our partners. So, that is the other reason why you need to have stability across every single member of ASEAN. Otherwise, you will have pockets where criminal syndicates can park themselves and from wherever they are, they can do a lot of harm to our people. Again, (we need to) work together and work in an open and inclusive way.\nSabrina Ng (CNA TV): Given that it is the 60th anniversary of ASEAN in two years, and it is the year that Singapore is chairing, what are Singapore's plans or area of focus for its championship?\nMinister: That is two years from now. I am not in a position to say what our themes would be, but as you would have ascertained from my comments in the last few minutes, I think some things are going to keep us occupied for probably the next decade. As I have said, (these include) integration, trade, investments, digitalisation, interconnectivity and keeping ASEAN competitive, relevant, and having a place at the main table, and to engage in a way in which we are taken seriously and relevant to global community. These may sound aspirational, and honestly, it is not something you can take for granted. I am not setting an agenda for 2027 when we will chair ASEAN, but I am saying that these are issues we need to think through carefully and to work on closely and collaboratively with our partners in ASEAN.\n[Category: Events]\nSource: Ministry of Foreign Affairs,Government of Singapore\n"
  }
]