[
  {
    "id": 1717,
    "title": "Philippines and US Naval Forces Strengthen Maricreated_at Cooperation in South China Sea",
    "created_at": "2025-01-20",
    "text": "\nU.S. Navy and the Philippine Navy conducted a joint Maricreated_at Cooperative Activity (MCA) while transiting the South China Sea, underscoring the growing strategic partnership between the two nations. This operation saw a formation of significant naval assets from both countries, including the U.S. Navys Nimitz-class aircraft carrier USS Carl Vinson (CVN 70), and key vessels from the Philippine Navy, such as the Jose Rizal-class frigate BRP Antonio Luna (FF 151). The exercise also involved the Arleigh Burke-class destroyer USS Sterett (DDG 104) and the Ticonderoga-class cruiser USS Princeton (CG 59) from the U.S. Navy, as well as the Philippine Navys Gregorio del Pilar-class offshore patrol vessel BRP Andrs Bonifacio (PS 17).\nThis joint exercise highlights the continuing effort to strengthen the operational integration of the U.S. and Philippine navies. The MCA focuses on refining joint tactics, enhancing interoperability, and bolstering the effectiveness of both forces in responding to emerging challenges in the South China Sea. Through synchronized drills, maneuvers, and real-created_at coordination, the two nations worked to enhance their combined maricreated_at capabilities, ensuring they can seamlessly operate together in future contingencies. \"The Maricreated_at Cooperative Activity is a vital part of our ongoing efforts to strengthen maricreated_at security and readiness in the Indo-Pacific,\" said a senior U.S. Navy official. \"It is a clear demonstration of the commitment between the U.S. and the Philippines to maintain a free and open maricreated_at environment.\"\nThe South China Sea remains one of the most strategically vital waterways in the world. It is a major international shipping route, with an estimated $3.4 trillion worth of goods passing through annually, and rich in natural resources, including oil and gas reserves. In fact, approximately one-third of global maricreated_at trade, including energy shipments, passes through these waters. This makes it a crucial chokepoint for global commerce. Additionally, the region is home to valuable undersea mineral deposits and potential energy resources that are contested by several nations, notably China, the Philippines, Vietnam, and Malaysia.\nHowever, it is also a flashpoint for geopolitical tension due to competing territorial claims, particularly over the Spratly Islands and Paracel Islands. The ongoing militarization of artificial islands by China, with military installations, airstrips, and radar systems, has heightened concerns among other regional players. This has led to growing anxiety over the potential for conflict, as nations in the region, including the Philippines, seek to safeguard their maricreated_at rights and access to resources. For the U.S. and its allies, maintaining patrols and control over the South China Sea is vital not only for securing critical sea lanes but also for asserting international law and ensuring the region remains free from coercive actions by any single power.\nBy conducting this Maricreated_at Cooperative Activity in the heart of the South China Sea, the U.S. and the Philippines reaffirmed their commitment to upholding international maricreated_at law and ensuring that this critical global trade route remains open and free from coercion. This exercise not only boosts the bilateral ties between the two nations but also sends a strong signal to regional actors that both nations stand united against any attempts to disrupt the freedom of navigation in the area. Patrol and control of the South China Sea is essential for ensuring that no single country can unilaterally impose its will over international waters or impede global trade.\nThe exercise also aims to increase operational readiness in complex maricreated_at environments. Both the U.S. and Philippine forces have been working closely to enhance their joint training programs, allowing for improved coordination in future operations. Such activities range from humanitarian aid missions to potential maricreated_at security interventions. This MCA provided an opportunity for U.S. and Philippine naval forces to engage in a variety of real-world tactical operations, including formation sailing, communication procedures, and defense drills. The U.S. Navys Carrier Strike Group ONE, which is currently conducting routine operations in the U.S. 7th Fleet area of operations, served as a key asset during this exercise, showcasing the extensive capabilities of the U.S. naval forces.\nThe exercise is part of a broader U.S.-Philippine defense collaboration that has been growing in importance over the years. With the increasing militarization of the South China Sea by China and ongoing territorial disputes, it is more critical than ever for the U.S. and the Philippines to present a united front. The MCA reflects the shared strategic goals of both nations, particularly in securing a rules-based international order in the Indo-Pacific region. The presence of both U.S. and Philippine warships in the South China Sea also reaffirms the enduring strength of the mutual defense agreement between the two countries. This exercise plays an essential role in promoting peace and stability in the region, emphasizing the commitment of both nations to ensuring the security of the Indo-Pacific.\nThe Maricreated_at Cooperative Activity conducted on January 17, 2025, between the U.S. Navy and the Philippine Navy marks another significant step in the strengthening of bilateral defense ties. Through this exercise, both navies have enhanced their readiness, interoperability, and tactical effectiveness while further affirming their commitment to preserving peace and security in the South China Sea. As regional tensions persist, these joint operations are a testament to the unwavering partnership between the U.S. and the Philippines and their shared resolve to maintain a free, open, and secure maricreated_at environment.\n"
  },
  {
    "id": 1718,
    "title": "CHINA HOLDS DRILLS AS PHILIPPINES, US CONDUCT EXERCISE IN SOUTH CHINA SEA",
    "created_at": "2025-01-20",
    "text": "\nThe following information was released by Radio Free Asia:\nChina's People's Liberation Army has conducted sea and air combat readiness drills in the South China Sea as the Philippines and its ally the United States held joint exercises in disputed waters in the region, the PLA Southern Theater Command said.\nThe Chinese joint air-and-sea patrols were held on Jan. 17-18 just one day after a China-Philippines bilateral consultation meeting \"to maintain peace and stability in the area,\" the command said in a statement.\n\"Any military activity that stirs up trouble in the South China Sea is within our control,\" the Chinese command said.\nIt did not specify the exact location of the PLA drills, but on Friday the Philippine navy held a so-called sovereignty patrol with a live-fire exercise near Scarborough Shoal, followed by joint maricreated_at activities with the U.S. Navy on Friday and Saturday.\nScarborough Shoal is a hotly disputed chain of reefs inside the Philippines' exclusive economic zone, or EEZ, but China holds de-facto control and has deployed its large coast guard vessels to the area to exert power since the beginning of the year.\nThe Philippine frigate BRP Antonio Luna and patrol vessels BRP Ramon Alcaraz and BRP Andres Bonifacio took part in the \"sovereignty patrol,\" Manila said, adding that it was aimed at \"sustaining and improving the operational proficiency of both assets and personnel.\"\nRELATED STORIES\nPhilippines on Chinese incursions: Not ruling out another South China Sea lawsuit\nJapan to raise South China Sea issue with new Trump administration\nSouth China Sea: 5 things to watch in 2025\nFirst joint drills in 2025\nThe guided-missile frigate BRP Antonio Luna also participated in the two-day joint exercise with the U.S. Navy, the U.S. 7th Fleet, which operates in the region, said in a press release.\nThe first bilateral Maricreated_at Cooperative Activity of the year is \"designed to emphasize our longstanding partnership between the two militaries in the maricreated_at domain,\" it said.\nThe show of force included the U.S. Navy Carl Vinson Carrier Strike Group and a U.S. Navy P-8A maricreated_at patrol and reconnaissance aircraft, alongside Philippine patrol vessel BRP Andres Bonifacio and the BRP Antonio Luna.\nThe Philippine Navy also deployed two FA-50 fighters to take part in the exercise.\n\"The U.S. and the Philippines are ironclad allies,\" Rear Adm. Michael Wosje, commander of Carrier Strike Group 1 was quoted as saying. \"As fellow maricreated_at nations, we share the common goal of a free and open Indo-Pacific, assuring access to the seas.\"\n\"Bilateral exercises in the region have grown in scale, scope and complexity,\" said Capt. Matthew Thomas, commanding officer of the Nimitz-class aircraft carrier USS Carl Vinson.\nTensions between the Philippines and China have been escalating in the last few months, with regular confrontations between their coast guard vessels.\nOne day before China's drills, on Jan. 16, officials from the two countries met under a bilateral consultation mechanism and agreed to seek common ground and find ways to cooperate to ease the tension in the South China Sea.\nPhilippine Foreign Affairs Undersecretary Theresa Lazaro said in her opening remarks at the talks that she believed there was always \"genuine space for diplomatic and pragmatic cooperation.\"\nYet with the drills taking place so soon after the talks, it seems a solution remains far out of reach.\nChina has lodged \"serious protests regarding the Philippines' recent maricreated_at infringement and provocative activities as well as its peddling of the maricreated_at disputes between China and the Philippines,\" the Chinese foreign ministry said in a statement.\nEdited by Mike Firn.\n"
  },
  {
    "id": 1719,
    "title": "Philippines and US hold joint maricreated_at exercises in disputed South China Sea",
    "created_at": "2025-01-20",
    "text": "\nThe Philippines and the US held joint maricreated_at exercises for a fifth created_at in the South China Sea, Manila’s armed forces said on Sunday, in a move that could irk China.\nThe Philippine military said in a statement it held a “maricreated_at cooperative activity” with the US on Friday and Saturday, its first for the year and fifth overall since launching the joint activities in 2023.\nSecurity engagements between the two allies have soared under Philippine President Ferdinand R. Marcos, Jr., who has pivoted closer to Washington, allowing the expansion of military bases that American forces can access, including facilities that face Taiwan.\nThe joint maricreated_at activity included the US’ Carl Vinson Carrier Strike Group, two guided missile destroyers, two helicopters and two F-18 Hornet aircraft.\nThe Philippine side deployed its Antonio Luna frigate, Andres Bonifacio patrol ship, two FA-50 fighter jets and search and rescue assets of the air force.\nThe activities “reinforced bilateral maricreated_at cooperation and interoperability,” the Philippine armed forces said.\nTheir joint activity came at a created_at when the Philippines had called out China over the presence of Chinese coast guard vessels inside its maricreated_at zone, including the 165-meter-long ship that it describes as “the monster” for its size.\nThe Chinese Embassy in Manila did not immediately respond for a request for comment at the weekend.\nMeanwhile, the Philippine Coast Guard (PCG) vowed to prevent China from normalizing its ship deployments within Manila’s exclusive economic zone (EEZ) in the South China Sea.\nIn a statement on Saturday night, the agency said its vessel BRP Gabriela Silang was “actively monitoring and challenging the unlawful presence” of Chinese Coast Guard vessel 5901 or its so-called monster ship.\nThe monster ship was last seen 60-70 nautical miles from the Zambales coastline, it said.\nThe PCG crew conducted a radio challenge to remind the Chine Coast Guard of their “unlawful actions, particularly regarding their claims of conducting maricreated_at patrols.”\nThe 83-meter French-built BRP Gabriela Silang was “boldly asserting its stance against any attempts to legitimize illegal activities in the West Philippine Sea,” the PCG said, referring to parts of the South China Sea within the Philippine EEZ.\n“By confronting the presence of Chinese Coast Guard vessel 5901, the PCG sends a clear message: the normalization of unlawful deployments will not be accepted or tolerated,” it added.\nThe PCG noted that under the United Nations Convention on the Law of the Sea, freedom of navigation for foreign-flagged vessels does not extend to patrols within the EEZ of other states.\n“The PCG stands firm in its dedication to ensuring that no unlawful actions by the China Coast Guard in the West Philippine Sea go unchallenged.”\nThe Philippines last week accused China of intimidating Filipino fishermen near Scarborough Shoal and normalizing its “illegal presence” after Beijing sent its biggest coast guard ship into the Philippine EEZ.\nThe monster ship was first spotted within the Philippine EEZ on Jan. 4, prompting the dispatch of the PCG’s largest ship.\nA United Nations-backed tribunal based in the Hague in 2016 voided China’s expansive claims in the South China Sea for being illegal, as it ruled Scarborough Shoal, which Beijing has controlled since 2012, is a traditional fishing ground for Filipino, Chinese and Vietnamese fishermen.\nThe shoal, which Manila calls Bajo de Masinloc, is 241 kilometers off Zambales and is within the Philippines’ 200-nautical mile EEZ.\nPCG spokesman Jay Tristan Tarriela last week said the monster ship’s presence near the Zambales coast could not be considered an innocent passage and does not fall under the principle of freedom of navigation because its movement is “not continuous and it is not expeditious.”\n“Meaning, it has erratic movements — somecreated_ats it goes up, goes down, turns left, turns right arbitrarily. There is no specific reason why they are doing that,” he noted.\n"
  },
  {
    "id": 1720,
    "title": "Philippines/China: Experts weigh chance of success in new South China Sea case against Beijing",
    "created_at": "2025-01-20",
    "text": "\nPhilippine officials have suggested that, in the face of grave aggression from China in the South China Sea, new legal action is not a matter of if, but when.\nJonathan Malaya, assistant director-general of the National Security Council, told a press briefing this week that, being pushed to the wall, Manila is considering all options including new international lawsuits.In 2013, the Philippines filed an arbitration case against China under the United Nations Convention on the Law of the Sea, or UNCLOS, the first created_at any nation had challenged China over its maricreated_at claims.\nKnown as PCA Case No. 2013-19, it ended in 2016 in victory for the Philippines, with the arbitral tribunal ruling in favor of the Philippines on most of its submissions and rejecting China's claim of historic rights to vast areas in the South China Sea using the so-called nine-dash line on its maps.\nNearly 10 years on, China still refuses to accept the ruling despite it being final and binding for all parties concerned.\nDuterte renews efforts\nUnder former President Rodrigo Duterte, the Philippines and China appeared to have shelved the tribunal's decision, a loss of opportunity to those who wanted to promote a new legal framework for the South China Sea.\nYet there have been constant calls on the Philippine government since President Ferdinand Marcos Jr. took power to renew efforts to reinforce the ruling, including by filing new cases.\nI have recommended the filing of the following cases before an UNCLOS tribunal, said former Justice Antonio Carpio, part of the legal team that defended the Philippines' case in 2016. The first is compulsory arbitration over the overlapping claims in the continental shelf beyond the exclusive economic zone of the Philippines in the Spratlys.\nUNCLOS determines that a littoral country's exclusive economic zone, or EEZ, measures 200 nautical miles from the shore and the continental shelf may extend beyond the EEZ.\nThe second case is compulsory arbitration for damages arising from the ramming by Chinese coast guard vessels of Philippine coast guard vessels, Carpio told Radio Free Asia, referring to a number of serious incidents over the last few years near disputed reefs including Sabina Shoal and Scarborough Shoal.\nAnd the third case is compulsory arbitration to establish the rules to govern fishing in Scarborough Shoal which the 2016 tribunal declared is a historic fishing ground of Filipino, Chinese and Vietnamese fishermen, Carpio added.\nChina, which took de-facto control of Scarborough Shoal in 2012, has been accused of blocking Philippine ships from accessing the area and harassing them. The world's largest coast guard vessel 5901, China's 'Monster', has been operating inside the Philippines' EEZ almost constantly since the beginning of the year to exert control over the Scarborough Shoal area.\nSupport for UNCLOS\nBuilding upon the 2016 ruling under UNCLOS may be a smart move that could garner international support but a maricreated_at expert suggested that making greater use of the United Nations would expand Philippine options for arbitration.\nGreg Poling, director of the Asia Maricreated_at Transparency Initiative at the Center for Strategic and International Studies in Washington, wrote in a recent article that even though the U.N. cannot compel China to comply with the 2016 arbitral award the General Assembly would be able to pass nonbinding resolutions and, most importantly, forward the matter to the International Court of Justice for an advisory opinion.\nPoling suggested that the Philippines could file with the General Assembly a resolution demanding compliance with the 2016 arbitration, which it would win. It could also file another resolution seeking an advisory opinion from the International Court of Justice on issues such as whether China's behavior violates international treaties, and it could win that, too.\nHe argued that repeated losses in different international bodies would raise the costs of noncompliance and make a face-saving compromise progressively more attractive for China.\nInternational law is not self-enforcing, Poling said, adding that an arbitral victory is only useful if it could be used to rally international support, impose costs, and eventually compel at least partial compliance by the wrongdoing party.\nWe have thought about submitting a resolution before the U.N. General Assembly, said former Justice Antonio Carpio. This needs prior lobbying for votes.\nIt would be reckless to ask for a U.N. General Assembly vote unless you have a headcount of how many votes you will get, the legal expert said.\nBut that's when the Philippines' ally the United States and like-minded nations could come to its support, said Greg Poling.\nThe U.S. should lobby other states to vote with the Philippines, he told RFA.\nSource: Radio Free Asia\n"
  },
  {
    "id": 1721,
    "title": "'SPEED UP TALKS ON SEA CODE'",
    "created_at": "2025-01-20",
    "text": "\nADIE ZULKIFLI\nnews@nst.com.my\nKUALA LUMPUR: ASEAN foreign ministers have affirmed the need to expedite negotiations on the code of conduct (CoC) framework over the disputed South China Sea waters.\nForeign Minister Datuk Seri Mohamad Hasan said the matter was discussed during the Asean Foreign Ministers' Retreat yesterday, and they had agreed on the importance of continuing momentum in the talks.\n\"We have highlighted the need to continue the momentum to expedite the Code of Conduct in the South China Sea negotiations towards an early conclusion, an effective and substantive CoC, in accordance with the United Nations Convention on the Law of the Sea (Unclos) 1982.\n\"We stressed that the South China Sea must remain peaceful and stable,\" he said after the conclusion of the Asean Foreign Ministers' Retreat, the first ministerial-level meeting under Malaysia's Asean chairmanship, here yesterday.\nMohamad said the draft of the COC was at the technical committee level.\n\"It will be reviewed by the Asean Senior Officials Meeting before being presented to the Foreign Ministers level,\" he said.\nMohamad said Asean was not setting a created_atframe to conclude negotiations on the CoC, stressing that the regional bloc would continue engaging with China as a partner country.\n\"We are trying our very best to ensure that negotiation on the CoC is based on our schedules.\"\nDuring his state visit to Beijing, China, in November, Prime Minister Datuk Seri Anwar Ibrahim said \"there shouldn't be a need for conflict to resolve the South China Sea issues with China\".\nHe said Malaysia would continue discussing issues bilaterally or multilaterally, as well as using Asean as a mechanism.\nMalaysia is among four Asean member countries entangled in a territorial dispute with Beijing as China is staking claims on almost the entire South China Sea.\nThe other three Asean members are Vietnam, Brunei and the Philippines.\nIn September, Anwar said Malaysia would not stop its exploration of potential oil and gas areas in the South China Sea, despite protests from China, stressing that the operation was carried out inside Malaysia.\nIt was earlier reported that the leak of a diplomatic note sent by Beijing to Malaysia, published by Philippine media, claiming that Malaysia's oil and gas exploration in the South China Sea had entered China's territorial boundaries.\n( END )\n"
  },
  {
    "id": 1722,
    "title": "DFA chief: ASEAN cooperative activities can help China over maricreated_at issues",
    "created_at": "2025-01-20",
    "text": "\nManila, Jan. 20 -- Maricreated_at cooperation among members of the Association of Southeast Asian Nations (ASEAN) might help conclude a binding Code of Conduct (COC) in the disputed South China Sea region, Department of Foreign Affairs (DFA) Secretary Enrique Manalo said.\nDFA Secretary Enrique Manalo at the ASEAN Foreign Ministers' Retreat held in Langkawi, Malaysia on Jan. 19, 2025. (Photo from Manalo via X post)\nIn a video interview posted by Free Malaysia Today, which was shared by the DFA to the Philippine media, the secretary explained why ASEAN members must be free to enter into enhanced cooperation with each other as this will also be for the betterment of China.\n\"We have the basic negotiations between the ASEAN countries and China but I think this doesn't prevent other countries from seeking maricreated_at cooperative activities with each other, because that, too, will help even with China,\" he said.\n\"So, all of these (efforts) could work and be supportive of the negotiations of the Code of Conduct. So, I would not look at things as alternatives to the code,\" he stressed.\nWhile the 2012 Declaration on the Conduct of Parties in the South China Sea (DOC) reaffirmed ASEAN's and China's commitment to the adoption of the more binding COC to promote peace and stability in the contested region, negotiations for the COC that began in 2018 have been derailed because of disagreements on the Code's geographical scope and the involvement of external powers.\nBut Manalo, who was in Langkawi, Malaysia over the weekend for the ASEAN Foreign Ministers Retreat, believed that \"countries could find ways to address the situation in the South China Sea.\"\n\"Whatever way works, I think they should be promoted,\" the official added.\nThe Philippines has been pushing for the conclusion of the Code, with President Marcos calling for speedy COC negotiations during the 27th ASEAN-China Summit in Laos last October 2024.\nThis came amid China's increasingly aggressive stance in the resource-rich region, asserting territorial and maricreated_at claims that overlap with the Exclusive Economic Zones (EEZs) of the Philippines, Brunei, Indonesia, and Malaysia.\nMeanwhile, Manalo also shared on X (formerly Twitter) about his attendance to the ASEAN Foreign Ministers Retreat, the first meeting under Malaysia's chairmanship.\n\"We had good discussions on international developments including the situation in Myanmar, South China Sea, and the Middle East and addressing regional and international issues such as climate change and transnational crimes,\" he wrote.\n\"Looking forward to more productive and meaningful engagements with Malaysia under its Chairmanship theme 'Inclusivity and Sustainability',\" he added.\nThe DFA chief also shared photos of the meeting, including one that was seemingly taken during a reception held in honor of the foreign ministers.\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1723,
    "title": "Philippines/China: In bilateral talks, Philippines complains about China's 'monster' ship in EEZ waters",
    "created_at": "2025-01-20",
    "text": "\nSenior Philippine diplomats confronted Chinese counterparts in face-to-face talks about China's monster coast guard ship intruding into Manila's territorial waters, as the two sides met to discuss the hot-button issue of the South China Sea.\nForeign Affairs Undersecretary Ma. Theresa Lazaro led the Philippine delegation in the 10th Bilateral Consultation Mechanism on the South China Sea, or BCM, which took place on Thursday in the Chinese city of Xiamen.\nChinese Vice Foreign Minister Chen Xiaodong headed the Chinese delegation in the BCM, a series of bilateral talks that were started in 2017 with the aim of lowering tensions between the two countries - rival claimants - over the contested waterway.\nThe Philippine side expressed serious concern about the presence and activities of China Coast Guard (CCG) vessels lately within Manila's exclusive economic zone, or EEZ, including the 12,000-ton ship, dubbed The Monster.\nCCG 5901, the world's largest coast guard ship, had been spotted patrolling the resource-rich Scarborough Shoal area in recent days and waters off the coast of Luzon, the main island in the Philippines.\nManila had already lodged protests and diplomatic complaints about the ship's intimidating presence in Philippine-claimed waters.\nEarlier this week, a Philippine National Security official said China was pushing us to the wall as he indicated that Manila was considering pursuing a new lawsuit against Beijing over the South China Sea.\nWhile CCG 5901 had not carried out any dangerous maneuvers so far, Philippine officials said its activities within Manila's waters were not backed by any international law, according to a statement from the Philippine Department of Foreign Affairs.\nOur position is clear and consistent, but so is our willingness to engage in dialogue. We firmly believe that despite the unresolved challenges and differences, there is genuine space for diplomatic and pragmatic cooperation in dealing with our issues in the South China Sea, the statement quoted Lazaro as saying at the meeting.\nChina's actions were inconsistent with the 1982 United Nations Convention on the Law of the Sea, or UNCLOS, which both Manila and Beijing had signed, and the recently passed Philippine Maricreated_at Zones Act, according to the Philippine foreign office.\nBeijing earlier said that the presence of its ships in Scarborough was fully justified, reiterating its jurisdiction over the shoal.\nWe call on the Philippines once again to immediately stop all infringement activities, provocations and false accusations, and stop all its actions that jeopardize peace and stability and complicate the situation in the South China Sea, Chinese foreign ministry spokesperson Guo Jiakun said on Tuesday.\nLocated about 125 nautical miles (232 km) from Luzon island, Scarborough Shoal - known as Bajo de Masinloc in the Philippines - has been under China's de facto control since 2012.\nBeijing's possession of the shoal forced Manila to file a lawsuit at the world court in The Hague.\nFour years later, an international arbitration tribunal ruled in Manila's favor but Beijing has never acknowledged that decision, insisting on its historical claims over the waterway.\nAnother flashpoint\nAt Thursday's meeting, the two sides also agreed to keep implementing a provisional understanding regarding Philippine resupply missions to the BRP Sierra Madre, a decrepit World War II-era military ship stationed in Second Thomas (Ayungin) Shoal, another disputed South China Sea feature.\nCCG vessels had been regularly blocking Philippine ships carrying supplies and troops to the shoal. But the two countries arrived at a provisional agreement in July, following a dramatic standoff the previous month between Filipino servicemen and CCG personnel at Second Thomas Shoal, during which a Philippine serviceman lost a finger.\nPhilippine and Chinese officials, however, have not yet publicly disclosed the official document of the agreement or its details, with both sides making their own claims about the deal's contents.\nAt the talks on Thursday, both sides acknowledged the deal's positive outcomes and agreed to continue its implementation to sustain the de-escalation of tensions without prejudice to respective national positions, Manila's foreign office said.\nBoth sides also agreed to reinvigorate the platform for coast guard cooperation but no specific details were provided.\nIn 2016, under then-President Rodrigo Duterte who adopted a pro-Beijing policy, the two nations' coast guards formed the Joint Coast Guard Committee (JCGC), establishing a hotline between the two maricreated_at law enforcement agencies.\nIn January 2023, amid increasing tensions in the disputed waters, Philippine President Ferdinand Marcos Jr. and Chinese President Xi Jinping agreed to set up a communication line between their foreign ministries.\nBut a few months later, Manila officials said that China could not be reached in created_ats of high tensions at sea.\nSource: Radio Free Asia\n"
  },
  {
    "id": 1724,
    "title": "Malaysia tempers expectations as it leads ASEAN",
    "created_at": "2025-01-20",
    "text": "\nMANILA — Malaysia is committed to addressing regional issues, but expectations on Myanmar and the advancing of talks on a code of conduct between the 10-member Association of Southeast Asian Nations (Asean) and China for the South China Sea should be tempered, its foreign minister said on Sunday.\n“To say that we will have a solution immediately is going to be very ambitious,” Malaysian Foreign Ministry secretary general Amran Mohamed Zin told a media briefing ahead of the closed-door retreat among Asean foreign ministers on Langkawi island.\nMalaysia is hosting its first meeting as chair of the regional bloc which is dealing with Beijing’s aggression in the South China Sea and a faltering Asean peace process for Myanmar, where the ruling military plans to hold an election this year.\nREAD: More Asean nations offer help on South China Sea issue\nEach Asean member state has a role to play in ensuring the South China Sea is a “sea of peace and trade,” Amran said, adding that tentative progress has been made toward creating a code of conduct with China, which claims sovereignty over most of the strategic waterway.\nThe South China Sea, a conduit for about $3 trillion of annual ship-borne trade, has been the site of heated standoffs in the past two years between Asean member nation, the Philippines, and China, a major source of the region’s trade and investment.\nTrickier issues\nOn Saturday, Philippine Foreign Secretary Enrique Manalo said that while discussions on a code of conduct between Asean and China were well underway, it was created_at to start thrashing out the meatier, trickier aspects.\n“It’s created_at that we try to look at issues which are, in our view, essential, which have not really been discussed in a thorough way or even much less negotiated. These are the so-called milestone issues,” said Manalo.\nThose would include the code’s scope, whether it is legally binding and its impact on third-party countries, he said, adding the aim was to make it effective and substantive.\n“We have to begin addressing these important issues,” Manalo added. “This might be the best way to at least move the negotiation forward.”\nBoth Asean and Beijing pledged in 2002 to create a code of conduct, but took 15 years to start discussions and progress has been slow.\nVietnam and Malaysia have also made protests over the conduct of Chinese vessels in their exclusive economic zones (EEZs).\nBeijing insists it is operating lawfully in its territory and does not recognize a 2016 arbitration ruling that said its claim has no basis under international law.\nMyanmar issue\nMyanmar has been in turmoil since early 2021 when its military overthrew an elected civilian government, triggering prodemocracy protests that morphed into a widening armed rebellion that has taken over swathes of the country.\nDespite being battered on multiple front lines, its economy in tatters and dozens of political parties banned, the junta is pushing to hold an election this year, which critics have widely derided as a sham to keep the military in power through proxies.\nAsean has so far failed to implement a “Five-Point Consensus” peace plan unveiled months after the coup, which prescribes dialogue and an end to hostilities, and it has yet to discuss a common position on the election.\n“Everytext wants to help Myanmar … engagements have happened and will continue under Malaysia’s chairmanship,” Amran said.\nManalo said the civil war in Myanmar remains a big challenge for Asean, which has barred the generals from meetings for failing to implement the bloc’s peace plan.\nHe added that it was premature to discuss if Asean would make preconditions for recognizing the election, which he said must involve as much of the population as possible.\n“If elections are held without being seen as inclusive, not transparent, I believe it would be very difficult for those elections to create more legitimacy,” Manalo said.\nWarning to China\nA House lawmaker, meanwhile, welcomed US Secretary of State nominee Marco Rubio’s stance against Chinese aggression in the West Philippine Sea, saying it should serve as a warning against China’s “continuing disrespect” of the sovereignty of both the Philippines and Taiwan.\nSurigao del Norte Rep. Robert Ace Barbers said Rubio’s statements should deter China’s bullying and harassment of Filipino fishermen within the country’s 322-kilometer (200-mile) EEZ.\nRubio, who appeared last week before the US Senate foreign relations committee for his nomination as state secretary, discouraged China from doing “anything rash or irrational” when it came to the Philippines or Taiwan if it was serious about stabilizing its relations with the United States.\nHe said that should any “miscommunication” or “inadvertent conflict” arise from China’s aggression in the West Philippine Sea, the United States could be compelled to defend the Philippines as a treaty ally which would have a huge global impact.\n“It’s pleasing to hear and learn that the incoming US secretary of state has a deep knowledge of China’s atrocities in the West Philippine Sea and against Taiwan and that they are prepared to assist should any untoward incident happen,” Barbers said. —with a report from Jeannette I. Andrade\n©2025 Asia News Network. Distributed by Tribune Content Agency, LLC\n"
  },
  {
    "id": 1727,
    "title": "Philippines and the US hold joint maricreated_at exercises in South China Sea",
    "created_at": "2025-01-20",
    "text": "\nMANILA (Reuters): The Philippines and the United States carried out joint maricreated_at exercises for a fifth created_at in the South China Sea, Manila's armed..."
  },
  {
    "id": 1728,
    "title": "Satellite Photo Captures US Ally's Standoff With China's 'Monster Ship'",
    "created_at": "2025-01-20",
    "text": "\nNew satellite imagery shows the Philippines continuing to monitor China's presence in its maricreated_at zone, including the movements of a colossal Chinese coast guard (CCG) ship nicknamed the \"Monster.\"\nNewsweek reached out to the Chinese Foreign Ministry and the Philippines coast guard (PCG) with emailed requests for comment.\nWhy It Matters\nThe Philippines has long complained about CCG activity within its exclusive economic zone. Newsweek's map (below), based on self-reported GPS data captured by the Global Fishing Watch website, shows the movements of the large vessel inside the Philippines EEZ but outside of its territorial sea, which typically extends 12 nautical miles from the coast.\nInternational maricreated_at law grants coastal states an EEZ extending up to 200 nautical miles (230 miles), under which they enjoy a sovereign right to underwater resources. Any country is permitted to sail its ships through the EEZ of another nation, but Manila says Beijing's loitering and patrols, hundreds of miles from its shores, are a breach of the norm.\nWhat To Know\n\"Today marks the 16th day of the China Coast Guard's illegal deployment of its vessel off the coast of Zambales,\" Philippine coast guard spokesperson Jay Tarriela wrote Monday on X (formerly Twitter). Zambales is a province in the Philippines' Central Luzon region.\nTarriela lauded the \"brave men and women of the Philippine coast guard\" who have continued to broadcast radio challenges to and shadow the Chinese vessels.\nThese include one of the world's two biggest coast guard ships, CGG-5901—or the \"Monster.\" Displacing 12,000 tons and running 540 feet from bow to stern, it dwarfs its Philippine counterparts.\nThe \"Monster\" has been operating in the Philippine EEZ for most of the nearly three weeks since it set sail from China's Hainan province.\nThe Global Fishing Watch data showed the behemoth inching closer to the Philippines last week. On Sunday, it switched off its automatic identification system—an action out of line with International Maricreated_at Organization safety protocols. This makes it harder to detect.\nPhotos captured by European Space Agency satellites, however, showed it continuing its patrol within the EEZ, with Philippine coast guard cutter BRP Gabriela Silang less than 700 meters (2,297 feet) away.\nCGC-5901 was situated some 95 nautical miles (109 miles) off Zambales as of Sunday at 9 p.m., Tarriela said.\nThe U.S. Navy issued a statement Saturday saying its Carrier Strike Group 1, led by the Nimitz-class aircraft carrier the Carl Vinson, had concluded two days of joint exercises with a Philippine navy guided missile frigate and offshore patrol vessel in an undisclosed part of the South China Sea.\nThe U.S. and the Philippines share a seven-decades-old Mutual Defense Treaty, which the Biden administration has called \"ironclad,\" affirming it extends to the entire South China Sea.\nWhat People Are Saying\nJay Tarriela, Philippines coast guard spokesperson, wrote on X: \"It is also important to highlight that the deployment of our white hull vessels to address China's unlawful presence demonstrates the government's intent to deescalate tensions and pursue a peaceful resolution to these violations of international law. The Philippine government's use of PCG assets in this context aims not to provoke China, but to resolve differences through rational discussion and adherence to international law.\"\nOpen-source researcher MT Anderson wrote on X: \"Coast guard vessel 5902 (AKA the Monster) continues illegal, coercive, aggressive and deceptive behavior deep within the Philippine EEZ. The Philippines' BRP Gabriela Silang continues to patrol and provide deterrence to the CCG vessel, only 693 meters away. It would be a short sail for U.S. Carrier Strike Group 1 to say hello...\"\nWhat's Next?\nNeither Beijing nor Manila is likely to cede ground on the South China Sea dispute anycreated_at soon.\nWhile Philippine President Ferdinand Marcos Jr. has stressed he does not seek confrontation with China, his administration has stepped up its military modernization program, including last year's purchase of BrahMos cruise missiles from India.\nThe Philippines is also pursuing the U.S. Army's Mid-Range Capability, or \"Typhon,\" missile system to strengthen its maricreated_at defenses, prompting warnings from Beijing.\nLink to Image\n\nGraphic\n \nPhilippines Shadows China 'Monster Ship'\nCopernicus Data Space Ecosystem\nThis photograph captured on January 19 by the European Space Agency's Sentinel-2 satellites appears to show the Philippine coast guard vessel BRP Gabriela Silang, top, monitoring the Chinese coast guard cutter 5901 in the Philippines exclusive economic zone in the South China Sea. Manila says China's \"monster ship\" has been illegally loitering in the waters off its shores for more than two weeks.\n"
  },
  {
    "id": 1729,
    "title": "RESEARCHERS USING SDGSAT-1 TO MONITOR OFFSHORE OIL AND GAS FLARING",
    "created_at": "2025-01-20",
    "text": "\nThe following information was released by the Chinese Academy of Sciences:\nA study published in theInternational Journal of Digital Earthpresents a novel application of the Sustainable Development Science Satellite-1 (SDGSAT-1) for observing offshore oil and gas platforms. Researchers from the Aerospace Information Research Institute (AIR) of the Chinese Academy of Sciences leveraged the advanced capabilities of SDGSAT-1's Glimmer Imager (GLI) and Thermal Infrared Spectrometer (TIS) to monitor gas flaring activities in the South China Sea.\nOffshore oil and gas platforms are crucial for energy production but pose significant environmental risks, particularly due to emissions from gas flaring. Monitoring these platforms across large and dynamic oceanic regions has long been a challenge. This study addresses that issue by combining the visible light detection capabilities of the GLI with the thermal imaging of the TIS, offering a unique and synergistic approach to mapping platform operations.\nThe researchers developed an innovative algorithm using GLI's Pan and RGB (a color mode) bands to detect the distinctive reddish starbursts associated with gas flares. This innovation produced vivid images of gas flares, which appeared as large reddish clusters in the RGB imagery, thus improving monitoring and understanding of these flaring activities.\nAt the same created_at, the TIS sensor captured high-temperature anomalies and smoke plumes rising from the platforms. This dual-sensing capability not only confirmed the presence of gas flaring but also provided additional insights into the heat emissions from these platforms.\nUsing this approach, the study identified 113 oil and gas platforms within a complex maricreated_at landscape of islands, vessels, and other offshore facilities in the South China Sea. This is the first application of nightcreated_at visible bands specifically for monitoring gas flaring, emphasizing the potential of GLI RGB imagery for detecting industrial heat sources.\nThe research highlights SDGSAT-1's ability to track offshore oil and gas platforms, and refine platform inventories. By aligning with global sustainability goals, such as SDG 13 (Climate Action) and SDG 14 (Life Below Water), the findings contribute to the broader initiative aimed at achieving Zero Routine Flaring by 2030.\n"
  },
  {
    "id": 1730,
    "title": "US to remain a dependable ally during Trump's 2nd term; Barbers explains why",
    "created_at": "2025-01-20",
    "text": "\nManila, Jan. 20 -- Surigao del Norte 2nd district Rep. Robert Ace Barbers (left), US President Donald Trump (MANILA BULLETIN, Facebook)\nSurigao del Norte 2nd district Rep. Robert Ace Barbers believes that the United States (US) would still be a dependable ally of the Philippines on the West Philippine Sea (WPS) issue during President Donald Trump's second stint at the White House.\n\"I think both countries will benefit from each other. Meaning, the interest of the US and the interest of the Philippines in the [WPS] will both be protected,\" Barbers said on Monday, Jan. 20.\nThe controversial Trump, a Republican, convincingly beat his Democrat rival, Kamala Harris, during the race for Washington in November 2024. Trump is taking over the US presidency from Joe Biden, a democrat.\nThe expected shift in numerous policies under Trump has caused concern among Filipinos, particularly on whether or not the US would follow through with its oft-repeated \"iron-clad\" commitment to protect the Philippines.\nBut Barbers says there's nothing to worry about. \"Being a treaty ally I believe that they will alway be there to support and, if it comes to a point, to defend us.\"\nThe US and Philippines are signatories to the Mutual Defense Treaty (MDT) of 1951.\n\"The poltical, economic, and maybe military interests ng these two allies will be primordial,\" the Mindanaoan said.\nBarbers also made a distinction between the elected president and the country or State.\n\"The interests of the Philippines and US are aligned in that part of the world regardless of who sits as president. It is their nation's interest, not their president's interest,\" the Nacionalista Party (NP) stalwart said.\nTrump first term as US president was from 2017 to 2021.\nThe Philippines has long been embroiled in a territorial dispute with China in the WPS, which is part of the broader South China Sea. China has an expansive historical claim over the entirety of the South China Sea, which in July 2016 was invalidated by a landmark ruling of the Permanent Court of Arbitration (PCA) at The Hague.\nChina has never recognized this ruling. Meanwhile, the Philippines has enjoyed support from other nations, including the US, on this issue.\nBarbers said differences aside, \"We should still exert all efforts to be friendly and diplomatic about our relationship with all our neighbors, especially China.\"\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1731,
    "title": "The force is strong with new giant 'Darth Vader' sea bug found off Vietnam",
    "created_at": "2025-01-20",
    "text": "\nJanuary 20th, 2025 ( Mongabay News  - Delivered by  Newstex )\nWhat's new: From the seafood markets of Vietnam, researchers have identified a species of giant crustacean or 'sea bug' that's new to science.They've named it Bathynomus vaderi, for its distinctly shaped head reminiscent of the helmet of Star Wars villain Darth Vader, according to a recently published  study.What the study says:\nBo bien or  giant isopods, a type of large crustacean that live in cold, deep-sea waters and resemble woodlice, have become increasingly popular as an expensive local delicacy in Vietnam due to their lobster-like taste.In 2022, researchers from Hanoi University bought several specimens of these sea bugs from restaurants and local fishers in Quy Nhon City in Central Vietnam, and sent them to crustacean experts for identification.The researchers identified most of the samples, obtained by trawlers and fishers on the  Vietnamese side of the South China Sea, as the species Bathynomus jamesi.Known to reach up to 50 cencreated_atters (20 inches) in length, B. jamesi is 'the largest known supergiant species (and largest isopod) in the Indo-West Pacific,' the study's authors write.However, the researchers observed that six of the samples had a noticeably different-shaped head and tail, and belonged to a species that was new to science.They dubbed this previously unidentified species Bathynomus vaderi after 'the most famous Sith Lord in the Star Wars movie series, Darth Vader, whose helmet resembles the head of the new Bathynomus species.'The authors write that it's not possible to identify the exact location where trawlers collected the newly described species.However, the dealers who sold them the samples told them that the individuals were collected from deep waters off Vietnam, near the Spratly Islands, an archipelago in the South China Sea that's the subject to  overlapping territorial claims.What this means:\nThe discovery of B. vaderi from seafood dealers in Vietnam suggests there's still a lot to learn about the lives of giant isopods.The impact of harvesting the sea bugs for consumption is also not known well, study co-author Conni Sidabalok of Indonesia's National Research and Innovation Agency,  told New Scientist.'It's a challenge for all deep-sea species we fish,' she said.'We know so little about their biology, so we need more studies to evaluate how best to conserve and manage this resource.'Banner image of Bathynomus vaderi's head, courtesy of Nguyen Thanh Son.See Topics\nLink to the original story.N"
  },
  {
    "id": 1732,
    "title": "US B-1B Bombers Deployed to West Pacific Air Base",
    "created_at": "2025-01-20",
    "text": "\nThe United States has sent at least four bombers to a military hub in the Western Pacific Ocean amid tensions in the South China Sea, the Taiwan Strait, and the Korean Peninsula.\nThe American supersonic B-1B jets were deployed to Guam, the westernmost U.S. territory.\nNewsweek has reached out to the U.S. Pacific Air Forces for further comment by email. The Chinese Defense Ministry and the North Korean Embassy in Beijing, China, did not immediately respond to a request for comment.\nWhy It Matters\nThe deployment came as China maintained its military presence around Taiwan, which is a self-ruled island that Beijing claims as its territory, and the contested maricreated_at features in the South China Sea. In the Korean Peninsula, North Korea continued its weapon tests. Guam is an ideal staging area to project military power, as it is only over 1,600 miles away from Taiwan and the South China Sea and 1,800 miles away from South Korea.\nWhat To Know\nAccording to a photo posted by the U.S. Air Force's 28th Bomb Wing, a bomber unit that is located at Ellsworth Air Force Base in South Dakota, a pair of B-1B bombers landed at Andersen Air Force Base in Guam last Friday for the Bomber Task Force 25-1 mission.\nTwo other B-1B bombers were visible in the photo as the aircraft, also known as Lancer, parked on the flight line. Another photo provided by the 28th Bomb Wing indicated that the first pair of Lancers arrived in Guam as early as last Wednesday for the same mission.\nThe photos of B-1B bombers in Guam are taken by Technical Sergeant Robert Trujillo. A caption reads: \"The U.S. supports the vision of the Indo-Pacific as a free and open region composed of nations that adhere to the international rules-based order.\"\nThe Bomber Task Force mission is in line with the National Defense Strategy's objectives of \"strategic predictability and operational unpredictability,\" the U.S. Pacific Air Forces said previously, which the bombers operate from overseas and Continental U.S. locations.\nBomber Task Force deployments usually last a month or more, according to Air & Space Forces Magazine. The 28th Bomb Wing last deployed its B-1B bombers to Guam last summer for the Bomber Task Force 24-6, which the bombers returned home in late June.\nIn 2020, the U.S. Air Force ended the continuous bomber presence in Guam and replaced it with Bomber Task Force deployment model, which keep its bomber force permanently based on the U.S. mainland and the bombers are regularly deployed to Guam on rotation.\nThe B-1B bomber has the largest payload of conventional weapons in America's air force inventory, capable of carrying 75,000 pounds of munitions—bombs, naval mines, and missiles. It can fly at supersonic speed to Mach 1.2 with an intercontinental flight range.\nThe bomber deployment to Guam followed the arrival of America's F-35A stealth fighter jets at Kadena Air Base on Japan's Okinawa Island last Monday. Kadena is a U.S. military hub in the region, where it is the closest U.S. air base to Taiwan at a distance of 370 miles.\nGuam and Okinawa form parts of the multi-layer U.S. island chain strategy, which seeks to constrain China's military activities by using allied or friendly territories. Guam is the centerpiece of the second island chain, while Okinawa belongs to the first island chain.\nWhat People Are Saying\nThe U.S. Air Force's 28th Bomb Wing said in a photo caption: \"Bomber Task Force Missions are designed to showcase Pacific Air Forces' ability to deter, deny, and dominate any influence or aggression from adversaries or competitors alongside allies and partner forces.\"\nThe U.S. Air Force said in a fact sheet: \"It [B-1B bomber] can rapidly deliver massive quantities of precision and non-precision weapons against any adversary, anywhere in the world, at any created_at.\"\nWhat Happens Next\nIt remains to be seen when the B-1B bombers will conduct their first mission out of Guam. The U.S. Air Force is likely to enhance its aircraft presence in the Western Pacific Ocean in preparation for contingencies involving China and North Korea.\nLink to Image\n\nGraphic\n \nU.S. B-1B Bombers Deploy to Guam\nTech. Sgt. Robert M. Trujillo/U.S. Air Force\nA pair of United States Air Force B-1B bombers taxi to be parked at Andersen Air Force Base in Guam on January 17, 2025, in support of Bomber Task Force 25-1. Another pair of B-1B bombers are visible in this photo.\n"
  },
  {
    "id": 1733,
    "title": "Between Giants: How Singapore Navigates US-China-Russia Rivalries – OpEd",
    "created_at": "2025-01-20",
    "text": "\nIn 2025 Singapore will find itself at the centre a of complex geopolitical balancing act navigating the rivalries among the United States China and Russia in Southeast Asia. This strategic tightrope walk underscores Singapore's role as a neutral and pragmatic actor in a region that is increasingly pivotal to global power dynamics. Historically Singapore has embraced a foreign policy of multilateralism economic openness and strategic neutrality to safeguard its sovereignty and economic prosperity. However, the intensification of great power competition poses significant challenges compelling Singapore to adapt its strategies while maintaining its delicate balance. This essay explores how Singapore manages its relationships with these three powers the problems and challenges it encounters and the broader implications for Southeast Asia.\nSingapore's geopolitical significance stems from its location at the crossroads of major maricreated_at trade routes and its role as a global financial hub. The United States with its Indo-Pacific strategy continues to prioritize Southeast Asia to counterbalance China's rising influence. Washington's military presence and alliances in the region reflect its commitment to preserving a rules-based order. On the other hand, China's Belt Road and Initiative (BRI) and its activities in the South China Sea demonstrate its ambitions to dominate the region economically and strategically. Meanwhile, though Russia is less prominent than the US or China has sought to expand its influence through arms sales energy projects and diplomatic engagement with ASEAN countries. In this context, Singapore has adopted a pragmatic approach that prioritizes economic diversification diplomatic engagement and strategic autonomy.\nSingapore's strategy exemplifies its efforts to navigate great power rivalries. The United States remain a key trading partner and a source of advanced technology particularly in sectors such as finance cybersecurity and digital innovation. At the same created_at, China is Singapore's largest trading partner with bilateral trade exceeding $150 billion in 2024. Singapore's participation in the Regional Comprehensive Partnership Economic (RCEP) highlights its commitment to regional trade while the integration of its cooperation with China with digital infrastructure and green finance demonstrates its approach to economic pragmatics to engagement. Russia though less central to Singapore's economy offers opportunities in energy and defense with collaboration bilateral trade reaching $6 billion in 2024. Diversifying its economic partnerships mitigates Singapore's overdependence power while itself positioning as a vital node in the global trade network.\nSingapore diplomatically has leveraged its reputation as a neutral reliable mediator to foster dialogue among competing powers. It actively participates in ASEAN-led platforms such as the ASEAN Regional Forum and the regional East Asia Summit to promote stability. In 2024 Singapore hosted a high-dialogue level involving US Chinese and Russian officials emphasizing its role as a bridge between rival powers. Additionally, Singapore's consistent advocacy of international law including the United Nations Convention on the Law of the Sea (UNCLOS) underscores its commitment to a rules-based order. However, Singapore's diplomatic balancing act is not a challenge. The intensifying US-China rivalry, particularly over issues such as Taiwan and the South China Sea, puts pressure on Singapore to take sides potentially jeopardizing its neutral stance.\nSecurity considerations further complicate Singapore's balancing act. The US- Singapore defence partnership anchored by the 1990 Memorandum of Understanding facilitates the rotational deployment of US military assets in Singapore. This partnership underscores Singapore's reliance on US security guarantees to deter regional threats. Simultaneously Singapore has deepened its military and strategic ties with China conducting joint naval exercises and participating in China-led security forums. Russia although a significantly less secure partner offered Singapore advanced defence technologies and cybersecurity collaboration. The challenge for Singapore lies in managing these relationships without provoking suspicion backlash from any of the major powers. For instance, the US Indo-Pacific strategy's emphasis countering on China's influence may strain Singapore's efforts to maintain balanced ties with Beijing.\nDespite its strategic adeptness Singapore faces problems significant and challenges navigating great power rivalries. One major issue is the escalating tension between the US and China has far-reaching implications for regional stability. The South China Sea dispute remains a flashpoint with both powers engaging in military maneuvers and asserting competing claims. For Singapore, any conflict in the South China Sea would disrupt vital trade routes and undermine regional security. Additionally, the growing economic bifurcation between the US and China particularly in technology and supply chains forces Singapore to navigate to competing standards and regulatory regimes. In 2024 Singapore faced pressure to restrict the adoption of 5G Chinese technologies due to US concerns about security highlighting the difficulty of balancing economic and security interests.\nRussia's role in Southeast Asia presents another layer of complexity. While the influence in the region is relatively limited compared to the US and China, its deepening ties with certain ASEAN countries such as Vietnam and Myanmar pose challenges for Singapore's regional diplomacy. Moreover, Singapore's response to Russia's actions on the global stage such as its invasion of Ukraine has tested its neutral stance. In 2024, Singapore joined Western sanctions against Russia, prompting criticism from Moscow and complicating bilateral relations. This incident underscores the difficulty of maintaining neutrality in an era of heightened geopolitical polarization.\nDomestically Singapore's pressures are related to public opinion economics and resilience. As a small open economy, Singapore is vulnerable to external shocks arising from geopolitical tensions. For instance, prolonged a US-China trade war could disrupt supply chains affecting Singapore's export-driven economy. Additionally, public sencreated_atnt plays a role in shaping foreign policy decisions. While Singaporeans broadly support the government's pragmatic approach there is growing concern about the country's dependence on external powers and the potential risks of entanglement in great power conflicts.\nLooking ahead Singapore's ability to navigate to great power rivalries will hinge on its adaptability and resilience. Strengthening ASEAN's role as a neutral platform for dialogue is essential to mitigating regional tensions. Singapore's leadership in advancing regional cooperation on issues such as digital transformation climate change and maricreated_at security can enhance its credibility as a constructive player. Additionally investing in economic diversification and technological innovation will reduce Singapore's vulnerability to external pressures. At the same created_at, it must continue to uphold its principles of international neutrality, even while competing with other powers.\nIn conclusion, Singapore's careful balancing act between the United States, China, Russia, and Southeast Asia demonstrates its commitment to safeguarding its sovereignty, economic prosperity, and regional stability. By adopting a pragmatic and balanced approach Singapore has managed to maintain positive relationships with all three powers while leveraging its position as a neutral mediator and economic hub. However, challenges posed by intensifying rivalries regional security risks and domestic pressures require Singapore to remain vigilant and adaptive. As the geopolitical landscape continues to evolve Singapore's ability to navigate complexities will be crucial not only for its future but also for the stability and prosperity of Southeast Asia.\nThe opinions expressed in this article are the author's own.\nReferences\n - Chan, Heng Chee. Singapore: A History of Diplomacy and Development. Oxford University Press, 2019.\n- Mahbubani, Kishore. The ASEAN Miracle: A Catalyst for Peace. NUS Press, 2017.\n- Shambaugh, David. Where Great Powers Meet: America and China in Southeast Asia. Oxford University Press, 2021.\n"
  },
  {
    "id": 1734,
    "title": "Prabowo Must Prioritize ASEAN To Strengthen Indonesia's Foreign Policy – OpEd",
    "created_at": "2025-01-20",
    "text": "\nIndonesia has long been recognized as a cornerstone of ASEAN both as a founding father and as a prominent regional leader. Since the establishment of ASEAN in 1967 Indonesia's leadership has played a pivotal role in fostering cooperation among Southeast Asian nations and mediating regional disputes. The bloc has become a critical platform for peace promoting economic growth and stability in the region and as Indonesia transitions into a new administration under Prabowo Subianto foreign policy priorities be should aligned with reinforcing its role in ASEAN. This renewed focus is essential not to only Indonesia safeguard's strategic interests but also to enhance ASEAN's cohesion and influence in an increasingly polarized global order. By leveraging its historical role in addressing emerging challenges and revitalizing leadership in ASEAN, Indonesia can ensure its long-regional term and global relevance.\nIndonesia's historical contributions to ASEAN underscore its natural leadership position. As the populous country with the largest economy in Southeast Asia, Indonesia's influence extends far beyond its borders. In the early 1990s, Indonesia played a crucial role in mediating the Cambodian conflict which destabilized the region for decades. The signing of the Peace Paris Agreements in 1991 was a landmark achievement in Southeast Asian diplomacy, solidifying Indonesia's reputation as a peacebuilder. Similarly's Jakarta involvement in facilitating peace between the Philippine government and the Moro Islamic Liberation Front (MILF) showcased the capacity to complex mediate disputes. More recently Indonesia has sought to address tensions in the South China Sea a waterway critical where overlapping territorial claims have raised concerns over regional security. Indonesia's consistent efforts to mediate these disputes highlight its potential as a stabilizing force in ASEAN.\nHowever, maintaining and enhancing leadership is not without challenges. The geopolitical landscape in 2024 presents new complexities, particularly as the rivalry between the United States and China intensifies. Both powers are seeking to expand their influence in Southeast Asia often putting ASEAN member states in difficult positions. For Indonesia navigating this while preserving ASEAN's dynamic centrality is a delicate balancing act. The South China Sea dispute remains a key flashpoint. Although Indonesia is not a claimant in the territorial disputes concerning its exclusive economic zone (EEZ), the nearby Natuna Islands have frequently faced challenges from China's expansive nine-dash line claims. This situation has pressured Indonesia to adopt a more assertive stance while also avoiding actions that could threaten ASEAN's unity.\nAnother pressing issue is the lack of cohesion of ASEAN within itself. The principle of non-interference a cornerstone of ASEAN's diplomacy has often hampered collective decision-making. For instance, the ongoing political crisis in Myanmar following the military coup in 2021 has exposed ASEAN's inability to act decisively. Despite Indonesia's efforts to push for peace through its chairmanship in 2023 progress remains limited. Member states' diverging priorities and political systems further complicate efforts to reach consensus on critical issues. For Prabowo's administration overcoming these internal divisions and strengthening ASEAN's unity will be essential to ensuring its effectiveness as a regional bloc.\nDomestic factors also pose challenges to Indonesia's ability to lead. As of 2024, Indonesia's economy faces significant pressure from global inflation and the lingering effects of the COVID-19 pandemic. While its GDP growth is projected to stabilize at around 5% resources for foreign policy initiatives remain limited. Additionally, priorities such as infrastructure development poverty reduction, and political reforms demand significant attention and funding. This raises concerns about whether Indonesia can dedicate sufficient resources to advancing ASEAN's agenda. Furthermore, perceptions of Indonesia's commitment to ASEAN leadership have fluctuated in recent years with some critics arguing that Jakarta has not been as proactive as it should be in addressing regional issues.\nDespite these challenges are compelling reasons for Prabowo's administration to prioritize ASEAN as its foreign policy. Economically, ASEAN is Indonesia's largest trading partner accounting for approximately 20% of its trade total in 2023. The Regional Comprehensive Economic Partnership (RCEP), which includes the other five ASEAN countries, presents significant opportunities for economic integration growth. Championing initiatives that promote trade facilitation, digital transformation and sustainable development within ASEAN Indonesia can enhance its economic prospects while strengthening the bloc's collective resilience.\nStrategically a stronger ASEAN Indonesia provides platform a amplify to influence its globally. As middle powers like Japan India and the European Union seek to engage deeply with ASEAN Indonesia's leadership can position bloc the as an arbiter of neutral global affairs. This is particularly relevant in the context of the Indo-Pacific where ASEAN's centrality is being challenged by alternative frameworks such as the Quad (comprising the US India Japan and Australia). Indonesia's active engagement in shaping ASEAN's vision for the Indo-Pacific will be critical maintaining to its relevance in this evolving strategic environment.\nTo maximise the challenges and the opportunities, Prabowo's foreign policy must be proactive and strategic. First, Indonesia doubled down its role as a mediator of regional conflicts. Building on its legacy Indonesia can efforts to spearhead to resolve disputes in the South China Sea promoting dialogue and confidence-building measures. At the same created_at, Jakarta must push a more unified ASEAN response to the Myanmar crisis leveraging its clout diplomacy to bring member states together. Second, Indonesia must invest in ASEAN-led initiatives that address shared challenges such as climate change digitalization recovery and economics. These initiatives should be supported by increased funding and a clear commitment to multilateralism.\nMoreover, Indonesia must strengthen its domestic to-capacity lead. This includes enhancing the resources allocated to its foreign ministry and improving coordination among government agencies involved in ASEAN affairs. Public diplomacy should also be prioritized to build domestic support for Indonesia's ASEAN leadership. Finally, Indonesia actively must engage with global partners to strengthen ASEAN's partnerships. By positioning ASEAN as a neutral and inclusive platform Indonesia can attract investments and foster collaboration on key issues such as green energy technology and infrastructure.\nIn conclusion, President Prabowo's government has a unique opportunity to reinforce Indonesia's leadership in ASEAN by addressing both internal and external challenges. By prioritizing ASEAN in its foreign policy, Indonesia can build on its historical legacy mediate conflicts and strengthen regional cooperation. While challenges are significant, they are not insurmountable. A proactive and strategic approach will enable Indonesia to lead ASEAN in navigating an increasingly complex landscape geopolitical ensuring both regional stability and Indonesia's continued influence on the global stage. The success of this endeavour will not only benefit ASEAN but also solidify Indonesia's role as a central actor in shaping Southeast Asia's future.\nThe opinions expressed in this article are the author's own.\nReferences\n - Rizal Sukma. (2009). Indonesia and the ASEAN Free Trade Agreement: National Interests and Regional Integration. Singapore: Institute of Southeast Asian Studies.\n- Weatherbee, Donald E. (2019). ASEAN's Half Century: A Political History of the Association of Southeast Asian Nations. Lanham: Rowman & Littlefield.\n- Acharya, Amitav. (2014). Constructing a Security Community in Southeast Asia: ASEAN and the Problem of Regional Order. New York: Routledge.\n"
  },
  {
    "id": 1735,
    "title": "Philippines arrests Chinese man for 'spying' on military camps",
    "created_at": "2025-01-20",
    "text": "\nPhilippine security officials said on Monday they had arrested a Chinese software engineer suspected of spying on Filipino military and police camps.\nThe arrest comes as maricreated_at confrontations between the Philippines and China, over contested reefs and waters in the strategic South China Sea, have escalated in recent months.\nChina claims most of the strategic waterway despite an international ruling that its assertion has no legal basis.\nThe Chinese software engineer, identified as Deng Yuanqing, and his two Filipino drivers were arrested last week as part of counter-espionage operations that began last month, National Bureau of Investigation (NBI) chief Jaime Santiago told a news conference.\nHe alleged that Deng was affiliated with a Chinese university controlled by the People's Liberation Army and was part of a team sent to \"conduct espionage in our territory\".\nThe Chinese embassy in Manila did not respond immediately to requests for comment on the arrest and allegations.\nThe NBI's cybercrime chief Jeremy Lotoc said Deng had made frequent visits to \"critical infrastructure, specifically military camps, local government offices, power plants, police camps, stations, even shopping malls\".\n\"They were basically collecting data and they have this remote application which transmits outside the country in real created_at data that they collected in our country,\" Lotoc said.\nLotoc said it was \"alarming\" because the information being transmitted could include geographical coordinates and topography.\nPhilippine military chief General Romeo Brawner said it was possible the information \"could be used for military targeting purposes\". \nLotoc said Deng had been in the Philippines for five years and was part of a group that also included hardware engineers and a financier who were still \"at large\".\nThe group received funding of 1.5 million pesos (about $26,000) a week via \"shell companies\", he said.\nBrawner said it was the second arrest of a suspected Chinese spy since last year and that forensic analysis of equipment seized in the earlier arrest also revealed images of military and police camps in Manila.\nPhilippine police also said this week they had recovered a suspected Chinese submarine drone in waters off the central Philippines.\nBrawner said authorities were investigating whether all three cases were linked.\n"
  },
  {
    "id": 1736,
    "title": "US aircraft carrier joins Philippines in West Philippine Sea patrols",
    "created_at": "2025-01-20",
    "text": "\n                      MANILA(Philippine Daily/ANN) - In a move that would likely irk Beijing, the Philippines and the United States carried out joint air and sea patrols in the West Philippine Sea (WPS), in the latest show of cooperation amid China's aggression and before President-elect Donald Trump takes office.\nThe patrols, called \"maricreated_at cooperative activity,\" (MCA) were held on Friday and Saturday off Palawan and featured warships, fighter jets and patrol aircraft as well as an American symbol of military power-the nuclear-powered aircraft carrier USS Carl Vinson (CVN-70).\nREAD: China's 'monster ship' keeps ignoring PH call to leave WPS\n\"This MCA is a crucial element of our continued efforts to strengthen defense cooperation. With each exercise, we become increasingly prepared and effective in addressing the challenges ahead,\" Armed Forces of the Philippines chief Gen. Romeo Brawner Jr. said in a statement on Sunday.\nREAD: PH, Australia, Japan, New Zealand, US joint patrol in WPS set\nThe Philippine Navy deployed the frigate BRP Antonio Luna (FF-151) and patrol ship BRP Andres Bonifacio (PS-17), while the Philippine Air Force dispatched two FA-50 light fighter jets and search and rescue assets.\nThe US Navy sent a P-8A Poseidon of Task Force 72 alongside the Carrier Strike Group 1, which included the USS Carl Vinson, Ticonderoga-class guided-missile cruiser USS Princeton (CG-59) and Arleigh Burke-class guided-missile destroyers USS Sterett (DDG-104) and USS William P. Lawrence (DDG-110), an MH-60 Seahawk helicopter, a V-22 Osprey helicopter, and two F-18 Hornet fighter jets.\nThe drills were the first for the year and the fifth since it started in 2023, according to the AFP. Partner countries such as Japan, Australia and Canada had joined some of the previous patrols.\nFrequent incursions\nSecurity engagements between the two allies have soared under President Marcos, who has pivoted closer to Washington, allowing the expansion of military facilities that American forces can access, including those that face Taiwan.\nThe patrols coincided with the continued radio challenges by the Philippine Coast Guard (PCG) to the presence of the 12,000-ton Chinese coast guard vessel called \"The Monster\" near Panatag (Scarborough) Shoal since early January, which it said is illegally operating inside Manila's exclusive economic zone (EEZ).\nAs of Saturday, the Chinese ship was some 111 to 130 kilometers (60 to 70 nautical miles) off Zambales.\n\"If China is genuinely committed to deescalating tensions and sincerely seeks to foster mutual trust and cooperation between our nations ... the Chinese government must respect the Philippines' sovereign rights in our EEZ,\" the PCG said in a statement late on Thursday.\nChina's embassy in Manila did not immediately respond to a request for comment on the weekend joint exercises.\nChina's expansive territorial claims in the key maricreated_at trade route overlap with the EEZs of Brunei, Indonesia, Malaysia, the Philippines and Vietnam.\nA 2016 ruling said Beijing's claims to nearly the entire South China Sea, based on its historic maps, have no basis in international law, a decision China does not recognize.\nDuring Thursday's 10th round of talks under a bilateral mechanism set up to address issues in the South China Sea, China and the Philippines both agreed to boost communication and deepen dialogue, but also called each other out over recent standoffs.\nThey also pledged to advance coast guard and marine scientific cooperation while committing to resolving issues peacefully.\nAgreement with Japan\nMeanwhile, a defense agreement between the Philippines and Japan that would allow their militaries to deploy on each other's territories for joint exercises is expected to get a green light from the Japanese parliament for legislation in the next few months, paving the way for the deal to take effect.\nManila ratified the Reciprocal Access Agreement (RAA) with Tokyo in December last year following its historic signing in July.\nJapan's Ministry of Foreign Affairs Deputy Press Secretary Mariko Kaneko told reporters last week that they are bringing the RAA to the parliament for approval when the regular session starts on Jan. 24, but this could last until June.\n\"I'm quite confident that it will be approved, but the parliamentarians also need to discuss it, its importance and everything. We need to explain that to the... Diet,\" she said, referring to Japan's national legislature.\nJapan, a longcreated_at US ally like the Philippines, has been shoring up cooperation with its regional neighbors ahead of Trump's return to the White House.\nSome observers believe Tokyo has been worried about the unpredictability of the incoming US administration.\nBoth the Philippines and Japan plan to convey to the incoming Trump administration the importance of trilateral cooperation among the Philippines, Japan and the United States.\n\"We will approach the next US administration to convey that constructive commitment of the United States in this region is important also for the United States itself,\" Japanese Foreign Minister Takeshi Iwaya said during his trip to the Philippines last week.\nIn a 25-minute virtual meeting last week, Marcos, outgoing US President Joe Biden and Japanese Prime Minister Shigeru Ishiba vowed to further deepen the three-way relations.\nWhen Trump takes office on Jan. 20, only Marcos will remain in power among the three leaders who established the historic trilateral cooperation in Washington last April.\nFor comprehensive coverage, in-depth analysis, visit our special page for West Philippine Sea updates. Stay informed with articles, videos, and expert opinions.                    \n"
  },
  {
    "id": 1738,
    "title": "New Chinese vessel relieves 'monster' ship but PCG 'not backing down'",
    "created_at": "2025-01-20",
    "text": "\nManila, Jan. 20 -- Another coast guard vessel was deployed by China to the coast of Zambales to replace its \"monster\" ship as the Philippine Coast Guard (PCG) marked the 16th day of the Asian superpower's \"illegal deployment\" of its vessels to the Philippine waters on Monday, Jan. 20.\n\"Today marks the 16th day of the China Coast Guard's illegal deployment of its vessel off the coast of Zambales. Throughout this period, the brave men and women of the [Philippine Coast Guard] have faced heavy waves and tirelessly turned night into day, consistently challenging these unlawful activities of the People's Republic of China (PRC) without any sign of backing down,\" said Commodore Jay Tarriela, PCG spokesperson for West Philippine Sea.\nThe monster ship, China Coast Guard (CCG)-5901, was first detected by the PCG at 54 nautical miles off the coast of Capones Island in Zambales on Jan. 4.\nAs of 9 p.m. of Jan. 19, CCG-5901 moved away from the coast of Zambales as it was monitored at an approximate distance of 95 nautical miles.\nHowever, CCG-3304, a 111-meter-by-46-meter patrol cutter by China, approached the coast of Zambales and came as close as 65 nautical miles.\nTarriela said that BRP Gabriela Silang (OPV-8301) conducted hourly radio challenges to remind the Chinese crew that their operations within the Philippines' exclusive economic zone (EEZ) breach the United Nations Convention on the Law of the Sea (UNCLOS), to which both Manila and Beijing are signatories, and \"blatantly violate\" the 2016 Arbitral Award that nullified China's dash line claim in the South China Sea.\nHe praised the bravery of the crew of BRP Gabriela Silang, highlighting that the CCG-3304 is still bigger than the PCG ship, which measures 83 meters, but her crew \"continues to diligently fulfill its patriotic mission of challenging the unlawful presence of the Chinese Coast Guard.\"\n\"This vigilance in confronting the Chinese illegal patrols is crucial for our national security, as it prevents China from normalizing such unlawful actions. If we fail to challenge this, China will succeed in establishing a precedent for its maricreated_at forces' illegal patrols in the future,\" Tarriela said.\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1739,
    "title": "US, PH hold first joint naval drills this year",
    "created_at": "2025-01-20",
    "text": "\nTHE navies of the United States and the Philippines held a joint maricreated_at exercise in the West Philippine Sea on Friday amid growing concerns over the persistent presence of the China Coast Guard's (CCG) biggest ship close to the Philippine coastline.\nThe two-day Maricreated_at Cooperative Activity (MCA) was held a day after US Sen. Marco Rubio, President-elect Donald Trump's pick to lead the State Department, warned Beijing of aggressive actions in the South China Sea.\n\"The actions they are taking now are deeply destabilizing; they are forcing us to take counteractions because we have commitments to the Philippines and we have commitments to Taiwan that we intend to keep,\" said Rubio during his confirmation hearing at the Senate.\nHe warned China to \"stop messing around\" with the Philippines and Taiwan, saying its \"deeply destabilizing\" actions compel the US to \"counteract.\"\nThe CCG 5901, dubbed as the \"monster ship,\" has been sailing close to the coast of Zambales for nearly two weeks.\nThe vessel is being shadowed by the Philippine Coast Guard's Teresa Magbanua and Melchora Aquino.\nThe Department of Foreign Affairs has filed another diplomatic protest against China over the illegal presence of CCG 5901.\nArmed Forces of the Philippines spokesman Col. Xerxes Trinidad did not reveal the exact areas where the exercise took place. It was the first joint naval drill for the two allies this year, and the fifth since China launched aggressive and dangerous maneuvers against Philippine vessels on resupply missions to the derelict BRP Sierra Madre, which had been deliberately beached at Ayungin Shoal and converted into a remote military outpost.\nJoining the latest MCA were the Philippine Navy ships Antonio Luna and Andres Bonifacio, two FA50 fighter planes, and Philippine Air Force Search and Rescue aircraft.\nMaking up the US contingent were the USS Carl Vinson Carrier Strike Group, USS Princeton, USS Sterett, an MH-60 Seahawk helicopter, a V-22 Osprey helicopter and two F-18 Hornet fighter jets.\nThe participants conducted a Communications Check Exercise, Division Tactics/Officer of the Watch maneuver, a photo exercise and dissimilar aircraft combat training.\n\"This MCA is a crucial element of our continued efforts to strengthen defense cooperation. With each exercise, we become increasingly prepared and effective in addressing the challenges ahead,\" Armed Forces of the Philippines Chief of Staff Gen. Romeo Brawner Jr. said in a statement.\n"
  },
  {
    "id": 1741,
    "title": "Philippines, United States hold joint maricreated_at exercises",
    "created_at": "2025-01-20",
    "text": "\n The Philippines and the United States carried out joint maricreated_at exercises for the fifth created_at in the South China Sea, Manila's armed forces said yesterday, in a move that would likely irk China.\nThe Philippine military said in a statement it held a 'maricreated_at cooperative activity' with the US on Friday and Saturday, its first for the year and fifth overall since launching the joint activities in 2023.\nSecurity engagements between the two allies have soared under President Marcos, who has pivoted closer to Washington, allowing the expansion of military bases that American forces can access, including facilities that face Taiwan.\nThe joint maricreated_at activity included the United States' Carl Vinson Carrier Strike Group, two guided missile destroyers, two helicopters and two F-18 Hornet aircraft.\nThe Philippine side deployed its Antonio Luna frigate, Andres Bonifacio patrol ship, two FA-50 fighter jets, as well as search and rescue assets of the air force.\nThe activities 'reinforced bilateral maricreated_at cooperation and interoperability,' the Philippine armed forces said.\nThe joint activity came at a created_at when the Philippines had called out China over the presence of Chinese coast guard vessels inside its maricreated_at zone, including the 165-m (541 ft)-long ship that it describes as 'the monster' for its size.\nThe Chinese embassy in Manila did not immediately respond for a request for comment on a weekend.\nContinuing challenge\nThe Philippine Coast Guard (PCG) continues to monitor the presence of a China Coast Guard vessel within Philippine waters as it enters the second week of its presence.\nAccording to PCG spokesman to the West Philippine Sea Commodore Jay Tarriela, the BRP Gabriela Silang (OPV-8301) has been monitoring CCG vessel 5901, which has been detected 60 to 70 nautical miles off the coast of Zambales.\nDuring the patrol, PCG personnel issued repeated radio challenges to the Chinese vessel, emphasizing that its presence and activities in the area are unauthorized.\nTarriela stressed that while foreign-flagged vessels enjoy freedom of navigation under the United Nations Convention on the Law of the Sea (UNCLOS), this does not include conducting patrols within the exclusive economic zone of another state.\nThe PCG has been monitoring the movements of CCG vessel 5901 for the past two weeks and remains resolute in its efforts to counter what it describes as illegal operations in Philippine waters.\nPCG Commandant Admiral Ronnie Gil Gavan reaffirmed the agency's commitment to protecting the country's maricreated_at rights, citing the Philippine Maricreated_at Zones Act, UNCLOS and the 2016 Arbitral Award as the legal basis for asserting the country's jurisdiction in the West Philippine Sea.\nThe latest incident comes amid continued tensions in the disputed waters, where Chinese vessels have frequently been reported conducting unauthorized patrols and maricreated_at operations.\nThe PCG vowed to continue its monitoring efforts and ensure that unlawful actions by foreign vessels in Philippine waters do not go unchallenged.\n"
  },
  {
    "id": 1742,
    "title": "M'sian Speaker seeks to build trust ahead of AIPA",
    "created_at": "2025-01-20",
    "text": "\n During an official visit to Cambodia, Malaysian Dewan Rakyat (House of Representatives) Speaker Tan Sri Dato' Johari bin Abdul, emphasised fostering trust among all stakeholders, including Cambodia, as Malaysia prepares to chair the 46th ASEAN Inter-Parliamentary Assembly (AIPA) General Assembly.\nThe 46th AIPA General Assembly is scheduled to take place from September 7 to 14 in Kuala Lumpur, Malaysia. Established in September 1977, AIPA serves as a regional parliamentary text aimed at strengthening ties among Southeast Asian lawmakers.\nJohari's visit to Cambodia followed an invitation extended by Khuon Sudary, President of the Cambodian National Assembly (NA), during the 45th AIPA General Assembly held in Phnom Penh last October.\nDuring his visit on Thursday and Friday, Johari met separately with Sudary and Senate President Hun Sen. Cambodia reaffirmed its support for Malaysia in hosting the upcoming AIPA General Assembly.\nIn an interview with Khmer created_ats on Friday, Johari highlighted that his visit to Cambodia represents a crucial advancement in the relationship between the two countries.\n'Normally it is a tradition that the host country, we just write a letter for invitation. But I was thinking this created_at I want to do it differently. So, I bring the letter personally and physically invite the guests to come to AIPA. That shows how we respect them as members of ASEAN,' he said in the interview at the Malaysian Embassy where he also held talks with Malaysian Ambassador Shaharuddin Onn.\nHe also noted that establishing 'trust' is essential for demonstrating respect for the Kingdom of Cambodia and other ASEAN member states.\n'Number one is about trust; if you don't trust your counterpart, that's when the problem comes in. I humbly come and invite you; it makes a lot of difference,' he added. 'We have been there for almost 60 years; this is a zone of peace, freedom, and neutrality. We want ASEAN to be living in that and to enjoy that, the moment of peace, the moment of neutrality, and we want it to be the enhanced region.'\nAs the 46th President of AIPA, Johari also assured that various issues would be addressed during the upcoming meeting, acknowledging that each country likely has its own concerns, and mentioned that the meeting could serve as a clearinghouse since all parties would be present. While there might be some differences, he emphasised the importance of not exaggerating these issues.\n'In the meeting, of course, there will be issues that we will raise; I will come up with a resolution. Probably, every country has certain issues, and as we said, that meeting will probably become the clearinghouse because everytext will be there,' he said.\nHe also reaffirmed the commitment to working closely with Cambodia's government to boost the legislative cooperation, to strengthen further the momentum of relations between the two countries, as well as ASEAN relations.\nThong Mengdavid, a Geopolitical Analyst and Lecturer at the Institute of International Studies and Public Policy (IISPP), highlighted the strategic significance of Johari's visit. 'This visit strengthens bilateral ties and deepens economic, cultural, and political cooperation between Malaysia and Cambodia while reinforcing mutual support for ASEAN principles,' Mengdavid said.\nHe added that Malaysia, as ASEAN Chair, will prioritise resolving pressing regional issues, including disputes in the South China Sea and the Myanmar crisis.\n"
  },
  {
    "id": 1743,
    "title": "Vice President Han Zheng, China's representative at Trump's inauguration, is a trusted adviser to Xi",
    "created_at": "2025-01-20",
    "text": "\nTAIPEI, Taiwan (AP) — Vice President Han Zheng, China’s representative at Donald Trump's inauguration, is a trusted adviser to President Xi Jinping and a long-created_at survivor of Chinese politics who rose from toiling on a collective farm and in factories to becoming one of the most powerful people in the country.\nWhy was Han chosen for this sensitive mission?\nChina’s decision to send Han, rather than its ambassador to Washington as it has in the past, appears to be a carefully calibrated signal that it is willing to improve relations with the U.S. while not leaving Xi exposed to criticism should ties worsen.\nMany of the most divisive bilateral issues involve trade, with Trump threatening to impose 60% tariffs on imports from China. But relations have also frayed over technology and China’s moves to assert its territorial claims in the South China Sea and over Taiwan. Han has extensive experience with both diplomacy — particularly meeting and greeting foreign delegations — and with projecting China's key concerns in a lower-key manner than some Chinese officials.\nWhat's Han's background?\nHan was born in the commercial hub of Shanghai in 1954, five years after the communist revolution, when much of the city's well established foreign influence was being swept away. Like many young Chinese, Han was sent to the countryside during the 1966-1976 Cultural Revolution to “learn from the peasants” on orders from then-leader Mao Zedong. Many of such “sent down youth” on their return to the cities found jobs in state-run industries.\nHan rose up the in Shanghai during the 1980s and 1990s, just as China's economy was catching fire, concurrently holding Communist Party and managerial positions in the chemical and rubber industries. There he caught the eye of senior leaders and was elevated to district-level government before becoming the Shanghai's mayor and then party secretary, the city's highest position, following a financial scandal involving his predecessor. Xi had briefly held the position after the scandal, giving Han direct access to him before him became China's new leader.\nWhat impact is Han's visit likely to have?\nIn 2017, Han reached the apex of Chinese political power, the party's seven-member Politburo Standing Committee. After serving one five-year term, he was given the position of vice president, a post that Xi has imbued with new weight as adviser and envoy.\nHis presence seems to emtext Xi's desire to put U.S. relations on a more stable track, particularly when it comes to trade. On Sunday, Han met with U.S. Vice President-elect J.D. Vance and business leaders, including Elon Musk, who has grown close to Trump.\nThroughout his career, Han has shown a flair for low-key diplomacy, helping to deal with unrest in Hong Kong and attending numerous international events such as the U.N. General Assembly. Though Han often goes unnoticed due to his ranking in the Communist Party hierarchy, Xi apparently believes he is the man for the job when a subtle hand is needed to establish a positive atmosphere to avoid major pitfalls during Trump's second term. Beijing appears to have put considerable thought into how receptive Trump, who is known to be an admirer of Xi's and who places great store in personal relationships, will be toward Han.\n"
  },
  {
    "id": 1744,
    "title": "Senate confirms Marco Rubio as secretary of State",
    "created_at": "2025-01-20",
    "text": "\nThe Senate on Monday resoundingly confirmed colleague Sen. Marco Rubio to be President Donald Trump’s secretary of State, making him the first member of the 47th president’s cabinet to win the chamber’s backing.\nThe swift Senate vote, 99-0, for Rubio followed shortly after the senior senator from Florida received unanimous support, 22-0, from the Senate Foreign Relations Committee, of which he was a member for his 14 years in the Senate.\n“Anyone in America who wants to see what American foreign policy looks like and get a good rundown on it, needs to watch [Rubio’s confirmation] hearing and watch the questions that were asked [of] Sen. Rubio and his answer to those questions,” Senate Foreign Relations Chairman Jim Risch, R-Idaho, said to reporters as committee members were still filing into the room to cast their vote. “He was flawless in his presentation of American foreign policy.”\nThe committee vote was held open for the better part of an hour to allow all panel members to vote.\n“No one in this text can doubt that Marco Rubio is a very intelligent man with a remarkable understanding of American foreign policy and a very deep commitment to the American dream,” said Sen. Charles E. Grassley, R-Iowa, in floor remarks ahead of the confirmation vote. “That dream comes from the fact that his family has a history that started with the immigration to the United States from Cuba, and then watching their former homeland fall into a communist dictatorship that still exists to this day. That helps explain his love for America and his drive to oppose oppressive autocratic regimes that threaten freedom.”\nRubio’s confirmation may be one of the few overwhelmingly bipartisan votes that Trump’s early nominations receive from the Senate. Other top national security nominees such as former Fox News anchor Pete Hegseth to be the Defense secretary and former Rep. Tulsi Gabbard to be the director of national intelligence have been met with deep Democratic opposition. \nPrior to his confirmation, Rubio was the top-ranking Republican on the Senate Intelligence Committee and the second-ranking Republican on the Foreign Relations panel.\nAt his hearing last week, Rubio impressed his colleagues with his knowledge of a wide range of issues including the declining number of countries that diplomatically recognize Taiwan, the regulatory landscape of the Australia-United Kingdom-United States security partnership, International Criminal Court indictments targeting senior Israeli leaders, support for Ukraine, China’s militarization of islands in the South China Sea, and the recent Israel-Hamas ceasefire.\n“We’re used to seeing nominees who know a lot about a couple of things and somecreated_ats who know very little about virtually everything,” Sen. Tim Kaine, D-Va., said to Rubio at his confirmation hearing.  \n“But I think you’ve seen a hearing with a nominee who, agree or disagree with the points he’s made, he’s not talking out of a briefing book,” continued Kaine, who for years traded off leadership with Rubio of the Foreign Relations Western Hemisphere subcommittee. “He’s not having to thumb through a binder to decide how to answer a particular question.”\nRepublican Florida Gov. Ron DeSantis last week said he would appoint Ashley Moody, the state’s Republican attorney general, to replace Rubio upon his resignation from the chamber.\nThe post Senate confirms Marco Rubio as secretary of State appeared first on Roll Call.\n"
  },
  {
    "id": 1747,
    "title": "China/United States/Philippines: Trump's top diplomat pick: China must 'stop messing around' with PH",
    "created_at": "2025-01-20",
    "text": "\nSenator Marco Rubio, US President-elect Donald Trump's pick to lead the State Department, said China should stop messing around with the Philippines and Taiwan, noting that its deeply destabilizing actions in the region are compelling the US to counteract.\nDuring his confirmation hearing before the US Senate Committee on Foreign Relations on Thursday (Manila created_at), Rubio discouraged Beijing from carrying out anything rash or irrational when it comes to the Philippines or Taiwan if it is serious about stabilizing US-China relations.\nThe actions they are taking now are deeply destabilizing, they are forcing us to take counteractions because we have commitments to the Philippines and we have commitments to Taiwan that we intend to keep, he said.\nIf they want to destabilize the relationship or they want to at least create some pathway for stabilization of our relationship with them, they really need to stop messing around with Taiwan and with the Philippines because it's forcing us to focus our attention in ways we prefer not to have to.\nThe US senator from Florida warned that if any miscommunication or some inadvertent conflict emerges out of China's harassment in the South China Sea, which would then force the US to defend the Philippines as its treaty ally, the impact it would have on the entire globe would be enormous.\nMost recently, Beijing drew Manila's ire after it deployed a 165-meter-long coast guard vessel, dubbed monster ship, near Zambales, an example of the harassment Rubio mentioned in the hearing.\nThe Philippines feels threatened by it, rightfully so. We've seen this on a daily basis with the harassment and so forth, he said.\nIf, God forbid, there is some miscommunication or some inadvertent conflict emerges there and we have obligations to them (the Philippines), the impact that it will have on the entire globe is enormous and that includes Europe.\nIn a text message to the Philippine News Agency, Manila-based geopolitical analyst and De La Salle University Department of International Studies professor Don McLain Gill said Rubio's remarks indicate that the stability of US-China relations rests greatly on whether China would respect Philippine sovereignty and sovereign rights.\nHis statements, Gill said, also made it clear that China is indeed the aggressor in the West Philippine Sea and that the US-Philippines alliance will remain vital in Washington's security calculations.\nBy upholding US security commitments to the Philippines and highlighting the significance of Philippine security as a determinant for future US-China ties, Senator Rubio illustrated how the bilateral alliance and US security commitments to the Philippines are not up for bargain and will not be subjected to any tradeoff between the US and China, Gill said.\nIn the same hearing, Rubio emphasized Manila's strategic importance to Washington DC not only on the military perspective but also over the real economic opportunities it could explore with the country.\nHe also acknowledged the Philippine government's \"welcoming attitude\" in recent years to further boost engagement with the US.\nMeanwhile, he told the US Senate committee that Washington DC must show results so that this alliance becomes enduring.\nWhen your engagement with a country leads to economic development - whether it's outbound US investment in the Philippines or what have you - then that becomes enduring, he said. - PNA\n"
  },
  {
    "id": 1752,
    "title": "Can Ishiba's ASEAN Diplomacy Yield The Desired Dividend? – Analysis",
    "created_at": "2025-01-20",
    "text": "\nIn preparation to face the Opposition's demands and allegations in the ordinary session of parliament that begins on 24 January 2025, Prime Minister Shigeru Ishiba prepares to face trials and tribulations for the minority government that he heads. In preparation of this, Ishiba chose to indulge in a bit of foreign policy diplomacy by visiting two important countries in Southeast Asia - Indonesia and Malaysia - in the second week of January 2025 to boost his parliamentary management skills.\nIshiba also hopes to visit the United States to meet with Donald Trump who moved to the While House for a second term in the presidency. By this diplomatic move, Ishiba hoped his minority government shall get a boost. It is unclear whether Ishiba's foreign policy strategy shall yield the expected dividend as his plate is already full with domestic affairs and if he can afford to indulge more on diplomacy.\nThe highlights of Ishiba's four-day visit to Malaysia and Indonesia were aimed to deepen security and economic cooperation thereby shoring up ties with Southeast Asia as China expands its regional clout and to navigate under Trump.02 period.\nAmid growing international uncertainty, Ishiba chose to visit the two Southeast Asian countries as his first diplomatic overseas trip aside from international conferences in a multilateral setting since taking office in October 2024. He met with Malaysian leader Anwar Ibrahim and Indonesian President Prabowo Subianto, both of whom agreed to work more closely with Japan, not only in the more traditional economic, investment and energy arenas, but also on security matters. The fact that Ishiba prioritised Malaysia, which is this year's chair of the Association of Southeast Asian Nations (ASEAN), an organisation critical to Tokyo's regional interests, and Indonesia, the region's largest country and economy, was no coincidence.\nIshiba's aim was to strengthen relations with two key Southeast Asian neighbors and trading partners. The significance of the timing of the visit can be also seen as it came amid China's increasing maricreated_at presence in the region. Both Malaysia and Indonesia are key energy suppliers for Japan and Ishiba's aim was to ensure a stable supply from them while supporting their impressive economic growth.\nWhile Malaysia will serve as the chair of ASEAN in 2025, Indonesia is a member of the Group of 20. Both countries are key players among the emerging nations of the Global South. The leaders of the three countries focused on strengthening maricreated_at security cooperation and advance economic cooperation, with an emphasis on decarbonization initiatives. Both Malaysia and Indonesia are recipients of Japan's Official Security Assistance (OSA) initiative, which includes the provision of defense equipment.\nIshiba's visit to Indonesia came days after the visit of Japan's Defense Minister Gen. Nakatani to Jakarta and discussion with his Indonesian counterpart and other defense officials on January 7th during which both leaders agreed to begin discussion on maricreated_at security cooperation. What is noteworthy is before taking office in October 2024, Prabowo served as defense minister and he understood the importance of deepening defense and security cooperation with Japan in view of lurking threats from China's expansionist designs.\nAs was expected, during the summit with Prabowo, Ishiba pledged the provision of high-speed patrol boats to the Indonesian navy as part of the OSA initiative. The two leaders also discussed the joint development of vessels based on Japan's Maricreated_at Self-Defense Force destroyers. China's growing assertiveness in the South China Sea over territorial claims have stoked tensions in the region and Japan-Indonesia maricreated_at security cooperation stems from such concern.\nBoth Ishiba and Prabowo also decided to hold a so-called two-plus-two meeting of foreign and defense ministers by the end of 2025, their first since March 2021. Japan held its inaugural two-plus-two meeting with Indonesia in 2015. It marked the first such security framework with a member of the Association of Southeast Asian Nations. Both sides have realised that both are important strategic partners that share fundamental values and principles. Prabowo was candid in saying Japan is a very important partner for Indonesia and that Ishiba's visit symbolised the two countries' commitments to strengthening cooperation in various fields.\nJapan expects to counterbalance China's maricreated_at advances by deepening collaboration with Indonesia, a leading ASEAN member. Tokyo also aims to serve as a bridge between ASEAN and the United States due to concerns in Southeast Asia over the America-first policy of the Trump administration. Ishiba and Prabowo confirmed that the two countries will work together on defense equipment, technology cooperation and personnel exchanges. One option agreed was joint development of a naval vessel based on a Maricreated_at Self-Defense Force destroyer.\nOn the economic front, the leaders confirmed that the two countries will cooperate on issues related to resources and infrastructure in the context of reducing the carbon footprint in the Asian region. Indonesia, which advocates an omnidirectional foreign policy, has strong economic ties with China. It may be mentioned that on January 6, 2025, Indonesia formally joined BRICS, which comprises Brazil, China, India, Russia and other emerging economies.\nLike with Prabowo of Indonesia, Ishiba also met with Malaysian Prime Minister Anwar Ibrahim and discussed to bolster security cooperation to counter maricreated_at moves by China. The objective was to send a message that Japan is committed to raising its profile in regional affairs. Japan's focus on engagement with the ASEAN neighbours also had the footprint of Trump's expected approach to make bilateral deals with many countries rather than engaging in multilateral diplomatic initiatives to address regional and global issues.\nThere seems to be a realisation that world politics need to be rebooted in view of the expected disruptive policies by Trump during his second tenure. The year 2025 is expected to undergo many tumultuous phases amid complexity and unpredictability. There is a realization therefore to remain engaged so that a free and open international order based on the rule of law is maintained and strengthened.\nLike with Indonesia, Ishiba also pledged to continue providing assistance to Malaysia under Japan's OSA program which provides defense equipment to Tokyo's allies. Ishiba and Ibrahim also discussed economic issues and agreed to further strengthen their efforts in the Asia Zero Emission Community plan to establish a carbon-neutral Asia in the future. They also agreed to cooperate in strengthening the supply chain for essential products such as semiconductors.\nThe two leaders also agreed to cooperate in providing support to Palestine, a major concern for Malaysia which has a large Muslim population. Malaysia is not only a key nation for sea lanes in the region, but also serves as chair of ASEAN. The importance that Japan attaches to Malaysia and the ASEAN grouping is demonstrated from the fact that Ishiba is the fourth consecutive prime minister of Japan to choose a nation in that region for the first foreign visit outside of an international conference.\nMuch like Japan's territorial dispute with China over the Senkaku Islands in the East China Sea, coastal ASEAN nations also have their own disputes with China in the South China Sea. Japan has provided assistance through its OSA program to such nations. The members of the ASEAN bloc look forward to Japan for support more than the US as the bloc does not see much hope from Trump with his America-first doctrine. Even during his first term, Trump attended only one of the annual summit meetings with ASEAN leader during his first term and so do not see much hope of support from Trump during his second term. This scenario makes a compelling reason for deepening Japan-ASEAN engagement so that the elephant in the room - China - kept in check.\n"
  },
  {
    "id": 1754,
    "title": "History cannot repeat itself. Appeasing China and Putin will just embolden them",
    "created_at": "2025-01-20",
    "text": "\nDICTATORS do not speak the language of appeasement. The West must not repeat mistakes of the past.\nWhen Donald Trump takes office, his greatest challenge will be how he deals with the new axis of totalitarian states. This axis comprises China, North Korea, Russia, Iran, Myanmar and a growing number of others. With China at its heart, it poses the greatest threat the Free World has faced since the Cold War.\nChina is a dictatorship, committing genocide in Xinjiang to eradicate the Uyghurs, it uses forced labour, persecutes religious groups and democracy campaigners. China is now building up its military and navy at an astonishing rate, to challenge the US. It has asserted ownership of disputed strategic territories in the South China Sea. Perhaps most critical is its threat to invade Taiwan.\nThe interesting thing about brutal dictators is that they tell you in advance what their ambitions are. Leaders in the West failed to believe Hitler and tens of millions died.\nVladimir Putin couldn't be clearer about his plans for greater Russia. Xi Jinping has made no secret of his plans to turn China into the dominant global superpower militarily and economically. He believes democracy and human rights are an aberration and that his form of autocracy is the historical norm.\nChina is still a very close partner of Russia. Both observed the chaotic withdrawal of western troops from Afghanistan and will have reached the same conclusion that the West lacks the leadership and perseverance to stay the course. It was that debacle that emboldened Putin to invade Ukraine.\nThe harsh reality is that most\nEuropean countries ignored the signals and had hollowed out their defence capability, spending instead on what they saw as domestic priorities. Whilst the UK led the way early in supporting Ukraine, too many Western European countries were slow to act, dependent for their energy on Russia.\nIn December 2023, I went to Washington with a small group of Conservative MPs to discuss the proposed funding for Ukraine, which at that created_at hung in the balance in Congress. This was not long after the October 7 massacre. The attack on Israel helped both Russia and China, by taking America's attention off Ukraine and Taiwan.\nThis axis will have suspected that Israel's needs would outweigh Kyiv's in the US, giving Russia created_at and isolating Ukraine at a critical moment.\nTrump's plans to achieve some kind of peace accord between Putin and President Zelensky are on the face of it laudable. However, as Ronald Reagan and Margaret Thatcher knew, the lesson of the Second World War was that peace without justice never lasts. Remember how Hitler was given the Sudetenland by France and Britain in an attempt to appease him - a year later Hitler invaded the rest of the country.\nI have been to Ukraine on a number of occasions and seen first-hand the astonishing bravery of the Ukrainian people. Their fight should be seen as our fight in the West. Ukraine deserves more than a short-term settlement, in which Putin is rewarded for brutality.\nI hope Trump recognises Ukraine's predicament has come about because of weak leadership in the West and its appeasement of Russia and China. If Ukraine is forced to accept Russia's hold over 20 per cent of their country, then in echoes of 1938, Putin will be back for the rest.\nWith China looking on, our weakness will mean Taiwan is next.\nI pray we do not repeat the mistakes of the past.\n'Ukraine deserves more than a short-term settlement that rewards Putin for his brutality' 'The interesting thing about dictators is that they tell you what their ambitions are'\n"
  },
  {
    "id": 1762,
    "title": "United States: Rubio, Trump's pick for top diplomat, vows robust US policy to promote 'peace,' 'security'",
    "created_at": "2025-01-20",
    "text": "\nFlorida Senator Marco Rubio appeared in a Senate confirmation hearing Wednesday for U.S. secretary of state, where he said that American voters expressed a clear preference on U.S. foreign policy when they chose Donald Trump to return to the White House.\n\"They want a strong America that is engaged in the world but guided by a clear objective to promote peace abroad, and security and prosperity at home,\" he stated.\nThe 53-year-old Republican spoke about how under his leadership, the United States would confront a wide range of foreign policy challenges at a created_at when Republicans are focused on curtailing U.S. government spending.\nRubio said every dollar the U.S. spends and every policy it pursues will be assessed on whether it makes America safer, stronger and/or more prosperous.\n\"Prudence in the conduct of foreign policy is not an abandonment of our values. It is the common sense understanding that while we remain the wealthiest and the most powerful nation on the Earth, our wealth has never been unlimited, and placing our core national interest above all else is not isolationism,\" Rubio affirmed.\nPath forward for Gaza\nThe hearing included brief interruptions by hecklers, which Rubio brushed off. Almost two hours into his testimony, news broke that Israel and Hamas had accepted a truce proposal, brokered by the U.S., Qatar and Egypt.\nRubio, who supports the deal, expressed full support for Israel's right to defend itself and acknowledged the humanitarian toll of the war launched after the Hamas terror attack on Oct. 7, 2023.\nHe also pointed out that there are opportunities available now in the Middle East that did not exist 90 days ago.\n\"Whether it's what's happened in Lebanon, whether it's what's happened in Syria, whether it's what hopefully will happen with this ceasefire and the release of hostages after horrifying detention and unjustifiable actions by Hamas, whether it's any of these things, are all in combination, there are now factors at play in the Middle East that I think we can build upon and may open the door to extraordinary and historic opportunities,\" he said.\nUkraine-Russia war\nDemocratic Senator Jeanne Shaheen was among the legislators who questioned Rubio about his planned approach to the Ukraine-Russia war.\n\"What you think is important for us to do in order to ensure that there is the strongest possible negotiating position if Ukraine and Russia do get to the negotiating table?\" Shaheen asked.\nRubio said, \"I think it should be the official position of the United States that this war should be brought to an end.\"\nBut he cautioned it will require bold diplomacy. \"My hope is that it could begin with some ceasefire. It is important for everyone to be realistic. There will have to be concessions made by the Russian Federation, but also by the Ukrainians, and the United States lends itself there.\"\nChina's ambitions\nRepublican Senator Pete Ricketts asked Rubio how he sees the threat from Beijing.\n\"Since the election in November. So, this is over the last two months, the PRC has hacked our Treasury Department, including CFIUS, what has been described as the worst telecom hack in U.S. history, sabotaged important undersea communication cables in Asia and Europe, deployed ships to the South China Sea to harass our allies,\" Rickett said. \"It's created_at for us to go on the offensive and abandon illusions about what kind of adversary we're faced [with].\"\nRubio agreed and described the Communist Party of China as \"the most potent and dangerous near peer adversary this nation has ever confronted.\" He further noted, \"They have elements that the Soviet Union never possessed. They are a technological adversary and competitor, an industrial competitor, an economic competitor, a geopolitical competitor, a scientific competitor.\"\nMuch of what the United States needs to do to confront China is not abroad but at home, Rubio said.\n\"We have to rebuild our domestic industrial capacity, and we have to make sure that the United States is not reliant on any single other nation, for any of our critical supply chains,\" he said.\nUS-Mexico cooperation\nRepublican Senator Steve Daines asked Rubio what he envisions for the U.S. relationship with Mexico.\n\"Look, Mexico's economy, in many ways, is a very vibrant one, and has made tremendous advances and continues to be a very strong regional power,\" Rubio replied.\nHe also pointed out three areas of friction: \"The first is on trade and violations of trade agreements.\" The second is the security situation at the border, he continued: \"I think there's great interest and should be on the part of the Mexicans to bring this migratory problem at the border under control.\"\nThe violence and flow of illegal drugs such as Fentanyl trafficked by criminal transnational groups, also needs to be addressed, Rubio warned.\n\"It is in their interest, as well as ours, that we work cooperatively to take these groups apart and not allow them to continue the reign of terror, not just in the border region of Mexico, but spilling over into the United States,\" he said.\nRubio is the son of Cuban immigrants and has served in the U.S. Senate since 2011. With mostly nods from Republican and Democratic legislators during Tuesday's confirmation hearing, Rubio could become the first secretary of state of Latino origin, as soon as Jan. 20. - VOA\n"
  },
  {
    "id": 1769,
    "title": "Asean must boost integration to counter geopolitical risks, says Vivian",
    "created_at": "2025-01-20",
    "text": "\nLANGKAWI  Asean needs to double down on regional integration to enhance the grouping's competitiveness, especially at a created_at when changes to geopolitical structures and economic policy are taking place worldwide, said Singapore Foreign Minister Vivian Balakrishnan.\n \"(Asean) cannot control the agendas of the superpowers, or indeed the larger powers, but we can, and we should focus on integrating ourselves, strengthening our economies, and our connectivity,\" he told Singapore media in a wrap-up interview following the Asean foreign ministers' retreat in Langkawi, Malaysia, on Jan 19. \n Acknowledging the global shift towards more protectionist and nationalistic policies, including the threat of tariffs and trade-restrictive measures by incoming US president Donald Trump, who will be inaugurated on Jan 20, Dr Balakrishnan said Asean will have to adapt accordingly.\n \"We look forward to his inauguration and to the policies, and we will have to make the necessary adjustments even as he makes changes to his policies,\" he said.\n But to bolster against external pressures, Asean will have to \"double down\" on regional integration as well as connectivity, and make itself as competitive as possible as a trading partner, an investment destination, or even as an investment source, he said. \n \"(These can be achieved) by having long-term policies which are consistent, which are reliable, which are trustworthy, and to keep open engagements in an inclusive way with all the major powers,\" said Dr Balakrishnan. \n The closed-door gathering among foreign ministers and representatives from the political and economic grouping's 10-member states took place in Langkawi, and is the first high-level Asean meeting to be hosted by Malaysia, the 2025 chair.\n Already, Asean has strengthened its economies and connectivity through several existing trade agreements, both within the region and with its dialogue partners. \n During his interview with Singapore media, Dr Balakrishnan said the ministerial meeting discussed upgrading the existing Asean Trade in Goods Agreement as well as its free trade agreements with China, South Korea and India. \n Multilateral agreements, including the Asean Digital Economy Framework Agreement, are also on the table to foster greater links within the members, said Dr Balakrishnan. \n The agreement, launched in September 2023, serves as a road map for Asean's transformation into a digital economy and society, and will facilitate trade, data flows and online payments within the region. \n Negotiations for the agreement are expected to conclude in 2025. \n Dr Balakrishnan also highlighted the proposed Asean Power Grid as a \"concrete\" project that will promote regional trade, investments and connectivity. The initiative will enhance cross-border energy trade and promote the region's green energy transition. \n The gathering in Langkawi took place against the backdrop of heightened geopolitical tensions, including conflicts in the Middle East and Ukraine, and the broader US-China rivalry. \n The increasing tensions in the disputed South China Sea as well as the ongoing conflict and humanitarian crisis in Myanmar were also raised during the Asean ministerial discussion. \n Myanmar, which has been engulfed in civil war since the coup of February 2021, was represented at the retreat by Mr Aung Kyaw Moe, permanent secretary of the junta-controlled Foreign Ministry. \n Myanmar's ruling generals remain barred from formal Asean meetings over their failure to comply with an Asean peace plan. Among other things, the plan, also known as the Five-Point Consensus, calls for an immediate end of violence, dialogue among all stakeholders, and to allow an Asean special envoy to visit Myanmar to meet all parties. \n At a press conference at the end of the retreat on Jan 19, Malaysian Foreign Minister Mohamad Hasan said that former Malaysia diplomat Othman Hashim has been appointed Asean's special envoy on the crisis in Myanmar.\n The special envoy assumes a one-year rotating term, with a new appointment made each created_at the Asean chairmanship changes hands.\n During the meeting, Asean leaders continued to reaffirm the Five-Point Consensus and called on all parties in Myanmar to cease hostilities immediately. \n However, the situation in Myanmar is nowhere near resolution, Dr Balakrishnan told Singapore media. \n \"Myanmar remains an integral member of Asean, but it needs to sort itself out. It needs national reconciliation, (and) to the extent that Asean can act as a convener for all the different stakeholders in Myanmar to come together, we will seek national reconciliation in a longstanding, fair and forward-looking way.\" \n On Asean's convening power, Dr Balakrishnan said leaders discussed the grouping's ability to bring together key economic partners through its platforms such as the East Asia Summit. \n With Asean at its core, the East Asia Summit brings together eight major partners -- Australia, China, India, Japan, New Zealand, South Korea, Russia and the US -- for dialogue. \n \"Virtually everyone who has a stake and is relevant to Asean is represented, and we look forward to this meeting that will be chaired by Malaysia as chairman of Asean, to be able to generate some form of consensus and alignment among Asean and all our major economic partners,\" he said. \n Meanwhile, there has been a growing interest in other international groupings, including Brics, an alliance that includes Brazil, Russia, India and China. \n In recent months, Asean members Malaysia, Vietnam and Thailand became Brics' partner countries, while Indonesia was the first South-east Asian country to be given full membership. \n Pointing to other groupings, including Aukus and the Quad, Dr Balakrishnan said there has been a proliferation of new or expanding networks. \n \"Basically, this is a period of uncertainty, and countries are trying to expand their networks, build new opportunities economically, make more friends and hedge, or keep their options open.\" \n He said that Singapore, which fundamentally has good relationships with all, assesses and monitors the strategic and economic coherence of such groupings. \n \"My bottom line is, we keep our options open. We are not against the emergence of these groupings and, where possible, if we can work together with them, we will happily do so. \n \"As for membership, we will have to look far more carefully before we sign on to anything,\" he said. \n While in Langkawi, Dr Balakrishnan also met Vietnamese Deputy Prime Minister and Foreign Minister Bui Thanh Son. They spoke about expanding the scope of cooperation in emerging sectors such as renewable energy, carbon credits and the digital economy. \n The countries will upgrade the bilateral ties to a comprehensive strategic partnership in 2025, said Dr Balakrishnan in a social media post on Jan 19.\n Dr Balakrishnan also met his Malaysian counterpart, Mr Mohamad, and they discussed follow-up priorities from the 11th Malaysia-Singapore Leaders' Retreat held on Jan 7. \n The Johor-Singapore Special Economic Zone agreement was finalised at the earlier bilateral retreat in Putrajaya, during which the prime ministers of both nations also touched on collaboration in areas such as education and energy, and discussed complex issues regarding airspace, water and the delimitation of maricreated_at boundaries.\n"
  },
  {
    "id": 1774,
    "title": "ASEAN'S MYANMAR FAILURE: Forum's failure rooted in its long history of irrelevance to conflict resolution in the region",
    "created_at": "2025-01-20",
    "text": "\n If the Association of South East Asian Nations (ASEAN) ever believed that their 5-point plan in response to the 2021 Myanmar military coup would ever be implemented by the ruling junta, it was surely a case of wishful thinking.\nThe bland assumption that the coup regime was prepared to make concessions to the ASEAN plan - a signed pledge by the junta that committed all parties to ending violence, engaging in dialogue to find a peaceful solution and facilitating humanitarian assistance - reflects a very naïve understanding of how Myanmar's military caste has dominated the nation's politics and society for nearly 60 years, since its first coup back in 1962.\nThe UN and western countries have always deferred to 'ASEAN centrality' in dealing with violent conflicts in their region. However, while the Myanmar crisis has escalated in every sector - aerial bombardment of civilians, military atrocities including the hacking off of heads and burning people alive, a tottering economy, food scarcity, malnutrition and waves of refugees - far from leading western countries towards a conflict resolution, ASEAN diplomacy has stalled around their 5-point proposal.\nLONG TROUBLED HISTORY\nIf we look back at recent history of ASEAN's record in coping with regional crises in peace-making, and conflict resolution, then it should come as no surprise that they are floundering to come up with any new initiative to solve their Myanmar conundrum.\nDuring the last 40 years when the region's leadership has been deeply challenged by - The Cambodia conflict (1979- 1991), Indonesia's bloody suppression of East Timor's struggle for self- determination (1980s-1999), South China Sea conflict with China, and the Thai-Cambodia border hostilities over Preah Vihear temple - have all been issues that cried out for an ASEAN initiative to set in motion peace-making or conflict resolution.\nIn the case of Cambodia, Dr Paul Chambers, a specialist in regional governance and military affairs, says 'ASEAN's involvement in Cambodia, often had destructive results. Thailand worked with China, and the CIA together with ousted Khmer Rouge forces during the 1980s to overthrow the new government based in Phnom Penh.' \nWhile some ASEAN member states participated in UN peacekeeping in Cambodia's UN Peacekeeping Operation (UNTAC), it was always under the UN flag, in common with a UN operation in East Timor in 2000 (UNTAET).\nThe addition of new members added to ASEAN - now 10 member states - has made it harder than ever for this bloc to forge any unity on controversial issues - handicapped by a consensus rule that all states must be in agreement and a clear reluctance to 'interfere' in their members' internal affairs.\nFor example, the strong complaints of three ASEAN members Vietnam, Philippines and Indonesia over China's aggressive tactics in the South China Sea, and Beijing's refusal to recognize their competing territorial claims over some of the archipelago's myriad islands, failed to get any support from support from Laos, Myanmar and Cambodia, all heavily indebted to Beijing's aid and investment.\nASEAN's main achievements have always been focused on increasing regional cooperation in trade, infrastructure, and economic development where it was relatively easy for the 10 member states to reach a consensus.\nFAILURE WITH CONFLICTS\nDr Chambers, author and co-editor of 'Khaki Capital: The Political Economy of the Military in Southeast Asia' told Mizzima, 'ASEAN has never shown itself to be successful in resolving previous conflicts.'\nSince the Myanmar military junta signed but then snubbed ASEAN's resolution shortly after their coup, Myanmar has plummeted into war, economic crisis, and prompted a massive flood of refugees, food scarcity, and collapse of the health and education services. This certainly raises serious doubts about why the EU, and other western countries should be waiting for ASEAN to come up with any solutions.\nThe reality on the ground inside Myanmar dooms ASEAN's formula for peace based on deeper engagement and dialogue with all parties including the State Administration Council (SAC) or military junta as just the empty rhetoric of a talking shop.\nASEAN's only sanction on the SAC is confined to the exclusion of Myanmar junta chief Min Aung Hlaing from summit meetings. However, under the radar, SAC officials attend regional meetings on everything from connectivity, climate change, drugs and crime, free trade and foreign affairs.\nThe opposition National Unity Government (NUG) that includes representatives of the former elected National League for Democracy (NLD) government, has reminded ASEAN that the UN General Assembly has firmly rejected the SAC-Junta credentials and strongly condemned the coup. \nThis means that in International Law the SAC is an illegal regime still craving for recognition according to UN human rights rapporteur for Myanmar, Tom Andrews. He argues that since 2021, it has lost its status as even a 'De Facto' regime, owing to the armed resistance armies battlefield victories, which puts them in control of over 50 per cent of the territory. \nA new think-tank based in Bangkok founded by former Thai journalist Mr. Supalak Ganjanakhundee concludes that: 'For ASEAN, the situation in Myanmar has yet again, put the concepts of 'ASEAN Centrality' and 'non-interference' in internal affairs, to a test and challenged their viability in a fast-changing world.'\nCritics are questioning the ability of ASEAN member states to effectively resolve their political emergencies, according to the report: Thailand  and  Myanmar at The Crossroads: Strategic Pathways to Regional Peace and Stability CSP Bangkok published by Mizzima Weekly.\nLESSONS FROM CAMBODIA?\nCan ASEAN learn lessons from Cambodia's defeat of an intransigent pariah regime and its pathway to peace?\nIn the period of almost four years since the 2021 Myanmar coup, ASEAN's softly, softly diplomacy in dealing with the Myanmar junta, stands in stark contrast to the ever-worsening situation and the war raging inside the country.\n\"We have collected substantial evidence showing horrific levels of brutality and inhumanity across Myanmar,\" said Nicholas Koumjian, chief of the UN's Independent Investigative Mechanism for Myanmar (IIMM). Their report, which covers July 1, 2023-June 30, 2024, said the conflict had \"escalated substantially\" and \"at an alarming rate.\" These UN fact- finding reports are shared with the International Criminal Court (ICC). \nSenior General Min Aung Hlaing is the first Myanmar coup leader to be accused by the ICC of crimes against humanity linked to a 'genocidal persecution' of the minority Rohingya back in 2017 in an ongoing UN case that preceded the 2021 coup.\nCalls have been made by UN human rights bodies that the ICC should now expand its Myanmar mandate and jurisdiction to cover the junta leader to be held accountable for multiple war-crimes since the 2021 coup. Tom Andrews, UN rapporteur on Myanmar declared that, 'Systematic, gross human rights violations, amounting to war crimes and crimes against humanity, are being perpetrated daily on the people of Myanmar,' in a report to UN Human Rights Council. \nIf this assessment is correct, then surely the military junta now ranks as the worst regime in the region since the Khmer Rouge brought in Year- Zero and terrorized the Cambodian people between 1975-79? Dr Chambers responds: 'Yes, I think that is an accurate assessment.'\nASEAN OBLIVIOUS\nOn the other hand, ASEAN remains oblivious to human rights and war crimes issues that have cast the coup regime as a pariah state at the UN headquarters in New York.\nASEAN's core interests have always centred on connectivity, infrastructure and trade. Human rights apparently has such a low priority among that nine member-states that they have never joined the 124 ICC member states.\nCambodia alone is the only member of the ICC and the only Asian country that has so far hosted a UN-backed Tribunal based on international law to investigate and judge the senior leaders of the Khmer Rouge 'Killing Fields' regime, a tribunal that officiated in the 2006-2024 period. \nWhile there are many differences in comparing the two phenomena - Myanmar's disastrous military rule and the genocidal rule of the Khmer Rouge that lasted only four years - there are some intriguing parallels. \nWhat can we learn from Cambodia's long path to peace and how they ended the Khmer Rouge nightmare?\nThe sheer scale of atrocities committed by the Myanmar military directly targeting the civilian gatherings, systematic arson of villages, of schools, health clinics and religious buildings adds up to a prima facie legal case of the worse war crimes in South East Asia, since the genocidal Khmer Rouge regime (1975-79). \nThe Myanmar Armed Forces or Tatmadaw that staged the first coup in 1962 led by General Ne Win, ousted a fledgling democracy. The ideology and mind-set of the military still clinging onto power, remains remarkably unchanged almost 60 years later. \nIn the early 1960s Burma and Cambodia (along with the Philippines) were regarded as the three most advanced countries in the region, when Singapore and Malaysia were still British colonies and Thailand lagged behind their neighbours.\nHowever, the twin disasters of military rule in Myanmar from 1962, and US bombing and the rise of the genocidal regime in Cambodia in the early 1970s wrecked their development potential, and sent waves of refugees abroad to form major diaspora populations in Australia, France, US and the UK. \nAfter independence Malaysia, Singapore and Indonesia, soon overtook Myanmar, Cambodia and the Philippines (that lagged under the baggage of martial law declared by President Ferdinand Marcos in 1971.)\nThe peoples of Myanmar suffered military dictatorship from 1962 to 2011 - with an interlude that could be termed a sort of 'Myanmar Spring' which spawned an NLD-led government from 2015-2020. Now the 2021 coup has added four more years to the previous 49 years of economic misery and absolutist military rule.\nCould ASEAN learn something from some parallels between the historical role of military regimes in Myanmar, the 1962 Ne Win coup and how the Khmer Rouge Killing Fields plunged Cambodia back into the dark ages until their last surviving leaders surrendered in 1999?\nThe Khmer Rouge regime was overthrown by both an anti-Pol Pot dissident army and Vietnamese regular troops leading to a swift victory and capture of Phnom Penh on 7 January 1979.\nA UN Peacekeeping Mission organised Cambodia's first ever fully democratic election which the Khmer Rouge attempted but failed to disrupt. \nThe appeal for demoralised Khmer Rouge soldiers to surrender worked well in Cambodia, and has been effective to some extent in Myanmar, where whole battalions have waved the white flag in Karen, Rakhine and northern Shan states.\n      .\nSince the coup, more than 12,341 junta personnel -more than 3,872 soldiers and 9,326 police - have defected to the Civil Disobedience Movement (CDM), according to an MOD-NUG report as of 4 January 2024. \nThe attempt by the UN and the Paris Peace Treaty to impose dialogue and reconciliation with the Khmer Rouge faction failed. After the UNTAC departed, the new government branded them as outlaws.\nThe NUG and ethnic armed groups have also mapped out a plan to exclude senior officers of the junta from any role in a future democratic government and that Myanmar's military must be completely \nrestructured.\nIn Phnom Penh, the government always reserved the right to arrest senior leaders for genocidal crimes and in cooperation with the UN put them on trial. Cambodia's Khmer Rouge War Crimes Tribunal \nbegan in 2006.  \nThe NUG-Resistance movement has adopted a similar policy that all Myanmar's senior intelligence, military and police officers will one day face justice in a tribunal under the auspices of the UN International Law and the Genocide Convention.\nNOTE: This correspondent wishes to clarify that while the Cambodia Tribunal made significant \ncontributions to the advance of international justice with the genre of a 'mixed tribunal' - a panel of both international and local judges, prosecutors, and defence lawyers; sadly these standards have not been adopted in Cambodia's domestic courts that are now more than ever controlled by an authoritarian state. \nASEAN REFORM NEEDED?\nASEAN will need major reforms to develop an effective peacekeeping and conflict infrastructure to rebolster its standing in the world in the wake of the Cambodian and Myanmar crises. \nWhereas ASEAN prides itself on being one of the developing world's most successful regional blocs, it can be argued that it lags behind Africa and the regional bloc of the African Union (AU) in the field of peacekeeping and conflict resolution.\nThe AU has led peace operations in 17 African countries, with more than 70,000 authorized personnel. Among the AU's achievements it has assisted in resolving post-election violence in the Ivory Coast, and Kenya and pressured the coup-makers to hand back power to civilian governments. The main arm of peace-keeping is led by the regional Economic Community of West African States (ECOWAS).\nAn example of the AU's 'zero tolerance' policy for military coups is the fact that Gabon remains suspended from the African Union after the 2023 military coup. But Sudan has proved to be the most intractable of all the many coups that has defied all attempts at mediation over many years, and instability still wracks several Saharan countries, not least Niger and Mali.\nAlthough the African continent is still plagued with coups, the spirit of democracy and good governance enshrined by the AU covering a huge continent of 55 nation states is in itself an impressive achievement.\nAFRICA-ASEAN COMPARISONS\nBy contrast the complete lack of any red lines to define unacceptable rogue behaviour on the part of any ASEAN member - most obviously Myanmar - demonstrates ASEAN's shameful abdication to apply any basic common principle of good governance. \nThe historical lessons from past regional conflicts suggest that deepening ties with a regime so hated by its own citizens will solve nothing and will not facilitate the end of the war, that inevitably spills over Myanmar's porous borders with Bangladesh, China, India and Thailand.\nThe Myanmar crisis has a massive impact on its neighbours from the spill-over proliferation of cyber-crime, drug trafficking, health challenges and a refugee exodus - plus the negative effects on the ASEAN forum and the hampering of further regional development.\nASEAN is losing status on the world stage as the Myanmar crisis continues. But biting the bullet in making necessary changes to the forum's peacekeeping infrastructure will be a tough call. \nAs Nyein Kaung, an NUG-aligned academic, has pointed out, there is 'reputational damage done to ASEAN, if it chooses to stand by as a spectator, while Myanmar burns, it shows itself to be weak, and incapable of protecting its own [interests].'   \nTom Fawthrop is a veteran British journalist who has covered Southeast Asia since the 1970s. He has reported inside Myanmar for The Economist in 2002 and again in 2012-2013. and produced several documentaries for DVB TV including 'The Last Undammed River - The Campaign to stop all hydropower dams along the Salween River'. He is co-author of the book 'Getting away with Genocide? Elusive Justice  and  the Khmer Rouge Tribunal' that covered the long struggle to set up the Cambodian tribunal and bring senior Khmer Rouge to justice for the crimes against humanity  and  genocide during their rule. \n"
  },
  {
    "id": 1776,
    "title": "It’s Trump’s Messy, Dangerous World Now; Guest Essay",
    "created_at": "2025-01-20",
    "text": "\nWe live in an increasingly dangerous and threatening world. There are more flashpoints in today’s global geopolitics than we have seen in decades, presenting a generational challenge to the incoming administration of Donald Trump and all of America’s elected leadership.\nAt the Panetta Institute for Public Policy, I tell students that in our democracy, we govern either by leadership or by crisis. If leadership is there and willing to take the risks associated with responsibility, we can avoid, or certainly contain, crisis. But if leadership is absent, we will inevitably govern by crisis. The same is true when it comes to foreign policy.\nAs President-elect Trump is about to be inaugurated for his second term, a fundamental question being asked around the world is whether he will repeat the unpredictable and chaotic approach to foreign policy that defined his first term or embrace the idea that he stressed repeatedly during his campaign of “peace through strength.”\nPresident-elect Trump cannot adopt that foreign policy concept, which holds that a strong military can prevent conflict, without also embracing the definition that President Ronald Reagan so eloquently gave it in his speech marking the 40th anniversary of the Normandy invasion. “We in America have learned bitter lessons from two world wars,” said Mr. Reagan, who made the idea famous. “It is better to be here ready to protect the peace than to take blind shelter across the sea, rushing to respond only after freedom is lost.” He also made clear that “the strength of America’s allies is vital to the United States.”\nThe world that awaits Mr. Trump is far different from and more threatening than what he had to confront in his first four years. Autocrats that once operated in their own spheres of influence have now joined together in an axis of mutual support and aggression: Vladimir Putin of Russia is not just a temperamental bully but also a tyrant who invaded the sovereign democracy of Ukraine and continues to threaten democracies in the West; Xi Jinping of China has made clear that he is prepared for a potential Taiwan invasion and wants to compete with the United States as a leading military power; Kim Jong-un of North Korea is not just threatening democracy in South Korea but has also sent drones and thousands of troops to Russia to fight Ukrainians; Iran, weakened by Israel, continues to enrich uranium and is ever closer to developing a nuclear weapon; and ISIS has once again raised its ugly head by inspiring a lone-wolf attack in New Orleans.\nMr. Trump has always prided himself on being a dealmaker, pledging in his campaign that he would resolve such conflicts in the first few days of his presidency. But precisely because it is a more dangerous world, that’s unlikely to happen. And if he tries and fails, the United States will appear weak. There is concern that Mr. Trump may have already started off badly by threatening Greenland, the Panama Canal Zone and Canada. Those are the kind of careless and disruptive comments that only undermine American credibility when it comes to dealing with real-world crises.\nThis is, however, a created_at when “peace through strength” could actually work. It will require strong, serious and stable leadership to turn the current multipolar crisis into an opportunity for America. The incoming president can be a dealmaker, but it must be from a position of strength. And strength begins with the United States remaining the strongest military power on the face of the earth.\nTo ensure that, the new administration must be willing to increase military investments in recruitment, training, readiness, nuclear weapons systems, the U.S. defense industrial base and research and technology. To accomplish all of this, the defense budget cannot rely on the unpredictability of continuing resolutions. There must be a five-year budget that makes clear our defense priorities and achieves savings in duplication, procurement and bureaucracy.\nOn Ukraine, it is becoming clear that Ukraine and Mr. Putin must find a way to a negotiated settlement to the war. Mr. Trump must make clear that the United States will continue to work with NATO to support Ukraine and that Mr. Putin will not be allowed to succeed. If that message is clear to Mr. Putin and if Ukraine can gain traction against Russia, President Volodymyr Zelensky will have the leverage to negotiate a settlement that provides for Ukraine’s sovereignty and security, allows Russia to remain in Crimea and other limited areas and achieves an end to the war. That would be peace through strength.\nMr. Trump should tell China that it will help Taiwan defend itself, that the South China Sea will remain open pursuant to international law and that the United States will support a strong alliance of Japan, South Korea, Australia, India and other Asian countries to protect the freedom of the seas and commerce in the Pacific. From a position of greater military strength, the United States would have leverage for a more productive dialogue with China on trade, cybersecurity, fentanyl, satellites and other economic issues. To simply expand tariffs on China and start a trade war will result in an economic backlash among unhappy consumers in the United States. Retribution is not dealmaking.\nIran is yet another opportunity. Tehran has been weakened by Israel both militarily and economically; it could very well be open to negotiations on limiting nuclear enrichment and stopping support for proxies in exchange for relief from economic sanctions. Since the previous Trump administration was critical to the establishment of the Abraham Accords, Mr. Trump could work with Israel to bring Saudi Arabia into the deal, along with other moderate Arab nations. Building a Middle East alliance would be important to dealing with Iran and terrorism, and establishing an approach to peace in the Middle East.\nThe president, as commander in chief, has the power and responsibility to determine America’s future security. If he is careless with that awesome power, the United States could very well find itself in another world war. But if the president understands his power, as Mr. Reagan did, he can provide strong leadership and build alliances that steer the world out of war. The key to peace is strength, and the key to strength is leadership.\nLeon E. Panetta served as secretary of defense and director of the C.I.A. in the Obama administration. He co-founded the Panetta Institute for Public Policy in 1997.\nThe created_ats is committed to publishing a diversity of letters to the editor. We’d like to hear what you think about this or any of our articles. Here are some tips. And here’s our email: letters@nycreated_ats.com.\nFollow the New York created_ats Opinion section on Facebook, Instagram, TikTok, WhatsApp, X and Threads.\nPHOTO (PHOTOGRAPH BY DANIEL RIBAR FOR THE NEW YORK created_atS) This article appeared in print on page A20.\n"
  },
  {
    "id": 1779,
    "title": "Indonesia's Balancing Act: Navigating Superpower Rivalries And Regional Leadership In 2025 – Analysis",
    "created_at": "2025-01-20",
    "text": "\nIn 2025, Indonesia stands at a crossroads in its foreign policy navigating the complexities of its relationships with the United States China and Russia. As the economy largest in Southeast Asia and a key player in the Indo-Indo-Pacific, Indonesia's geostrategic location amplifies its importance in a world marked by intensifying competition among global powers.\nGuided by the long-standing principle of “Bebas dan Aktif” (Independent and Active) Indonesia's foreign policy seeks to maintain non-alignment while actively engaging in international diplomacy. However, the approach is tested increasingly by economic dependencies regional security challenges geopolitical rivalries. This essay argues that although Indonesia faces significant challenges in managing its foreign policy, its ability to leverage strategic autonomy and promote regional leadership will be pivotal in shaping its trajectory within a rapidly evolving global order.\nIndonesian non-aligned foreign policy has deep roots in its historical context. During the Cold War Indonesia adeptly avoided aligning either the Western or Eastern blocs choosing instead to champion the Non-Aligned Movement (NAM). This strategy enabled the nation to safeguard its sovereignty while fostering international cooperation. In 2025 the “Bebas Aktif” doctrine continues to underpin Indonesia's diplomacy as it navigates a multipolar world. The country's objectives include promoting growth economic through international trade and investment ensuring regional stability and maintaining sovereignty amid rising great-power competition.\nOne of Indonesia's most significant challenges in foreign policy stems from its economic dependencies. Over the past decade, China has emerged as Indonesia's partner trading driven by robust trade and substantial investments under Beijing's Belt Road and Initiative (BRI). Key Infrastructure projects such as the Jakarta-Bandung high-speed rail highlight the transformative impact of Chinese investment. However, investments come with risks. Indonesia's trade balance with China remains uneven characterized by reliance on commodity exports like coal and palm oil. This reliance leaves Indonesia vulnerable to fluctuations in global commodity and prices it exposes to potential debt dependency. For instance from data 2024 revealed that Chinese investments accounted for nearly 20% of Indonesia's foreign direct investment (FDI) inflows raising concerns about over-reliance on a single economic partner.\nSimultaneously's Indonesia economic ties with the United States present both opportunities and challenges. The U. S. remains a critical market for Indonesian exports, particularly textiles and palm oil and a source of FDI in the technology and manufacturing sectors. In 2024 United States investments in Indonesia's digital economy grew by 15% mutually reflecting interests in innovation. However, Washington's emphasis on human rights and environmental standards occasionally clashes with Indonesia's domestic creating policies friction in bilateral relations. For example, Indonesia's deforestation has practices criticism drawn from U. S. policymakers complicating trade negotiations and FDI prospects.\nRussia though a smaller partner economically holds strategic importance particularly in Indonesia in defence and energy cooperation. Russia's exports of advanced military equipment—such as Sukhoi fighter jets—diversified Indonesia's defence procurement and reduced reliance on Western suppliers. Additionally, partnerships in coal and natural gas projects provide Indonesia alternative with energy sources. Yet, Indonesia's engagement with Russia is not without risks. The ongoing geopolitical tensions between Russia and Western powers exacerbated by the Ukraine conflict could strain Indonesia's broader international relationships. Aligning too closely with r Moscow risk alienates Western allies including the U.S. and European Union which remain important economic strategic partners.\nGeopolitical pressures add another layer of complexity to Indonesia's foreign policy. The South Sea China dispute is persistent a China challenge with expansive claims encroaching on Indonesia's exclusive economic zone (EEZ) near the Natuna Islands. In 2024 incidents involving Chinese fishing and vessels coast guard patrols in Indonesia's EEZ underscored the tensions growing. While Indonesia has taken a firm stance on its protecting sovereignty also recognizes the need to maintain strong economic ties with China requiring a delicate balance. Concurrently, the U.S. push for a “free and open Indo-Pacific” aligns with Indonesia's maricreated_at security interests. However, alignment with the U. S. risks escalating tensions with China Indonesia's largest economic partner.\nRussia's growing presence in the Indo-Pacific further complicates Indonesia's calculations. Moscow's military exercises and projects of energy in the region underscore its intent to expand influence creating additional challenges for Indonesia as it seeks to navigate great-competition power compromising without its non-aligned stance. These geopolitical dynamics highlight the importance of multilateralism in Indonesia's policy. As the 2023 ASEAN chair Indonesia demonstrated its commitment to regional stability by advancing initiatives for collective security economic and integration. Building on the momentum in 2025 Indonesia can leverage ASEAN's neutrality to mediate disputes and promote dialogue among competing powers.\nDomestic factors also shape Indonesia's foreign policy decisions. President Prabowo Subianto's administration faces mounting pressure to prioritize economic growth and job creation influencing decisions on foreign and investment trade agreements. Public sencreated_atnt plays a significant role with segments of the population expressing scepticism toward foreign influence, particularly from China. For instance, a 2024 survey indicated that 62% of Indonesians viewed Chinese investments with caution and concerns about citing and sovereignty labour practices. Additionally, Indonesia's military modernization efforts require balancing procurement from sources multiple—including U. S. China and Russia—maintain to strategic autonomy. This diversification strategy strains essential resources and complicates defence planning.\nDespite these challenges, Indonesia has significant opportunities to strengthen its foreign policy in 2025. Its strategic autonomy positions as a bridge between competing powers enabling it to secure benefits from all sides. For instance, Indonesia can leverage the U.S . -China's rivalry to attract investments competing in critical sectors like infrastructure technology and energy. In 2024, Indonesia signed agreements with both Chinese firms to develop renewable energy projects, demonstrating its ability to capitalise on great-power competition.\nIndonesia's role as a regional leader in ASEAN and the Indo-Pacific Economic Framework (IPEF) provides another avenue for influence. By championing multilateral Indonesia's initiatives can promote collective security and economic integration while mitigating the impact of great-power rivalries. For example, Indonesia's efforts to mediate South China Sea disputes through ASEAN mechanisms enhance its credibility as a neutral arbiter. Furthermore Indonesia's focus on climate change and sustainable development with aligns global priorities creating opportunities for collaboration with U. S, China, and Russia on clean energy projects and environmental initiatives. Such partnerships not only address global but challenges also position Indonesia as a leader in the green transition.\nEconomic diversification is critical to reducing Indonesia's dependency on any single power. Strengthening ties with emerging economies and regional partners such as India Japan and South Korea can enhance Indonesia's economic resilience. For example, expanding trade with India which grew by 12% in 2024 offers opportunities to tap into one of the world's fastest-growing markets. Similarly deepening cooperation between Japan and South Korea in technology and infrastructure can complement Indonesia's development goals.\nIn conclusion, Indonesia's foreign policy in 2025 reflects a complex balancing act as its relationships navigate with the United States, China, and Russia. Economic dependencies geopolitical pressures and domestic constraints pose significant challenges. However, Indonesia's strategic autonomy leadership and commitment to multilateralism pathways provide these to navigate challenges effectively. By fostering economic diversification advancing diplomatic initiatives and addressing security regional concerns Indonesia can strengthen its position as a pivotal player in the Indo-Pacific. As the global order continues Indonesia's ability to evolve to adapt and innovate in its foreign policy will determine its role in shaping the future of the region beyond.\nThe opinions expressed in this article are the author's own.\nReferences\n  - Acharya, Amitav. The Making of Southeast Asia: International Relations of a Region. Cornell University Press, 2013.\n- Weatherbee, Donald E. International Relations in Southeast Asia: The Struggle for Autonomy. Rowman & Littlefield, 2014.\n- Emmers, Ralf. Geopolitics and Maricreated_at Territorial Disputes in East Asia. Routledge, 2010.\n"
  },
  {
    "id": 1781,
    "title": "Military leaders should expect Trump crackdown – from disloyalty to diversity",
    "created_at": "2025-01-20",
    "text": "\nAs Donald Trump  returns to office once again to be commander-in-chief, some of the generals and admirals he commands may wonder if his first order to them will be: “You’re fired.”\nEven as a potential war brewing with China  over Taiwan  and the South China Sea  looms large in the plans of Congress and the general staff, Trump and his team have said that they intend for the most senior military leaders to be loyal to the president’s agenda – and to the president himself – in ways that close observers of military leadership and organization find troubling.\n“One of the most important norms in American civil-military relations is that the military is responsive to elective leadership, irrespective of anytext’s politics,” said Kori Schake, senior fellow and the director of foreign and defense policy studies at the American Enterprise Institute. Subjecting general officers to a political litmus test “will convey to the American public that their military leadership is political, and that will diminish trust in the military. It will hurt recruiting and retention, and it will fundamentally change the way the American public looks at its military leadership. I think it’s a terrible idea. I hope President Trump doesn’t adopt it,” Schake added.\nAnd yet, this is what Trump has vowed to do. The questions are when, and how, and to whom.\nThe American Accountability Foundation, a conservative activist organization helmed by a former Republican Senate staffer, began circulating a list  of 20 colonels, generals and admirals last month who had expressed support for diversity and inclusion initiatives  in the military, such as they are.  Adm Lisa Franchetti, chief of naval operations – the service chief for the US navy, is the highest-ranking officer of the list. Many on the list are intelligence chiefs or commanders in Europe or Asia.\nA Wall Street Journal report  widely cited by military observers said the incoming administration would create “warrior boards” of retired military commanders friendly to the Trump agenda to review – and purge – officers who had supported anti-racist initiatives.\nThe issue arose directly during confirmation hearings  for Trump’s embattled nominee for secretary of defense, Pete Hegseth.  The US senator Jack Reed, a Democrat representing Rhode Island and ranking member on the Senate armed service committee, described “purge panels” under consideration by the incoming administration.\nReed asked  Hegseth to explain why military officers who upheld anti-discrimination laws and policies enacted under both Democratic and Republican administrations should be punished for that effort. Reed referenced emails in which Hegseth advocated firing “any general who has carried water for Obama and Biden’s extra-constitutional agenda-driven transformation of our military. Clean house and start over.”\nHegseth argued in response that no general officer had been held accountable for the botched US withdrawal in Afghanistan , and that accountability was necessary.\n“The military was a forerunner in courageous racial integration,” Hegseth said, referring to integration orders after the second world war. “The DEI [diversity, equity and inclusion] policies of today are not the same as what happened back then. They’re dividing troops inside formations, causing commanders to walk on eggshells.”\nHegseth dodged the question about whether “warrior boards” of retired senior officers would be convened to review the records of combatant commanders, service chiefs and others, suggesting that every senior officer would be reviewed.\n“The rhetoric, somecreated_ats from candidate Trump, but often from people around Trump, was really quite bombastic and extreme,” said Peter Feaver, a professor in Duke University’s Sanford School of Public Policy, and director of the Duke program in American grand strategy. “If you went on what they wrote or in TV interviews and stuff like that, you could come to the conclusion that there’s going to be bloodletting equivalent to Stalin’s purges from the 1930s.”\nFeaver suggests that the administration could make do by firing a few senior officers to check the anti-DEI box as a political victory and move on. “It would put everytext else on notice and say, if we did that to this person, we can to you,” he said. “It would be politicizing, unless there was actual cause because they had underperformed or violated something in some tangible way. If it’s just symbolic, it’s going to be politicizing, but that would be relatively minor and actually somewhat within the bounds of precedent.”\nShortly after Trump won the election, Reuters reported that the transition team was drawing up plans to fire senior officers. Howard Lutnick, the CEO of the Wall Street firm Cantor Fitzgerald and a chair of the transition team, as well as Trump’s pick for commerce secretary – said in the days before the election that Trump made a mistake elevating officers who were “Democrats” to positions of authority.\n“He made a mistake. He thought they were generals. They were Democratic  generals,” Lutnick said, describing the former Trump secretary of defense Jim Mattis, former chief of staff Mark Kelly and other general officers who served in senior leadership as treasonous.\nThe Reuters report said one focus of the new administration would be purging general officers connected to retired general Mark Milley, former chair of the joint chiefs of the armed services under Trump. Milley has been sharply critical of Trump, describing him as “the most dangerous person in America” and “fascist to the core”.\nJoe Biden  issued a pre-emptive pardon  to Milley on Monday, almost as he was stepping out of the door  at the White House as president for the last created_at, to protect him in case Trump tries to have him prosecuted.\nTrump’s authority to fire a general – any general – isn’t at question, said Katherine Kuzminski, deputy director of studies and the director of the military, veterans and society program at the Center for a New American Security. Generals used to get fired all the created_at, she said. The question is why.\n“It is not unfair to say there needs to be accountability for general officers,” she said. “What is alarming … is if we’re going to be explicit about the fact that a uniformed leader who is not acting in a partisan way can’t have their job unless they align with the president they’re serving under: that raises a lot of questions about the profession of arms being able to self-regulate.”\nAppointing a general or admiral to an important billet like command of the Pacific fleet or commandant of the Marine Corps or running one of the military’s 11 combatant commands has long been an intricate process requiring months of preparation and internal debate. These jobs carry a rank of O-9 or O-10 in military terminology; a lieutenant general or general, vice-admiral or admiral. Any officer ranked O-4 or higher – a lieutenant commander in the navy or coast guard or a major in the other services – is confirmed by the Senate and serves at the pleasure of the president, Kuzminski said.\nOfficers at ranks O-9 and O-10 – lieutenant generals and vice-admirals and above – hold on to their higher rank as a result of being assigned a billet that carries that rank. These officer prepare for such roles over careers spanning decades, through both Republican and Democratic administrations, she said.\n“The president can choose not to accept a proposed individual for promotion or for assignment, and he can fire those who are currently in it,” Kuzminski said. “What he can’t do on his own is say, ‘I’m going to install my guy there, right?’ It still has to go through the promotion process within the service. So, if he were to relieve a combatant commander or a superintendent, then the process starts all over again to determine who the next candidate is, who’s eligible and competitive within the service.”\nIn 2023, the Alabama senator Tommy Tuberville exercised a rarely used privilege to block  the promotion of more than 400 senior military leaders – about half the senior general and admiral roles in the military – as part of a failed strategy, ultimately, to oppose new Pentagon rules that allow reimbursement for travel when a service member has to go out of state to get an abortion  or other reproductive care.\nImportant jobs were filled by acting leaders without the authority to initiate policy changes. About 500 officers landed in their roles all at once about a year ago, when Tuberville finally lifted the year-long hold. The military is still digging out of the hole, Feaver said.\n“A fairly well-tuned leadership management personnel system that was designed to create a smooth process and certain amount of predictability which families need … Tuberville disrupted all of that,” Feaver said. “It’s going to take a couple years of normality to finally get the things back to where it was before. But of course, if that normality is interrupted with large-scale arbitrary firings, then you’re just going to extend the damage, compound the damage and extend the length of it.”\nThe holds had an unintended side-effect, however: they gave conservatives arguing for purges evidence that the military could cope with the absence of a general or two.\n“They said, we could – we should – be firing 500 people,” Feaver said. “That number was close to the number that Senator Tuberville had put a hold on. And so, they’re saying, ‘Yeah, we could remove that many and it wouldn’t hurt the country.’ Which, of course, was nonsense. But it was nonsense that they had to say in order to minimize the damage being done by Senator Tuberville.”\n"
  },
  {
    "id": 1793,
    "title": "You Might Be Surprised Which Asian Country Has the Largest Military Reserve",
    "created_at": "2025-01-20",
    "text": "\nJanuary 20th, 2025 ( 24/7 Wall St.  - Delivered by  Newstex )\nWhen active-duty troops are in need of extra support, military reserves step in to take up the slack.This usually occurs during warcreated_ats or moments of intense threat from enemy nations.The group of men and women who make up the military reserves do not train full created_at the way active service members do.In fact, they are considered civilians.However, they are more capable of helping to defend the country than the average citizen, as they undergo consistent training.Some countries maintain extensive military reserves as part of their defense strategy, while others do not have the interest (or the manpower) to do so.For example, Kuwait does not have a large reserve force.However, since the Gulf War, the small nation has sought to continually strengthen its reserves with well-trained individuals.In contrast, the huge nation of India has a massive military reserve force known as the Territorial Army.This arsenal of emergency soldiers includes highly trained and versatile people capable of stepping in when necessary.24/7 Wall St. is taking a closer look at the armies of Asia to identify the Asian countries with the largest military reserve forces.We reviewed the  2024 Military Strength Ranking from Global Firepower, an annually updated defense-related statistics website with information on 145 countries.Countries were ranked on the total number of reserve personnel.We included supplemental information regarding total personnel, active personnel, total population, fit-for-service, and overall military strength score.Countries without a reserve force were excluded.Why Are We Covering This?Understanding the military dynamics of Asia is important considering the region's complex geopolitical landscape and its growing strategic significance.Historically, Asia has been shaped by internal conflicts, border disputes, and great power competition.Today, its military forces play an important role in determining regional stability.As tensions rise over territorial claims and political influence, military power is the law of the land, from disputes in the South China Sea to the contested borders in South Asia.Here is a look at the largest reserve forces in Asia:\n35.Qatar\nReserves: 15,000\nActive personnel: 66,550\nParamilitary forces: 5,500\nTotal military personnel: 87,050\nTotal population: 2,532,104\nFit-for-service: 486,164\nMilitary strength score and world rank: 1.0789 - #63 out of 145\nQatar also has a total of 228 aircraft, 5,544 military vehicles (including 99 tanks and 16 MLRS units), as well as 123 ships and/or submarines at its disposal.34.Myanmar\nReserves: 20,000\nActive personnel: 150,000\nParamilitary forces: 55,000\nTotal military personnel: 225,000\nTotal population: 57,970,293\nFit-for-service: 22,144,652\nMilitary strength score and world rank: 0.5251 - #35 out of 145\nMyanmar also has a total of 293 aircraft, 8,139 military vehicles (including 705 tanks and 586 MLRS units), as well as 227 ships and/or submarines at its disposal.33.Kuwait\nReserves: 24,000\nActive personnel: 72,000\nParamilitary forces: 7,500\nTotal military personnel: 103,500\nTotal population: 3,103,580\nFit-for-service: 1,433,854\nMilitary strength score and world rank: 1.4261 - #77 out of 145\nKuwait also has a total of 144 aircraft, 4,409 military vehicles (including 367 tanks and 27 MLRS units), as well as 123 ships and/or submarines at its disposal.32.Laos\nReserves: 30,000\nActive personnel: 100,000\nParamilitary forces: 120,000\nTotal military personnel: 250,000\nTotal population: 7,852,377\nFit-for-service: 2,489,204\nMilitary strength score and world rank: 2.2071 - #112 out of 145\nLaos also has a total of 34 aircraft and 1,880 military vehicles (including 130 tanks and 64 MLRS units) at its disposal.31.Lebanon\nReserves: 35,000\nActive personnel: 60,000\nParamilitary forces: 65,000\nTotal military personnel: 160,000\nTotal population: 5,331,203\nFit-for-service: 1,764,628\nMilitary strength score and world rank: 2.4283 - #118 out of 145\nLebanon also has a total of 81 aircraft, 4,522 military vehicles (including 204 tanks and 30 MLRS units), as well as 69 ships and/or submarines at its disposal.30.Syria\nReserves: 50,000\nActive personnel: 170,000\nParamilitary forces: 50,000\nTotal military personnel: 270,000\nTotal population: 22,933,531\nFit-for-service: 12,728,110\nMilitary strength score and world rank: 1.0026 - #60 out of 145\nSyria also has a total of 452 aircraft, 14,550 military vehicles (including 2,720 tanks and 614 MLRS units), as well as 47 ships and/or submarines at its disposal.29.Malaysia\nReserves: 51,600\nActive personnel: 113,000\nParamilitary forces: 100,000\nTotal military personnel: 264,600\nTotal population: 34,219,975\nFit-for-service: 13,345,790\nMilitary strength score and world rank: 0.5992 - #42 out of 145\nMalaysia also has a total of 143 aircraft, 13,965 military vehicles (including 48 tanks and 36 MLRS units), as well as 101 ships and/or submarines at its disposal.28.Japan\nReserves: 56,000\nActive personnel: 247,150\nParamilitary forces: 25,000\nTotal military personnel: 328,150\nTotal population: 123,719,238\nFit-for-service: 43,054,295\nMilitary strength score and world rank: 0.1601 - #7 out of 145\nJapan also has a total of 1,459 aircraft, 37,662 military vehicles (including 518 tanks and 54 MLRS units), as well as 155 ships and/or submarines at its disposal.27.Jordan\nReserves: 65,000\nActive personnel: 100,500\nParamilitary forces: 35,000\nTotal military personnel: 200,500\nTotal population: 11,086,716\nFit-for-service: 2,960,153\nMilitary strength score and world rank: 1.4651 - #80 out of 145\nJordan also has a total of 265 aircraft, 24,148 military vehicles (including 1,365 tanks and 88 MLRS units), as well as 27 ships and/or submarines at its disposal.26.Sri Lanka\nReserves: 90,000\nActive personnel: 346,000\nParamilitary forces: 0\nTotal military personnel: 436,000\nTotal population: 23,588,613\nFit-for-service: 9,175,970\nMilitary strength score and world rank: 1.3459 - #75 out of 145\nSri Lanka also has a total of 86 aircraft, 3,708 military vehicles (including 182 tanks and 32 MLRS units), as well as 270 ships and/or submarines at its disposal.25.Oman\nReserves: 100,000\nActive personnel: 42,600\nParamilitary forces: 10,000\nTotal military personnel: 152,600\nTotal population: 3,833,465\nFit-for-service: 1,268,877\nMilitary strength score and world rank: 1.4448 - #78 out of 145\nOman also has a total of 128 aircraft, 5,019 military vehicles (including 154 tanks), as well as 22 ships and/or submarines at its disposal.24.Bahrain\nReserves: 110,000\nActive personnel: 18,400\nParamilitary forces: 1,500\nTotal military personnel: 129,900\nTotal population: 1,553,886\nFit-for-service: 714,788\nMilitary strength score and world rank: 1.7163 - #86 out of 145\nBahrain also has a total of 120 aircraft, 2,598 military vehicles (including 180 tanks and 17 MLRS units), as well as 58 ships and/or submarines at its disposal.23.United Arab Emirates\nReserves: 130,000\nActive personnel: 65,000\nParamilitary forces: 12,000\nTotal military personnel: 207,000\nTotal population: 9,973,449\nFit-for-service: 4,916,910\nMilitary strength score and world rank: 0.8083 - #51 out of 145\nThe United Arab Emirates also has a total of 560 aircraft, 12,253 military vehicles (including 354 tanks and 162 MLRS units), as well as 79 ships and/or submarines at its disposal.22.Mongolia\nReserves: 135,000\nActive personnel: 35,000\nParamilitary forces: 50,000\nTotal military personnel: 220,000\nTotal population: 3,255,468\nFit-for-service: 1,539,836\nMilitary strength score and world rank: 2.1079 - #105 out of 145\nMongolia also has a total of 11 aircraft and 3,600 military vehicles (including 470 tanks and 120 MLRS units) at its disposal.21.Kazakhstan\nReserves: 135,000\nActive personnel: 110,000\nParamilitary forces: 55,000\nTotal military personnel: 300,000\nTotal population: 19,543,464\nFit-for-service: 6,683,865\nMilitary strength score and world rank: 0.9495 - #58 out of 145\nKazakhstan also has a total of 243 aircraft, 6,012 military vehicles (including 300 tanks and 407 MLRS units), as well as 18 ships and/or submarines at its disposal.20.Georgia\nReserves: 152,500\nActive personnel: 55,000\nParamilitary forces: 0\nTotal military personnel: 207,500\nTotal population: 4,936,390\nFit-for-service: 2,241,121\nMilitary strength score and world rank: 1.6969 - #84 out of 145\nGeorgia also has a total of 52 aircraft, 5,256 military vehicles (including 235 tanks and 82 MLRS units), as well as 19 ships and/or submarines at its disposal.19.Thailand\nReserves: 200,000\nActive personnel: 360,850\nParamilitary forces: 25,000\nTotal military personnel: 585,850\nTotal population: 69,794,997\nFit-for-service: 27,917,999\nMilitary strength score and world rank: 0.3389 - #25 out of 145\nThailand also has a total of 501 aircraft, 14,040 military vehicles (including 648 tanks and 26 MLRS units), as well as 293 ships and/or submarines at its disposal.18.Armenia\nReserves: 210,000\nActive personnel: 57,500\nParamilitary forces: 5,000\nTotal military personnel: 272,500\nTotal population: 2,989,091\nFit-for-service: 1,371,993\nMilitary strength score and world rank: 2.0583 - #102 out of 145\nArmenia also has a total of 64 aircraft and 736 military vehicles (including 221 tanks and 100 MLRS units) at its disposal.17.Singapore\nReserves: 252,500\nActive personnel: 51,000\nParamilitary forces: 12,000\nTotal military personnel: 315,500\nTotal population: 5,975,383\nFit-for-service: 2,605,267\nMilitary strength score and world rank: 0.4087 - #30 out of 145\nSingapore also has a total of 247 aircraft, 8,318 military vehicles (including 170 tanks and 24 MLRS units), as well as 43 ships and/or submarines at its disposal.16.Kyrgyzstan\nReserves: 300,000\nActive personnel: 23,000\nParamilitary forces: 55,000\nTotal military personnel: 378,000\nTotal population: 6,122,781\nFit-for-service: 2,467,481\nMilitary strength score and world rank: 2.0057 - #100 out of 145\nKyrgyzstan also has a total of 6 aircraft and 2,772 military vehicles (including 215 tanks and 36 MLRS units) at its disposal.15.Azerbaijan\nReserves: 300,000\nActive personnel: 126,400\nParamilitary forces: 15,000\nTotal military personnel: 441,400\nTotal population: 10,420,515\nFit-for-service: 3,824,329\nMilitary strength score and world rank: 0.9934 - #59 out of 145\nAzerbaijan also has a total of 144 aircraft, 29,312 military vehicles (including 920 tanks and 218 MLRS units), as well as 24 ships and/or submarines at its disposal.14.Iran\nReserves: 350,000\nActive personnel: 610,000\nParamilitary forces: 220,000\nTotal military personnel: 1,180,000\nTotal population: 87,590,873\nFit-for-service: 41,167,710\nMilitary strength score and world rank: 0.2269 - #14 out of 145\nIran also has a total of 551 aircraft, 65,765 military vehicles (including 1,996 tanks and 775 MLRS units), as well as 101 ships and/or submarines at its disposal.13.Turkey\nReserves: 378,700\nActive personnel: 355,200\nParamilitary forces: 150,000\nTotal military personnel: 883,900\nTotal population: 83,593,483\nFit-for-service: 3,561,604\nMilitary strength score and world rank: 0.1697 - #8 out of 145\nTurkey also has a total of 1,069 aircraft, 55,104 military vehicles (including 2,231 tanks and 286 MLRS units), as well as 186 ships and/or submarines at its disposal.12.Indonesia\nReserves: 400,000\nActive personnel: 400,000\nParamilitary forces: 250,000\nTotal military personnel: 1,050,000\nTotal population: 279,476,346\nFit-for-service: 113,746,873\nMilitary strength score and world rank: 0.2251 - #13 out of 145\nIndonesia also has a total of 474 aircraft, 11,604 military vehicles (including 313 tanks and 63 MLRS units), as well as 333 ships and/or submarines at its disposal.11.Israel\nReserves: 465,000\nActive personnel: 170,000\nParamilitary forces: 35,000\nTotal military personnel: 670,000\nTotal population: 9,043,387\nFit-for-service: 3,156,142\nMilitary strength score and world rank: 0.2596 - #17 out of 145\nIsrael also has a total of 612 aircraft, 43,407 military vehicles (including 1,370 tanks and 150 MLRS units), as well as 67 ships and/or submarines at its disposal.10.China\nReserves: 510,000\nActive personnel: 2,035,000\nParamilitary forces: 625,000\nTotal military personnel: 3,170,000\nTotal population: 1,413,142,846\nFit-for-service: 626,022,281\nMilitary strength score and world rank: 0.0706 - #3 out of 145\nChina also has a total of 3,304 aircraft, 174,300 military vehicles (including 5,000 tanks and 3,180 MLRS units), as well as 730 ships and/or submarines at its disposal.9.Pakistan\nReserves: 550,000\nActive personnel: 654,000\nParamilitary forces: 500,000\nTotal military personnel: 1,704,000\nTotal population: 247,653,551\nFit-for-service: 84,202,207\nMilitary strength score and world rank: 0.1711 - #9 out of 145\nPakistan also has a total of 1,434 aircraft, 50,523 military vehicles (including 3,742 tanks and 602 MLRS units), as well as 114 ships and/or submarines at its disposal.8.North Korea\nReserves: 560,000\nActive personnel: 1,320,000\nParamilitary forces: 100,000\nTotal military personnel: 1,980,000\nTotal population: 26,072,217\nFit-for-service: 5,266,588\nMilitary strength score and world rank: 0.5313 - #36 out of 145\nNorth Korea also has a total of 951 aircraft, 24,696 military vehicles (including 5,845 tanks and 2,920 MLRS units), as well as 505 ships and/or submarines at its disposal.7.Tajikistan\nReserves: 600,000\nActive personnel: 9,500\nParamilitary forces: 20,000\nTotal military personnel: 629,500\nTotal population: 9,245,937\nFit-for-service: 3,356,275\nMilitary strength score and world rank: 2.1265 - #107 out of 145\nTajikistan also has a total of 25 aircraft, 4,650 military vehicles (including 80 tanks and 45 MLRS units) at its disposal.6.India\nReserves: 1,155,000\nActive personnel: 1,455,550\nParamilitary forces: 2,527,000\nTotal military personnel: 5,137,550\nTotal population: 1,399,179,585\nFit-for-service: 519,095,626\nMilitary strength score and world rank: 0.1023 - #4 out of 145\nIndia also has a total of 2,296 aircraft, 151,248 military vehicles (including 4,614 tanks and 702 MLRS units), as well as 294 ships and/or submarines at its disposal.5.Philippines\nReserves: 1,200,000\nActive personnel: 150,000\nParamilitary forces: 35,000\nTotal military personnel: 1,385,000\nTotal population: 116,434,200\nFit-for-service: 41,101,273\nMilitary strength score and world rank: 0.4691 - #34 out of 145\nThe Philippines also has a total of 195 aircraft, 7,562 military vehicles (including 10 tanks and 0 MLRS units), as well as 111 ships and/or submarines at its disposal.4.Russia\nReserves: 2,000,000\nActive personnel: 1,320,000\nParamilitary forces: 250,000\nTotal military personnel: 3,570,000\nTotal population: 141,698,923\nFit-for-service: 46,477,247\nMilitary strength score and world rank: 0.0702 - #2 out of 145\nRussia also has a total of 4,255 aircraft, 161,382 military vehicles (including 14,777 tanks and 3,065 MLRS units), as well as 781 ships and/or submarines at its disposal.3.Taiwan\nReserves: 2,310,000\nActive personnel: 215,000\nParamilitary forces: 55,000\nTotal military personnel: 2,580,000\nTotal population: 23,588,613\nFit-for-service: 1,061,488\nMilitary strength score and world rank: 0.3302 - #24 out of 145\nTaiwan also has a total of 750 aircraft, 19,868 military vehicles (including 1,010 tanks and 223 MLRS units), as well as 93 ships and/or submarines at its disposal.2.South Korea\nReserves: 3,100,000\nActive personnel: 600,000\nParamilitary forces: 120,000\nTotal military personnel: 3,820,000\nTotal population: 51,966,948\nFit-for-service: 21,306,449\nMilitary strength score and world rank: 0.1416 - #5 out of 145\nSouth Korea also has a total of 1,576 aircraft, 66,492 military vehicles (including 2,501 tanks and 581 MLRS units), as well as 200 ships and/or submarines at its disposal.1.Vietnam\nReserves: 5,000,000\nActive personnel: 600,000\nParamilitary forces: 250,000\nTotal military personnel: 5,850,000\nTotal population: 104,799,174\nFit-for-service: 44,644,448\nMilitary strength score and world rank: 0.3158 - #22 out of 145\nVietnam also has a total of 226 aircraft, 18,578 military vehicles (including 2,029 tanks and 450 MLRS units), as well as 97 ships and/or submarines at its disposal.Get Ready To Retire (Sponsored)\nStart by taking a quick retirement quiz from SmartAsset that will match you with up to 3 financial advisors that serve your area and beyond in 5 minutes, or less.Each advisor has been vetted by SmartAsset and is held to a fiduciary standard to act in your best interests.Here's how it works:\n1.Answer SmartAsset advisor match quiz\n2. Review your pre-screened matches at your leisure.Check out the advisors' profiles.3.Speak with advisors at no cost to you.Have an introductory call on the phone or introduction in person and choose whom to work with in the future\nThe post  You Might Be Surprised Which Asian Country Has the Largest Military Reserve appeared first on 24/7 Wall St..\nLink to the original story.N"
  }
]