[
  {
    "id": 1798,
    "title": "Philippines-Mainland China Relations Will Remain Strained By South China Sea Dispute",
    "created_at": "2025-01-21",
    "text": "\nKey View\nTensions in the South China Sea have escalated, with incidents between Mainland China- and Philippines-based coastguard vessels becoming more frequent and increasing in intensity.\nThe strains in Beijing-Manila relations will push the Philippines towards closer security cooperation with the US.\nWe believe that Manila will refrain from seeking direct US intervention in its maricreated_at territorial clashes with China due to the latteraEURtms importance as a trade partner.A\nAs expected, tensions in the South China Sea have escalated, as Mainland China and the Philippines attempt to assert their overlapping territorial claims. President Ferdinand MarcosaEURtms clear shift in foreign policy towards the US and its allies (Japan and Australia) since taking office in 2022 has led to an erosion in bilateral relations with China. This raises the risk of the Philippines becoming more deeply affected by the greater struggle for influence between Beijing and Washington in the Indo-Pacific region.A\nTerritorial disputes in the South China Sea will remain a key point of contention and are unlikely to abate anycreated_at soon. Confrontations between China- and Philippines-based security forces have become more frequent and intense in the last few months, with tensions eventually leading to a collision between China- and Philippines-based coast guard vessels near the disputed Scarborough Shoal on August 19 2024. It has been over a decade since a similar event occurred. However, tensions have cooled since the withdrawal of the largest Philippine Coast Guard vessel from the flashpoint. Despite this, the latest reports suggest that the Shoal has been surrounded by Chinese ships. The ongoing disputes will align the PhilippinesaEURtm current administration more closely with the US and other partners such as Japan and Australia. The Philippines and the US share a longstanding partnership, solidified by the Mutual Defense Treaty that they signed in 1951. The Philippines' pivotal geographic position, bridging the South China Sea and the Western Pacific Ocean, makes it an invaluable partner for the US. Although this alliance experienced a period of cooling when former president Rodrigo Duterte (2016-2022) favoured closer relations with China, President Marcos has reversed the course back towards the US.In a sign of deepening security ties, in 2023, President Marcos granted the US access to four additional military locations, bringing the total to nine. Some of these are situated near Taiwan, China, which will be a source of tension with Mainland China. A greater presence of US troops in the South China Sea could be perceived as a threat to China's sovereignty and interests, especially amid the ongoing contest of influence between Beijing and Washington in the Indo-Pacific region. The leaders of the US, Japan and the Philippines also held their first-ever trilateral summit in April 2024 for the purposes of strengthening ties.A The Philippines will refrain from seeking direct naval assistance from Washington.A The US Indo-Pacific Command commander has proposed US escorts for Philippine vessels as a response to Chinese moves in the South China Sea. However, deploying US forces directly to protect and resupply Philippine vessels would significantly raise the stakes and potentially challenge China to escalate the dispute. Not the US, China or the Philippines has an interest in raising tensions in the South China Sea at this created_at. In particular, the US is distracted by the latest increase in tensions in the Middle East and a new Trump's presidency, which will have bearing on China-US relations.A\nThe Philippines faces limits in how far it will confront China, given that China has emerged as the Philippines' largest trading partner, accounting for roughly 23% of total imports and 16% of exports, according to 2023 data. Currently, tensions in the South China Sea have not strained economic ties with China. However, Beijing has a history of using trade restrictions against markets with conflicting interests. For instance, China recently banned Japanese seafood imports after Japan decided to release treated wastewater from the Fukushima nuclear plant into the Pacific Ocean. Similarly, China imposed tariffs on Australian wine in 2021 when diplomatic relations with Australia deteriorated. The Philippines might face similar repercussions if tensions continue to rise.A \n"
  },
  {
    "id": 1799,
    "title": "'It's a win': Philippines, China uphold South China Sea deal on resupply missions",
    "created_at": "2025-01-21",
    "text": "\n Analysts say the agreement 'commits both states to a status quo' and urge the Philippines to hold firm on its South China Sea stance   \nIn a rare moment of accord amid their simmering feud over the South China Sea, Beijing and Manila have agreed to maintain a provisional deal allowing the Philippines to resupply a remote outpost at the Second Thomas Shoal - a move hailed as a \"win\" for Manila, albeit one fraught with uncertainty. \nThe agreement, reached during the 10th bilateral consultation mechanism (BCM) meeting in Xiamen on Thursday, comes as the Philippines continues to push back against what it calls a rising tide of Chinese incursions in the South China Sea. \nThe BCM, established as a forum for dialogue, has often been weighed down by the deep mistrust between the two neighbours. But this created_at, envoys described the talks as \"frank and constructive\", according to the Philippines' foreign affairs department. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nDespite the diplomatic veneer, tensions remain high. Just days before the meeting, Manila lodged a fresh protest against the deployment of China's 165-metre-long (180-yard-long) coastguard vessel 5901 - ominously dubbed \"the monster\" - which was spotted just 77 nautical miles (142km) off the Philippine coast. \nThe Philippines condemned the move as a violation of its exclusive economic zone, citing the 1982 United Nations Convention on the Law of the Sea and Manila's recently enacted Maricreated_at Zones Act. \nChina, for its part, has shown no signs of toning down its presence in contested waters, including Scarborough Shoal, which it has controlled since a 2012 clash with Philippine forces. The shoal - known in the Philippines as Bajo de Masinloc - remains a flashpoint, and was the reason Manila filed an arbitration case against Beijing at The Hague. \nBeijing has dismissed the 2016 ruling that invalidated its expansive claim over much of the South China Sea. \nStill, the agreement on resupply missions represents a rare moment of compromise. For years, the Second Thomas Shoal has been a symbol of Manila's defiance, with the rusting BRP Sierra Madre - a World War II-era warship intentionally grounded on the shoal - serving as the Philippines' foothold. \nChinese coastguard vessels have repeatedly tried to block resupply efforts to the outpost, even resorting to aggressive tactics that led to a Philippine serviceman losing a thumb in a past skirmish. \nThursday's meeting \"shows that the Philippines is able to get [China] to agree to commit. It's a win,\" said Julio Amador, interim president of the Foundation for the National Interest and a trustee at the non-profit organisation Facts Asia. The agreement \"commits both states to a status quo\", Amador said. \nBut he was quick to caution against complacency, saying that Beijing would continue probing for vulnerabilities. He urged Manila to \"stop announcing to the world its weakness\" and adopt a more strategic approach. \nAt last week's meeting, the two sides also reportedly explored areas of cooperation, including ocean meteorology and coastguard collaboration. These proposals built upon a joint coastguard committee formed in 2016 and the \"direct communication line\" for maricreated_at concerns that Philippine President Ferdinand Marcos Jnr and China's Xi Jinping agreed to set up in January 2023. \nPhilippine Foreign Affairs Undersecretary Theresa Lazaro said the continued implementation of the resupply deal was essential to the \"de-escalation of tensions\" without compromising national interests. Both sides had \"exchanged views\" and \"acknowledged ... positive outcomes\", she said. \n\"Our position is clear and consistent, but so is our willingness to engage in dialogue,\" Lazaro added in a statement. \nBeijing and Manila reached a provisional agreement on Philippine resupply missions to the Second Thomas Shoal last year. \nGeopolitical analysts remain sceptical of China's intentions, however. Don McLain Gill, a lecturer in international relations at De La Salle University in Manila, said Beijing had a habit of \"throwing its weight around\" and warned that Manila must not compromise on its core interests. \n\"The most important thing is that we hold our ground and we stay consistent,\" he said. \nNational Security Council spokesman Jonathan Malaya recently admitted that the Philippines felt China was \"pushing us to the wall\" and said Manila may have to file another case against Beijing. \nBut analysts warn that litigation alone is unlikely to shift the dynamics in the South China Sea, where China's strategy of incremental encroachment has left its neighbours scrambling for answers. \nAs the Philippines prepares to host the next BCM later this year, the question remains: can these fragile agreements hold against the tide of escalating tensions? \nFor now, Manila has secured what some see as a tenuous victory. But in the high-stakes chessboard of the South China Sea, every move counts - and every misstep could tip the balance.  \n"
  },
  {
    "id": 1801,
    "title": "How US-Philippines quiet show of South China Sea strength sent 'a clear message'",
    "created_at": "2025-01-21",
    "text": "\n As the world's attention turned towards Washington and Donald Trump's inauguration, the Pentagon was operating decisively under the radar   \nDays before Donald Trump's inauguration, Washington quietly deployed an aircraft carrier strike group to the disputed South China Sea and staged secretive naval drills with the Philippines. \nThe timing was deliberate and the message unmistakable, analysts say - it signalled the US' determination to continue challenging China's increasingly provocative actions and regional dominance. \nOver two days in waters near Palawan, US and Philippine forces held maricreated_at defence exercises, part of a broader series of Maricreated_at Cooperative Activities (MCA) that began in late 2023. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nThe drills on Friday and Saturday - kept under wraps until their conclusion - featured the USS Carl Vinson Carrier Strike Group alongside Philippine vessels BRP Antonio Luna and BRP Andres Bonifacio. The exercises included tactical manoeuvres and communication drills aimed at bolstering interoperability between the two allies. \n\"With each exercise, we become increasingly prepared and effective in addressing the challenges ahead,\" said General Romeo Brawner Jnr, commander of the Armed Forces of the Philippines, on Sunday. \n\"This is a result of our shared commitment and mutual effort to safeguard our national interests, and secure a peaceful region.\" \nUS Rear Admiral Michael Wosje echoed this sencreated_atnt, describing the US-Philippine alliance as \"ironclad\" while emphasising the drills' role in maintaining a free and open Indo-Pacific. \nBut the message wasn't just for Manila. Analysts say the timing and secrecy of the drills were squarely aimed at Beijing, which has ramped up military activities in the South China Sea in recent months. \nChina's deployment of its double carrier battle group and the \"monster\" - its 165-metre-long (180-yard-long) coastguard vessel - has stoked tensions in contested waters, particularly near Scarborough Shoal, a flashpoint claimed by both Manila and Beijing. \n\"These exercises send a clear message to China, serving as both a statement of resolve and a deterrent,\" said Chris Gardiner, CEO of the Institute for Regional Security in Canberra. \n\"The US has a defence treaty with the Philippines. The US military should and will be undertaking exercises based on threat assessments, not on domestic politics, and will do so until such created_at as the new commander in chief adopts new China or Philippines policies,\" he told This Week in Asia. \nGardiner dismissed talk of the US drills as \"secret\", however, saying they were merely not revealed ahead of created_at. The exercises should instead be viewed as \"an expression of US commitment to and capabilities with the Philippines\" and a sign that Washington was ready to act if deterrence failed, he said, noting China's recent displays of force in the region. \n\"It is crucial that such posturing does not go unanswered,\" Gardiner said, \"or else both China and allies may misread US levels of commitment\". \nOther analysts argued that Beijing's aggressive posturing often backfired. \"Sending the monster ship is creating more resentment,\" said Jose Antonio Custodio, a defence analyst and fellow at the Consortium of Indo-Pacific Researchers. \"It's China creating the conditions [for these responses].\" \nCustodio noted the irony: while Beijing is increasingly assertive, its military assets, including its conventionally powered carrier groups, still lag behind the US Navy's ageing but formidable Nimitz-class carriers. \nThe timing of the drills also indicated that the new Trump administration was likely to continue its policy on freedom of navigation in the South China Sea, Custodio said. \n\"It won't change. The actions may become more intense, but they will remain consistent,\" he told This Week in Asia. \"I would expect the Trump government to do the same policy in the Asia-Pacific region.\" \nThe South China Sea is a critical global trade route, with about a third of the world's maricreated_at trade - valued at more than US$3 trillion - passing through its waters annually. \nBeijing claims nearly the entire waterway, dismissing overlapping claims from neighbours such as the Philippines, Vietnam and Malaysia. It also rejects a 2016 international arbitral ruling invalidating its claims, arguing the decision lacks legal merit. \nGeopolitical expert Arnaud Leveau, an assistant professor at Paris Dauphine University and researcher at the Asia Centre think tank in France, noted that while Trump was likely to push for stronger financial commitments from partners such as the Philippines, strategic interests and regional security concerns would endure. \n\"The security partnership between the US and the Philippines is a key component of the US presence in the region,\" he said, adding that strengthening alliances will only grow more critical as China's military capabilities expand. \nYet, the risks of escalation are ever-present. In June 2023, a Chinese warship came within 150 yards (137 metres) of the USS Chung-Hoon in the Taiwan Strait, forcing the US destroyer to alter course to avoid a collision. \nLucio Blanco Pitlo III, president of the Philippine Association of Chinese Studies and a research fellow at Asia-Pacific Pathways to Progress, warned that while the latest drills improve US-Philippine readiness, they won't necessarily de-escalate tensions. \n\"If something happens, the US and China can test their crisis management hotline,\" he said, underscoring the razor's edge diplomacy at play in the disputed waters.  \n"
  },
  {
    "id": 1803,
    "title": "Opportunity for ASEAN to reassert its autonomy",
    "created_at": "2025-01-21",
    "text": "\nBy LI YANG | China Daily | Updated: 2025-01-21 06:54\nThe 2025 ASEAN Foreign Ministers' Retreat was convened on Sunday in Langkawi, Malaysia. The Retreat, with the theme \"Inclusivity and Sustainability\", is the first major meeting of the Association of Southeast Asian Nations this year.\nUnder the chairmanship of Malaysia, the ASEAN foreign ministers had candid and in-depth discussions on ASEAN's priorities in 2025. Their wide-ranging joint statement issued after the meeting conveyed the ASEAN members' common stance on many issues, ranging from the South China Sea maricreated_at disputes to the Ukraine crisis.\nOver the past four years, the Joe Biden administration of the United States has exerted tremendous pressure on ASEAN in a bid to coerce it to jump onto its anti-China bandwagon, and the Philippines under the Ferdinand Marcos Jr government has sought to leverage an advantage by acting as a proxy of the US in the region. Portraying itself as a victim of China's \"bullying\", the Philippines tried to drive a wedge between the regional organization and China.\nThese external and internal factors have to some extent taken a toll on regional solidarity, stability and cooperation.\nWith a new US administration taking office on Monday, the organization will hopefully have the opportunity to better exercise its strategic autonomy in foreign affairs and uphold an independent stance on many burning issues of regional and international concern.\nIn the document, the ASEAN foreign ministers reiterated their strong commitment to upholding regionalism and multilateralism, welcomed the progress of the negotiations on the Code of Conduct in the South China Sea, vowed to play a greater role in fostering a stable and predictable environment through adherence to the principles of international law, mutual respect, and the peaceful resolution of maricreated_at disputes, and underscored the importance of the full and effective implementation of the 2002 Declaration on the Conduct of Parties in the South China Sea in its entirety.\nThe ASEAN stance accords with that of China, and, if acted upon, will be conducive to promoting the organization's cooperation with China to seek proper solutions on the South China Sea issues.\nBesides, the ASEAN foreign ministers vowed to deepen cooperation under the ASEAN Plus Three (China, Japan and the Republic of Korea) cooperation framework, and welcomed substantive progress in the implementation of the ASEAN Plus Three Cooperation Work Plan (2023-27).\nWhile China, Japan and the ROK have been accelerating their efforts to mend ties in recent months, the ASEAN's strong support for a closer regional cooperation will help unleash the potential of the ASEAN Plus Three cooperation framework that is based on their structural complementarity and shared Asian values and culture.\nStanding at a new starting point, ASEAN is now in a better position to understand that it has no reason not to keep good relations with its neighbors, including China, and that no external forces should be allowed to assume the center of the stage in Southeast Asia except the regional countries themselves.\n"
  },
  {
    "id": 1805,
    "title": "Manila says it will keep challenging China’s ‘illegal patrols’ in own EEZ",
    "created_at": "2025-01-21",
    "text": "\nThe Philippine Coast Guard (PCG) on Monday said it would continue to confront illegal patrols in the South China Sea as it tries to prevent China from “normalizing such unlawful actions.”\n“If we fail to challenge this, China will succeed in establishing a precedent for its maricreated_at forces’ illegal patrols in the future,” it said in a statement.\nIt added that the deployment of white hull vessels in the face of China’s incursions into its waters signals its intent to manage tensions peacefully.\nThe Philippine Coast Guard said the use of its assets amid the presence of Chinese vessels including China’s “monster ship” within Manila’s exclusive economic zone (EEZ) in the South China Sea “aims not to provoke China, but to resolve differences through rational discussion and adherence to international law.”\n“It is also important to highlight that the deployment of our white hull vessels to address China’s unlawful presence demonstrates the government’s intent to deescalate tensions and pursue a peaceful resolution to these violations of international law,” it added.\nThe Philippines last week accused China of intimidating Filipino fishermen near Scarborough Shoal and normalizing its “illegal presence” after Beijing sent its biggest coast guard ship into the Philippine EEZ.\nChina Coast Guard (CCG)-5901 was about 175.94 kilometers from the coast of Zambales province as of 9 p.m. on Sunday.\nThe monster ship, first spotted within the Philippine EEZ on Jan. 4, “moved further away” from the PCG vessel Gabriela Silang, the agency said in a statement on Sunday night. It said another Chinese vessel, CCG-3304, approached the coast of Zambales at 120.38 kilometers.\n“Although the monster ship has departed, it is important to note that CCG-3304, its replacement, remains larger than the largest PCG vessel,” the Philippine side said, referring to the 97-meter muti-role response vessel BRP Teresa Magbanua.\nCCG-3304 is 111 meters long and 46 meters wide, it said.\nIt said the 83-meter French-built BRP Gabriela Silang “continues to diligently fulfill its patriotic mission of challenging the unlawful presence of the Chinese Coast Guard.”\nThe Philippine Coast Guard said it must confront illegal patrols “as it prevents China from normalizing such unlawful actions.” “If we fail to challenge this, China will succeed in establishing a precedent for its maricreated_at forces’ illegal patrols in the future.”\n“Therefore, no matter how long it takes, the PCG vessels will always be present to prevent China from changing the status quo,” it added.\nThe PCG said China’s “disregard of international law” is a matter of concern not only for the Philippine government but for the entire region and the international community.\n“If the People’s Republic of China feels emboldened to ignore UNCLOS (United Nations Convention on the Law of the Sea) and unlawfully patrol the EEZ of other states, what will stop it from doing the same to additional countries?” it asked.\n“While some may argue they are prepared to defend their rights, isn’t that precisely what we are trying to prevent?” it added.\n“A world increasingly dominated by rising tensions among sovereign nations is not what we desire. This is why international law has been established — to ensure equality and uphold the sovereignty of all nations.”\nA United Nations-backed tribunal in 2016 voided China’s expansive claims in the South China Sea, as it ruled Scarborough Shoal, which Beijing has controlled since 2012, is a traditional fishing ground for Filipino, Chinese and Vietnamese fishermen.\nThe shoal, which Manila calls Bajo de Masinloc, is 241 kilometers off Zambales and is within the Philippines’ 200-nautical mile EEZ.\n"
  },
  {
    "id": 1806,
    "title": "Malaysia's Anwar Ibrahim Says Global Trade Will Weather Trump's 'Initial Shock'",
    "created_at": "2025-01-21",
    "text": "\n In an interview with the Financial created_ats, Malaysia's Prime Minister Anwar Ibrahim sought to reassure the global community about the future of international trade under the incoming Trump administration. While acknowledging the inevitable 'initial shock' of new tariffs and protectionist policies, Anwar expressed confidence that the global trading system would stabilize over created_at, emphasizing that the long-term benefits of trade interdependence would ultimately outweigh short-term disruptions.\n'I think you can expect some initial turbulence or uncertainty, but after five or six months, you stay the course,' Anwar said, adding that 'reason will probably prevail.' He emphasized that major U.S. companies and conglomerates have significant interests in foreign trade and investments, making it unlikely that prolonged trade barriers would be sustainable.\nAnwar's comments come as Donald Trump prepares to take office for a second term, with many in Asia concerned about potential economic fallout from his proposed high tariffs. Despite these anxieties, Anwar, who has spoken with key leaders such as China's Xi Jinping and the UAE's Mohammed bin Zayed, argued that the 'US wants to protect its own interests, but in the long term, trade barriers wouldn't help.' His diplomatic stance reflects a belief that global commerce, while temporarily disrupted, would eventually resume its course.\nA Shift in Regional Power Dynamics\nAnwar also pointed to the shifting balance of power in Southeast Asia, where the U.S. is seen to have lost ground to China due to diminished engagement. 'China in that sense takes a more positive attitude,' he explained, noting the growing presence of Chinese officials in Malaysia and the increasing Chinese investments in infrastructure projects. Anwar suggested that the U.S. had diverted its focus elsewhere, particularly with the ongoing conflict in Ukraine, and had reduced its active involvement in Asia.\n'Maybe they are focused on Europe, I don't know. But certainly, they have reduced placing importance on the region,' he told the FT. This observation underscores Malaysia's growing ties with China, a trend that has raised concerns among ASEAN (Association of Southeast Asian Nations) partners, particularly regarding the contentious South China Sea disputes. While Malaysia maintains a delicate balance in its relations with both Washington and Beijing, Anwar acknowledged that his government has shifted closer to China in recent years.\nNavigating Tensions in the South China Sea\nAnwar's stance on the South China Sea was measured, highlighting Malaysia's position as a key player in regional security. Although Malaysia has avoided confronting China directly, Anwar underscored his country's efforts to engage diplomatically while taking a firm stand on its territorial claims. He also pointed to Malaysia's leadership role in ASEAN, where tensions over China's assertiveness are felt by many member states.\nWhen asked whether ASEAN under his leadership would adopt a tougher stance toward China, Anwar replied, 'Why do we need to be tough? We disagree on many foreign policy issues with the U.S. but we want them to be an important ally. Similarly with China, I don't think it's a matter of being tough against a strong, big neighbor.'\nReflections on Western Engagement and Trust Deficits\nIn the same interview, Anwar lamented the 'trust deficit' in Southeast Asia toward Western powers, particularly in light of their stance on issues like the Gaza conflict. He accused Western nations of hypocrisy, having supported Israeli military actions in Gaza while promoting democracy and human rights in Asia. Anwar argued that the West had offered little practical support to the region, focusing mainly on trade and investment without addressing deeper geopolitical concerns.\nOn domestic issues, Anwar also defended his decision to ease the jail conditions of former Prime Minister Najib Razak, convicted in connection with the 1MDB scandal. Anwar, who endured his own political imprisonment in the past, justified the move by highlighting that while he could not forgive corruption, the focus should be on recovering stolen funds rather than retribution.\n"
  },
  {
    "id": 1807,
    "title": "Philippines Political Risk Key View",
    "created_at": "2025-01-21",
    "text": "\nCore Views\nPolitical Risk:A The overall outlook remains stable. The PhilippinesaEURtm political landscape is prone to aEUR~celebrityaEURtm culture and is often dominated by several political families that hold sway over regions within the country. For many years, there has been an insurgency in the southern part of the country. The composite score remains relatively stable, at 46.0, as of December 2024.\nGovernance: The Philippines is a long-established and vibrant democracy, enabling broad checks and balances on the government by the House of Representatives and the Senate. However, political institutions have long been dominated by 'political dynasties'. For example, President Ferdinand Marcos Jr is the son of a former president, and several of his predecessors have been related to past presidents. Many legislators are also the children of a previous generation of legislators. The significant intertwining of political spheres and major corporations has also given rise to an aEUR~oligarchicaEURtm ruling class. Although this dynastic phenomenon does not inherently cause instability, it creates a perception of a self-sustaining elite, posing challenges for newcomers to break into the political arena. This aspect of the political system potentially obstructs economic and political reforms. In December 2024, the Governance score stood at 35.6; however, there is a risk of it deteriorating.A\nSociety:A Due to its low GDP per capita, A the Philippines is vulnerable to social unrest. The uneven distribution of income is evident from the Gini coefficient, which stood at 40.2 in 2021. The rapid rate of population growth also dampens the rate of per capita GDP growth, compared with economies with lower fertility rates. With around 54% of the Philippine population under the age of 25, the high percentage of youth has historically been associated with higher risks of protest. However, the emigration of Philippine workers in search of employment abroad has acted as a form of relief, and the remittances of overseas workers provide a buffer for the economy, amounting to around 10% of GDP. The Philippines' Social Risk score stands at 45.7, as of December 2024.A\nSecurity:A The Philippines is engaged in a dispute with Mainland China regarding sovereignty in the South China Sea. Any intensification of this dispute could strain bilateral relations between Beijing and Manila. However, risks are mitigated by the PhilippinesaEURtm Mutual Defense Treaty with the US. Domestically, the Philippines faces security challenges from insurgent and radical groups, including Abu Sayyaf, the Maute group and the New PeopleaEURtms Army. There is a risk that skirmishes expand into more extensive and enduring confrontations, such as the Marawi Siege which took place in 2017. While the Security Risk score stands at 44.7 in December 2024, with tensions escalating in the South China Sea, it could potentially deteriorate.A\nElection Watch:A Mid-term legislative elections are scheduled for May 2025, and the next presidential election is scheduled for May 2028. Philippine presidents are not allowed to run for a second six-year term, so President Macros will step down. Vice President Sara Duterte has expressed interest in running for president, and her popularity places her as a clear favourite.\n"
  },
  {
    "id": 1808,
    "title": "Challenges to X Jinping, grow from Party, people and PLA",
    "created_at": "2025-01-21",
    "text": "\nJanuary 21 --\nChairman Xi Jinping once looked supreme, unimpeachable and irreproachable. He was perched high upon a pedestal he and the Chinese Communist Party (CCP) erected after he became supremo in 2012.\nAt first, he could do no wrong, as China's economy and military might inexorably grow. However, a lot has happened since then, and the gloss of his aura has rubbed off and is now tarnished.\nMuch of the reason for that has been Xi's poor handling of the COVID-19 pandemic, increasingly restrictive surveillance and control over the minutest aspect of Chinese society, unstinting support for tsar Vladimir Putin and his war machine, and his failed economic policies.\n \n \nConsider too that Xi and a militant CCP have done nothing to endear themselves to other nations - as China grabbed territory in India and the South China Sea, tightened the screws against Taiwan, trampled on human rights in Xinjiang, and subjugated Hong Kong. He has rubbed neighbours up the wrong way and alarmed Europe and the US.\nThe People's Liberation Army (PLA) has been complicit in all manner of sabre-rattling activities and in bullying others smaller than themselves. Yet the PLA is in a degree of disarray, wracked by scandal, corruption and political interference. Commander-in-chief Xi is not filled with confidence in his armed forces.\n"
  },
  {
    "id": 1809,
    "title": "ASEAN 2025: Navigating Unity In A Divided World – OpEd",
    "created_at": "2025-01-21",
    "text": "\nThe Association of Southeast Asian Nations (ASEAN) has long served as a cornerstone of stability and cooperation in Southeast Asia. Founded in 1967 it has played a vital role in fostering peace economic growth and regional dialogue among its ten member states. However, as the world becomes increasingly multipolar ASEAN's geopolitical competence faces heightened scrutiny. The bloc's ability to navigate this complex landscape in 2025 will depend on its capacity to strengthen internal cohesion enhance economic integration and assert itself as a mediator in global and regional conflicts all while addressing challenges posed by external interference internal disparities, and non-traditional security threats.\nHistorically ASEAN has been instrumental in promoting regional stability. The organization emerged during the Cold War as a platform to prevent conflicts among its member states and to counter external ideological influences. Its early success in fostering peace within a plagued region by territorial disputes and ideological divides is a testament to its effectiveness. ASEAN's Treaty of Amity and Cooperation (TAC) and its principle of non-interference have provided a framework for peaceful coexistence ensuring that member states resolve disputes through dialogue rather than confrontation. Furthermore, ASEAN has been pivotal in driving economic stability most notably through initiatives like the ASEAN Free Trade Area (AFTA), which has facilitated intra-regional trade and investment. This historical role as a stabilizing force underscores ASEAN's geopolitical significance.\nIn recent years ASEAN has achieved remarkable success in regional diplomacy and economic integration. Its role in mediating disputes such as those in the South China Sea highlights its importance as a platform for dialogue. Although the South China Sea disputes remain unresolved ASEAN's consistent emphasis on diplomacy has prevented these tensions from escalating into open conflict. The establishment of the Regional Comprehensive Economic Partnership (RCEP)the world's largest free trade agreement, further demonstrates ASEAN's ability to foster economic cooperation among its member states and external partners. Additionally, ASEAN forums led such as the ASEAN Regional Forum (ARF) and the East Asia Summit (EAS) have enhanced the bloc's role as a convener of global powers, enabling it to shape regional security and economic agendas.\nHowever, despite achievements ASEAN faces significant challenges that threaten its geopolitical competence. The internal bloc is marked by in disparities economic development governance, politics and systems among its member states. For instance, Singapore enjoys one of the highest GDPs per capita in the world the countries like Myanmar and Cambodia lag significantly behind. This economic gap often translates into diverging national priorities complicating efforts to achieve consensus on critical issues. Additionally, ASEAN lacks enforceable mechanisms to address intra-regional disputes which undermines its ability to present a unified front. Fragmented response, to external pressures, such as the COVID-19 pandemic, further highlighted these internal divisions.\nExternally the intensifying rivalry between the United States and China poses a significant challenge to ASEAN's neutrality. Both powers seek to expand their influence in Southeast Asia often forcing ASEAN member states to choose sides. For example, the U. S. has ramped up its military presence in the region under its Indo-Pacific Strategy while China continues to assert its claims in the South China Sea and expand Belt and Road Initiative (BRI) projects in ASEAN countries. These competing influences risk fracturing ASEAN's cohesion, as member states prioritize bilateral relations with these powers over collective interests. Moreover the rise of other regional players, as such India and Japan, complicates further ASEAN's strategic calculations.\nNon-traditional security threats present a growing challenge. Climate change and environmental degradation have disproportionately affected Southeast Asia, rising with sea levels threatening low-lying countries like Vietnam and the Philippines disaster as typhoons and earthquakes are becoming more and more frequent straining severe state members' resources and capabilities. Cybersecurity threats and the rapid pace of digital expose ASEAN transformation to risks of cyberattacks and digital inequities. Transnational crimes including human trafficking, drug smuggling and terrorism add layer another of complexity to ASEAN's security landscape necessitating coordinated responses that are often hindered by differing national policies and priorities.\nTo address these challenges and bolster its geopolitical competence ASEAN must adopt a multifaceted strategy. Enhancing internal cohesion should be a top priority. Strengthening ASEAN's institutional framework such as by granting more authority to the Secretariat ASEAN can help improve coordination and decision-making. Bridging economic and political divides among state members requires targeted investments in capacity-building initiatives and infrastructure development in less developed countries. Establishing more robust conflict resolution mechanisms-such as binding agreements on dispute settlement-will further enhance ASEAN's unity.\nEconomic integration must also be deepened. Accelerating the implementation of the ASEAN Economic Community (AEC) will facilitate seamless trade investment and flows, boosting the region's global competitiveness. Embracing the digital economy fostering and innovation are equally critical. For instance, expanding digital infrastructure and harmonizing regulations on e-commerce can help ASEAN leverage the opportunities presented by the Fourth Industrial Revolution. These efforts will not only strengthen intra-ASEAN economic ties but also enhance the bloc's resilience external against economic shocks.\nIn the realm of regional security ASEAN must assert its role as a mediator and advocate for multilateralism. The \"ASEAN Way\" of consensus-building and non-confrontation remains a valuable diplomatic tool for managing tensions among major powers. By positioning itself as a neutral platform for dialogue ASEAN can mitigate the risk of U. S. -China rivalry spilling over into Southeast Asia. Moreover, ASEAN should expand its role in addressing non-traditional security threats by fostering regional cooperation on disaster preparedness cybersecurity and environmental sustainability.\nStrengthening external partnerships is another critical strategy. ASEAN must manage great-power competition maintaining a delicate balance between engaging with major powers and safeguarding its centrality. Diversifying strategic alliances-such as deepening ties with the European Union, Australia and Africa-can reduce dependency on any single power and enhance ASEAN's strategic autonomy. Promoting a rules-international based order through participation in global institutions like the United Nations further ASEAN's geopolitical relevance.\nIn conclusion, ASEAN's geopolitical competence in 2025 will depend on its ability to adapt to a rapidly evolving global landscape. While the bloc has demonstrated remarkable resilience and achievements in fostering regional stability and economic growth, it must significantly overcome internal and external challenges to remain the cornerstone of regional and global diplomacy. By enhancing internal cohesion, economic deepening integration asserting its role in regional security and externally strengthening partnerships ASEAN can navigate these complexities and reaffirm its position as a central player in the multipolar world. Adaptability and unity will be the key determinants of ASEAN's success in the years to come.\nIn this article, the author expresses his personal view.\nReferences\n - Acharya, Amitav. The Making of Southeast Asia: International Relations of a Region. Cornell University Press, 2012.\n- Beeson, Mark. Rethinking Regionalism: Europe and East Asia in Comparative Perspective. Palgrave Macmillan, 2019.\n- Severino, Rodolfo C. Southeast Asia in Search of an ASEAN Community: Insights from the Former ASEAN Secretary-General. Institute of Southeast Asian Studies, 2006.\n"
  },
  {
    "id": 1810,
    "title": "Philippines' arrest of Chinese 'sleeper agent' sparks fears of widespread spying",
    "created_at": "2025-01-21",
    "text": "\n A group comprising Deng Yuanqing and two Filipinos is accused of spying on Philippine military bases, including where US troops have access   \nPhilippine authorities have arrested a Chinese national suspected of conducting espionage operations, recovering equipment in his possession that they believe might have been used for spying on military facilities. \nLaw enforcers and military officials presented the suspect, identified as Deng Yuanqing, at a press conference in Manila on Monday, and two Filipinos who were allegedly also involved in the case. \nOfficials from the Philippines' National Bureau of Investigation (NBI) said Deng was a \"control engineering\" specialist and was arrested with his Filipino companions in Makati City on January 17. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nAuthorities added that Deng was affiliated with the Army Engineering University of PLA (People's Liberation Army), a military university based in Nanjing. \nNBI Director Jaime Santiago said local authorities received intelligence information about Deng and his group in December, indicating they had arrived in the Philippines to conduct surveillance on critical structures such as military bases and police camps. \nCybercrime chief Jeremy Lotoc said Deng, whom he dubbed a \"sleeper agent\", might have been in the Philippines for about five years based on his passport. \nDeng's group had even managed to visit sites under the Philippines' Enhanced Defence Cooperation Agreement (EDCA) with the United States, Armed Forces of the Philippines chief Romeo Brawner warned. US troops are allowed access to selected military bases in the Philippines under EDCA. \nAuthorities found data-gathering devices in their possession capable of sending sensitive information, such as exact coordinates and topographic details, which could be used for military targeting or drone operations. \nThey added that Deng and his group were also found surveying other locations such as airports, seaports, power facilities, and shopping malls. \nThe Chinese embassy in Manila did not immediately respond to a request from This Week in Asia for comment. \nAnalysts said Deng's arrest was unsurprising, with Beijing seeking to exploit Manila's vulnerabilities as both sides remained embroiled in tensions over the disputed South China Sea. \nThe development happened just days after Chinese and Philippine diplomats met in Xiamen for the two countries' 10th bilateral consultation mechanism (BCM) meeting, during which Manila pushed back against what it believed were rising incursions by China's vessels in the Philippines' exclusive economic zone. \nJulio Amador, interim president of the Foundation for the National Interest and a trustee at the non-profit organisation Facts Asia, said the arrests confirmed that China could run covert operations in the Philippines, including \"targeting our security infrastructures\". \nAmador said Manila should summon Beijing to demand an explanation of the activities of Deng's group and raise the matter in the next BCM. \nChester Cabalza, president of the Manila-based think tank International Development and Security Cooperation, said the investigations showed sleeper agents \"have faces, which tell us to even be more wary of hybrid warfare in a hyperconnected world\". \n\"Cyber warriors look like any ordinary people with an extraordinary mission to gather information, scan and send data, and plot future scenarios to weaken our institutions,\" he said, adding that the incident would deepen Manila's doubts about Beijing's sincerity in establishing a credible BCM. \nSherwin Ona, an international fellow at the Institute for National Defense and Security Research in Taiwan, said malign actors in China were long aware of ways to exploit the vulnerabilities of security and other systems in the Philippines, such as through the now-banned offshore gaming operators (Pogos), which had been suspected of carrying out espionage activities. \n\"In the past, we were complacent in accepting development assistance and loans [from Beijing], whose onerous terms can also be used to influence local officials. Plus, China knows the country has limited maricreated_at domain awareness and cyber abilities,\" Ona said. \nThe presence of EDCA sites in the Philippines posed a \"direct threat to the PRC's intention in the South China Sea and Taiwan Strait\". \"Therefore, surveillance of these sites is crucial,\" he added. \nAnalysts believe such espionage cases will continue alongside other China-led cyber and disinformation acts. As such, Cabalza called for a robust national ID system in the Philippines to counter such activities. \nLast year, over 1,000 Chinese nationals were found to have acquired fraudulent identity documents in the Philippines, such as birth certificates and national IDs. \n\"The government should hasten a flawless system and legal remedy to include cyber espionage, severely punishable under our domestic laws,\" Cabalza said. \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1812,
    "title": "Report: No maricreated_at piracy in Asia in 2024",
    "created_at": "2025-01-21",
    "text": "\n 21 Jan 2025 (Philippines News agency) The Regional Cooperation Agreement on Combating Piracy and Armed Robbery against Ships in Asia Information Sharing Centre (ReCAAP ISC) on Tuesday reported that there was not a single incident of piracy in Asia waters in 2024.\nIn a press conference in Manila, ReCAAP ISC executive director Krishnaswamy Natarajan said it is 'a proud moment for ReCAAP as well as all the contracting parties and member states in Asia.'\n'We're ensuring an incident-free region through the help of local governments,' Natarajan said.\nHe praised the Philippine Coast Guard (PCG) for 'doing a commendable job in the region.'\n'There are no incidents of abduction of crew for ransom in the Sulu-Celebes area,' he said.\nAccording to data from the ReCAAP ISC, there is a 'moderate low' threat of abduction of crew in the Sulu-Celebes Seas and waters off Eastern Sabah.\nThe current classification means that abductions are unlikely to occur due to the perceived lack of capability of perpetrators to orchestrate an attack.\nHowever, minimal damage are expected to occur on vessels and crew in case of an attack.\nUnder the 'Piracy and Armed Robbery Against Ships in Asia 2024,' the ReCAAP ISC reported 107 ship robberies, a six percent increase from 2023.\nOf the reported incidents, 62 occurred in the Straits of Malacca and Singapore (SOMS), 22 in Indonesia, 13 in Bangladesh, three in the Philippines, two in India, two in the South China Sea (SCS), two in Vietnam, and one in Malaysia.\nOf the total, there were 11 incidents in Bangladesh, Indonesia, and SOMS where the perpetrators failed to board ships through the vigilance of the crew and the presence of patrol vessels.\nNo crew was affected in 86 percent of the incidents.\nHowever, eight percent of cases had the crew tied up by the perpetrators, three percent where the crew were threatened, and three percent where the crew suffered injuries.\nOf these, 76 percent occurred in bulk carriers, 13 percent in tankers, 10 percent in tug boats towing barges or drill ships, and one percent in general cargo ships\n"
  },
  {
    "id": 1814,
    "title": "Trust deficit: Anwar hits at Western world's hypocrisy, says US has lost ground in Southeast Asia compared to China",
    "created_at": "2025-01-21",
    "text": "\nLONDON, Jan. 21 -- Prime Minister Datuk Seri Anwar Ibrahim has highlighted a \"trust deficit\" between the Western world and emerging economies, or Southeast Asia, due to its hypocrisy on certain geopolitical matters.\nIn an interview with UK-based Financial created_ats, he pointed to the Western world's support for Israel's military attacks against Palestinians in Gaza.\n\"There is a trust deficit among emerging economies because big powers have not followed the ground rules of basic international law,\" he was quoted saying.\nSimilarly in Southeast Asia, Anwar said the West had talked big about democracy and reform but did nothing to help.\n\"Nothing was done to assist [the region]. There's engagement only in trade and investment,\" he added.\nAnwar said that the United States has lost ground in the region compared to China, suggesting that its eyes may have moved to Europe due to Russia's invasion of Ukraine.\n\"We engage well with the US but it does not engage the region as actively as it did in the past. China in that sense takes a more positive attitude,\" he reportedly said, pointing to senior Chinese officials who visited Malaysia in recent created_ats.\n\"They give better access, you can meet them easily. We send ministers there, they send ministers.\"\nDespite that, Anwar said the US is still a valued investor in Malaysia, especially in the semiconductor industry.\n\"It's better for smaller economies such as Malaysia to extend its [ties] with China,\" he was quoted saying.\n\"The only contentious issue is the South China Sea [where China has conflicting territorial claims with some Asean member states] where we are engaging well and taking a strong position.\"\nAnwar also said that under Malaysia's chairmanship, Asean does not necessarily need to be confrontational with China - as the bloc needs the superpower as an ally.\n\"Why do we need to be tough? We disagree on many foreign policy issues with the US but we want them to be an important ally.\n\"Similarly with China I don't think it's a matter of being tough against a strong, big neighbour,\" he reportedly said.\nPublished by HT Digital Content Services with permission from Malay Mail. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1816,
    "title": "AS TRUMP TAKES POWER, DEFENSE PICK'S ASEAN FUMBLE RAISES CONCERNS",
    "created_at": "2025-01-21",
    "text": "\nThe following information was released by Radio Free Asia:\nSoutheast Asia is greeting Donald Trump's return to the White House with a mix of hope and hesitation as he embarks on his second term as U.S. president.\nTrump took the oath of office on Monday inside the Capitol after the ceremony was moved indoors because of weather reports that a polar vortex would bring frigid temperatures to the nation's capital.\nEven as regional leaders anticipate greater engagement with the United States, a controversial moment involving his defense secretary nominee, Pete Hegseth, has raised concerns about how the administration will treat relations with the Association of Southeast Asian Nations, or ASEAN.\nHegseth, a former Army National Guard officer and television commentator, was unable to name ASEAN member states or identify the bloc's size during his confirmation hearing last week, drawing criticism both in Washington and across Southeast Asia.\n\"He doesn't understand that the Defense Department's work in the South China Sea, where the U.S. plays a major role, involves many ASEAN countries,\" Isa Gharti, a public policy researcher at Chiang Mai University in Thailand, told RFA affiliate BenarNews. \"This lack of understanding could bring problems to ASEAN countries in the long term.\"\nASEAN has been central to Washington's strategy in the Indo-Pacific. The bloc, which includes Indonesia, Malaysia, Vietnam and Singapore among its 10 members, represents more than 680 million people and collectively forms the world's fifth-largest economy.\nThe United States counts two other ASEAN nations, Thailand and the Philippines, as treaty allies and has sought to deepen ties with the group to counter China's growing influence in the region. The U.S. military has access to nine Philippine bases.\nChina has made significant inroads in Southeast Asia, investing in infrastructure projects and using its economic clout to build partnerships. The South China Sea, where Beijing's territorial claims overlap with those of several ASEAN nations, remains a key flashpoint in the region.\nWhile Hegseth fumbled in responding to questions from Sen. Tammy Duckworth, who was born in Bangkok and injured in combat while serving in the U.S. military, regional leaders have expressed optimism about U.S. engagement under Trump's leadership.\nIndonesian President Prabowo Subianto has congratulated Trump on his victory and expressed his desire for a personal meeting.\nMalaysian Prime Minister Anwar Ibrahim hailed Trump's election a \"remarkable political comeback\" and voiced optimism about the potential for a deeper partnership with the United States.\nAnalysts react\nRaden Mokhamad Luthfi, a defense analyst at Universitas Al Azhar Indonesia, said he is skeptical about future defense relations between the United States and Indonesia, the world's largest Muslim-majority country, citing what he described as Hegseth's and Trump's unfavorable views of Muslims.\nCristina Palabay, secretary general of the Philippine rights group Karapatan, accused Washington of using allies including the Philippines to further its strategic goals.\n\"Trump's hostility toward China certainly matches, if not surpasses, that of Biden,\" Palabay said.\nIn Bangkok, Phumtham Wechayachai, Thai deputy prime minister and defense minister, struck a cautious tone.\n\"After Trump's inauguration as U.S. president, we need to see what adjustments may be needed,\" Phumtham told reporters. \"Overall, the foundation of U.S.-Thai relations is already good. We will consider any proposals according to Thai principles and make any adjustments that benefit the nation.\"\nOther analysts suggested that Hegseth's misstep might not significantly impact U.S. engagement with the region.\n\"It would be folly to assume that just because the secretary of defense may not be familiar with ASEAN, that is tantamount to weaker U.S. engagement,\" said Julio Amador, a geopolitical analyst based in Manila. \"The Pentagon is a huge bureaucracy and Hegseth's deputies are well-versed in the geopolitics of the Indo-Pacific.\"\nMuhammad Waffaa Kharisma, a researcher at the Centre for Strategic and International Studies in Jakarta, argued that ASEAN is not strategically significant to the United States.\n\"Perhaps some ASEAN member states are, but ASEAN as an institution isn't, especially in an era when enthusiasm for multilateral organizations has waned,\" Waffaa told BenarNews.\nHe added that Trump's first term as president was \"not particularly enthusiastic\" about ASEAN.\n\"They came up with initiatives which were seen as undermining ASEAN, including the Quad,\" he said, referring to a security dialogue among the United States, Japan, India and Australia.\n'Limited awareness'\nAsrul Hadi Abdullah Sani, a partner at ADA Southeast Asia, a regional consultancy firm, said Hegseth's \"gaffe underscores the limited awareness of ASEAN in American political circles.\"\nStill, concerns remain about the Trump administration's long-term priorities.\n\"We will need to plan for a worst-case scenario in which Trump and Xi will reach a modus vivendi that sacrifices the Philippines' national interests,\" Rommel Jude Ong, a retired Philippine Navy rear admiral, told BenarNews while calling for stronger ties with other regional powers such as Japan and Australia. Xi is Xi Jinping, China's president.\nMeanwhile, a social media user in Southeast Asia questioned Hegseth's comments.\n\"Not having heard of ASEAN doesn't mean it doesn't exist. All of us here in the ASEAN are cringing over what's happening over there in the West,\" a Filipina who goes by the username @tessgarcia wrote on X, formerly Twitter. \"Geography-challenged people like Hegseth are probably the reason the U.S. lost in Vietnam (an ASEAN country).\"\nJason Gutierrez and Gerard Carreon in Manila, Jon Preechawong in Bangkok, Iman Muttaqin Yusof and Iskandar Zulkarnain in Kuala Lumpur, Pizaro Gozali Idrus and Tria Dianti in Jakarta contributed to this report.\n"
  },
  {
    "id": 1818,
    "title": "European Commission to present its new Competitiveness Compass - Ursula von der Layen",
    "created_at": "2025-01-21",
    "text": "\nBAKU, Azerbaijan, January 21. The European Commission to present its new Competitiveness Compass next week, said President of the Commission Ursula von der Layen with her special address during the World Economic Forum in Davos, Switzerland, Trend reports.\nShe pointed out that the cooperative world order we imagined 25 years ago has not turned into reality. Instead, we have entered a new era of harsh geostrategic competition.\n\"The world's major economies are vying for access to raw materials, new technologies, and global trade routes. From AI to clean tech, from quantum to space, from the Arctic to the South China Sea, the race is on. As this competition intensifies, we will likely continue to see frequent use of economic tools such as sanctions, export controls, and tariffs that are intended to safeguard economic and national security.\nBut it is important that we balance the imperative to safeguard our security against our opportunity to innovate and enhance our prosperity. In this spirit, we will need to work together to avoid a global race to the bottom, because it is in no one's interest to break the bonds of the global economy. Rather, we need to modernize the rules to sustain our ability to produce mutual gain for our citizens,\" said the Commission's president.\nShe went on to add that for Europeans, the race begins at home.\n\"Europe has a unique social market economy. We have the second largest economy and the biggest trading sector in the world. We have longer life expectancy, higher social and environmental standards, and lower inequalities than all our global competitors. Europe is home to immense talent, along with a proven ability to attract ideas and investment from across the world. Our capacity to invent and create is underappreciated. Europe's global share of patent applications is on par with the U.S. and China. But the world is changing. So must we,\" said Ursula von der Layen.\nShe recalled that for the last 25 years, Europe has relied on the rising tide of global trade to drive its growth.\n\"It has relied on cheap energy from Russia. And Europe has too often outsourced its own security. But those days are gone. To sustain our growth in the next quarter of a century, Europe must shift gears. And this is why I asked Mario Draghi, President of the European Central Bank, to deliver a report on European competitiveness. And on that basis, next week the European Commission is presenting our roadmap, the Competitiveness Compass, which will drive our work for the next five years. The focus will be increased productivity by closing the innovation gap,\" she said.\nFollow the author on X: @Lyaman_Zeyn\n"
  },
  {
    "id": 1822,
    "title": "South Dakota-based B-1 bombers arrive on Guam for latest task force mission",
    "created_at": "2025-01-21",
    "text": "\nJan. 21—U.S. Air Force bombers from South Dakota are back in the Western Pacific for the region's first bomber task force mission of the year.\nAt least two B-1B Lancers assigned to the 34th Expeditionary Bomb Squadron at Ellsworth Air Force Base, S.D., arrived Jan. 15 at Andersen Air Force Base, according to photos published Friday by the 28th Bomb Wing.\nThe long-range, heavy bombers are slated to participate in Bomber Task Force 25-1, part of an ongoing series of training missions intended to showcase the Air Force's \"ability to deter, deny and dominate any influence or aggression from adversaries or competitors alongside allies and partner forces,\" according to photo captions published to the Defense Visual Information Distribution Service.\nSquadron spokeswoman 2nd Lt. Alejandra Angarita acknowledged an email request for additional information on the deployment but was unable to provide a response by Tuesday afternoon.\nThe day of their arrival, at least one of the Lancers completed an aerial refueling over the South China Sea with a KC-135 Stratotanker assigned to 909th Air Refueling Squadron at Kadena Air Base, Okinawa, according to a separate series of photos posted Thursday on Facebook by the 18th Wing.\nAlso that day, a pair of Lancers were escorted in an airpower demonstration over the Sea of Japan, or East Sea, by South Korean F-15K Slam Eagles and Japan Air Self-Defense Force Mitsubishi F-2 fighters, the first overflight by U.S. allies of the new year. The Air Force did not identify the Lancers' home station.\nThe Air Force routinely deploys Lancers, B-52 Stratofortress and B-2 Spirit bombers to Guam and elsewhere around the world on task force missions, which began in January 2018 and have continued regularly since 2020. Plans call for replacing the Spirits with the B-21 Raider being developed by Northrop Grumman.\n\"While the missions for each BTF may vary, the overall goal remains the same: assure allies and deter adversaries,\" the Air Force Global Strike Command website states.\nFrom Nov. 8 to Dec. 13, four B-52s assigned to the 20th Expeditionary Bomb Squadron at Barksdale Air Force Base, La., deployed to England's Royal Air Force Fairford base.\nThe bombers participated in nine operations with NATO and partner nations, including the Czech Republic, Finland, France, Italy, Lithuania, Morocco, Norway, Sweden and the United Kingdom, according to a Dec. 13 news release.\nThe last task force mission based out of Guam, Bomber Task Force 24-6, concluded June 25 and included B-1Bs from Ellsworth's 37th Expeditionary Bomb Squadron, according to a July 5 news release from the 28th Bomb Wing.\n© 2025 the Stars and Stripes. Visit www.stripes.com. Distributed by Tribune Content Agency, LLC.\n"
  },
  {
    "id": 1825,
    "title": "New top U.S. diplomat to hold Quad talks with Japan, Australia, India",
    "created_at": "2025-01-21",
    "text": "\n The first major diplomatic event of the second presidency of Donald Trump will take place Tuesday, a day after his inauguration, bringing together the top diplomats of the United States, Japan, Australia and India to discuss major challenges in the Indo-Pacific amid China's rise in the region.\n Marco Rubio, who was swiftly confirmed by the Senate as secretary of state on Monday, will attend a meeting of the grouping known as the Quad in Washington, indicating that the new Trump administration could be more supportive of multilateral cooperation than has been generally expected.\n Rubio, a former Florida senator, has taken a hard-line approach to China that aligns with Trump's stance. In his confirmation hearing before the Senate Foreign Relations Committee last week, he said China is \"the most potent and dangerous near-peer adversary\" the United States has ever confronted.\n Rubio is almost certain to put China on the agenda in the talks with Japanese Foreign Minister Takeshi Iwaya, Australian Foreign Minister Penny Wong and Indian Foreign Minister Subrahmanyam Jaishankar.\n The diplomatic partnership of the four democracies was raised to the foreign ministerial level in 2019 during Trump's first presidency.\n His predecessor Joe Biden elevated the Quad to the leader level in 2021. He hosted the first in-person Quad summit in September of that year in Washington.\n Inviting the Japanese, Australian and Indian foreign ministers to Trump's inauguration ceremony and organizing the meeting just after he returned to the White House on Monday suggests that the new administration places special value on the four-way partnership.\n The Quad's origins date back to when the four countries coordinated their emergency responses and humanitarian aid following the 2004 Indian Ocean earthquake and tsunami.\n The Quad is not a security alliance but has often been regarded as a counterweight to China's growing influence. The areas of cooperation have been expanding in recent years, ranging from maricreated_at safety and infrastructure to health security and emerging technologies.\n Biden hosted a Quad summit last September in his home state of Delaware, at which the leaders used some of the strongest language that the group has ever issued. Without mentioning China by name, they voiced \"serious concern\" over \"the militarization of disputed features, and coercive and intimidating maneuvers in the South China Sea.\"\n \"We condemn the dangerous use of coast guard and maricreated_at militia vessels, including increasing use of dangerous maneuvers,\" they said.\n Notable new initiatives announced at that created_at included launching joint coast guard exercises. The move was seen as augmenting the security aspect of the Quad and sending a strong signal to China that its assertive maricreated_at actions against smaller countries such as the Philippines are unacceptable.\n While the four countries have repeatedly underscored that they have come together to share values such as democratic governance and the vision of a free and open Indo-Pacific, China has criticized the Quad as an Asian version of NATO aimed at containing its rise.\n==Kyodo\n"
  },
  {
    "id": 1826,
    "title": "Tariffs, Ukraine, climate, energy: Von der Leyen and the EU respond to Trump",
    "created_at": "2025-01-21",
    "text": "\nBreaking the \"bonds\" that hold the global economy together \"is in no one's interest.\" So said European Commission President Ursula von der Leyen, speaking at the World Economic Forum in Davos, Switzerland, where she also responded to US President Donald Trump's words on issues such as the war in Ukraine, climate, tariffs and energy.\n\"The world's leading economies,\" she said, \"are racing for access to raw materials, new technologies and global trade routes. From artificial intelligence to clean technology, from quantum to space, from the Arctic to the South China Sea, the race has begun. As this competition intensifies, we will likely continue to see frequent use of economic tools, such as sanctions, export controls and tariffs, aimed at safeguarding economic and national security.\"\n\"But it is important,\" she continues, \"that we balance the fundamental imperative to safeguard our security in the face of the opportunity to innovate and improve our prosperity. In this spirit, we will have to work together to avoid a global race to the bottom. Because breaking the bonds of the global economy is in no one's interest. Rather, we need to modernize the rules, to support the ability to produce benefits for our citizens,\" she continues.\n\"To sustain growth in the next quarter century, Europe must shift gears,\" underlines President von der Leyen.\n\"That is why,\" she continues, \"I asked Mario Draghi for a report on European competitiveness. And on this basis, next week the European Commission is presenting the roadmap that will guide our work for the next five years. The goal will be to increase productivity by closing the innovation gap. A joint plan for decarbonization and competitiveness.\"\n\"To overcome skills and labor shortages and to reduce bureaucracy,\" he continues, \"a strategy for faster, cleaner and fairer growth, ensuring that all Europeans can benefit from technological change\", he stresses.\n\"It is important that Ukraine remain an independent country and that it is Ukraine that decides on its own territory. So the line still holds: we stand with Ukraine for as long as it takes,\" reiterates the President of the European Commission. US President Donald Trump in his inaugural address did not mention Ukraine once.\n\"The Paris Agreement remains the best hope for all of humanity. Europe will stay the course and will continue to work with all nations that want to protect nature and stop global warming,\" von der Leyen said after Trump again decided to pull the world's leading economy out of the Paris climate agreement.\nNow in the EU \"our competitiveness depends on a return to low and stable energy prices. Clean energy is the medium-term answer, because it is cheap, creates good jobs locally and strengthens our energy independence,\" said European Commission President Ursula von der Leyen, speaking at the World Economic Forum in Davos, Switzerland. The president also announced the presentation of a new EU plan \"in February,\" von der Leyen's response after the US president said yesterday that the United States intends to take full advantage of its hydrocarbons to boost the economy and export them, shouting \"drill, baby, drill.\" (\"drill, baby, drill\").\n©2025 GMC S.A.P.A. di G. P. Marra. Visit at adnkronos.com. Distributed by Tribune Content Agency, LLC.\n"
  },
  {
    "id": 1828,
    "title": "US Ally Seizes China Military Spy Car",
    "created_at": "2025-01-21",
    "text": "\nThe Philippines has arrested three people on suspicion of espionage after they were caught with intelligence related to military installations and other sensitive sites, allegedly collected from a vehicle.\nNewsweek contacted the Chinese foreign ministry and the Philippine National Bureau of Investigation (NBI) with emailed requests for comment.\nWhy It Matters\nThe case comes amid heightened China-Philippine tensions over a longstanding territorial dispute. Beijing's sweeping claims encompass much of the South China Sea, including the Philippines' internationally recognized maricreated_at zone. Clashes between the neighbors' coast guards have resulted in several Philippine injuries and raised the specter of Manila's Mutual Defense Treaty with Washington.\nFurther fueling anti-China sencreated_atnt is the case of Alice Guo, a mayor accused of spying for China and having links to illegal online scamming centers, often run by Chinese nationals and tied to criminal activities such as human-trafficking. Guo has pled not guilty.\nWhat to Know\nThe NBI on Friday arrested a Chinese national with the surname Deng, and two male Philippine associates, called Besa and Fernande.\nThe law enforcement action followed a bureau investigation triggered by naval operatives' report on a group of Chinese citizens suspected of conducting surveillance under the guise of developing an autonomous vehicle.\nOfficials learned Deng, a software engineer specializing in control engineering, has connections with China's military-affiliated People's Liberation Army University of Science and Technology, according to a bureau press release.\nThe bureau identified three other suspects in the surveillance operation, including two unnamed hardware engineers and a financier, a woman known as Wang. All three individuals are believed to be in China.\nDeng was operating ICT equipment when officials approached the car in Metro Manila's Makati City. Asked about his identity and to provide authorization, Deng tried to hide his equipment and flee, prompting the officials to take him and his companions into custody.\nA search of the equipment in the vehicle revealed a range of sensitive information \"comprising topographic footage mapping the critical infrastructures of the Philippines, among others,\" the report said. \nThe vehicle was tracked \"traversing to and fro\" on Luzon island as Deng collected detailed imaging data from between December 13, 2024, and January 16.\nNBI Cybercrime Division head Jeremy Lotoc told reporters Monday that Deng is suspected of being a \"sleeper\" agent or mole who has been in the Philippines for five years, the Philippine Inquirer reported.\nFernandez and Besa reportedly admitted to having acted as Deng assistant and driver, taking the engineer to police and military headquarters as well as government offices and power installations, the Inquirer cited officials as saying.\nThe military sites of interest included those being jointly operated alongside the U.S. under the allies' Enhanced Defense Cooperation Agreement, Philippine armed forces chief Romeo Brawner Jr. told reporters.\nWhat People Are Saying\nEduardo Ano, the Philippine national security adviser, said:\n\"The recent apprehensions highlight the need for continuous vigilance, strengthened coordination among government agencies and proactive measures to fortify our national security framework.\"\nThe Armed Forces of the Philippines wrote on X (formerly Twitter):\n\"The AFP remains vigilant in its duty to defend the country against all kinds of threats to national security.\"\nWhat's Next\nAno urged the Philippine Congress to prioritize passing the Countering Foreign Interference and Malign Influence Bill and pending amendments to the Espionage Act.\n\"Strengthening our legal framework is essential to effectively address evolving security threats and ensure that those who seek to compromise our national security will face the full force of the law,\" he added.\nLink to Image\n\nGraphic\n \nSuspects in Philippine Espionage Case\nArmed Forces of the Philippines\nThe three men arrested on suspicion of illegal surveillance, Deng, Fernande, and Besa, are presented at a press conference on January 20.\n"
  },
  {
    "id": 1830,
    "title": "UPDATE1: New top U.S. diplomat holds Quad talks with Japan, Australia, India",
    "created_at": "2025-01-21",
    "text": "\n The first major diplomatic event of the second presidency of Donald Trump took place Tuesday, a day after his inauguration, bringing together the top diplomats of the United States, Japan, Australia and India to discuss major challenges in the Indo-Pacific amid China's rise in the region.\n Marco Rubio, who was swiftly confirmed by the Senate as secretary of state on Monday, hosted a meeting of the grouping known as the Quad in Washington, indicating that the new Trump administration could be more supportive of multilateral cooperation than has generally been expected.\n Rubio, a former Florida senator, has taken a hard-line approach to China that aligns with Trump's stance. In his confirmation hearing before the Senate Foreign Relations Committee last week, he said China is \"the most potent and dangerous near-peer adversary\" the United States has ever confronted.\n Rubio is almost certain to put China on the agenda in the talks with Japanese Foreign Minister Takeshi Iwaya, Australian Foreign Minister Penny Wong and Indian Foreign Minister Subrahmanyam Jaishankar.\n Arriving at the State Department for his first day ahead of the meeting, Rubio delivered remarks in which he reminded officials that voters decide the course of the United States and they have elected Trump.\n \"Our foreign policy is centered on one thing, and that is the advancement of our national interest,\" Rubio said, telling them also that \"there will be changes\" in the way the department operates, but such moves were not meant to be \"destructive\" or \"punitive.\"\n He stressed that the agency needs \"to move faster than we ever have, because the world is changing faster than we ever have.\"\n The diplomatic partnership of the four democracies was raised to the foreign ministerial level in 2019, during Trump's first presidency.\n His predecessor Joe Biden elevated the Quad to the leader level in 2021 and hosted the first in-person Quad summit in September of that year in Washington.\n Inviting the Japanese, Australian and Indian foreign ministers to Trump's inauguration ceremony and organizing the meeting just after he returned to the White House on Monday suggests that the new administration places special value on the four-way partnership.\n The Quad's origins date back to when the four countries coordinated their emergency responses and humanitarian aid following the 2004 Indian Ocean earthquake and tsunami.\n Although the Quad is not a security alliance, it has often been regarded as a counterweight to China's growing influence. Its areas of cooperation have been expanding in recent years, ranging from maricreated_at safety and infrastructure to health security and emerging technologies.\n The four countries have repeatedly underscored that they have come together to share values such as democratic governance and the vision of a free and open Indo-Pacific, but China has criticized the Quad as an Asian version of NATO aimed at containing its growing influence.\n Biden hosted a Quad summit last September in his home state of Delaware, at which the leaders used some of the strongest language ever issued by the group. Without mentioning China by name, they voiced \"serious concern\" over \"the militarization of disputed features, and coercive and intimidating maneuvers in the South China Sea.\"\n \"We condemn the dangerous use of coast guard and maricreated_at militia vessels, including increasing use of dangerous maneuvers,\" they said.\n Notable new initiatives announced at the created_at included the launching of joint coast guard exercises. The move was seen as augmenting the security aspect of the Quad and sending a strong signal to China that its assertive maricreated_at actions against smaller countries such as the Philippines were unacceptable.\n==Kyodo\n"
  },
  {
    "id": 1831,
    "title": "Secretary of State Rubio on Day 1 meets with Quad countries focused on countering China’s influence",
    "created_at": "2025-01-21",
    "text": "\nBANGKOK (AP) — On his first full day as secretary of state, Marco Rubio is meeting with his counterparts from a group of countries known as the Quad, which is made up of the United States plus India, Japan and Australia, representing nearly 2 billion people and more than a third of global GDP. The grouping has been around for more than 15 years, but has recently grown in importance. What exactly is it?\nA diplomatic partnership, but maybe more?\nThe Quad was established in 2007 to bring together countries that had worked together in response to the devastating 2004 earthquake and tsunami in the Indian Ocean. Its members stress its diplomatic nature and broad focus on regional issues including infrastructure, humanitarian aid, disaster relief, climate change, and maricreated_at security.\nEven though security is only part of the mix, the Quad is a major component of the American strategy to counter China's growing assertiveness and vast territorial claims in the region, including to virtually all of the strategically important South China Sea and the democratic self-governing island of Taiwan. As a result, the group is frequently referred to as the “Quadrilateral Security Dialogue” though officially it's just the “Quad.”\nThe strategic element to the Quad has prompted China to accuse the four countries of attempting to form an “Asian NATO,” though it is a very different construction and has no mutual-defense pact, a key component to the North Atlantic Treaty Organization alliance.\nStill, the White House stressed following a Quad summit in September that the members were working with partners throughout the region to “bolster maricreated_at security, improve maricreated_at domain awareness, and uphold a free and open Indo-Pacific.”\nHow important is it?\nNot long after its founding, the Quad fell dormant and stayed that way for a decade until President Donald Trump in his first term agreed with the leaders of Japan, Australia and India to revive it.\nThe meetings of the countries' top diplomats were elevated under Joe Biden's presidency to summits of leaders, most recently in September in Biden's home state of Delaware. Over Biden's four years in office, defense cooperation between the Quad members has deepened. Japan, Australia and the U.S. have all increased their defense spending, with the Americans increasingly targeting the Asia-Pacific region, while India has held its expenditure steady.\nAt the Delaware summit, the countries agreed to expand the partnership among their coast guards to improve interoperability and capabilities, with Indian, Japanese and Australian personnel sailing on U.S. ships in the region\nJapan and Australia have also been broadly revamping their defense strategies, with Australia entering the AUKUS agreement with the U.S. and United Kingdom to obtain nuclear-powered submarines and other advanced capabilities.\nWhat comes next?\nIt remains to be seen whether Trump will keep the Quad at the leaders level, or turn it back to the nations' top diplomats, though the fact that there will be a meeting in Washington the day after his inauguration signals it's likely to remain important.\nFor his part, Rubio called China “the most potent, dangerous and near-peer adversary this nation has ever confronted” during his confirmation hearing Wednesday, and the issues that gave rise to the rebirth of the Quad in Trump's first term have only intensified.\nAmong other things, China has been pursuing its regional territorial claims more aggressively, leading to direct confrontations with the Philippines and others, and working toward establishing a true 'blue-water\" navy capable of operating in seas far from China, including advancing toward the construction of nuclear-powered aircraft carriers, in a growing global challenge.\nAhead of the meeting with Rubio, Australian Foreign Minister Penny Wong called bilateral ties with the U.S. “our most important strategic relationship” and said she was happy a meeting of the Quad countries was being held so soon after the inauguration.\n“It’s a demonstration of the collective commitment of all countries to the Quad, an iron-clad commitment in this created_at where close cooperation in the Indo-Pacific is so important,” she told reporters in Washington on the weekend.\n"
  },
  {
    "id": 1833,
    "title": "Newly minted Secretary of State Rubio is meeting with members of the Quad. What's it for?",
    "created_at": "2025-01-21",
    "text": "\nBANGKOK (AP) — On his first full day as secretary of state, Marco Rubio is meeting with his counterparts from a group of countries known as the Quad, which is made up of the United States plus India, Japan and Australia, representing nearly 2 billion people and more than a third of global GDP. The grouping has been around for more than 15 years, but has recently grown in importance. What exactly is it?\nA diplomatic partnership, but maybe more?\nThe Quad was established in 2007 to bring together countries that had worked together in response to the devastating 2004 earthquake and tsunami in the Indian Ocean. Its members stress its diplomatic nature and broad focus on regional issues including infrastructure, humanitarian aid, disaster relief, climate change, and maricreated_at security.\nEven though security is only part of the mix, the Quad is a major component of the American strategy to counter China's growing assertiveness and vast territorial claims in the region, including to virtually all of the strategically important South China Sea and the democratic self-governing island of Taiwan. As a result, the group is frequently referred to as the “Quadrilateral Security Dialogue” though officially it's just the “Quad.”\nThe strategic element to the Quad has prompted China to accuse the four countries of attempting to form an “Asian NATO,” though it is a very different construction and has no mutual-defense pact, a key component to the North Atlantic Treaty Organization alliance.\nStill, the White House stressed following a Quad summit in September that the members were working with partners throughout the region to “bolster maricreated_at security, improve maricreated_at domain awareness, and uphold a free and open Indo-Pacific.”\nHow important is it?\nNot long after its founding, the Quad fell dormant and stayed that way for a decade until President Donald Trump in his first term agreed with the leaders of Japan, Australia and India to revive it.\nThe meetings of the countries' top diplomats were elevated under Joe Biden's presidency to summits of leaders, most recently in September in Biden's home state of Delaware. Over Biden's four years in office, defense cooperation between the Quad members has deepened. Japan, Australia and the U.S. have all increased their defense spending, with the Americans increasingly targeting the Asia-Pacific region, while India has held its expenditure steady.\nAt the Delaware summit, the countries agreed to expand the partnership among their coast guards to improve interoperability and capabilities, with Indian, Japanese and Australian personnel sailing on U.S. ships in the region\nJapan and Australia have also been broadly revamping their defense strategies, with Australia entering the AUKUS agreement with the U.S. and United Kingdom to obtain nuclear-powered submarines and other advanced capabilities.\nWhat comes next?\nIt remains to be seen whether Trump will keep the Quad at the leaders level, or turn it back to the nations' top diplomats, though the fact that there will be a meeting in Washington the day after his inauguration signals it's likely to remain important.\nFor his part, Rubio called China “the most potent, dangerous and near-peer adversary this nation has ever confronted” during his confirmation hearing Wednesday, and the issues that gave rise to the rebirth of the Quad in Trump's first term have only intensified.\nAmong other things, China has been pursuing its regional territorial claims more aggressively, leading to direct confrontations with the Philippines and others, and working toward establishing a true 'blue-water\" navy capable of operating in seas far from China, including advancing toward the construction of nuclear-powered aircraft carriers, in a growing global challenge.\nAhead of the meeting with Rubio, Australian Foreign Minister Penny Wong called bilateral ties with the U.S. “our most important strategic relationship” and said she was happy a meeting of the Quad countries was being held so soon after the inauguration.\n“It’s a demonstration of the collective commitment of all countries to the Quad, an iron-clad commitment in this created_at where close cooperation in the Indo-Pacific is so important,” she told reporters in Washington on the weekend.\n"
  },
  {
    "id": 1836,
    "title": "'Typhon missile system can defend Philippines maricreated_at interests'",
    "created_at": "2025-01-21",
    "text": "\n The US Typhon mid-range missile system provides the capability to help defend the Philippines' maricreated_at interests, according to Washington's top diplomat in the country.\nAmbassador MaryKay Carlson stated that the US is working with Philippine authorities in accordance with the Philippines' Comprehensive Archipelagic Defense Concept, which is 'a very important way of assessing or visualizing the archipelagic nation.'\n'It's about defending your interests in your territorial seas, certainly, but also in your exclusive economic zone (EEZ),' Carlson said during her visit to The STAR office in Parañaque last Thursday.\n'We're working together hand in hand, day in, day out on what we can do together to defend our mutual interests in this region,' she added.\nThe US Army deployed the mid-range missile system in the northern Philippines last year for the Balikatan, the annual joint military exercises with its longcreated_at ally.\nIt has been used by Philippine armed forces to train for their operations.\n'We'll be using it for training, and it's a system that we think is useful for our troops to have the capability to use. It's so important to understand that there are exercises and we have 500-plus different types of exercises or engagements, military to military,' Carlson said.\nThe Philippines plans to acquire the US Typhon, also known as the strategic mid-range fires system, that can launch Tomahawk cruise missiles capable of hitting targets up to 2,000 kilometers away.\nIt is crucial in coastal defense and protecting the country's sovereignty against foreign threats.\n'So it's really important that we have the ability to train together on these complex systems, the fact we've heard a number of calls on the part of the Philippine government to have the system remain here to purchase one. That's something that is certainly under discussion. The Philippines is our oldest treaty ally in this region,' Carlson emphasized.\nChina has urged the Philippines to promptly pull out the Typhon missile system, telling Manila that the 'world needs peace and not a mid-range missile system.'\nThe Philippines maintained that China must respect the country's decisions on its defense and security as the government plans to acquire a missile system from the US.\nNational Security Adviser Eduardo Año branded as unfounded and pure speculation China's criticism that the Philippines' efforts to enhance its defense and deterrence capabilities, specifically the deployment of the Typhon missile system, are part of a broader arms race or pose a threat to the region or any country.\nSustained efforts\nMeanwhile, the Philippine Coast Guard will sustain its efforts to drive Chinese forces out of the West Philippine Sea 'no matter how long it takes,' according to PCG spokesman on WPS concerns Commodore Jay Tarriela.\nThe PCG's 83-meter offshore patrol vessel BRP Gabriela Silang saw the changing of two patrol ships of the China Coast Guard (CCG) with bow numbers 5901 - said to be the world's largest coast guard ship at 165 meters and 12,000 tons - and 3304 that is 111 meters long.\n'At approximately 3 p.m., CCG-5901 moved further away from the PCG vessel, while another vessel, CCG-3304, approached the coast of Zambales,' Tarriela said in his latest nightly advisory last Sunday.\nHe noted that CCG 5901 was detected 'at an approximate distance of 95 nautical miles from the coast of Zambales' while CCG 3304 was around '65 nautical miles' from the shores of the province.\nPersonnel onboard Gabriela Silang sent radio challenges to both CCG vessels, asserting they were violating Republic Act 12064, or the Philippine Maricreated_at Zones Act, and the United Nations Convention on the Law of the Sea, of which China is a 'signatory party,' and the 2016 Arbitral Award.\nThe ruling upheld the Philippines' sovereign rights over its 200-nautical-mile EEZ and rejected China's expansive claim over the entire South China Sea.\nIn a post on his X account yesterday, Tarriela asserted that if the PCG would not challenge China's trespassing in the WPS, China 'will succeed in establishing a precedent for its maricreated_at forces' illegal patrols in the future.'\n'Therefore, no matter how long it takes, the PCG vessels will always be present to prevent China from changing the status quo,' he wrote. - Ghio Ong, Bella Cariaso\n"
  },
  {
    "id": 1837,
    "title": "VP Han Zheng, China's representative at Trump's inauguration, is a trusted adviser to Xi",
    "created_at": "2025-01-21",
    "text": "\nVice President Han Zheng, China's representative at Donald Trump's inauguration, is a trusted adviser to President Xi Jinping, a long-created_at survivor of Chinese politics who rose from toiling on a collective farm and in factories to becoming one of the most powerful people in the country.\nChina's decision to send Han, rather than its ambassador to Washington as is usual, appears to be a carefully calibrated signal that it is willing to improve relations with the U.S., while not leaving Xi exposed to criticism should ties worsen.\nMany of the most divisive bilateral issues involve trade, with Trump threatening to impose 60% tariffs on imports from China, but relations have also frayed over technology and China's moves to assert its territorial claims in the South China Sea.\nLike many young Chinese, Han was sent to the countryside during the Cultural Revolution to \"learn from the peasants\" on orders from then-leader Mao Zedong. Many on their return to the cities found jobs in state-run industries.\nHan, 70, rose up the ranks in the financial center of Shanghai during the 1980s and 1990s, just as China's economy was catching fire, concurrently holding Communist Party and managerial positions in the chemical and rubber industries.\nThere he caught the eye of senior leaders and was elevated to district-level governance before becoming the city's mayor and then party secretary, the city's highest position, following a financial scandal involving his predecessor. Xi had briefly held the position after the scandal, giving Han access to him before him became China's new leader.\nIn 2017, Han reached the apex of Chinese political power, the party's seven-member Politburo Standing Committee, and after serving one five-year term was given the position of vice president, a position Xi has imbued with new weight as adviser and envoy.\nThroughout his career, Han has shown a flair for low-key diplomacy, helping to deal with unrest in Hong Kong and attending numerous international events such as the United Nations General Assembly.\nYesterday [Macau created_at], Han met with U.S. Vice President-elect J.D. Vance and U.S. business leaders, including Elon Musk, in Washington on the eve of the inauguration.\nHan Zheng, who serves as an envoy for Chinese President Xi Jinping at the inauguration, \"discussed a range of topics including fentanyl, balancing trade and regional stability\" with J.D. Vance, according to the Trump transition team.\nHan stressed the \"extensive common interests and enormous space of cooperation\" the United States and China share in economic and trade relations despite \"some disagreements and frictions,\" according to a readout of his meeting with Vance issued by the Chinese Foreign Ministry yesterday.\nTrump has threatened to impose tariffs and other measures against China in his second term, while also hinting and ways in which the two rival powers could cooperate on issues such as regional conflicts and curbing the export of substances used in the production of fentanyl.\nIn an unorthodox move, Trump last month invited Xi to his inauguration. No head of state has previously made an official visit to the U.S. for the inauguration, according to State Department historical records.\nWhile Xi will not personally attend the event, he and Trump held a phone call last week during which they discussed trade, fentanyl and TikTok. The Chinese social media app restored service to users in the U.S. yesterday, just hours after it went dark in response to a federal ban, which Trump said he would pause by executive order yesterday.\nHan also met with Musk and other top U.S. business executives, including representatives of the U.S.-China Business Council and the U.S. Chamber of Commerce in Washington, D.C., according to the Chinese Foreign Ministry.\nThe Chinese vice president reiterated promises for an improved business environment for foreign firms in China and expressed hopes that U.S. companies will continue expanding investment in the country.\nMusk, whose company Tesla operates a factory in Shanghai, posted on his platform X after the meeting that he has long opposed the TikTok ban \"because it goes against freedom of speech.\"\n\"That said, the current situation where TikTok is allowed to operate in America, but X is not allowed to operate in China is unbalanced,\" he wrote. \"Something needs to change.\"\nX is banned in China alongside other major U.S. social media and news apps and websites, including YouTube, Google, Facebook and many major U.S. media. MDT/AP\nLink to Image\n\nGraphic\n \nVice President Han Zheng meets with U.S. Vice President-elect J.D. Vance (right) in Washington yesterday\n"
  },
  {
    "id": 1839,
    "title": "'One wrong move': China's 'monster' ship puts Zambales fishers on edge",
    "created_at": "2025-01-21",
    "text": "\n China's rotating fleet of massive Coast Guard vessels off Zambales has compelled local fishermen to move with extra caution while venturing out to sea, a fisherfolk federation leader said Tuesday, January 21.\nThe Philippine Coast Guard marked its 16th day yesterday challenging the presence of Chinese vessels prowling illegally in the waters off Zambales, well within the country's 200-nautical mile exclusive economic zone.\nWhile Beijing's CCG vessel 5901, dubbed the \"monster ship\" due to its massive size, moved away this weekend, it was immediately replaced by CCG vessel 3304 - a 111-meter ship that still dwarfs the PCG's biggest ship, the 96-meter BRP Teresa Magbanua.\nIn response, the PCG has maintained its deployment of the 84-meter BRP Gabriela Silang to monitor China's vessels. It also issues hourly radio challenges.\nLeonardo Cuaresma, who chairs the Federated Association of Fisherfolk in Masinloc, described a tense situation at sea where China has deployed not just its coast guard vessels but also its maricreated_at militia to conduct coordinated patrols up to 50 nautical miles from where local fishermen operate.\n\"Our fishermen there, our companions, and other organizations here in the province of Zambales, it's true that we've been discussing this, and they have concerns about this matter because the monster ship remains stationed in front of Capones,\" Cuaresma said in Filipino in an interview with TeleRadyo on Tuesday.\nThe PCG first reported the presence of the 12,000-ton \"monster ship\" some 50 to 70 nautical miles off Capones Island in Zambales on January 4. Since then, PCG reports show the CCG vessel has only moved away upon the deployment of a reliever vessel.\nCuaresma onserved the same pattern. \"They don't leave. And when our forces are there, they just move away briefly but then come back again.\"\n\"They are well within our exclusive economic zone. Their massive ship is just about 40 nautical miles off Capones,\" he said.\nWhile local fishing boats regularly encounter these Chinese vessels at sea, they have so far been left alone.\n\"Actually, for now, they somecreated_ats encounter our commercial fishing vessels, but by God's grace, they don't interfere with our fishermen,\" he said.\nHowever, local fishers remain concerned about potential incidents at sea, particularly given the stark disparity in size between Philippine and Chinese vessels. \"We don't know, but if we make one wrong move, it could potentially endanger our fishermen,\" Cuaresma said.\nRadio challenges from the Philippine Coast Guard appear to have limited effect, the fisherfolk leader added.\n\"They have no fear regarding this matter, except when the Philippine Coast Guard frequently conducts joint exercises. If the ships of the US, Japan, and some of our neighboring countries are present, there is a possibility that China's monster ship could be driven away,\" Cuaresma said in Filipino.\nAlready on edge\nCuaresma also explained that the constant presence of Chinese vessels has become even more concerning for the fishing community following the disappearance of several fishermen last month under unusual circumstances.\n\"Last month, some of our fishermen reportedly had their boats sink. The sea wasn't rough during that created_at and there was no bad weather,\" he said in Filipino. Only one fisherman from the group made it back - a crew member who had stayed aboard their mother boat. \"Those who separated using smaller boats never returned,\" he said.\nCuaresma said this is why local fishers were already on edge when China's largest Coast Guard vessel started roaming the waters off Zambales earlier this month.\n\"The survivor who made it home couldn't explain what happened to their companions. Some worry they might have encountered Chinese vessels, though we cannot confirm this,\" he added.\nNon-flashpoint area\nAfter two years of increasing run-ins between both nations' Coast Guard vessels, the deployment of China's 12,000-ton vessel off Zambales has brought Beijing's maricreated_at muscle closer to an area that has not traditionally been a flashpoint between the two countries.\nAs a result, Manila has branded China's maricreated_at presence near Zambales - and its reported deployment of a navy helicopter - as escalatory actions that violate both Philippine and international law.\nChina's increasing incursions into the Philippines' EEZ are part of its broader actions in the South China Sea, where it claims historic rights to almost all waters through its \"nine-dash line.\" An international tribunal invalidated this claim in 2016.\nIn recent years, Chinese vessels have maintained a persistent presence around features inside the Philippines' EEZ, from the resource-rich Scarborough Shoal to the submerged Ayungin Shoal where Filipino troops maintain a World War II-era ship as an outpost.\n"
  },
  {
    "id": 1841,
    "title": "Buckle up, Trump is back",
    "created_at": "2025-01-21",
    "text": "\n The 47th president of the United States, Donald Trump, took his oath of office in Washington on Jan. 20. A peaceful transfer of power in America officially marked the stunning political comeback of Trump, unlike the chaotic departure he had in 2021.\nBut on this side of the Pacific, there are many worries that are troubling everyone: What are the prospects for the Philippines, which is the US' oldest and most trusted ally in Southeast Asia, and Filipinos living and working in the US, in the next four years?\nThis two-fold question involves political (diplomatic), security (defense), and economic cooperation (including trade, labor, and people-to-people exchanges), which comprise the three legs of an overarching objective that has nuanced our bilateral relations with our former colonizer since 1946.\nAnxiety over Trump's isolationist approach to international relations and his unpredictable behavior when it comes to overhauling domestic policies, such as immigration, trade, and the environment, is not unfounded. Other nations, including the Philippines, have every right to worry about how he will shake things up.\nThere are fears that Trump, who sings the praises of Chinese leader Xi Jinping, would prioritize American interests over protecting the territorial integrity of nations such as the Philippines when it comes to the contested South China Sea (SCS), which includes the West Philippine Sea (WPS).\nMajor strategic partner\nAttentive observers would notice that during his call with Xi last Friday, Trump was ecstatic: 'President Xi and I will do everything possible to make the World more peaceful and safe!' Trump said in a post on Truth Social.\nBut there are positive signals that the 'ironclad' alliance between Manila and Washington would hold under the Trump administration. With the 1951 Mutual Defense Treaty, the Philippines has cemented its status as a major strategic partner of the US outside of the North Atlantic Treaty Organization.\nLast week, Trump's pick to head the State Department, Marco Rubio, called on China to 'stop messing around' with the Philippines and Taiwan. Chinese belligerent actions in the WPS 'are forcing us to take counteractions because we have commitments to the Philippines and we have commitments to Taiwan that we intend to keep,' Rubio said.\nRubio was not short on details, clearly referencing the hostile presence of the 'monster ship' (China Coast Guard 5901) in waters off Zambales province which, Rubio said, the 'Philippines feels threatened by it, rightfully so.' Rubio rebuked China's bullheadedness, declaring that the US would 'defend the Philippines as its treaty ally' in the event of an attack.\nRotational presence\nSuch an unequivocal pronouncement from the US dispels fears of Chinese expansion remaining unchecked in the SCS. However, the Philippines must continue to insist through diplomatic channels that the US honor, both in word and deed, its security alliance with the Philippines which has stood the test of created_at.\nBesides the Balikatan and maricreated_at exercises, the Philippines has agreed to add four more sites under the Enhanced Defense Cooperation Agreement (Edca) to the existing five. This is a strategic move that greatly benefits the US interest.\nIn the absence of the US bases' treaty that was rescinded in 1991, Edca legalizes the rotational presence of US troops on Philippine soil, giving the US a solid ground for defending both the Philippines and Taiwan. Edca's immediate impact is in ensuring the freedom of navigation in the SCS, which is at the heart of the balance of power in the Indo-Pacific, besides obvious benefits to global shipping and trade. These Edca sites augur well for stability and security in the region because Edca fills the yawning gap in the US' line of defense against China, which runs from East Asia to Southeast Asia to India.\nUndocumented immigrants\nSecurity begets development, if not prosperity. As the Philippines' largest export market and one of its largest foreign investors, the US' role in stabilizing the Philippine economy is crucial amid its rising national debt, hunger, and self-rated poverty, and persistent unemployment. A stable economy also benefits almost 400,000 US citizens living in the Philippines.\nFinally, Trump's mass deportation plans have placed the fate of millions of undocumented immigrants in limbo, including approximately 250,000-300,000 Filipinos who are illegally staying in the US. Philippine Ambassador to the US Jose Manuel Romualdez wisely advised them to avoid deportation by either leaving the US voluntarily or immediately consulting with immigration lawyers.\nBut we should continue to make representations to US authorities for a fair and orderly process. Providing refuge to around 200 Afghan refugees, who stayed in Manila for less than two weeks this January while the US processed their special immigrant visa applications, is an argument we can raise for a demanding reciprocal gesture from the US in treating our kababayan humanely and fairly.\n"
  },
  {
    "id": 1842,
    "title": "Rubio kicks off Trump foreign policy engagements in meetings with Indo-Pacific 'Quad'",
    "created_at": "2025-01-21",
    "text": "\nWASHINGTON (AP) — Secretary of State Marco Rubio met Tuesday with his counterparts from Australia, India and Japan as the Trump administration kicked off its formal foreign policy engagements in discussions with the Indo- Pacific “Quad.” The ministers reaffirmed their countries' commitment to the format and its goals and indicated their leaders would meet in the coming months.\nThe grouping of the four countries has been seen by many as an initiative to counter or at least slow China’s increasing assertiveness and aggressiveness in the region, something over which President Donald Trump and his predecessors, including former President Joe Biden, have all expressed deep concern.\nThe timing of Tuesday’s meeting — on Trump's first full day in office and just hours after Rubio was sworn in as America’s top diplomat — suggests it will remain a priority for Trump. And, in a joint statement released after the meeting, the ministers suggested a new Quad summit would be held this year in India, continuing an upgrade of the relationship from foreign ministers to leaders initiated by the Biden administration.\n“Our four nations maintain our conviction that international law, economic opportunity, peace, stability, and security in all domains including the maricreated_at domain underpin the development and prosperity of the peoples of the Indo-Pacific,” they said.\n“We also strongly oppose any unilateral actions that seek to change the status quo by force or coercion,” they said in a not-so-subtle reference to China.\nThe two-paragraph joint statement was the only indication of how the meeting unfolded as none of the ministers — Rubio, Australian Penny Wong, Indian S. Jaishankar or Japanese Iwaya Takeshi — spoke as they opened their meeting at the State Department.\nInstead they stood silent and expressionless in front of their respective flags before journalists were ushered out. And, none of them spoke at photo opportunities before individual meetings that Rubio hosted afterward.\nThe Quad was established in 2007 to bring together countries that had worked together in response to the devastating 2004 earthquake and tsunami in the Indian Ocean. Its members stress its diplomatic nature and broad focus on regional issues, including infrastructure, humanitarian aid, disaster relief, climate change and maricreated_at security.\nEven though security is only part of the mix, the Quad is a major component of the American strategy to counter China’s growing assertiveness and vast territorial claims in the region, including to virtually all of the strategically important South China Sea and the democratic self-governing island of Taiwan.\nThe strategic element to the Quad has prompted China to accuse the four countries of attempting to form an “Asian NATO,” though it is a very different construction and has no mutual-defense pact, a key component to the North Atlantic Treaty Organization alliance.\nDuring his created_at in the Senate, Rubio was a “China hawk” and he has been sanctioned by the Chinese government for outspoken remarks about the country's human rights record,\nLast week in his confirmation hearing, Rubio called China “the most potent, dangerous and near-peer adversary this nation has ever confronted.\"\nEarlier Tuesday, Rubio made his first appearance at the State Department as secretary of state and called on U.S. diplomats to forcefully defend and execute Trump’s “America First” policies.\n“The voters decide the course of our nation, both domestically and abroad, and they have elected Donald J. Trump as our president when it comes to foreign policy on a very clear mission,” Rubio told them.\n“And that mission is to ensure that our foreign policy is centered on one thing, and that is the advancement of our national interest, which (was) clearly defined through his campaign as anything that makes us stronger or safer or more prosperous. And that will be our mission, that will be our job.”\nTrump has been publicly skeptical of the value of the State Department since his first term in office and, as he has done with other agencies, accused some in the diplomatic corps of working to blunt or derail his policy priorities.\nRubio paid tribute to the men and women of the State Department, calling them “the greatest, the most effective, the most talented, the most experienced diplomatic corps in the history of the world.”\nBut, his arrival came amid a wave of resignations — demanded by Trump’s team — of career diplomats from senior positions in the State Department bureaucracy and U.S. embassies around the world.\nThe full extent of the resignations sought by the incoming administration remained unclear on Tuesday but began in earnest on Friday when a large number of career diplomats holding politically appointed posts, such as undersecretaries and assistant secretaries of state, were told to resign. On Monday, the demand for resignations grew to include career diplomats serving as ambassadors as well as lower-ranking staffers.\n"
  },
  {
    "id": 1843,
    "title": "Cold, wet weather expected during Tet holiday",
    "created_at": "2025-01-21",
    "text": "\n The northern region of Vietnam is expected to experience cold weather and drizzle during the Tet (Lunar New Year) holiday, according to the National Centre for Hydrometeorological Forecasting (NCHMF).\nDeputy Director of the NCHMF Hoang Phuc Lam stated that in the period leading up to Tet, from January 17 to 25, northern Vietnam will experience light morning fog, dry and sunny days, and continued cold temperatures. In central Vietnam, from Thanh Hoa to Hue, the weather will be mostly cloudy with little to no rain and cold temperatures.\nThe region from Da Nang to Binh Thuan will see cold weather at night and in the morning, while daycreated_at temperatures will be mild and sunny. In the Central Highlands and southern Vietnam, the nights and early mornings will be cloudy, with light fog or mist, but the days will be dry and warm without extreme heat.\nDuring the main Tet period from January 27 to 31, northern Vietnam will be affected by a northeast monsoon, resulting in cold weather, with severe cold in mountainous areas. The northeastern region may see some days with light rain or drizzle.\nIn the northern central region, the strong northeast monsoon during Tet will also bring cold temperatures with occasional light rain. In the central and southern central regions, scattered rain and showers are expected in the days leading up to Tet.\nOver Tet, the eastern coastal areas of southern Vietnam will experience tidal surges from January 30 to February 2. The highest tide levels during this period could reach 4.1 metres, potentially causing flooding in some coastal and estuary areas.\nWeather patterns for 2025\nIn 2025, the ENSO phenomenon is predicted to return to a neutral state with a probability of 55-65% over the three-month period from March to May. It is expected to remain in a neutral state for the rest of the year.\nThis means that while a La Niña event may persist briefly in early 2025, it may not last long enough to be classified as a full La Niña cycle. It is expected to gradually transition back to neutral conditions.\nBased on these forecasts, Lam highlighted several key weather and climate trends for 2025:\nUnder La Niña conditions, winds in the Pacific Ocean will strengthen, reducing convective activity near the central Pacific while increasing it over the western Pacific. As a result, Southeast Asia, particularly Indonesia and southern Vietnam, may experience above-average rainfall in the early months of 2025. This could lead to unseasonal rains in southern Vietnam during the dry season.\nRegarding tropical depression activity, the number of storms in the East Sea (known internationally as South China Sea) is expected to be similar to the multi-year average, with storm formation beginning around June. The number of tropical storms and depressions affecting the East Sea and Vietnam's mainland is also expected to be in line with historical averages, with about 11 to 13 storms forming in the region and approximately five or six making landfall.\nHeatwaves in 2025 are also expected to be on par with historical averages. Hot weather will likely begin in the southern and Central Highlands regions around early March, in the northwestern region and western parts of central Vietnam around April, and in northeastern Vietnam and coastal central regions from May onwards. However, the intensity and duration of heatwaves in 2025 are not expected to be as severe as in 2024.\nMeanwhile, cold air activity in 2025 is expected to be in line with historical averages, meaning that severe cold spells could occur between January and March. Strong cold snaps could lead to widespread severe cold conditions, frost and freezing rain in northern mountainous areas.\nIn addition, in 2025, the number of large-scale heavy rain events across the country is expected to be similar to the long-term average, with approximately 20 such events. These heavy rain episodes will likely begin in the northern region around June and gradually shift southward, ending in the central region around December, Lam emphasised.\nDuring the early dry season of 2025, saltwater intrusion in the Mekong Delta is expected to be higher than the historical average from February to April. This may impact livelihoods and agriculture in affected areas, but it is not expected to be as severe as in the dry seasons of 2015-2016 and 2019-2020.\nFrom March to July 2025, drought and water shortages could affect some areas in the provinces of Phu Yen to Binh Thuan, as well as Kon Tum, Gia Lai and Dak Lak.\nWith the increasing intensity of strong storms due to climate change, the NCHMF will integrate storm monitoring and warning systems into digital platforms, providing information to the public and government agencies. Artificial intelligence (AI) will be applied in forecasting and early warning systems, initially focusing on storm tracking, heavy rainfall prediction and other rare weather events.\nThe use of AI will enhance the centre's ability to analyse large datasets from various sources (observations, radar, satellites and numerical models) and improve short-term severe weather forecasting, including storm warnings three to six hours in advance. This will help enhance the accuracy of flood and landslide early warning systems.\n"
  },
  {
    "id": 1846,
    "title": "China's uncompromising 'red lines' challenge Trump's presidency",
    "created_at": "2025-01-21",
    "text": "\nThe arrival of Donald Trump to the presidency of the United States has heightened tensions in the bilateral relationship with China, an issue that has been at the center of his political discourse. Although Trump's stance on economic competition with Beijing is categorical, his approach to security issues-particularly regarding the defense of Taiwan and support for strategic allies such as the Philippines and South Korea-remains diffuse. In contrast, Beijing is making rapid progress in modernizing its armed forces, despite persistent corruption scandals. Aiming to overcome the White House's power projection in the East and South China Seas, the Chinese military is restructuring and, at the same created_at, expanding and modernizing its nuclear arsenal. This strategic maneuver not only seeks to consolidate its regional influence, it poses challenges to US hegemony in the Asia-Pacific.\nXi Jinping faces the second Trump administration from a substantially transformed position of power compared to his first term. After more than a decade at the pinnacle of leadership, he projects himself as an established and experienced statesman. In this context, the boundaries delineated by Xi are unmistakable. During his recent APEC summit meeting with President Joe Biden, the Chinese leader emphasized the \"four red lines\" that the United States must not transgress: Taiwan, democracy and human rights, China's political system and Beijing's right to sovereign development. This statement manifests its uncompromising stance and serves as a blunt warning to the new administration, suggesting that any violation of these principles could aggravate the tensions inherent in the complex relationship.\nAll in all, China's claim to Taiwan constitutes one of the most intricate foreign policy dilemmas Trump will face. During his campaign, he hinted that Taipei should bear costs for its defense against Chinese aggression, raising uncertainty about his steadfastness in protecting the island. However, his recent cabinet and advisory appointments suggest a different approach. These include individuals considered hawks on Chinese policy, such as Senator Marco Rubio and Representative Michael Waltz. Prior to his appointment to the State Department, Rubio expressed that Trump would \"maintain support for Taiwan.\" Although the leader has not specified whether he will deploy military forces to safeguard \"the rebel island\" against a possible invasion, he has expressed his intention to react to such an eventuality with tariffs ranging from 150% to 200% on Chinese products.\nIn this complex scenario, the global economic and security orders face severe tensions, and Trump's penchant for trade wars, his skepticism of alliances, and the likely imposition of tariffs at levels not seen since the 1930s will intensify the role of international trade as a geopolitical battleground, with the potential to destabilize an already fragile system.\nIndeed, China faces the challenge of managing a slowing economy while strengthening its ties with the Western bloc, without sacrificing its relations with other nations. Xi is currently grappling with a series of interconnected crises that threaten the power's stability. The world's second largest economy faces growing investor skepticism, a worsening real estate crisis, an alarming increase in local government debt, a volatile stock market, deflationary pressures and rising social unrest. All in all, improved relations with Washington could be a crucial factor in restoring confidence. For this to happen, however, Xi will need to identify areas of convergence with Trump, a considerable challenge. Leaders in New Delhi, Tokyo and Taipei are on high alert for the possibility of the Republican escalating the trade war with Beijing, as well as the strategic reactions that could be deployed as a result.\nMoreover, the Indo-Pacific confronts a growing security vacuum that raises questions about the reliability of U.S. commitments. Washington's close allies and partners-Japan, the Philippines, South Korea, and Taiwan-are surrounded by uncertainty about the extent to which they can trust the US to honor its security obligations.\nThe unpredictable and transactional nature of Trump's diplomacy exacerbates concerns about potential flashpoints in already tense regions such as the South China Sea, the Korean Peninsula and the Taiwan Strait. This framework not only aggravates power dynamics in the region, it also forces allies to reconsider their security strategies and bilateral relations in an environment characterized by volatility and ambiguity.\nMoreover, the new U.S. executive will now find itself facing a scenario of growing concern at several points of tension. In North Korea, Kim Jong Un is acting more belligerently, strengthened by a renewed alliance with Russia. Taiwan faces the largest Chinese military exercises in decades, raising uncertainty about US commitment to its defense, given that Trump may see the island as a tool in broader negotiations with Beijing. On the other hand, the Philippines, under the leadership of Ferdinand Marcos Jr, has strengthened its alignment with the US and seeks to deepen military cooperation with regional allies. However, it also faces significant domestic challenges, which could influence the stability of its foreign policy. The mid-term elections in May will be crucial in assessing popular support for its geopolitical orientation and the residual influence of the Duterte dynasty in domestic politics.\n"
  },
  {
    "id": 1847,
    "title": "Press statement by Chair of ASEAN Foreign Ministers' Retreat calls for regional unity and cooperation",
    "created_at": "2025-01-21",
    "text": "\n A press statement from the Chair of the ASEAN Foreign Ministers' Retreat was released on 19 January 2025 highlighted the need for dialogue to tackle common challenges and enhance stability. Held in Langkawi, Malaysia, the retreat focused on regional unity and cooperation. The statement announces the Ministers' commitment to collaborative efforts and sets an agenda for future engagements. \nThe complete text of the statement is as follows.\n1. The ASEAN Foreign Ministers' Retreat (AMM Retreat) was convened on 19 January 2025 in Langkawi, Malaysia. The Retreat was the first major meeting under Malaysia's ASEAN Chairmanship 2025 with the theme 'Inclusivity and Sustainability'. The Retreat was also attended by the Foreign Minister of Timor-Leste as Observer.\n2.  We had candid and in-depth discussions on ASEAN's priorities in 2025 and the follow-up to the 44th and 45th ASEAN Summits and Related Summits to further advance the ASEAN Community, strengthen ASEAN unity and Centrality, and enhance mutually beneficial cooperation with ASEAN partners.\n3.  We reiterated our strong commitment to upholding regionalism and multilateralism with full adherence to key principles, shared values and norms enshrined in the UN Charter, the ASEAN Charter, the Declaration on Zone of Peace, Freedom and Neutrality (ZOPFAN), the Treaty of Amity and Cooperation in Southeast Asia (TAC), the 1982 United Nations Convention on the Law of the Sea (UNCLOS), the Treaty on the Southeast Asia Nuclear Weapon-Free Zone (SEANWFZ Treaty), the 2011 Declaration on the East Asia Summit on the Principles for Mutually Beneficial Relations and the ASEAN Outlook on the Indo-Pacific (AOIP).\n4.  We expressed strong support towards Malaysia's key priorities and deliverables in advancing ASEAN's collective vision of a resilient, people-centred, and forward-looking ASEAN Community while advancing economic growth and regional connectivity, and enhancing regional resilience.\n5.  We emphasised the importance of realising these priorities to ensure ASEAN's continued role as a key driver of peace, stability, and prosperity in the region, and looked forward to the successful implementation of these initiatives under Malaysia's Chairmanship in an inclusive and sustainable manner.\n6.  We welcomed the excellent progress made by the High-Level Task Force on the ASEAN Community Post-2025 Vision (HLTF-ACV) in developing the Strategic Plans of the ASEAN Community Vision 2045 (ACV 2045): Resilient, Innovative, Dynamic and People-Centred ASEAN. In this regard, we looked forward to the adoption of the ACV 2045 and all its Strategic Plans at the 46th ASEAN Summit in Kuala Lumpur. We looked forward to the convening of the ASEAN Future Forum 2025 next month in Ha Noi, Viet Nam, which would continue to complement the exercise of developing the Strategic Plans of the ASEAN Community Vision 2045 as well as their future implementation.\n7.  We reaffirmed our commitment to strengthening ASEAN's institutional capacity and effectiveness through enhanced role of the Committee of Permanent Representatives to ASEAN, and the East Asia Summit Group of Ambassadors, in discussing and responding to pressing regional challenges.\n8.  We underscored the importance of ASEAN's efforts in promoting peace, conflict management and conflict resolution in the region. We recognised the potential of the ASEAN Institute for Peace and Reconciliation (AIPR) in support of ASEAN's efforts in promoting peace and stability in the region.\n9.  We looked forward to the development of the report on complementarities between the ASEAN Community Vision 2045 and the UN 2030 Agenda for Sustainable Development, which will help guide us in advancing our green agenda, as we strive towards a more sustainable and resilient future, set out in the ACV 2045.\n10.  We reiterated our commitment to preserve the Southeast Asian region as a nuclear weapon-free zone and free of all other weapons of mass destruction as enshrined in the SEANWFZ Treaty and the ASEAN Charter. We noted that the Executive Committee of the SEANWFZ Commission is continuing to explore the possibility of allowing individual Nuclear Weapon States (NWS) which are willing to sign and ratify the Protocol to the SEANWFZ Treaty without reservations and provide prior formal assurance of this commitment in writing to go ahead with the signing. We welcome any NWS that are ready to do so. We reaffirmed our commitment to continuously engage all the NWS, including those with reservations, and intensify efforts of all parties to resolve all outstanding issues in accordance with the objectives and principles of the SEANWFZ Treaty.\n11.  We welcomed the progress of the negotiations on the Code of Conduct in the South China Sea (COC), including the completion of the third reading of the Single Draft COC Negotiating Text (SDNT), and emphasised the importance of maintaining positive momentum in this regard, towards the early conclusion of an effective and substantive COC that is in accordance with international law, including the 1982 UNCLOS.\n12.  We reaffirmed our collective resolve to combat transnational crime, including people smuggling, trafficking in persons, drug trafficking, cybercrime, money laundering, and the growing threat of online scams. We welcomed the inaugural meeting of the ASEAN Senior Officials' Meeting on Transnational Crime (SOMTC) Working Group on People Smuggling and the proposal to establish the Working Group on Money Laundering as significant mechanisms to enhance regional capacity and coordination, contributing to strengthening regional security.\n13.  We stressed the importance of intensifying regional cooperation to effectively address cyber threats, as ASEAN continues to advance in its digital transformation. We welcomed the establishment of the ASEAN Regional Computer Emergency Response Team (CERT) located in Singapore with Malaysia as first regional coordinator. We reaffirmed our commitment to advancing CERT-related information sharing and capacity building that will enable ASEAN Member States to quickly exchange information and where appropriate, work together to address common threats.\n14.  We reaffirmed the roles of the ASEAN Defence Ministers' Meeting (ADMM) and ADMM-Plus in promoting strategic dialogue and enhancing practical cooperation including through the seven ADMM-Plus Experts' Working Groups. We welcomed the progress in enhancing civil-military coordination for the management of Humanitarian Assistance and Disaster Relief (HADR) efforts. We commended efforts to advance discussions on the proposed application of artificial intelligence (AI) in the defence sector and supported the strengthening of cooperation among ASEAN Member States in the defence industry.\n15.  We looked forward to the convening of the Dialogue among ASEAN National Security Advisors as a forum to address issues of strategic concern and to contribute to strengthening the resilience and institutional capacity of ASEAN and ASEAN-led mechanisms as well as in shaping the region's inclusive and comprehensive security architecture.\n16.  We encouraged regional cooperation in international commercial arbitration and mediation. These efforts aim to foster a robust arbitration and mediation landscape in accordance with established international standards to drive economic growth in the region.\n17.  We reaffirmed our commitment to the ASEAN economic agenda, particularly on enhancing the region's competitiveness and resilience in a created_at of digital transformation and in the face of an increasingly complex and unpredictable global environment. We are encouraged by ASEAN's on-going efforts toward developing a comprehensive, high-quality, and forward-looking ASEAN Digital Economy Framework Agreement (DEFA) and looked forward to its conclusion by 2025. We underscored the need to leverage our collective strengths and harness digitalisation to foster deeper economic integration, and promote sustainable and inclusive growth to ensure the long-term prosperity and stability of the region and our peoples.\n18.  We expressed full support for Malaysia's priorities to navigate the region's economic agenda. We looked forward to the implementation of the Priority Economic Deliverables (PEDs), anchored by four (4) Strategic Thrusts namely (i) Enhancing Trade and Investment; (ii) Creating an Inclusive and Sustainable Pathway; (iii) Promoting Integration and Connectivity of Economies; and (iv) Building a Digitally Resilient ASEAN that reflects a holistic and forward-looking approach to advancing ASEAN's economic objectives while addressing key regional challenges and opportunities.\n19.  We underscored the importance of elevating culture and heritage value creation, targeted towards harnessing the rich cultural diversity and heritage assets of Member States to contribute towards enhanced economic growth, cultural resilience and sustainable development.\n20.  We acknowledged the need to advance regional efforts in addressing environmental challenges, including biodiversity loss, climate change, natural disasters, sustainable use and management of water resources, among others, towards promoting sustainable development and achieving carbon neutrality through stewardship, partnership, and ownership. We looked forward to the early operationalisation of the ASEAN Centre for Climate Change.\n21.  We reaffirmed our commitment to realise the ASEAN Power Grid (APG) by 2045, and encouraged efforts to accelerate the establishment of the APG to promote regional energy connectivity, security, and resilience.\n22.  We reaffirmed our commitment to advancing green jobs and skills to drive sustainable and inclusive development across ASEAN.\n23.  We reaffirmed our resolve to strengthen regional capacities for the prevention, preparedness, and response to public health emergencies for a healthy, resilient and prosperous ASEAN.\n24.  We reiterated the commitment to further promote equitable, inclusive and sustainable development across the ASEAN Community by aligning sub-regional growth with the comprehensive development of ASEAN.\n25.  We emphasised the importance of enhanced ASEAN-wide collaboration, focusing on innovation and engagement to advance youth development and sports excellence.\n26.  We looked forward to Timor-Leste being a full member of ASEAN, and recognised the progress made by Timor-Leste in implementing the Roadmap for Timor-Leste's Full Membership, as well as welcomed the enhanced participation of Timor-Leste in ASEAN Meetings following the adoption of the revised Guidelines for the Implementation of the Observer Status Granted to Timor-Leste. We reiterated our commitment, and called on our external partners to continue providing capacity building assistance to Timor-Leste. We looked forward to the establishment of the Timor-Leste Unit in the ASEAN Secretariat, to intensify efforts in facilitating Timor-Leste's accession to ASEAN.\n27.  We are convinced that ASEAN can play a greater role in fostering a stable and predictable environment through adherence to principles of international law, mutual respect, and the peaceful resolution of disputes, including full respect for legal and diplomatic processes, without resorting to the threat or use of force, in accordance with the universally recognised principles of international law, including the 1982 UNCLOS. We also underscored the importance of the full and effective implementation of the 2002 Declaration on the Conduct of Parties in the South China Sea (DOC) in its entirety. We reaffirmed our steadfast commitment to an ASEAN-centred, open, inclusive, transparent, resilient, and rules-based regional architecture that upholds international law, in light of evolving regional and international challenges.\n28.  We noted the UN General Assembly Resolution A/RES/79/144 emphasising in the Preamble, the universal and unified character of the 1982 UNCLOS, and reaffirmed that the Convention sets out the legal framework within which all activities in the oceans and seas must be carried out and is of strategic importance as the basis for national, regional and global action and cooperation in the marine sector, and that its integrity needs to be maintained.\n29.  We reaffirmed the importance of the TAC as the key code of conduct in governing inter-state relations in the region and as a foundation for maintaining regional peace and stability. We called on all High Contracting Parties to fulfil their obligations under the Treaty. We welcomed the growing interest of non-regional countries to accede to the TAC, on the basis of respect for and in conformity with the purposes and principles of the TAC. We are committed to strengthening relations with ASEAN's current partners and engaging those who have acceded to the TAC. We also looked forward to substantive preparations of the 50th anniversary of the TAC next year.\n30.  We underscored the value and relevance of the AOIP in promoting regional peace, security, stability, and prosperity in light of geopolitical tensions affecting the region, including in building mutual trust and confidence as well as reinforcing an open, transparent, resilient, inclusive, and rules-based regional architecture with ASEAN at the centre that upholds international law. We noted the establishment of the ASEAN Indo-Pacific Business Network (AIPBN) and the intention to convene the ASEAN Indo-Pacific Forum this year.\n31.  We reaffirmed our commitment to promote the implementation of concrete AOIP projects and activities, under the four priority areas in our engagement with external partners, through the various ASEAN-led mechanisms. We underscored the importance of advancing an AOIP that builds mutual trust and confidence as well as reinforce an open, transparent, resilient, inclusive, and rules-based regional architecture with ASEAN at the centre that upholds international law.\n32.  We reaffirmed the importance of strengthening ASEAN unity and Centrality, and our strong commitment to shaping and leading the evolving regional architecture through existing ASEAN-led mechanisms. We agreed to conduct our engagement with external partners based on shared interest, constructive engagement, and mutual benefit, underpinned by ASEAN Centrality, which would contribute to the implementation of the ASEAN Community Vision 2045. We looked forward to the adoption of the 7 Plans of Action between ASEAN and the relevant Dialogue Partners for the new period beginning in 2026.\n33.  We looked forward to the ASEAN-New Zealand Commemorative Summit in Malaysia later this year in conjunction with the 50th Anniversary of the ASEAN-New Zealand Dialogue Relations.\n34.  We looked forward to the convening of the 2nd ASEAN-GCC Summit in 2025 in Kuala Lumpur, and agreed to further advance the effective implementation of the ASEAN-GCC Framework of Cooperation (2024-2028). We also looked forward to the convening of an ASEAN-GCC+China Summit to enhance and deepen economic collaboration.\n35.  We agreed to deepen cooperation under the ASEAN Plus Three (APT) cooperation framework to promote peace, stability, and prosperity in the East Asian region. We welcomed substantive progress in the implementation of the APT Cooperation Work Plan (2023-2027).\n36.  We reaffirmed our commitment to further strengthening the EAS as a premier Leaders-led forum for dialogue and cooperation on broad strategic, political, and economic issues of common interest and concern with the aim of promoting peace, stability, and economic prosperity in the region, with ASEAN as the driving force. We underscored the importance of the East Asia Summit (EAS) and supported the Chair's proposal to develop and finalise a Declaration on the 20th Anniversary of the EAS, an EAS Joint Statement, and thematic statement(s) to further enhance the implementation of the EAS Plan of Action (2024-2028) as outcome documents of the East Asia Summit.\n37.  We agreed to revitalise the ASEAN Regional Forum (ARF) in a holistic and comprehensive manner to maintain its effectiveness, relevance and function as the leading regional security forum in the Asia-Pacific region, enabling it to address current and emerging political and security challenges through a more substantive, constructive and interactive dialogue while also pursuing preventive diplomacy. We also discussed the ways forward on the Hanoi Plan of Action II (2020-2025) which is set to expire this year.\n38.  We also exchanged views on regional and international developments, reaffirming our shared commitments to promoting sustainable peace, security, stability, and prosperity within ASEAN and beyond.\n39.  We expressed our deep concern over the escalation of conflicts and humanitarian situation in Myanmar and the minimal progress on the implementation of the Five-Point Consensus (5PC). We reaffirmed our united position that the 5PC remains our main reference to address the political crisis in Myanmar and further reaffirmed the corresponding Leaders' decisions. The Leaders upheld the decision limiting Myanmar's participation at the ASEAN Summits and Foreign Ministers' Meetings to the non-political level and reiterated that ASEAN community building and decision-making should not be affected. We denounced the continued acts of violence against civilians and public facilities and urged all parties involved to take concrete action to immediately halt indiscriminate violence, exercise utmost restraint, ensure the protection and safety of all civilians and civilian infrastructures, and create a conducive environment for the delivery of humanitarian assistance and inclusive national dialogue. We welcomed the progress of the provision of ASEAN Humanitarian Assistance to Myanmar by the AHA Centre to implement Point 4 of the ASEAN Leaders' 5PC.\n40.  We welcomed the appointment of H.E. Tan Sri Othman Hashim as the Special Envoy of the ASEAN Chair on Myanmar for 2025. We expressed our full support to the Special Envoy in carrying out his mandate in facilitating efforts towards finding an inclusive, durable and peaceful resolution in Myanmar through promoting concrete progress on the implementation of the 5PC.\n41.  We reaffirmed the importance of maintaining and promoting peace, security, stability, safety and freedom of navigation in and overflight above the South China Sea. We further reaffirmed the need to enhance mutual trust and confidence, exercise self-restraint in the conduct of activities that would complicate or escalate disputes and affect peace and stability, avoid actions that may further complicate the situation, and pursue peaceful resolution of disputes in accordance with the universally recognised principles of international law, including the 1982 UNCLOS. Concerns were expressed by some Ministers on the land reclamations, recent actions and ongoing developments in the area which have eroded trust and confidence, increased tensions, and may undermine peace, security, and stability in the region.\n42.  We expressed grave concern over the surge in the Democratic People's Republic of Korea's (DPRK) intercontinental ballistic missile testing and ballistic missile launches and the increased tension in the Korean Peninsula, which are a worrisome development that threatens peace, and stability in the region. We urged the DPRK to take action to de-escalate tension and called on all concerned parties to resume peaceful dialogue, including to create a conducive environment towards the realisation of lasting peace and stability in a denuclearised Korean Peninsula. We re-emphasised the importance of full compliance with all relevant United Nations Security Council (UNSC) Resolutions and to abide by international law. We stressed the importance of continued peaceful dialogue among all parties concerned in order to realise lasting peace and stability in a denuclearised Korean Peninsula.\n43.  With regard to Ukraine, as for all nations, we continued to reaffirm our respect for sovereignty, political independence, and territorial integrity. We reiterated our call for compliance with the UN Charter and international law. We underlined the importance of an immediate cessation of hostilities and the serious engagement in a genuine dialogue for the peaceful resolution of the conflict. We supported the efforts of the UN Secretary-General in the search for a peaceful solution. We also called for the facilitation of rapid, safe, and unhindered access to humanitarian assistance for those in need in Ukraine, and for the protection of civilians, humanitarian personnel, and persons in vulnerable situations.\n44.  We expressed grave concern over the continued war in Gaza and the Middle East and the dire humanitarian situation in Gaza, which has been exacerbated following the 7 October attacks. We condemned all attacks against civilians and civilian infrastructure, which have resulted in immense number of casualties, particularly innocent women and children, the restricted access to food, water, and other basic needs, leading to the further deterioration of the humanitarian crisis in Gaza. We welcomed the ceasefire agreement in Gaza and urged that the implementation of this agreement to be carried out immediately and comprehensively. We called for the immediate and unconditional release of all hostages, especially ASEAN nationals, women, children, the sick and the elderly. We underscored the importance of release from any arbitrary detention. We urged all parties concerned to work towards a peaceful resolution to the conflict with a view to realising the two-State solution in accordance with international law and the relevant UNSC and UNGA resolutions, including UNGA resolution A/RES/ES-10/23 on the Admission of New Members to the UN dated 10 May 2024 which we all voted in favour. We emphasised the importance of intensifying humanitarian assistance to those in need, including through the restoration of UNRWA's role, and for post-conflict reconstruction in Gaza.\n"
  },
  {
    "id": 1848,
    "title": "Commentary: With Trump back in office, the world can no longer free-ride on American goodwill",
    "created_at": "2025-01-21",
    "text": "\nSINGAPORE: With Donald Trump officially sworn in as America's 47th president, pundits are predicting American foreign policy will become more unpredictable and messy.\nIt's no surprise that Trump's inaugural speech was directed at the American people - particularly his supporters - and not the international community. Words like \"exceptionalism\" and \"manifest destiny\" painted a picture of American might and the ability to wield it against threats at home and abroad.\nHowever, there exists a broad consensus within the United States that a US-led world order has been good for the world, because Washington has seen its interests as synonymous with global ones. Those who espouse this belief may interpret attempts to challenge US dominance not as a threat to America per se, but a threat to the world.\nFour observations follow from this. \"AMERICA FIRST\" POLICY\nFirst, the overall climate of US-China relations will not change. Both countries have viewed one another with great suspicion and hostility for some created_at and this is not likely to change, regardless of what their respective leaders do.\nSince China's reopening to the world in 2023 following the pandemic, I have not come across a single Chinese scholar who is optimistic about the future of US-China relations. China under Xi cannot be seen as weak notwithstanding its economic problems, while America's desire for primacy makes it anxious about countries who do not accept US hegemony as inherently good.\nSecond, it is likely that the second Trump administration will take a more instrumental approach to foreign policy. This means extracting maximum concessions from those who want to build good relations with America and wielding a stick to those who challenge Washington's interests.\nAfter all, Trump was elected by the American people, not by the world. We should not expect the US to pay any price to help anyone, anywhere. Countries who want to get in the good books of Trump would have to demonstrate in a real and tangible manner why America should care about them.\nDoes Trump care about democracy and other values that Biden talk about? Only to the extent that America benefits from its so-called democratic friends. Is being non-democratic a problem? Not if you chose to acquiesce by American interests and conform to its preferences. Vietnam is an example in Southeast Asia of how this can work out. Third, middle powers such as Australia, Japan and South Korea will likely emerge to play more important roles in international affairs, if they are not derailed by domestic challenges. Countries that want to thrive amid geopolitical turbulence need to make decisive contributions at the right moment.\nFinally, a quick word of caution on perceived American decline. Whatever we may think about Trump's policies in the next four years, Trump is effectively in his second and last term. US presidents are effectively constrained by the Constitution, and no single institution (executive, judiciary and legislative) is able to arrogate maximum power to itself.\nAmerican institutions and ideals are defined in a manner that will outlast whatever crazy ideas or narrow interests a single leader may have.\nNO MORE FREE-RIDING ON AMERICAN GOODWILL\nAs a result of Trump's transactional politics, America will likely demand greater contribution from many countries in defence and security matters. This is not necessarily a bad thing because it gives these countries, particularly smaller ones, the opportunity to show that they are not simply doing things at the behest of the United States.\nFor instance, if the Philippines and Vietnam decide to increase their defence budgets to strengthen their territorial claims in the South China Sea, it is not because the US is asking them to, but because they do not want to free-ride on America's security presence in the region. There is a substantial reservoir of goodwill towards the US in Southeast Asia. In the 2024 State of the Region survey conducted by the ISEAS - Yusof-Ishak Institute, respondents were asked which country the Association of Southeast Asian Nations (ASEAN) should choose - the US or China - if it were forced to align itself with one.\nFor the first created_at, a majority picked China over the US. However, the margin was paper thin - 50.5 per cent for China to 49.5 per cent for the US, likely due to a swing in Malaysia and Indonesia over American support for Israel in the Gaza war.\nThat said, the 2024 survey showed that 42.4 per cent of those surveyed were confident or very confident that the US would do the right thing to contribute to global peace, security, prosperity and governance. The figure for China was only 24.8 per cent.\nSeen this way, one can observe that when Southeast Asian countries criticise the US, it is because of a perceived American absence, not because of American presence. In fact, more than 70 per cent of respondents expressed the view that cooperation between ASEAN and the Quadrilateral Security Dialogue (Quad), which the US is part of, as being beneficial to the region or complementary with ASEAN's efforts.\nCountries all over the world would need to diversify their partners to ensure that they retain political agency beyond the remit of great power plays. Small countries in particular need to be nimble and deft to find space to act.\nWhile the next four years may be unpredictable to some extent, countries in Asia are much more sanguine about their fortunes only because they have had the experience of Trump's first administration to take reference from. America putting itself first is hardly surprising, don't all countries do so?\nBenjamin Ho is an assistant professor at the S Rajaratnam School of International Studies, specialising in Chinese international relations and comparative political order. He spent created_at in the United States under a Fulbright scholarship between November 2021 and February 2022. INITIAL: el\n"
  },
  {
    "id": 1849,
    "title": "As China flaunts its military might, PH weighs all options",
    "created_at": "2025-01-21",
    "text": "\n Almost 143 kilometers from the coast of Zambales, China's 'monster ship' got so close to the Philippine land mass that the government had to make its stand clearer: 'We do not waver or cower in the face of intimidation.'\nJonathan Malaya, assistant director general of the National Security Council, said 'we do not and will not dignify these scare tactics by backing down' as he stressed how China has been 'pushing the Philippines to the wall.'\nThe 12,000-ton China Coast Guard (CCG) 5901, which is 165 meters in length, is China's monster ship and the world's largest that was seen off Capones Island on Jan. 4 and replaced by CCG 3103.\nHowever, as the Philippine Coast Guard's (PCG) BRP Teresa Magbanua 'gradually pushed it away,' the 'monster ship' came back on Jan. 11 'to outmaneuver' the PCG vessel, which is only 97 meters in length.\nCCG 5901's presence inside the exclusive economic zone (EEZ) of the Philippines prompted the government to point out that it is now 'contemplating things it was not contemplating before.'\n'All options are on the table,' said Malaya, who stressed that the proximity of CCG 5901 is escalating tension between the Philippines and China over areas of the South China Sea.\nRenato de Castro, a professor of international studies at the De La Salle University, said the Philippines has to protest the presence of the monster ship in the West Philippine Sea.\nBut while it won't be enough to stop China, he told INQUIRER.net that filing a diplomatic protest would express the Philippines' strong opposition against China's intimidation.\n'It is not enough but really necessary,' he said. 'It is an indication that we do not accept the situation, which we could not control, but nevertheless, we do not want the situation.'\nThe government, since the start of the presidency of Ferdinand Marcos Jr. in July 2022, has already filed close to 200 diplomatic protests against China's aggression inside the EEZ of the Philippines.\nIntimidating PH\nExecutive Secretary Lucas Bersamin pointed out that the presence of China's monster ship could be a case of power projection, saying that Malacañang 'view[s] it with concern.'\nIn 2023, CCG 5901 was also seen off the coast of the state of Sarawak in Malaysian Borneo, close to the Kasawari Gas Development Project, based on a satellite image and AIS data from the Asia Maricreated_at Transparency Initiative.\nThis drew a response from the Royal Malaysian Navy.\nDe Castro had told radio station dzBB that China is really making it appear that they can conduct 'intrusive patrols' and that the Philippines is helpless even if CCG vessels are already inside the country's EEZ.\nSeaLight's Gaute Friis, a defense innovation scholar at Stanford University's Gordian Knot Center, said intrusive patrol would describe the presence of CCG vessels 'within the EEZs of other states.'\n'These patrols are a key component of China's strategy to reinforce its expansive maricreated_at claims in disputed waters [as it] aims to establish a continuous presence and gradually normalize its maricreated_at activities in these areas,' he said.\nLast year, CCG 5901 was also seen close to Ayungin, or Second Thomas Shoal, where the Philippines has grounded its warship BRP Sierra Madre to serve as an outpost in the West Philippine Sea.\nBacking PH protests\nNow, as diplomatic protests won't be enough to really stop China's aggression, De Castro said 'we have to rely on our alliance[s],' considering the insufficient naval capabilities of the Philippines.\nBased on data from the World Directory of Modern Military Warships, the Philippine Navy has a TvR of only 33.7 in the 2025 Global Naval Powers Ranking, which takes into account values related to the overall fighting strength of naval services in the world.\nThe TvR, or 'TrueValueRating,' considers modernization, logistical support, attack and defense capabilities to assess strength not only based on the number of warships and submarines but rather on the 'quality and general mix of the inventory.'\nChina's People Liberation Army Navy has a TvR of 319.8, while the United States Navy, which is still considered as the world's most powerful, was given a TvR of 323.9, although China has over 400 warships, compared to the 243 that the United States has.\nLast year, however, Philippine Navy spokesperson Rear Admiral Roy Vincent Trinidad said 'with what is happening right now, not only in the maricreated_at domain but also in the air space, we are good with what we have.'\nHe said even with the present capabilities of the Philippine Air Force, Philippine Navy, and the Philippine Army, 'we are good with what we have, and given more, they can perform even better.'\n'Hard' executive decision\nBut engaging in the use of force is a 'hard executive decision' that Marcos will have to make if the aggression of China would persist and intensify in the West Philippine Sea.\nThis, as De Castro pointed out that the possible use of force would bring the Philippines to the 'realm of uncertainty'-will China be deterred or the Philippines will simply be caught in the middle?\n'It will also depend on whether it is in the interest of our allies to really back us,' he said, stressing that once the United States or Japan assist the Philippines, China would really react.\nHe explained that 'China cannot afford to lose force if it is confronted by the United States and Japan, and once we do it, once we put them in a situation where they would confront each other then we lose control of the situation.'\n'Either we would be caught in the middle or our allies would simply abandon us. So it is an executive decision. The President has to take a calculated risk,' De Castro said, although stressing that the United States is expected to 'act more decisively.'\nHe said: 'So that is why you have to interpret or look at the Mutual Defense Treaty not in terms of its legalistic provision, but in terms of the political context when you have to make that decision.'\n"
  },
  {
    "id": 1851,
    "title": "Is Trump supplying ammo to expansionist China via Panama Canal?",
    "created_at": "2025-01-21",
    "text": "\nAs Donald Trump took the oath of office as the 47th President of the United States, his inaugural speech had a distinct mention of China. Despite reports of phone calls and behind-the-scenes discussions between Trump's administration and Beijing, the President made it clear that China was squarely in his crosshairs. The Panama Canal, which Trump claimed was under \"Chinese control\", became a tool for his claim on the 82-kilometre-long waterway. Trump said the\nUS had \"foolishly\" given the Panama Canal\nto Panama. However, Trump's use of the Panama Canal as a tool to counter China could embolden Beijing's expansionist ambitions in its neighbourhood and beyond. Trump might have unwittingly gone against decades of American policy of teaching restraint to China and given a kind of legitimacy to its expansionist stance. Trump's claim over the Panama Canal could give Beijing, which's growingly becoming impatient and militarily assertive with Taiwan and\nthe South China Sea littoral nations\n, an opportunity and legitimacy to assert its expansionist claims. Commentators and experts argue that Trump's threats to\nseize the Panama Canal, even by force\n, have weakened the credibility of the US's long-standing call for restraint on Taiwan. HOW IS US DIFFERENT FROM RUSSIA AND CHINA, ASK EXPERTS Trump's bid to claim the Panama Canal, which he floated weeks before his Monday inauguration, had already raised eyebrows among experts, prompting them to question how it would differ from the actions of China and Russia. \"Russia's Putin invaded Ukraine saying it's rightfully his. China threatens violence to annex Taiwan. Trump doesn't rule out the use of force to grab Panama and Greenland. Why are they different?,\" wrote New York City-based journalist Geraldo Rivera on X, earlier this month. Yes, Trump even said he would not hesitate to use force in reclaiming the Panama Canal that he alleged was controlled by the Chinese and alleged that Latin American nation Panama had violated \"the purpose of our deal and the spirit\" of the 1977 Torrijos-Carter Treaties. Under the treaties, the US ceded control of the canal to Panama by 1999. These treaties guaranteed the canal's neutrality and allowed US intervention to defend it if necessary. Trump had earlier accused Panama of \"overcharging US ships\" to use the waterway. Trump also called the treaties 'follies' that undermined US influence in the region. The concern flagged by New York City-based journalist Rivera, that Trump's expansionist claims on a sovereign territory on the back of military power, was echoed by another Washington DC-based journalist. DOES TRUMP REMARKS OFFER CHINA AN OPPORTUNITY TO USE FORCE?    CNN anchor Jim Sciutto highlighted the potential consequences of Trump's actions and rhetoric regarding Greenland and Panama. \"The message to China and Russia from Trump's sanctions and military threats to Greenland and Panama is that if the US can use force and intrigue to take another nation's sovereign territory, they can do the same for Taiwan and Ukraine, and they might read a new American willingness to accept those claims,\" wrote Jim Sciutto on X. For years, the US had called on China to exercise \"restraint\" in asserting its claim over Taiwan and to abandon military threats aimed at bringing the democratically governed island under its control. Chinese commentators warn Trump's unconventional tactics may weaken US credibility, empower and \"create an opening for China\", according to a Reuters report earlier this month. \"If Greenland is annexed by the United States, China must take Taiwan,\" Wang Jiangyu, a Hong Kong-based professor was quoted as posting on Weibo. Apart from claiming the Panama Canal, Trump has also laid claim to\nCanada and the Danish-ruled island of Greenland\n in the North Atlantic, in the run-up to his inauguration. Zhao Minghao, a professor at the Institute of International Studies at the Fudan University in Shanghai, said Trump's threats to take the Panama Canal needed to be taken seriously, noted the report. \"Besides that, we need to think about Trump's transnationalism, which he is serious about as well. Many in China still perceive Trump as a deal-maker, even on very tough issues like the Taiwan question,\" Minghao was quoted as saying by Reuters. Currently, around 70% of the ships passing through the canal are involved in American trade. DOES CHINA REALLY CONTROL THE PANAMA CANAL? The US constructed the Panama Canal between 1904 and 1914 to shorten the distances covered by ships travelling between the Pacific and the Atlantic. The waterway seamlessly connected the eastern coasts of the Americas and Europe to Asia. It was in 1999 that the Canal's control was transferred to Panama under the 1977 treaties. The treaty enabled both nations to defend the Panama Canal as a neutral waterway and gave the US to protect its security. It is this security that Trump has made the basis of his claim on the canal, claiming Chinese presence and involvement. Trump's claims have been\nvehemently denied by the Panamanian government\n. China does not control or operate the canal, but a subsidiary of Hong Kong-based CK Hutchison Holdings has long managed ports at the canal's Caribbean and Pacific entrances, according to an Associated Press report. However, it is also a fact that Panama became the first Latin American country to join China's Belt and Road Initiative (BRI) in 2017 and Beijing has a growing presence in the region. China's involvement in Panama began in 2016 when Beijing's state-owned company COSCO sent its first vessel through the expanded canal. In the same year, China's Landbridge Group acquired Panama's largest Atlantic port on Margarita Island for USD 900 million, according to a Hong Kong-based South China Morning Post report. In 2018, two Chinese companies won a $1.42 billion contract to build a fourth bridge across the canal that cuts through Panama, according to a Reuters report. Not just Trump, even his Secretary of State Marco Rubio proposed purchasing the Panama Canal earlier this month. Rubio held that the argument that enabled the canal to be handed over was \"violated\". \"While technically sovereignty over the canal has not been turned over to a foreign power, in reality, a foreign power possesses it through their companies... If [China] orders a company to shut it down or impede our transit, they will have to do so,\" Rubio was quoted as saying by the South China Morning Post in January. Therefore, Trump's Panama Canal claim might aim to counter China, but it risks Beijing mimicking the very expansionism the US has long condemned. In trying to secure influence, he may have handed Beijing a stronger case for its own expansionist territorial ambitions.\nLink to Image\n\nGraphic\n \nIs Trump supplying ammo to expansionist China via Panama Canal?\n"
  },
  {
    "id": 1854,
    "title": "It's Trump's Messy, Dangerous World Now",
    "created_at": "2025-01-21",
    "text": "\nWe live in an increasingly dangerous and threatening world. There are more flashpoints in today's global geopolitics than we have seen in decades, presenting a generational challenge to the incoming administration of Donald Trump and all of America's elected leadership. \n  At the Panetta Institute for Public Policy, I tell students that in our democracy, we govern either by leadership or by crisis. If leadership is there and willing to take the risks associated with responsibility, we can avoid, or certainly contain, crisis. But if leadership is absent, we will inevitably govern by crisis. The same is true when it comes to foreign policy.\n  As President-elect Trump is about to be inaugurated for his second term, a fundamental question being asked around the world is whether he will repeat the unpredictable and chaotic approach to foreign policy that defined his first term or embrace the idea that he stressed repeatedly during his campaign of ''peace through strength.''\n  President-elect Trump cannot adopt that foreign policy concept, which holds that a strong military can prevent conflict, without also embracing the definition that President Ronald Reagan so eloquently gave it in his speech marking the 40th anniversary of the Normandy invasion. ''We in America have learned bitter lessons from two world wars,'' said Mr. Reagan, who made the idea famous. ''It is better to be here ready to protect the peace than to take blind shelter across the sea, rushing to respond only after freedom is lost.'' He also made clear that ''the strength of America's allies is vital to the United States.''\n  The world that awaits Mr. Trump is far different from and more threatening than what he had to confront in his first four years. Autocrats that once operated in their own spheres of influence have now joined together in an axis of mutual support and aggression: Vladimir Putin of Russia is not just a temperamental bully but also a tyrant who invaded the sovereign democracy of Ukraine and continues to threaten democracies in the West; Xi Jinping of China has made clear that he is prepared for a potential Taiwan invasion and wants to compete with the United States as a leading military power; Kim Jong-un of North Korea is not just threatening democracy in South Korea but has also sent drones and thousands of troops to Russia to fight Ukrainians; Iran, weakened by Israel, continues to enrich uranium and is ever closer to developing a nuclear weapon; and ISIS has once again raised its ugly head by inspiring a lone-wolf attack in New Orleans.\n  Mr. Trump has always prided himself on being a dealmaker, pledging in his campaign that he would resolve such conflicts in the first few days of his presidency. But precisely because it is a more dangerous world, that's unlikely to happen. And if he tries and fails, the United States will appear weak. There is concern that Mr. Trump may have already started off badly by threatening Greenland, the Panama Canal Zone and Canada. Those are the kind of careless and disruptive comments that only undermine American credibility when it comes to dealing with real-world crises.\n  This is, however, a created_at when ''peace through strength'' could actually work. It will require strong, serious and stable leadership to turn the current multipolar crisis into an opportunity for America. The incoming president can be a dealmaker, but it must be from a position of strength. And strength begins with the United States remaining the strongest military power on the face of the earth.\n  To ensure that, the new administration must be willing to increase military investments in recruitment, training, readiness, nuclear weapons systems, the U.S. defense industrial base and research and technology. To accomplish all of this, the defense budget cannot rely on the unpredictability of continuing resolutions. There must be a five-year budget that makes clear our defense priorities and achieves savings in duplication, procurement and bureaucracy.\n  On Ukraine, it is becoming clear that Ukraine and Mr. Putin must find a way to a negotiated settlement to the war. Mr. Trump must make clear that the United States will continue to work with NATO to support Ukraine and that Mr. Putin will not be allowed to succeed. If that message is clear to Mr. Putin and if Ukraine can gain traction against Russia, President Volodymyr Zelensky will have the leverage to negotiate a settlement that provides for Ukraine's sovereignty and security, allows Russia to remain in Crimea and other limited areas and achieves an end to the war. That would be peace through strength.\n  Mr. Trump should tell China that it will help Taiwan defend itself, that the South China Sea will remain open pursuant to international law and that the United States will support a strong alliance of Japan, South Korea, Australia, India and other Asian countries to protect the freedom of the seas and commerce in the Pacific. From a position of greater military strength, the United States would have leverage for a more productive dialogue with China on trade, cybersecurity, fentanyl, satellites and other economic issues. To simply expand tariffs on China and start a trade war will result in an economic backlash among unhappy consumers in the United States. Retribution is not dealmaking.\n  Iran is yet another opportunity. Tehran has been weakened by Israel both militarily and economically; it could very well be open to negotiations on limiting nuclear enrichment and stopping support for proxies in exchange for relief from economic sanctions. Since the previous Trump administration was critical to the establishment of the Abraham Accords, Mr. Trump could work with Israel to bring Saudi Arabia into the deal, along with other moderate Arab nations. Building a Middle East alliance would be important to dealing with Iran and terrorism, and establishing an approach to peace in the Middle East.\n  The president, as commander in chief, has the power and responsibility to determine America's future security. If he is careless with that awesome power, the United States could very well find itself in another world war. But if the president understands his power, as Mr. Reagan did, he can provide strong leadership and build alliances that steer the world out of war. The key to peace is strength, and the key to strength is leadership.\n  Leon E. Panetta served as secretary of defense and director of the C.I.A. in the Obama administration. He co-founded the Panetta Institute for Public Policy in 1997.\n  The created_ats is committed to publishing a diversity of letters to the editor. We'd like to hear what you think about this or any of our articles. Here are some tips. And here's our email: letters@nycreated_ats.com\n  Follow the New York created_ats Opinion section on Facebook, Instagram, TikTok, WhatsApp, X and Threads.\n\n\n\nGraphic\n \nPHOTO (PHOTOGRAPH BY DANIEL RIBAR FOR THE NEW YORK created_atS) This article appeared in print on page A20.               \n"
  },
  {
    "id": 1855,
    "title": "1405 China-Sulu Treaty revisited",
    "created_at": "2025-01-21",
    "text": "\nLong before the United States signed the Carpenter-Kiram Agreement placing Mindanao and Sulu under a US protectorate, the Sultanate of Sulu had a pending treaty with China to place Sulu and North Borneo under the protection of the Ming Dynasty with an aim to safeguard the South China Sea and the commercial Silk Sea route. Abraham Idjirani,..."
  },
  {
    "id": 1858,
    "title": "From Boardrooms to Battlefields: Preparing Supply Chains for Warcreated_at Economy",
    "created_at": "2025-01-21",
    "text": "\nIn an operating environment with a geopolitical challenge disrupting your supply chain every few weeks, if not days, you need to be prepared for the worst. Plus, there are hush-hush whispers of an impending war that will change how supply chains work and connect. Therefore, plans must be implemented to mitigate risks of over-dependence on adversarial nations, prepare for sudden disruptions, and contribute to preventing conflicts by building sustainable and resilient supply chains. This story will explore how businesses must pivot their supply chain/logistics strategies to ensure resilience while operating in a warcreated_at economy. It will examine the intersection of geopolitics and economic dependencies.\nJust a few weeks have passed since NATO's Admiral Rob Bauer made a call to action for businesses. To mitigate the risk of coercion from nations like China and Russia, Bauer advised companies to adapt their production and distribution strategies to align with potential warcreated_at scenarios.\nAdmiral Rob Bauer's call to action for businesses is created_atly given the increasing geopolitical tensions, particularly between Western powers and nations like China and Russia, and the recent global disruptions such as the COVID-19 pandemic and supply chain breakdowns.\nThe rising geopolitical friction between NATO members and nations like China and Russia has created an environment of uncertainty. Russia's invasion of Ukraine and China's growing influence, especially in Asia and Africa, have put businesses on edge about potential coercion or disruption of their operations. Both nations have demonstrated a willingness to use economic leverage or military force to achieve political and strategic objectives.\nFor businesses that are integrated into these regions, such pressures can be devastating. Therefore, anticipating and mitigating these risks, as suggested by Bauer, could safeguard not only the physical supply chain but also intellectual property, financial assets, and market access.\nBauer's advice emphasizes the importance of preparing for a possible warcreated_at scenario where critical goods and services may be disrupted. Companies might need to reassess their supply chain strategies to be less reliant on a single country or region that could be subject to political or military pressure.\nLearning from Recent History\nThe Ukraine-Russia war\nIt has been two years since Russia invaded Ukraine, and Putin's 'special military operation' in Ukraine crippled the supply chain operations emerging from, going through and ending in both countries. Initially, it was literally a 'two step forward, one step back' situation. Many hundred tonnes of grains were burnt to ashes and an equal amount were stuck at the ports. Cargo ships and planes were destroyed, and the global crude oil supply was heavily interrupted. Not to forget, both nations being major exporters of raw materials, the war has also prolonged the global semiconductor shortage.\nRussia's invasion of Ukraine has led to sanctions on Russia, disrupted energy markets, and resulted in significant shifts in global supply chains. Similarly, China's actions in the South China Sea and its handling of Taiwan and Hong Kong present risks to businesses operating in or dependent on these regions.\nCOVID-19\nThe COVID-19 pandemic exposed the vulnerabilities of global supply chains, especially for industries reliant on specific regions for raw materials, production, or distribution. The disruptions caused by the pandemic, including factory closures, shipping delays, and shortages of goods, demonstrated how businesses could be crippled by external shocks. With the ongoing geopolitical instability, the risk of future disruptions from either nation-state interference or military conflict remains high.\nBuilding Redundancy and Agility in Supply Chains\nOne of the main lessons from the pandemic is the importance of redundancy. Companies that relied on a single supplier or region for key inputs were hit hardest. Companies with the ability to swiftly pivot, adjust production schedules, and find alternative routes or suppliers were more successful in maintaining business continuity.\nThe lessons from Russia's invasion of Ukraine are similar to those of the pandemic: businesses must develop strategies for redundancy and resilience. For instance, companies involved in industries dependent on raw materials from regions affected by conflict should seek to diversify their sources and avoid putting all their eggs in one basket. Additionally, the war revealed the need for businesses to better anticipate and respond to geopolitical risks. Having contingency plans in place can provide a buffer against unforeseen events like military conflicts or sanctions.\nBusiness Decisions and Geopolitics\nGeopolitics are directly proportional to the business decisions and trade relations. In today's world, no one is entirely independent within their country.\nBusiness decisions and trade relations have increasingly become central to geopolitics, as countries and corporations navigate an interconnected world where economic choices influence international power dynamics.\nA prime example of this is the global reliance on critical resources such as rare earth metals and chemicals, many of which are concentrated in specific regions like China. This reliance not only shapes business strategies but also has farreaching geopolitical consequences, as nations balance economic interests, national security, and political influence.\nOn other hand, geopolitical relations shape trade policies such as tariffs, trade agreements, and sanctions. These policies impact business strategies, determining where companies can trade, what products they can export/import, and the cost of doing business. Sanctions imposed due to geopolitical conflicts can restrict business operations, requiring companies to reassess their strategies and find alternative markets or suppliers.\nIf cheap Chinese imports are banned in the west, then businesses will have to procure the same from some other neutral country or at a high cost from within the bloc. For instance, the US has imposed new tariffs on cheap Chinese EVs, and as a counter, the Chinese have put a ban on Tesla near government buildings as they fear security breaches.\nAs a result of geopolitical conflicts, businesses will have to search for alternative markets to sell their products. New markets like India and EU are likely to be flooded with cheap Chinese EVs which may again lead to another set of trade conflicts with these countries.\nTrade relations built around essential goods often act as a bridge for diplomatic cooperation or, conversely, a source of tension.\nWhile geopolitical unrest creates a number of difficult situations for supply chain managers, Nikhil Puri, Vice President - Direct Purchases, Yokohama Off-Highway Tyres shares that not all outcome is negative. He says, \"Due to the war, India shifted their Crude imports to Russia and the burden on ex-chequer got reduced significantly. One adverse or favourable decision taken by a country will have ripple effect on the supply chains of many industries across different geographies.\"\n\"Some of the impacts of the war-created_at situation are only superficial. The East and the West, sanctioning each other, have rerouted the supply chain, while producers and consumers remain the same. For instance, Russian oil is still being bought by the West albeit they are now being refined in India. The US is still procuring Chinese products, however, they are now being rerouted through Mexico. Nearshoring and regionalization are playing key roles in rerouting the supply chain with countries like Vietnam, India and Mexico benefiting from such rerouting,\" adds Pallavi Chaudhuri, Director, Perfetti Van Melle, giving another perspective to the situation.\nPreparing for Warcreated_at Scenario\nWhen asked about what are their opinions on managing supply chain and logistics in the new geopolitical scenario, this is what experts had to say:\n\"Managing supply chains in today's geopolitical climate presents both challenges and opportunities for innovation. Diversifying suppliers across regions helps mitigate risks from geopolitical tensions, trade disputes, and natural disasters. Investing in technologies enhances supply chain visibility, allowing for better forecasting and faster responses to disruptions. Robust contingency planning ensures continuity in the face of trade route blockages or material shortages. Strong collaboration with suppliers and logistics partners improves coordination during crises while focusing on sustainability reduces environmental impact and strengthens resilience.\" Kusum Sharma, Head - Digital Supply Chain Transformation and Manufacturing Excellence, PepsiCo\n"
  }
]