[
  {
    "id": 1894,
    "title": "China: China holds drills as Philippines, US conduct exercise in South China Sea",
    "created_at": "2025-01-22",
    "text": "\nChina's People's Liberation Army has conducted sea and air combat readiness drills in the South China Sea as the Philippines and its ally the United States held joint exercises in disputed waters in the region, the PLA Southern Theater Command said.\nThe Chinese joint air-and-sea patrols were held on Jan. 17-18 - just one day after a China-Philippines bilateral consultation meeting - to maintain peace and stability in the area, the command said in a statement.\nAny military activity that stirs up trouble in the South China Sea is within our control, the Chinese command said.\nIt did not specify the exact location of the PLA drills, but on Friday the Philippine navy held a so-called sovereignty patrol with a live-fire exercise near Scarborough Shoal, followed by joint maricreated_at activities with the U.S. Navy on Friday and Saturday.\nScarborough Shoal is a hotly disputed chain of reefs inside the Philippines' exclusive economic zone, or EEZ, but China holds de-facto control and has deployed its large coast guard vessels to the area to exert power since the beginning of the year.\nThe Philippine frigate BRP Antonio Luna and patrol vessels BRP Ramon Alcaraz and BRP Andres Bonifacio took part in the sovereignty patrol, Manila said, adding that it was aimed at sustaining and improving the operational proficiency of both assets and personnel.\nFirst joint drills in 2025\nThe guided-missile frigate BRP Antonio Luna also participated in the two-day joint exercise with the U.S. Navy, the U.S. 7th Fleet, which operates in the region, said in a press release.\nThe first bilateral Maricreated_at Cooperative Activity of the year is designed to emphasize our longstanding partnership between the two militaries in the maricreated_at domain, it said.\nThe show of force included the U.S. Navy Carl Vinson Carrier Strike Group and a U.S. Navy P-8A maricreated_at patrol and reconnaissance aircraft, alongside Philippine patrol vessel BRP Andr\\xE9s Bonifacio and the BRP Antonio Luna.\nThe Philippine Navy also deployed two FA-50 fighters to take part in the exercise.\nThe U.S. and the Philippines are ironclad allies, Rear Adm. Michael Wosje, commander of Carrier Strike Group 1 was quoted as saying. As fellow maricreated_at nations, we share the common goal of a free and open Indo-Pacific, assuring access to the seas.\nBilateral exercises in the region have grown in scale, scope and complexity, said Capt. Matthew Thomas, commanding officer of the Nimitz-class aircraft carrier USS Carl Vinson.\nTensions between the Philippines and China have been escalating in the last few months, with regular confrontations between their coast guard vessels.\nOne day before China's drills, on Jan. 16, officials from the two countries met under a bilateral consultation mechanism and agreed to seek common ground and find ways to cooperate to ease the tension in the South China Sea.\nPhilippine Foreign Affairs Undersecretary Theresa Lazaro said in her opening remarks at the talks that she believed there was always genuine space for diplomatic and pragmatic cooperation.\nYet with the drills taking place so soon after the talks, it seems a solution remains far out of reach.\nChina has lodged serious protests regarding the Philippines' recent maricreated_at infringement and provocative activities as well as its peddling of the maricreated_at disputes between China and the Philippines, the Chinese foreign ministry said in a statement.\nSource: Radio Free Asia\n"
  },
  {
    "id": 1895,
    "title": "Findings from Nanyang Technological University Provide New Insights into Asian Studies (Role and Threat: an Assessment of Australia's South China Sea Policy Amid Great Power Rivalry)",
    "created_at": "2025-01-22",
    "text": "\n2025 JAN 22 (NewsRx) -- By a News Reporter-Staff News Editor at Politics, Law & Government Daily -- Current study results on Global Views - Asian Studies have been published. According to news originating from Singapore, Singapore, by NewsRx editors, the research stated, \"Despite having no territorial claim in the South China Sea, why has Australia publicly voiced concerns? What factors led to the shift in its South China Sea policy during the 2010s? By integrating role theory with the balance of threat theory and analyzing official documents, I argue that Australia's role conception in the South China Sea and its perception of the 'China threat' have primarily shaped its policy on this issue. Driven by its assertive actor role, Australia has felt obligated to take positions on disputed events.\" \n Our news journalists obtained a quote from the research from Nanyang Technological University, \"An intensified perception of China as a threat has led Australia to adopt a more confrontational posture, bringing it into closer alignment with the United States. This case study of Australia's South China Sea policy illustrates the broader dynamics of how regional countries navigate the complexities of great power competition.\" \n According to the news editors, the research concluded: \"It highlights that alignment reformulation arises not only from external pressures but also from ideational factors.\" \n This research has been peer-reviewed. \n For more information on this research see: Role and Threat: an Assessment of Australia's South China Sea Policy Amid Great Power Rivalry. Asian Perspective, 2024;48(4):621-646. Asian Perspective can be contacted at: Johns Hopkins Univ Press, Journals Publishing Division, 2715 North Charles St, Baltimore, MD 21218-4363, USA. \n The news correspondents report that additional information may be obtained from Shuqi Wang, Nanyang Technological University Ntu, School of Social Sciences, Singapore, Singapore. \n The direct object identifier (DOI) for that additional information is:  This DOI is a link to an online electronic document that is either free or for purchase, and can be your direct source for a journal article and its citation. \n Keywords for this news article include: Singapore, Singapore, Asia, Asian Studies, Global Views, Asia, China, Nanyang Technological University. \n Our reports deliver fact-based news of research and discoveries from around the world. Copyright 2025, NewsRx LLC \n"
  },
  {
    "id": 1896,
    "title": "Does Prabowo have a new strategy on the South China Sea?; Indonesian President Prabowo Subianto has sparked debate after implementing several seemingly contradictory policies last year. Does he have a coherent plan for Indonesia? Or is it too early to criticise and evaluate his approach? ISEAS academic Leo Suryadinata tells us more.",
    "created_at": "2025-01-22",
    "text": "\n                        On 9 December 2024, General Agus Subiyanto, commander-in-chief of the Indonesian National Armed Forces, announced a large-scale reshuffling of 300 senior officers: 143 from the Army, 92 from the Navy, and 65 from the Air Force. This move was primarily aimed at consolidating the power of Indonesian President Prabowo Subianto. Among these senior officers, some were close associates of former President Joko Widodo (Jokowi). Now that Prabowo has officially assumed the presidency, he is positioning his trusted allies in key positions or promoting generals previously sidelined by Jokowi. These individuals are expected to be unwaveringly loyal to Prabowo.\n                        One example is Major General Kunto Arief Wibowo, previously the commander of the Regional Command III. During the 2024 presidential election, he wrote an article warning that military personnel must remain neutral, which led to his reassignment by Jokowi. Now, Prabowo has appointed him as commander of the Joint Regional Defense Command I. Analysts believe this role requires someone Prabowo trusts, as it pertains to the Natuna Sea. Prabowo seems to have a new strategy regarding the South China Sea.\n                        Observers speculate that Prabowo has made concessions to China regarding these areas in exchange for Chinese support, particularly in economic and technological assistance. However, Indonesia takes a slightly different view.\n                        The South China Sea remains a pressing issue\n                        Analysts suggest that Prabowo had already made concessions on the South China Sea issue in September 2024. According to a China-Indonesia joint statement in English released by China, Indonesia and China agreed to jointly develop “areas of overlapping claims”. This implied a shift in Indonesia’s previous stance to one that recognised China’s nine-dash line. However, shortly thereafter, Indonesia’s Ministry of Foreign Affairs issued a statement in Indonesian, clarifying that the joint statement does not imply Indonesia’s recognition of the nine-dash line. The statement also reiterated that China’s nine-dash line lacks legal basis under international law, is not recognised by the International Tribunal, and is inconsistent with the 1982 United Nations Convention on the Law of the Sea (UNCLOS). However, the statement did not explicitly criticise the wording of the China-Indonesia joint statement. These discrepancies show that both sides have diverging interpretations.\n                        Chinese Maricreated_at Militia vessels are pictured near the Second Thomas Shoal in the South China Sea, on 5 March 2024.\n                        China believes that under the joint statement, Jakarta has reached a consensus with Beijing, and that both countries will jointly develop “areas of overlapping claims”. Observers speculate that Prabowo has made concessions to China regarding these areas in exchange for Chinese support, particularly in economic and technological assistance. However, Indonesia takes a slightly different view.\n                        Prabowo may not have anticipated that doing so would be perceived as a shift in Indonesia’s stance on the South China Sea issue that affects the interests of ASEAN claimant states.\n                        According to this view, Prabowo wants to show his willingness to cooperate with China without really having joint development in the “areas of overlapping claims”. This is due to the fact that in practice, any such development would require alignment with Indonesia’s current laws and regulations. Since Indonesia adheres to the United Nations Convention on the Law of the Sea (UNCLOS) and the 2016 ruling by the Permanent Court of Arbitration, it does not recognise the nine-dash line, meaning there are no “areas of overlapping claims” with China. The proposed joint development project would conflict with existing Indonesian laws, making it unfeasible. However, Prabowo may not have anticipated that doing so would be perceived as a shift in Indonesia’s stance on the South China Sea issue that affects the interests of ASEAN claimant states.\n                        Notably, after China released the joint statement, Prabowo gave a speech affirming his commitment to safeguard Indonesia’s sovereignty and prevent foreign violations. Yet he also remarked that he would always try to look for the possibility of a partnership, as partnerships are better than conflicts. He appeared to hint to China that Indonesia would not compromise on sovereignty issues, while simultaneously signalling to the US not to provoke conflicts in the South China Sea.\n                        Former US President Joe Biden meets with Indonesian President Prabowo Subianto in the Oval Office of the White House in Washington, US, on 12 November 2024.\n                        Following his visit to China, Prabowo also visited the US, where a joint statement was issued between the two nations’ leaders. On the South China Sea issue, the joint statement did not mention the nine-dash line but did make a reference to the 2016 Permanent Court of Arbitration ruling under UNCLOS, which invalidated the nine-dash line. However, China does not recognise this ruling.\n                        Prabowo is thus likely to maintain a good relationship with Trump. However, in his diplomatic approach, Prabowo is expected to continue with a non-aligned policy that avoids taking sides in the US-China rivalry.\n                        Prabowo playing both sides amid geopolitical uncertainty \n                        Prabowo has a personal connection to the US, having received military training there, and seems to hold a favourable view of Donald Trump. When Trump won the US presidency, Prabowo was one of the first world leaders to call and congratulate him, addressing him as “sir”. Trump, in turn, was delighted and bestowed high praise on Prabowo’s capabilities. When Trump complimented his English, Prabowo reportedly replied, “All my training is American, sir.” Prabowo is thus likely to maintain a good relationship with Trump. However, in his diplomatic approach, Prabowo is expected to continue with a non-aligned policy that avoids taking sides in the US-China rivalry.\n                        When it comes to defence, Indonesia conducts large-scale annual military exercises with the US. However, no similar joint operations with China exist. Additionally, the US provides training to enhance Indonesia’s maricreated_at patrol capabilities, and much of Indonesia’s defence equipment is sourced from Western countries, including the US. Therefore, Indonesia has close military and defence ties with the West, particularly the US. However, Indonesia also maintains strong economic relations with China.\n                        World leaders pose for a family photo during the BRICS summit in Kazan, Russia,  on 24 October 2024. Indonesia is now officially a full member of BRICS.\n                        The BRICS group, led by Russia, India and China, is a coalition of so-called “developing countries” that aims to break away from US economic dominance by promoting trade outside the US dollar to facilitate freer and more profitable commerce. Prabowo recently announced that Indonesia is now officially a full member of BRICS, expressing a desire to serve as a “bridge between developed and developing nations” . Because Indonesia prides itself on its non-aligned stance, it also applied last year to join the Organisation for Economic Co-operation and Development (OECD), a group of developed nations led by the US. However, its application has yet to be accepted.\n                        Indonesia is a trade-surplus country with the US, exporting minerals, agricultural and fishery products, electronics, and labour-intensive goods. Trump has previously warned BRICS members that their exports to the US could face a 100% tariff, a significant threat to Indonesia, as losing the US market would heavily impact its national revenue. However, analysts believe that if Trump were to impose such sanctions, it might drive Indonesia closer to China. Given Indonesia’s strategic importance in the Asia-Pacific region, it is unlikely that Trump would take such drastic measures.\n                        Inconsistent political approach?\n                        Some analysts note that Prabowo, despite being democratically elected, exhibits tendencies that are less democratic. For instance, in December last year, he proposed that direct elections for local governors and mayors should be abolished, suggesting instead that regional councillors elect and appoint these officials. He argued that this approach would reduce national expenditures and improve efficiency. The proposal sparked heated debate. While many political party members welcomed the idea, pro-democracy advocates criticised it as undemocratic. They argue that the government should work to improve the existing system of direct elections for local officials to strengthen Indonesia’s democracy, rather than remove elections.\n                        Students eat lunch on the first day of a free-meal programme at PGRI 6 Junior High School in Bogor, West Java, on 6 January 2025.\n                        Prabowo’s leadership style is also distinctly military. Upon assuming office, he organised a military-style retreat for his cabinet ministers to deliver instructions. He expressed his vision of transforming Indonesia into a technologically advanced and powerful nation, emphasising that national strength requires a healthy and well-educated population.\n                        To this end, he introduced a programme providing free and nutritious lunches for students and pregnant women, which was implemented on 6 January 2025. He has also prioritised improving Indonesia’s education system, particularly higher education and scientific research, aiming to position Indonesia as a developed nation by 2045. Achieving these goals will require substantial funding, so Prabowo has set an ambitious target of increasing Indonesia’s economic growth rate from 5% to 8%. Achieving this goal is challenging, and he has tasked his ministers with making it a reality.\n                        Although Prabowo is a diplomatically-focused president, he understands that domestic, political and economic stability are crucial to securing his position. \n                        Indonesian President Prabowo Subianto, Vice President Gibran Rakabuming Raka, and newly appointed cabinet ministers pose for photographs after the inauguration of the new cabinet, at the Presidential Palace in Jakarta, Indonesia, on 21 October 2024.\n                        However, Prabowo’s cabinet is oversized, comprising over 100 ministers and deputy ministers with varying levels of competence. Shortly after taking office, some ministers have performed poorly. For instance, Minister of Villages and Development of Disadvantaged Regions Yandri Susanto misused his position and violated regulations by using an official letterhead for invitations to his mother’s birthday celebration. Similarly, Minister of Human Rights Natalius Pigai complained about insufficient departmental funding, openly requesting a huge budget of 20 trillion rupiah (US$1.2 billion). The bloated cabinet not only drains national resources but also hampers efficiency.\n                        Too early to judge Prawobo’s performance?\n                        Although Prabowo is a diplomatically-focused president, he understands that domestic, political and economic stability are crucial to securing his position. He has thus taken steps to strengthen his leadership and tasked his ministers with increasing state revenue. Many business leaders have cooperated with Prabowo, providing funding needed by the government. In an effort to boost state revenue, he recently proposed granting amnesty to corrupt officials if they return stolen funds to the state and express genuine remorse. This proposal has drawn significant criticism. Additionally, his Coordinating Minister for Economic Affairs announced a plan to raise the value-added tax (VAT) from 11% to 12%, which also faced backlash. As a result, the government decided to maintain the VAT at 11%, with the 12% rate only applying to luxury goods.\n                        However, Prabowo has been in office for less than 100 days. While the economy remains relatively stable, the challenges ahead are significant, and it is still too early to fully evaluate his administration’s performance.\n                        This article was first published in Lianhe Zaobao as “普拉博沃就职后的印尼政治和外交”. \n                        Related: Indonesia joins BRICS: A strategic step towards global south empowerment | Has Prabowo changed Indonesia’s stance on the South China Sea?\n                        This handout picture taken and released by Indonesia’s presidential palace on 25 October 2024, shows president Prabowo Subianto (right) flanked by defence minister Sjafrie Sjamsoeddin (left), commander-in-chief of the Indonesian army General Agus Subiyanto (second from left) and police commissioner general Listyo Sigit Prabowo (centre), at the military academy during their cabinet retreat in Magelang, Central Java.\n"
  },
  {
    "id": 1897,
    "title": "US FREEDOM OF NAVIGATION OPERATIONS 'UNSUCCESSFUL,' STUDY SAYS",
    "created_at": "2025-01-22",
    "text": "\nThe following information was released by Radio Free Asia:\nSo-called freedom of navigation operations, or FONOPs, that the U.S. Navy has been carrying out against China's extensive maricreated_at claims in the South China Sea, have proved ineffective and even risk escalating tensions, Australian research found.\nThe findings, in the paper \"Don't Shoot the Messenger: Perception and Misperception in the South China Sea,\" by Nell Bennett, are part of the Blue Security program, a collaboration between various Australian universities and institutes.\nBennett, a researcher specializing in maricreated_at and naval affairs, looked into the FONOP program between 2016 and 2023 when, in her opinion, the U.S. made the South China Sea a focus and directed its attention towards China's maricreated_at claims there.\n\"The seven-year FONOP program has seen China go from measured rejection of U.S. messages to more explicit hostility,\" Bennett said in the report.\n\"China did not accept the messages that the U.S. sought to send through its FONOP program,\" she said, adding that as China's behavior remains unaltered and becomes even more belligerent, the FONOPs are deemed unsuccessful.\n'Strategic communication'\nFreedom of navigation, according to the U.N. Convention on the Law of the Sea , or UNCLOS, is the right of all states to sail the high seas, as well as to fly over them, without interference from other states.\nSince 1979, the United States has conducted FONOPs to uphold UNCLOS provisions and reject \"unlawful attempts by coastal states to restrict the rights and freedoms of navigation and overflight as well as other lawful uses of the sea,\" as defined by the Pentagon.\nThe USS Chung-Hoon observes a Chinese navy ship conduct what it called an \"unsafe\" Chinese maneuver in the Taiwan Strait, Saturday, June 3, 2023.(Mass Communication Specialist 1st Class Andre T. Richard/AP)\nThe U.S. campaign shows that the United States \"does not acquiesce to the excessive maricreated_at claims by other nations and prevents them from becoming accepted customary international law,\" the Department of Defense said in an annual report.\nSince the end of 2015, U.S. naval ships regularly sailed near disputed features in the South China Sea, as well as in the Taiwan Strait, to challenge the claims by not only China but also by others, such as Vietnam, Malaysia and Taiwan, that the U.S. views as inconsistent with UNCLOS.\nThe report's author considered FONOPs a form of strategic communication, or \"messages that are communicated to advance a strategic objective.\"\n\"The idea is that the state will receive the message and either reconsider or change its course of action,\" Bennett wrote.\nHowever, despite the 46 reported FONOPs in the South China Sea from 2016 to 2023, \"China's responses became more oppositional over created_at.\"\n\"Not only did China use U.S. actions as justification for its own militarization, but it also made a thinly veiled threat of retaliation,\" the researcher said, citing statements by Chinese military officials and media reports.\nThe key factor that will determine whether a message will be accepted is the pre-existing relationship between the states, Bennett argued, and as China viewed the U.S. as a competitor and potential threat, it was predisposed to reject the U.S. communication, which is unlikely to bring about any change in Beijing's behavior.\n\"This argument actually has been floating around since FONOPs started,\" said Collin Koh, senior fellow at the S. Rajaratnam School of International Studies in Singapore, who recorded every FONOP by U.S. and allied vessels in the region.\n\"I think the whole idea, firstly, is to let China know it's created_at to roll back on its excessive maricreated_at claims, but notext has realistically expected to achieve Beijing's rolling back so it is a bit hasty to say it's unsuccessful,\" Koh told Radio Free Asia.\nChina would still conduct land reclamation and military exercises to exert control according to its plans and strategies, but the U.S. FONOPs had helped to deter Beijing's \"gray zone\" campaign of coercive pressure, he added.\n\"An in-depth study is needed to reach conclusions,\" Koh said.\nSometext cares\nIn Koh's opinion, the U.S. strategic messaging is also intended to reassure countries in the region about Washington's stabilizing role, \"that is to say that there is sometext who cares.\"\n\"At least one country acts for public common good and its actions should be appreciated by all countries facing China's aggression,\" Koh said.\nAn F/A-18F Super Hornet, assigned to the \"Bounty Hunters\" of Strike Fighter Squadron (VFA) 2, launches from the flight deck of the Nimitz-class aircraft carrier USS Carl Vinson (CVN 70), Jan. 21, 2025.(U.S. Navy)\n\"I don't think FONOPs are designed to stop Chinese aggression,\" said Malcolm Davis, a senior analyst at the Australian Strategic Policy Institute, or ASPI, a government think tank.\n\"They are there to demonstrate to Beijing that the U.S. maintains the right to sail in international waters and challenges China's illegal claims to territory.\"\nOnly China has publicly and officially protested against the U.S. FONOPs that it sees as disruptive and \"a grave threat to China's sovereignty and security.\"\nRELATED STORIES\nChina holds drills as Philippines, US conduct exercise in South China Sea\nUS, Canadian warships conduct joint drills in South China Sea\nPhilippines, US, Japan stage joint naval maneuvers in South China Sea\nIn her research, Bennett also noticed that the Philippines remained supportive of U.S. messaging and its media \"even adopted the rhetoric and justifications that the U.S. provided in support of the operations.\"\n\"Many would argue that [without the FONOPs] it would be more challenging to send clear, consistent messages to Beijing regarding international law and territorial disputes in the South China Sea,\" said Troy Lee-Brown, project manager of Blue Security and co-editor of Blue Security Maricreated_at Affairs Series.\n\"However, ultimately, as the author Nell Bennett points out, the effectiveness of FONOPs depends on how they are perceived.\"\n\"So, there is a tension there between the two points of view on their efficacy,\" Lee-Brown told RFA.\nLee-Brown suggested that FONOPs \"should ideally be complimented by other forms of strategic communication\" diplomatically, through statements and declarations, military presence and exercises with partners and allies, and legal and normative advocacy amongst other aspects.\nA Royal Australian Air Force P-8A Poseidon aircraft conducts a fly-over of Philippine Navy ships, a Japan Maricreated_at Self-Defense Force ship, as well as U.S., New Zealand Navy and Australian Navy ships during a Maricreated_at Cooperative Activity in the South China Sea on Sept. 28, 2024.(U.S. Navy)\nAnalysts also pointed out that the U.S. not being a party to UNCLOS presents challenges to its advocating a rules-based order in the South China Sea.\n\"However, the U.S. has consistently observed UNCLOS as customary international law and conducts operations in accordance with its principles,\" Lee-Brown added.\nASPI's Malcolm Davis said it's important that the U.S. maintains FONOPs and \"it's also important that other U.S. allies participate in one way or another, or, like Australia, undertake similar operations to demonstrate international law at sea.\"\nEdited by Mike Firn.\n"
  },
  {
    "id": 1898,
    "title": "tenuous 'win' claimed in shoal resupply deal",
    "created_at": "2025-01-22",
    "text": "\nIn a rare moment of accord amid their simmering feud over the South China Sea, Beijing and Manila have agreed to maintain a provisional deal allowing the Philippines to resupply a remote outpost at the Second Thomas Shoal - a move hailed as a \"win\" for Manila, albeit one fraught with uncertainty. \nThe agreement, reached during the 10th bilateral consultation mechanism (BCM) meeting in Xiamen last Thursday, comes as the Philippines continues to push back against what it calls a rising tide of Chinese incursions in the South China Sea.  \nThe BCM, established as a forum for dialogue, has often been weighed down by the deep mistrust between the two neighbours. But this created_at, envoys described the talks as \"frank and constructive\", according to the Philippines' foreign affairs department. \nDespite the diplomatic veneer, tensions remain high. Just days before the meeting, Manila lodged a fresh protest against the deployment of China's 165-metre-long coastguard vessel 5901 - ominously dubbed \"the monster\" - which was spotted just 77 nautical miles off the Philippine coast.  \nThe Philippines condemned the move as a violation of its exclusive economic zone, citing the 1982 United Nations Convention on the Law of the Sea and Manila's recently enacted Maricreated_at Zones Act. \nChina, for its part, has shown no signs of toning down its presence in contested waters, including Scarborough Shoal, which it has controlled since a 2012 clash with Philippine forces.  \nThe shoal - known in the Philippines as Bajo de Masinloc - remains a flashpoint, and was the reason Manila filed an arbitration case against Beijing at The Hague. Beijing has dismissed the 2016 ruling that invalidated its expansive claim over much of the South China Sea. \nStill, the agreement on resupply missions represents a rare moment of compromise. For years, the Second Thomas Shoal has been a symbol of Manila's defiance, with the rusting BRP Sierra Madre - a World War II-era warship intentionally grounded on the shoal - serving as the Philippines' foothold.  \nChinese coastguard vessels have repeatedly tried to block resupply efforts to the outpost, even resorting to aggressive tactics that led to a Philippine serviceman losing a thumb in a past skirmish. \nLast Thursday's meeting \"shows that the Philippines is able to get [China] to agree to commit. It's a win,\" said Julio Amador, interim president of the Foundation for the National Interest and a trustee at the non-profit organisation Facts Asia. The agreement \"commits both states to a status quo\", Amador said. \nBut he was quick to caution against complacency, saying Beijing would continue probing for vulnerabilities. He urged Manila to \"stop announcing to the world its weakness\" and adopt a more strategic approach. \nAt last week's meeting, the two sides reportedly explored areas of cooperation too, including ocean meteorology and coastguard collaboration.  \nThese proposals built upon a joint coastguard committee formed in 2016 and the \"direct communication line\" for maricreated_at concerns that Philippine President Ferdinand Marcos Jnr and China's Xi Jinping agreed to set up in January 2023.  \nPhilippine Foreign Affairs Undersecretary Theresa Lazaro said the continued implementation of the resupply deal was essential to the \"de-escalation of tensions\" without compromising national interests.  \nBoth sides had \"exchanged views\" and \"acknowledged ... positive outcomes\", Lazaro said.  \n\"Our position is clear and consistent, but so is our willingness to engage in dialogue,\" she said. \nBeijing and Manila reached a provisional agreement on resupply missions to the Second Thomas Shoal last year. \nGeopolitical analysts remain sceptical of China's intentions, however. Don McLain Gill, a lecturer in international relations at De La Salle University in Manila, said Beijing had a habit of \"throwing its weight around\" and warned Manila must not compromise on its core interests.  \n\"The most important thing is that we hold our ground and we stay consistent,\" he said. \nNational Security Council spokesman Jonathan Malaya recently admitted the Philippines felt China was \"pushing us to the wall\" and said Manila might have to file another case against Beijing.  \nBut analysts warn litigation alone is unlikely to shift the dynamics in the South China Sea, where Beijing's strategy of ­incremental encroachment has left its neighbours scrambling for answers. \nAs the Philippines prepares to host the next BCM later this year, the question remains: can these fragile agreements hold against the tide of escalating tensions?  \nFor now, Manila has secured what some see as a tenuous victory. But in the high-stakes chessboard of the South China Sea, every move counts - and every misstep could tip the balance.\n"
  },
  {
    "id": 1899,
    "title": "Chinese military conducts sea-air combat readiness patrols in South China Sea, 'directly targeting the Philippines' provocative moves'",
    "created_at": "2025-01-22",
    "text": "\nSouth China Sea Photo: VCG By Zhao Yusha and Guo Yuandan The Chinese military conducted joint sea-air combat readiness patrols in the South China Sea from Friday to Saturday to maintain peace and stability in the area, according to a statement by the Chinese People's Liberation Army (PLA) Southern Theater Command. The statement was issued after the..."
  },
  {
    "id": 1900,
    "title": "Philippine Missile Crisis And Taiwan Contingency – Analysis",
    "created_at": "2025-01-22",
    "text": "\nThe indefinite deployment of a powerful U.S. weapon system in the northern Philippines and Beijing's strong reaction to it has the makings of a new missile crisis.\nManila wants to acquire a Typhon mid-range capability (MRC), but Beijing warned this would trigger a dangerous arms race. Manila argues that its procurement decision is driven by its own security calculus. But the cost, sophistication, and nature of this capability and the timing fuel doubts, adding to the boiling cross-Strait flashpoint.\nSouth China Sea or Taiwan Strait? \nTyphon MRC was installed in Laoag in northern Luzon during a joint Philippines-United States exercise last April and has stayed since, much to China's chagrin. Laoag City is the capital of Ilocos Norte province, the stronghold of the powerful Marcos family. President Ferdinand Marcos Jr. served as vice governor, governor, and representative of the province's second district. His late father, strongman Ferdinand Sr., also served as a representative before becoming a senator and, eventually, president. Hence, stationing Typhon in the city suggests it has the nod from the highest official in the land. Choosing Laoag may be both strategic and expedient, given its location and buy-in of national and local leadership. Other provinces, like neighboring Cagayan, have aired unease about increased U.S. military presence, worried this may affect Chinese investments and put them directly in harm's way should hostilities break out.\nThe storm brought by the appearance of the Typhon was preceded by the expansion of U.S. military access in the northern theater closer to Taiwan. This fueled speculation that the move was more in line with a cross-Strait crisis rather than deterring China in the South China Sea. From where it is presently fixed, the MRC can fire missiles that can hit targets way beyond the South China Sea, including the Mainland, Taiwan, and parts of the Western Pacific. Beijing replied to this unprecedented prolonged arms deployment by staging its first intercontinental ballistic missile (ICBM) test in 44 years.\nThe Typhon deployment infuriated China. Not even U.S. allies, such as Japan and South Korea, have allowed installment of the platform on their territory, possibly anticipating China's reaction. While Seoul's THAAD bid may be understood in light of Pyongyang's growing nuclear and ballistic arsenal, no other South China Sea claimant has seen China's maricreated_at grab in such stark view as to warrant hosting a foreign lethal missile system on their soil. Beijing claimed the move was destabilizing, a view Manila was quick to refute. Likely to assert agency, Manila said it is keen to induct a Typhon to strengthen its defense posture. Owning the capability may be a ploy to allay concerns that the country is simply granting the U.S. free reign to use its territory for its larger strategic goals. The logic is that Philippine-owned U.S. arms on Philippine soil mean the button will be pushed by someone from Manila, not Washington. This is akin to South Korea's order for a Terminal High Altitude Area Defense battery, which also riled Seoul's ties with Beijing.\nNo bystander? But at what cost and risk? \nDue to its proximity and the presence of over 150,000 Filipino nationals in Taiwan, a cross-Strait emergency presents dilemmas for the Philippines. Manila already struggles to deal with Beijing in the South China Sea in the west and would not wish to have another front in the north. But the prospect of a forceful takeover of the self-ruled island worries the Southeast Asian country. While Manila abides by the \"One China Policy,\" it maintains unofficial ties with Taipei, which is also an important trade partner and investor.\nAllied exercises in northern Luzon and Batanes, expanded American military footprint, and Typhon's indeterminate placing in that space can be seen from the prism of the Taiwan crisis. Three of the four new agreed locations for US military presence are in northern Luzon. For the first created_at in the history of the Philippines-US Enhanced Defense Cooperation Agreement (EDCA), a naval base was opened for US access. Camilo Osias Base in Santa Ana, Cagayan stares at Taiwan across the Luzon Strait. Four of the five original EDCA locations are all air bases further south. The other one is an army base. Typhon was stationed at Laoag International Airport. Another new EDCA site was the Lal-lo airport in Cagayan. That both Laoag and Lal-lo are civilian airports suggests that even strategic non-military real estate can be tapped in a possible contingency operation.\nAll these developments give the impression that Manila is warming up to a possible Taiwan emergency, which some estimate may happen by 2027. Washington is reportedly keen on building a potential dual-use port in Batanes closer to Taiwan. Northern Luzon was a theater for joint Philippine-U.S. military exercises last year. Last October, Philippine and U.S. marines staged drills to evacuate displaced Filipino migrant workers, a scenario that may happen should armed conflict break out. Hence, Beijing's intensified pressure on its smaller neighbor may be more in reply to Manila taking steps aligned with the U.S. broader deterrence initiative to prevent Beijing from using force against the island.\nMarcos said that EDCA sites will not be used as staging grounds to target another country. EDCA facilities are also said to be useful for humanitarian assistance and disaster relief (HADR) operations. Northern Luzon and Batanes being at-risk for strong typhoons make it a palatable pretext. But China is not buying it and is vigilantly watching Philippine and U.S. actions in this space. Beijing discourages other countries from intervening in the Taiwan issue, saying it is a domestic matter. Even before its ICBM test, China had already warned the U.S. and its neighbors to stay clear of Taiwan. The southernmost of the six exclusion zones where China undertook drills in response to the 2022 visit of former US House Speaker Nancy Pelosi to Taipei included waters and airspace off northern Batanes. Five ballistic missiles fired by China during that exercise landed in Japan's EEZ. These actions are messages to Manila and Tokyo, two US allies closest to Taiwan, and are counted upon by Washington as crucial in deterring forcible attempts to change the status quo across the Strait.\nPhilippine participation in a Taiwan emergency is a delicate issue. Repatriating its nationals in Taiwan is a top priority for Manila. It may also help evacuate other foreign nationals, including citizens of fellow ASEAN countries like Indonesia, Vietnam, and Thailand, which also have big communities on the democratic island. Manila may also permit medical evacuation to Batanes. Delivery of food, medicines, and other basic humanitarian supplies may be considered. Further steps may depend on the country's comfort level, given the grave hazards involved. Pressure from the U.S. is expected, especially if the latter decides to play a big role in Taiwan's defense, something to watch under the second Trump administration. However, an anxious domestic Filipino public may also dissuade the government from joining the fray, especially if the stakes are not sufficiently conveyed.\nDue to its own turbulent ties with Beijing over the South China Sea and its traditionally strong alliance with the U.S., Manila may not be in a good position to broker a cross-Strait dialogue. But predisposing the country to bear U.S. arms as the only way to matter in a Taiwan Strait crisis shows a dearth in imagination. As a founding father of ASEAN, the Philippines, at the minimum, can support ASEAN or an ASEAN country like Singapore or Indonesia to play a more robust role in defusing tensions.\n - This article was published at China-US Focus and draws from the author's prior work published in Italian text: Pitlo, Lucio III B. \"Manila Morirebbe Per Gli Scogli Ma Non Per Taiwan.\" Limes (Rivista Italiana di Geopolitica) No. 10 (November 2024). 223-231.\n"
  },
  {
    "id": 1901,
    "title": "Malaysia's Anwar says don't single out China in sea tensions",
    "created_at": "2025-01-22",
    "text": "\nThere will always be border disputes in Asia, and China should not be singled out because of tensions in the South China Sea, Malaysian Prime Minister Anwar Ibrahim said Wednesday.\nSpeaking at the World Economic Forum in Davos, Switzerland, Anwar said that Malaysia had border issues with Singapore and its other neighbours in Southeast Asia but they still managed to cultivate good relations.\nWhile Malaysia also has maricreated_at issues with China, it will push ahead with improving ties because it is an important country, he said.\n\"We have excellent relationship with Singapore. We still have border issues with them,\" Anwar said.\n\"I treat the Thais as my family members, the leaders, but still we have some border issues with them. So it is with Indonesia, with the Philippines.\n\"(But) we don't go to war, we don't threaten. We do discuss. We get a bit... angry, but we do focus on the economic fundamentals and move on,\" he added.\n\"Why is it that we must then single out China as an issue?\" Anwar asked.\n\"That's my only contention. Do I have an issue about it? Yes, but do I have a problem? No. Do we have any undesired tensions? No,\" he said.\nHe said that while Malaysia has strong ties with the United States, China is an important neighbour that it must also engage with.\n\"Of course, people highlight the issue of the South China Sea... But may I remind you that Malaysia is a maricreated_at country,\" he said.\nChina has been \"very reasonable\" in dealing with Malaysia, Anwar added.\n\"They take us seriously, more seriously than many of the countries of our old allies and friends,\" he said, without mentioning any country.\nChina has ruffled diplomatic feathers in Southeast Asia because of its assertion that it owns most of the strategic waterway despite an international ruling that the claim has no legal basis.\nThis has pitted it against Brunei, Malaysia, the Philippines, Taiwan and Vietnam, which have partial claims to the sea.\nIn recent years, China and the Philippines have seen an escalation of confrontations, including boat-ramming incidents and Chinese ships firing water cannons on Filipino vessels.\nThe clashes have sparked concern they could draw the United States, Manila's long-created_at security ally, into armed conflict with China.\nllk-mba/js\n"
  },
  {
    "id": 1905,
    "title": "China responds to Quad FMs meeting, says its claims over South China Sea 'completely justified'",
    "created_at": "2025-01-22",
    "text": "\nResponding to a question on the Quad foreign ministers' meeting in Washington on Tuesday during which they reaffirmed their commitment for a Free and Open Indo-Pacific, Chinese Foreign Ministry spokesperson Mao Ning said, 'China’s activities in relevant waters are lawful, legitimate and completely justified'. Beijing: China on..."
  },
  {
    "id": 1906,
    "title": "2025, a hinge year for Malaysia",
    "created_at": "2025-01-22",
    "text": "\nTHE new year is 22 days old today, and already Malaysia is setting the tone â€” regionally and globally â€” for the remaining 343 days. Make no mistake, Malaysia is no superpower. Mighty powers, from the region and outside, would want to shape the moment as their geopolitical interests dictate. But it has a chance to stand up and be counted. This is the moment, a hinge moment, as the consultant-types would badge it. Malaysia can choose to be the aileron to shift the hinge line of control.\nPutrajaya has already done that in a regional way as the chair of Asean since Jan 1. A clear signal of the shift came on Sunday out of Langkawi, the venue for the Asean's Foreign Ministers Retreat, when Foreign Minister Datuk Seri Mohamad Hasan urged the regional bloc to assert its voice and chart its own course rather than be swayed by external forces. Asean's voice has a heft of its own, but the bloc finds it hard to get all 10 members to speak with one voice on key issues. One such is on how to deal with the military regime in Myanmar after it overthrew a democratically elected government on Feb 1, 2021, and went on a rampage of violence, killing and torturing civilians. The violence has grown complicated in the last two years, with rebel groups adding to the bloodshed. Next month will be the fourth anniversary of the coup. Not speaking with one voice means choosing to see the violence continue.\nAnother lingering issue is China's claims over almost all of the South China Sea, much of which overlap with those of other Asean members. Besides calling for all parties to the dispute to respect international law, Asean has been negotiating with China to draft a Code of Conduct for the South China Sea, but progress is slow. In the meancreated_at, China has adopted a confrontational stance against the other claimants. The Philippines has been the most vociferous against Beijing's aggression, having taken its case to the Permanent Court of Arbitration (PCA) in 2013 as provided for under the United Nations Convention on the Law of the Sea (UNCLOS). The PCA's award issued on July 12, 2016, confirmed the sovereign rights of the Philippines over its 200-nautical-mile Exclusive Economic Zone in the West Philippine Sea while rejecting China's \"nine-dash line\" claim. China rejects the PCA award. Like it or not, this has forced Manila to seek the help of the United States. One form such a help has taken is joint maricreated_at exercises, now into the fifth since it began in 2023. The two-day exercise, whose aim is to help Manila assert its sovereign rights, came after Manila complained about the presence of Chinese coast guard vessels inside its maricreated_at zone. The military route is certainly not the right way to solve maricreated_at disputes. The code of conduct based on international law is. China and Asean will do well to conclude it soonest.\nGlobally, too, Malaysia is setting the pace for a just and humane global order by calling out the West's hypocrisy, a might-is-right hegemonic evil that has bred a heartless world. There is no place in this 21st century for such neo-barbarism. Well done, Malaysia.\n( END )\n"
  },
  {
    "id": 1907,
    "title": "Philippines Oil & Gas Competitive Landscape",
    "created_at": "2025-01-22",
    "text": "\nThe Philippines runs one the most liberalised oil and gas markets in the Asia-Pacific region. The government is not involved in the downstream wholesale and retail fuel markets, with its main tasks being regulating, enforcing and monitoring retail fuel price movements.The upstream industry faces several challenges to reverse depleting oil and gas reserves amid lack of interest from foreign investors. The government has promote foreign investment in the upstream sector without much success since the operators of the existing oil and gas fields are unwilling to commit investments due to depletion and a lack of major new discoveries. \nDomestic oil production is centred on the offshore Galoc and onshore Alegria oil fields.AThe exit of international oil companies has further undermined the industryaEURtms attractiveness. Although there is potential for joint exploration activities with Mainland China in the South China Sea, the markets have not reached a concrete agreement to commit investments for exploration activities. Philippine National Oil Company and China National Oil Corporation initially agreed to jointly conduct exploration in the South China Sea, but no progress has been made due to ongoing maricreated_at disputes.Downstream refining industry faces similar challenges as the refining capacity was reduced to just one refinery following the closure of ShellaEURtms Batangas refinery in 2020. Petron contemplated investment in a 100,000 b/d condensate splitter integrated with an aromatics unit, but the project failed to take off. Refinery upgrading projects are centred on improving energy efficiency, refining margins and production of cleaner fuels. The countryaEURtms dependence in refined fuels imports has risen significantly due to the loss of supplies stemming from refinery closure. Currently, downstream fuel markets offer opportunities for fuel importers, traders and distributors, but the market is increasingly becoming overcrowded with numerous industry players.In terms of gas consumption, the Philippines presents significant opportunities for LNG and LPG imports in the short-to-long term given the lack of domestic production. Plans to build new LNG-fired power plants could offer significant opportunities for LNG imports. The government has approved six LNG import terminals, of which three began commercial operations in 2023.In addition, there is significant latent demand for LPG in the residential and commercial sectosr for cooking and other purposes, but potential demand growth remains hampered by the lack of LPG distribution infrastructures. The LPG market is heavily dominated by local firms, led by Petron and Liquigaz. Shell previously accounted a significant share of the LPG market, although it is only a minor player currently after selling off its primary LPG business in 2011 to Isla LPG.Petron has assumed the role of sole crude oil refiner in the country after Shell to permanently shut its refinery at Tabangao in 2020. Shell's plant has subsequently been converted into a fuel import terminal and serves end-users across Metro Manila, Southern Luzon and Northern Visayas.The retail fuel market is principally controlled by Petron, holding 21.3%, followed by Shell (15.6%) and Chevron (4.9%); the remaining 58.2% market share is held by several retail and wholesale companies. The LPG market is dominated by local firms, includingA Liquigaz (22.7%), S.Pacific (21.7%),A Petron (18.8%) and Pryce Gas (13.4%). \n"
  },
  {
    "id": 1909,
    "title": "China Seeks Closer Relations With US Allies Amid Trump's Return",
    "created_at": "2025-01-22",
    "text": "\nAs Donald Trump reclaims the White House, analysts believe China is taking the opportunity to reshape its diplomatic landscape, particularly with nations that former President Joe Biden sought to court during his tenure.\nIn the wake of Biden's strategy to counter China's growing influence by building alliances with \"like-minded countries,\" China has made notable progress in improving relations with the U.S.'s traditional allies—including Japan, India, and the U.K.\nWhy It Matters\nTrump's return could signal a shift toward a more unilateralist approach, providing China with the chance to recalibrate its foreign policy.\nDuring Biden's administration, the U.S. reinvigorated the Quad alliance, consisting of the United States, India, Japan, and Australia, in a bid to counterbalance China's economic and military power in the Indo-Pacific.\nWhat To Know\nWhile Beijing strengthens ties with key players in this grouping, the future of Biden's legacy in the region appears uncertain.\nSome observers predict that Trump's approach could weaken U.S. alliances, but others point out that his policies successfully rallied global partners to adopt a more competitive stance toward China.\nHow Far Along Is China in Improving Relations With Us Allies?\nDuring his first term, Trump endorsed Japan's \"Free and Open Indo-Pacific\" strategy and supported efforts to exclude Chinese telecom giants from critical networks in the U.S. and allied countries.\nBut Japan's economic rapprochement with China is still in its early stages, and India has protested Beijing's creation of two new counties in disputed border regions.\nWhat Are the Territorial Disputes in The South China Sea?\nYet, leaders in Australia, the U.K., and Japan have shown a renewed interest in bolstering relations with China, especially given the country's role as the world's largest manufacturer and a key supplier of strategic minerals.\nIn recent weeks, Chinese President Xi Jinping spoke with European Council President Antonio Costa, offering to stabilize the globe through enhanced cooperation.\nAdditionally, China and the U.K. resumed economic and financial talks after a six-year hiatus, following visits by senior officials from both nations.\nBut some countries remain cautious. The Philippines remains at odds with China over territorial disputes in the South China Sea.\nDespite a temporary deal to avoid violent confrontationslast year, tensions persist.\nTrump's statements on other international issues have already ruffled feathers among U.S. allies.\nHis recent comments about possibly annexing Greenland, a territory of NATO ally Denmark, and suggesting Canada should become the 51st U.S. state have raised concerns.\nWhat People Are Saying\nWu Xinbo, dean of the Institute of International Studies at Fudan Universityin Shanghai, said \"It is possible that Trump may drift away from U.S. allies, making them pay more attention to China's role, and in fact, it has provided a chance for China's diplomacy. I think we should grasp the chance.\"\nWu explained that for China, improving ties with U.S. allies and boosting economic cooperation is crucial to mitigating the affect of deteriorating China-U. S. relations. He said \"Improving relations with American allies will offset the shock to China-U. S. economic relations.\"\nSun Yun, director of the China program at the Stimson Center, said \"Countries want to at the minimum keep their options open. China is unlikely to be a better choice than the U.S., even under Trump, but it is important to find some counterbalance.\"\nWhat Happens Now\nDespite Beijing's warming ties with the U.K. and Japan, significant obstacles remain.\nIn Japan, senior diplomatic visits are rekindling ties, while British Prime Minister Keir Starmer has attempted to steer the U.K. back toward engagement with Beijing, distancing his government from the more confrontational stance of his predecessor, Rishi Sunak.\nThe shifting dynamics reflect a broader recalibration in global diplomacy, with nations looking to hedge their bets amid an unpredictable future under Trump.\nThis article contains additional reporting from The Associated Press\nLink to Image\n\nGraphic\n \nChinese President Xi Jinping\nSean Kilpatrick/The Canadian Press via AP, File\nChinese President Xi Jinping takes part in the Economic Leaders Meeting during the APEC summit in Lima, Peru on Nov. 16, 2024.\n"
  },
  {
    "id": 1910,
    "title": "Vietnam Looks to South Korean K9 Thunder Howitzers to Fortify Border Defenses",
    "created_at": "2025-01-22",
    "text": "\nAccording to information published on January 20, 2025, by The Korea created_ats, South Korea is nearing a milestone in its defense exports with the finalization of an agreement to supply K9 Thunder self-propelled howitzers to Vietnam. Industry and government sources indicate that negotiations between the two nations are in advanced stages, with a contract for approximately 20 units valued at $300 million expected to be finalized in the coming months. This deal would mark South Korea's first arms export to Vietnam and represent a notable development in its efforts to penetrate the Southeast Asian defense market.\nThe K9 Thunder, developed by Hanwha Aerospace, is recognized as one of the most capable artillery systems globally. Equipped with a 155 mm/52 caliber gun, it can achieve a firing range of up to 60 kilometers and is designed for long-range bombardment and rapid-response missions. Vietnams acquisition of this system aligns with its objective to modernize artillery units that currently rely on aging Soviet-era systems and Chinese Type 63 multiple rocket launchers. The expected delivery of these howitzers could enhance Vietnams defense capabilities, particularly in strategic areas near its northern border with China, where military tensions remain high.\nThe K9 Thunder features a welded steel chassis protecting 152 mm shell fragments and small arms fire up to 14.5 mm caliber. Powered by a 1,000-horsepower MTU diesel engine, it achieves a top speed of 67 km/h with a range of 360 kilometers. The system includes hydropneumatic suspension for improved mobility over challenging terrain and integrates modern systems such as CBRN protection, automatic fire control, and precise targeting capabilities. Operated by a five-person crew, the K9 combines firepower, protection, and mobility to meet the demands of contemporary battlefields.\nVietnams interest in the K9 has been evident through multiple bilateral engagements. In 2023, Vietnamese Defense Minister Phan Van Giang visited South Korea to observe the system in operation and received a detailed briefing from Hanwha Aerospace. In 2024, Vietnamese troops participated in a South Korean Army training program focused on the K9, demonstrating the system's potential role in Vietnams military modernization efforts. If finalized, the deal would make Vietnam the 11th country to operate the K9, joining nations like Australia, Poland, India, and Egypt.\nBeyond its technical advantages, this agreement highlights a strategic shift in Vietnams defense procurement policy. Traditionally reliant on Russian arms, Vietnam is diversifying its supply sources, partly due to sanctions limiting Russias defense exports. The move also reflects Vietnams intent to strengthen its land-based defenses amid increasing tensions with China, particularly concerning territorial disputes in the South China Sea. The decision to acquire the K9 is further inspired by Indias deployment of the system in mountainous terrains similar to Vietnams border regions.\nThis agreement underscores South Korea's growing prominence as a defense supplier on the global stage. With over 1,400 K9 units already delivered or under contract, the system exemplifies Seouls capability to provide advanced military equipment with competitive delivery created_atlines. South Korean manufacturers also stand out for their adaptability, offering technology transfer agreements and localized production options to meet their clients' specific needs.\nThis prospective agreement between South Korea and Vietnam signifies a dual strategic shift. For Hanoi, it represents a critical step in modernizing its armed forces and reducing reliance on Russian equipment. For Seoul, it is an opportunity to enhance its diplomatic and security influence in a region of growing geopolitical importance. If concluded, the deal would pave the way for deeper defense cooperation between the two countries and further solidify the K9 Thunders reputation as a leading self-propelled artillery system worldwide.\nDefense relations between South Korea and Vietnam have seen significant progress in recent years, driven by a series of initiatives to enhance bilateral military cooperation. In September 2024, Vietnamese Chief of General Staff General Nguyen Tan Cuong hosted South Korean Air Force Chief of Staff General Lee Young Su to discuss strengthening military ties. This meeting built on a comprehensive strategic partnership established in December 2022, aimed at advancing collaboration in areas such as maricreated_at security, defense industry, and UN peacekeeping operations. Both countries have also agreed to deepen cultural and political exchanges while supporting each others positions on key regional issues, including the denuclearization of the Korean Peninsula and stability in the South China Sea.\n"
  },
  {
    "id": 1911,
    "title": "Philippines to increase FA-50 fighter fleet, among moves analysts say complicate planning in Beijing",
    "created_at": "2025-01-22",
    "text": "\nTwo Philippine Air Force FA-50PHs in the 2024 US-Philippine joint Maricreated_at Cooperative Activity in the West Philippine Sea. (Philippine Air Force)\nSYDNEY — The Philippines has decided to double the size of its FA-50 light fighter fleet, reportedly buying another 12 from South Korea, in a move that analysts told Breaking Defense won’t get China off Manila’s back but could complicate Beijing’s plans.\nThe new order, revealed by the Philippines Department of National Defense in a Procurement Monitoring Report earlier this month, is valued at P40 billion ($683 million). The document doens’t list aircraft figures, but media reports, like the Asia Pacific Defense Journal, say it’s for a dozen of the airframes.\nThe additional fighters represent a significant leap in capability for the vast island archipelago, two analysts told Breaking Defense, but they are unlikely to pose a serious threat to China’s most advanced fighters, such as the J-20.\nChina has persistently and often daringly pressed Philippine forces to try and dislodge them from the Thomas and Sabina Shoals and other features in the South China Sea to which it lays claim.\nIn addition to any complications for China, the purchase from South Korea’s KAI, following an initial $420 million order placed in 2014, even more closely binds the Philippines to another US ally and highlights the costs to China of its bullying.\n“This purchase marks a significant departure from past policy which allowed the Philippine Air Force capability to wither in the post-Cold War years. It marks a policy failure for China as well: the exercise of adversarial grey zone tactics with the maricreated_at militia and coast guard as the vanguard for Chinese sharp power, has effectively backfired,” John Blaxland, head of The Australian National University’s Washington office and China expert, wrote in an email to Breaking Defense.\nHe said that, despite past concessions from the Philippines to China, “persistent PRC assertiveness has generated growing Philippine resolve to push back and to work more closely with other like-minded powers, other US treaty allies, including not only Korea, but Japan and Australia, and the United States itself.“\nBlaxland added, “The increased cooperation with South Korea is significant … but we shouldn’t read too much into it. After all Korea is going through an unprecedented political upheaval that could lead to a significant shift in foreign and defense policy priorities for Korea.”\nIn terms of the aircraft’s technical capabilities, Malcolm Davis, a China defense expert at the Australian Strategic Policy Institute, told Breaking Defense the FA-50 is “a capable lightweight fighter, and if flown by a well trained pilot, would certainly pose a challenge for the PLAAF’s older combat aircraft, or combat support assets such as maricreated_at patrol aircraft, or airborne early warning platforms.” But going up against Chinese fighters such as the J-16, J-20 or J-35 would be problematic.\n“At the moment they are only equipped with within visual range missiles, so the Chinese have a significant ‘first look, first shot, first kill’ advantage. As the FA-50 is upgraded in the future, with AESA radars, and BVR [Beyond Visual Range] missiles, that advantage should become less apparent,” Davis wrote in an email.\nAll this raises the bigger question, will China curtail or halt its persistent attempts to claim waters to which a UN tribunal ruled it has no valid claim?\n“China will be watching closely to see if the purchase of these aircraft affect Philippine policy towards defense of their interests in the South China Sea,” Blaxland wrote. It will be years before that’s known, “as it will take created_at for the aircraft to turn up and crews to be fully trained and prepared to use them.”\nBut he also said he thinks the purchase is especially important because the Philippines Air Force “has long been one of the weakest in the region. Its capability is less than that that which defended the country during the Pacific War in 1942. So this additional capability is a significant leap, but from a low base and China likely won’t be overly intimidated by this.”\nDavis also opined that he doubted the PLAAF will change their operational posture much as a result of the PAF getting another squadron of FA-50s. “They may rotate some of the older aircraft (i.e. older J-10s, J-11s or Su-30s) away in favor of deploying newer platforms, but I’d say their overall day-to-day readiness and (force) posture will remain in place,” he wrote.\n"
  },
  {
    "id": 1912,
    "title": "Chinese VP's Attendance At Donald Trump's Inauguration Sparks Activist Backlash",
    "created_at": "2025-01-22",
    "text": "\nChinese Vice President Han Zheng's attendance at Donald Trump's inauguration on January 20, 2025, has sparked significant backlash from activists and observers. This event marks the first created_at a senior Chinese official has attended a U.S. presidential swearing-in ceremony, which traditionally sees foreign leaders opting not to attend in person but rather sending lower-ranking officials or diplomats instead.Han's presence is seen as a diplomatic gesture from Beijing, indicating a willingness to engage with the incoming Trump administration amidst ongoing tensions between the two nations over trade, technology, and geopolitical issues. The Chinese government expressed hopes for \"win-win cooperation\" and stable bilateral relations during Han's visit. \nAnalysts suggest that this move could be interpreted as an attempt by China to reset its relationship with the U.S. following years of strained interactions under previous administrations.Activist BacklashDespite the diplomatic overtures, Han's attendance has drawn criticism from various activist groups who view it as an endorsement of Trump's policies, which they argue have been detrimental to human rights and global stability. Activists are concerned that such high-level engagement could legitimize Trump's administration, particularly given his controversial stances on issues like trade tariffs and immigration policy.Moreover, there are fears that Han's presence may overshadow critical discussions regarding China's human rights record and its aggressive stance in the Asia-Pacific region, particularly concerning Taiwan and territorial disputes in the South China Sea.ConclusionAs the inauguration unfolds, the implications of Han Zheng's attendance will likely continue to be debated among political analysts and activists alike. While it represents a significant moment in U.S.-China relations, it also raises questions about the future trajectory of diplomatic engagement under a Trump presidency characterized by both confrontation and potential cooperation.ANI\n"
  },
  {
    "id": 1914,
    "title": "WEF 2025: Global South Must Push For International Structural Reforms -- PM Anwar",
    "created_at": "2025-01-22",
    "text": "\n 22 Jan 2025 (BERNAMA News Agency) Prime Minister Datuk Seri Anwar Ibrahim emphasised that the Global South, such as BRICS, has to take a stand because the international financial structure through the International Monetary Fund (IMF) and the United Nations need to reform.\nAnwar, also the Finance Minister, noted that an alliance such as BRICS is important as a mechanism to talk about reform and not be a zero-sum game.\n'We talk about democracy but refuse to accept democratic principles and democratic accountability. The World Trade Alliance (WTA) needs to make some adjustments.\n'That is all they (the Global South) are asking for. We are not going to war. We still work under the present mechanisms,' he said during a special one-on-one exclusive dialogue with forum leadership entitled 'A Conversation with Anwar Ibrahim' at the World Economic Forum (WEF) Annual Summit 2025.\nThe session was moderated by the World Economic Forum's (WEF) founder and chairman of the board of trustees, Prof Klaus Schwab.\nAnwar pointed out that Malaysia is a trading nation, and to survive and manage as a trading nation, it has to be as friendly as possible with everyone.\nHe highlighted that Malaysia is an emerging economy, and as the chairman of ASEAN, the alliance has the principle of centrality.\n'Traditionally, we have strongly engaged with the United States and will continue to do so. China is an important neighbour; we do not have problems.\n'Of course, people highlight the issue of the South China Sea, the border, but I remind you that Malaysia is a maricreated_at country,' he added.\nThe prime minister also stressed that China has become an important player in ASEAN and has been very reasonable as they treat the bloc very seriously.\n'More seriously than many of our old allies and friends,' he said.\nAnwar said that as a country that is fiercely independent and maintains centrality, Malaysia is now engaging much more with the European Union (EU)\nHe added that Malaysia had informed the EU that it must work with the Global South and with BRICs\nAnwar is currently at the end of his three-day working visit to attend WEF 2025, marking his first attendance since assuming office in 2022.\n"
  },
  {
    "id": 1916,
    "title": "The PLA is building a fleet of barges with Taiwan in mind, analysts say",
    "created_at": "2025-01-22",
    "text": "\n New vessels - which have extendable ramps - could be part of strategy to boost amphibious capabilities by allowing for faster landings   \nNew barges being built in China could strengthen the amphibious capabilities of the People's Liberation Army against Taiwan and other targets by enabling faster landings, according to analysts. \n\"At least three\" of the barges are under construction, defence website Naval News reported earlier this month citing multiple sources. \nThe vessels are said to be equipped with ramps that can extend more than 120 metres (over 390 feet) from the front of the barge. They could be used to reach a coastal road or hard surface beyond a beach to deliver equipment such as tanks. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nIn a follow-up report last week citing recent satellite images, the Financial created_ats said six such vessels were being built at state-owned Guangzhou Shipyard International in southern China. \nMalcolm Davis, a senior analyst at the Australian Strategic Policy Institute, sad the barges were likely to be part of the PLA strategy on Taiwan. \n\"Certainly whilst these barges could be used to support other amphibious operations - for example to seize territory in the South China Sea - it is more likely they are being acquired to support the invasion of Taiwan,\" Davis said. \nBeijing regards Taiwan as part of its territory and has not ruled out the use of force to bring the self-governed island under its control. Most countries do not recognise Taiwan as an independent state but oppose any forcible attempt to change the status quo. \nWith a potential cross-strait conflict in mind, the PLA has been boosting its amphibious fleet. \nThe line-up includes the Type 075 amphibious assault ship, the Type 071 amphibious landing ship, and the next-generation amphibious assault ship unveiled last month known as the Type 076, which has an electromagnetic catapult. \nThe PLA is also making use of civilian vessels in its exercises, including a 10,000-tonne roll on-roll off passenger ferry that was part of a loading and crossing drill conducted by the 80th Group Army in August. \nBut an amphibious landing operation across the Taiwan Strait - which is some 160km (100 miles) wide at its narrowest point - would be complex and challenging. \nThere are only about 20 beaches in northern and western Taiwan that would be suitable for a PLA landing, according to a report last year by Taiwanese think tank the Institute for National Defence and Security Research. It also said the PLA did not have enough amphibious transport vehicles for the task. \nHowever, the new barges could be used to support the PLA's amphibious forces so that heavily defended beaches can be bypassed or to carry out landings in different locations, according to analysts. \nDavis said the barges would allow the PLA to rapidly deploy ground forces to the shoreline so that they can secure a beachhead, and the barges could then provide a form of offshore logistics support. \nHe said the barges were reportedly designed not just to get troops ashore but further inland onto road networks, giving landing forces fast mobility so that they do not get stuck on a beach under fire. \nLu Li-shih, a former instructor at the Taiwanese Naval Academy in Kaohsiung, also said the barges would allow for \"faster landings\" and reduce the created_at needed to clear obstacles set up to defend against attack. \nTimothy Heath, a senior international defence researcher with Rand Corporation, said during a landing operation in Taiwan the ships could also help offload equipment at ports and harbours destroyed either through combat or sabotage. \n\"However, the barges are also slow-moving targets and could be quite easily destroyed in a war, undermining their utility,\" he said, adding that for this reason he was sceptical that they were being built for a Taiwan attack. \nHeath also said that the construction of the barges did not point to an imminent plan to attack Taiwan in the absence of any other clear indicators. \n\"More likely, they are dual-use platforms that are designed primarily to support at sea commercial activity but which could also be used for a variety of war and non-war missions if they are built to military specifications,\" he said. \nChinese military analyst Song Zhongping also said the barges were dual-purpose and could be used for disaster relief as well as amphibious operations, including in the South China Sea or Taiwan. \n\"For military use, they could quickly facilitate the final few hundred metres of an amphibious landing,\" he said. \"By using an extended bridge to rapidly offload equipment such as tanks it would significantly reduce the losses that could occur in the final stretch of a landing.\" \nCollin Koh, a senior fellow with the Institute of Defence and Strategic Studies at the S. Rajaratnam School of International Studies in Singapore, agreed that the barges appeared to be designed for Taiwan. \nBut he said they would be vulnerable as they traversed the Taiwan Strait given their lack of self-defence capabilities. \n\"The voyage could be made perilous if Taiwanese forces and allies are not lying idle ... and if [the barges] don't have adequate naval and air cover they'll become sitting ducks that could easily be taken out,\" Koh said. \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1918,
    "title": "'Extremely capable' French jet lands in Darwin",
    "created_at": "2025-01-22",
    "text": "\nAfter travelling more than 2000 kilometres across the sea, French navy commander, Remi, is keen to test his European fighter jet against Australia's tropical north.\nOn Tuesday evening, three Rafale fighter pilots, including Remi, touched down in Darwin after breaking away from their Carrier Strike Group, which is currently deployed off South Asia.\nLess than 18 hours after arriving in Australia for the first created_at, Remi and his pilots will push the limits of their French-designed Rafale multirole fighter jet with a view to enhancing their ability to operate on the other side of the planet.\n\"It's very important for us to be able to fly over land in the southern hemisphere from the aircraft carrier,\" he said. \n\"We are also training a new section lead during this exercise and we will also be doing a lot of (training) on this kind of weather.\"\nThe chance to work from solid ground also gives the French visitors more created_at to work alongside the F-35 Lightning II - an airframe that Remi has seen more frequently during NATO exercises back home.\n\"We see them a lot more in Europe now,\" he said. \n\"We have opportunities to train with the F-35 in Europe and training with the Australian F-35 is a first (for me) so I'm looking forward to that.\"\nRoyal Australian Air Force Squadron Leader Jordon Sander said he was looking forward to tying in with his new French mates.\n\"We will start to uncover some basic integration lessons, for example, we talk in pounds of fuel and the French talk in terms of kilograms,\" he said.\n\"That's why we must train together, so when we need to fight together we can do it effectively.\"\nWhile its not the first created_at the Rafale fighter has graced the tarmac at RAAF Base Darwin, Squadron Leader Sander said he was looking forward to probing the European jet.\n\"It's an amazing aircraft and we're looking forward to fighting it,\" he said. \n\"We don't often get opportunities to train against different aircraft, so whenever we get that chance it's great for our crews and the Rafale jet is an extremely capable fighter.\"\nUnfortunately for Remi and his pilots, sightseeing Darwin will have to wait, with the French visitors planning to rejoin their Carrier Strike Group on Friday before setting course for the South China Sea.\nHowever, the Territory's French footprint will pick up again later this month when the French Navy's second largest warship, the Jacques Chevallier, docks at HMAS Coonawarra ahead of security talks between Canberra and Paris.\n\nNotes\nDocument links may not lead to an active page. Page maintenance is at the discretion of the publisher.\n"
  },
  {
    "id": 1920,
    "title": "The future of Europe in Davos",
    "created_at": "2025-01-22",
    "text": "\nDonald Trump's powerful comeback to lead a second presidential term in the United States is indisputable. The personal agenda he has been developing for years at his Mar-a-Lago residence and the postulates he has been proclaiming for years are today acts of power, government decisions and indisputable opinions.\nIn this scenario of unipolar redefinition, there are voices and wills that, although they may share the ideas of progress, do not share the criteria of exclusion, protectionism or economic sanctions based on political sympathies.\nFor more than half a century, the Davos Economic Forum in Switzerland has been the place where politicians, government leaders, businessmen, specialists, scientists, thinkers and social activists have converged.\nIn this forum, yesterday the voice of Ursula von der Leyen, President of the European Commission, was raised, analyzing the broad panorama facing this region of fundamental historical, political, economic, artistic and intellectual value for contemporary civilization.\nEspecially in contrast to Donald Trump's inauguration speech. We are witnessing and participating in a reconfiguration of the international political, economic and technological system.\nI reproduce just a few sentences to invite readers to know in detail his speech.\n\"From artificial intelligence to clean technology, from quantum technology to space, from the Arctic to the South China Sea: The race is on... As this competition intensifies, we will likely continue to see the frequent use of economic tools - such as sanctions, export controls and tariffs - aimed at safeguarding economic and national security... In this spirit, we will have to work together to avoid a global race to the abyss. For it is in no one's interest to break the bonds of the global economy. Rather, we need to modernize the rules to sustain our ability to produce mutual benefits for our citizens... The race starts at home. Europe has a single social market economy... We have the second largest economy and the largest trading sector in the world.\"\nIt was announced that the European Commission will present roadmap, the Competitiveness Compass that will guide its work over the next five years.\nEurope intends to replace 27 national laws to operate in the European Union under a single set of rules called \"regime 28,\" which integrates corporate law, insolvency, labor law, and taxation as a single, simple framework to compete successfully in a world of giants.\nVon der Leyen underlined: \"In the last two months we closed new alliances with Switzerland, Mercosur and Mexico. This means that soon 400 million Latin Americans will participate in a privileged partnership with 450 million Europeans\". In Europe, we play by the rules,\" she added: \"Our offers have no hidden conditions.\nThe President of the European Commission concluded her valuable speech with a thought-provoking sentence: \"The rules of engagement between global powers are changing. We must take nothing for granted. And while some in Europe may not like this new reality, we are prepared to face it.\"\nMexico Always Great, or to make our point: MAG, \"Mexico Always Great!\"\nPolitician and writer. \n"
  },
  {
    "id": 1921,
    "title": "Risk of US decoupling from China low; other countries can help manage rivalry: PM Wong",
    "created_at": "2025-01-22",
    "text": "\n The risk of the US cutting itself off from China is not high at this stage, given the \"tremendous interdependencies\" between both countries, said Prime Minister Lawrence Wong.\n And as long as they do not force others to pick sides, Singapore will be able to navigate the growing competition between them.\n \"If the United States were to cut itself off from China, it will be very damaging for the US economy and for American citizens,\" PM Wong told students at a dialogue on Jan 21. \n He added that much of what the US manufactures, produces and imports comes from China.\n \"I can't see how a full decoupling can happen at this stage,\" PM Wong said.\n He was responding to a question on how Singapore will navigate its relationship with both superpowers, hours after Mr Donald Trump was sworn in for a second term as US president. \n The dialogue was attended by close to 900 students from various educational institutions, with questions asked ranging from foreign policy to housing to social policy.\n Held at the National University of Singapore's University Cultural Centre, the session was organised by government feedback unit Reach and Varsity Voices, a student-led university initiative.\n Elaborating on US-China relations, PM Wong said the issue is that both countries are in a competition for global leadership, with deep mistrust and suspicion on both sides.\n While he believes neither side wants a direct conflict, competition will grow and there is the worry that things may go wrong, he added. \n \"Not just on the economics side, where potentially you may have more trade barriers, more technological decoupling,\" PM Wong noted. \"But even accidents and miscalculations that can happen around hot spots like the South China Sea or the Taiwan Strait.\"\n He said that Singapore has a \"close partnership\" with the US, citing areas of cooperation like defence and security, as well as cyber security, nuclear energy and outer space collaboration\n \"I am sure we can continue under the Trump presidency to strengthen that partnership,\" he added. \n \"And so long as the two countries are able to manage the competition, and not force countries like Singapore... to choose sides, and then bifurcate the world into two blocs -- the US bloc and the China bloc -- we will be able to navigate this.\"\n Such a decoupling would be cataclysmic and take the world to \"the brink of a third world war\", he added.\n But the risk of this happening is not high, PM Wong said, adding that countries can find ways to manage the situation and reduce the risk of conflict. \n \"While the US and China continue to compete vigorously, the rest of us in the world who can shape and influence events, perhaps not to the same degree as US-China, can do our part to minimise the risk of an outright decoupling or an outright conflict from happening,\" he added. \n \"Then, hopefully, we can manage the rivalry between the two superpowers, keep the peace in the world, and we can still have a reasonably good environment for us to continue thriving and flourishing,\" he said.\n"
  },
  {
    "id": 1922,
    "title": "What Portfolio Holders Need to Know About Overseas Conflicts and Their Impact on Precious Metals",
    "created_at": "2025-01-22",
    "text": "\nJanuary 22nd, 2025 ( TechBullion  - Delivered by  Newstex )\nAs geopolitical tensions continue to rise around the world, consumers may want to consider these tensions' potential economic effects.U.S. Money Reserve President Philip N. Diehl, who also served as the 35th Director of the U.S. Mint, shares his thoughts on geopolitical risk - including ways physical gold can help hedge a portfolio against it - in an edition of ' Market Insider,' U.S. Money Reserve's review of current market conditions available on the company's website and YouTube channel.Historically, warfare is one of the factors that has helped drive gold prices - an outcome we've seen in the past year, Diehl says, as the issues occurring in the Middle East spread from Gaza and Israel to the West Bank, Yemen, Syria, Iraq, and eventually Lebanon and Iran.'Other nations are now being drawn into the conflict - the U.S., our European allies, Egypt, Saudi Arabia, Jordan, and Turkey,' Diehl says.'It is no exaggeration to say [that] these are dangerous developments.'Growing Geographic Concerns\nThe warfare in the Middle East isn't the only conflict  impacting gold prices, according to Diehl.Other major disputes generating gold demand include Russia's war with Ukraine, which has also led to other nations along its western border preparing to defend themselves, and rising tensions between China and Taiwan.'Chinese President Xi [Jinping] has ordered his military to be prepared to invade Taiwan by 2027,' Diehl says.'In the meancreated_at, he is deepening military cooperation with Russia and Iran while ramping up conflict with nations bordering the South China Sea.'The Chinese economy, Diehl says, is suffering and poses the risk of Xi becoming tempted to wage war to distract citizens from their financial situations.Military conflict that occurs outside of the United States can impact numerous domestic economic elements, such as defense spending, which the U.S. government has already increased.Diehl anticipates the pace of increased defense spending will likely accelerate, which could boost the economy and create jobs - and possibly raise  inflation rates.'Western sanctions on Russia led to a sharp increase in energy prices, juicing inflation for American consumers,' Diehl says.'But sanctions also generated windfall profits and jobs for U.S. oil and gas producers, downstream operators, and liquid natural gas suppliers to Europe.'Before the Russia-Ukraine war, Ukraine was a major agricultural product exporter.As shipments declined after the Russian invasion and U.S. and global inflation rates rose, U.S. agricultural suppliers benefited from higher prices.Similarly, Diehl says, with much of the world's oil sourced from the Middle East, expectations of a wider war in the region contributed to oil prices increasing by more than 5%.According to the U.S. Money Reserve President, tensions between the United States and China are now having a notable effect on our economy.The U.S. is onshoring the production of a number of manufactured and strategic commodities that were previously imported from China, which, while raising costs, is also creating American jobs and helping to protect national security.'The impact of these conflicts is complex - except for when it comes to gold,' Diehl says.'You can look back over the last year and see the proof.When rumors of war, fears of war, or outright warfare have risen, gold follows suit.'Recommended for you\nLink to the original story.N"
  },
  {
    "id": 1923,
    "title": "Risk of US cutting itself off from China low, other countries can help manage rivalry: Singapore PM Wong",
    "created_at": "2025-01-22",
    "text": "\nJan. 22—SINGAPORE(THE STRAITS created_atS/ANN) — The risk of the US cutting itself off from China is not high at this stage, given the \"tremendous interdependencies\" between both countries, said Prime Minister Lawrence Wong.\nAnd as long as they do not force others to pick sides, Singapore will be able to navigate the growing competition between them.\n\"If the United States were to cut itself off from China, it will be very damaging for the US economy and for American citizens,\" PM Wong told students at a dialogue on Jan 21.\nHe added that much of what the US manufactures, produces and imports comes from China.\n\"I can't see how a full decoupling can happen at this stage,\" PM Wong said.\nHe was responding to a question on how Singapore will navigate its relationship with both superpowers, hours after Mr Donald Trump was sworn in for a second term as US president.\nThe dialogue was attended by close to 900 students from various educational institutions, with questions asked ranging from foreign policy to housing to social policy.\nHeld at the National University of Singapore's University Cultural Centre, the session was organised by government feedback unit Reach and Varsity Voices, a student-led university initiative.\nElaborating on US-China relations, PM Wong said the issue is that both countries are in a competition for global leadership, with deep mistrust and suspicion on both sides.\nWhile he believes neither side wants a direct conflict, competition will grow and there is the worry that things may go wrong, he added.\n\"Not just on the economics side, where potentially you may have more trade barriers, more technological decoupling,\" PM Wong noted. \"But even accidents and miscalculations that can happen around hot spots like the South China Sea or the Taiwan Strait.\"\nHe said that Singapore has a \"close partnership\" with the US, citing areas of cooperation like defence and security, as well as cyber security, nuclear energy and outer space collaboration\n\"I am sure we can continue under the Trump presidency to strengthen that partnership,\" he added.\n\"And so long as the two countries are able to manage the competition, and not force countries like Singapore... to choose sides, and then bifurcate the world into two blocs — the US bloc and the China bloc — we will be able to navigate this.\"\nSuch a decoupling would be cataclysmic and take the world to \"the brink of a third world war\", he added.\nBut the risk of this happening is not high, PM Wong said, adding that countries can find ways to manage the situation and reduce the risk of conflict.\n\"While the US and China continue to compete vigorously, the rest of us in the world who can shape and influence events, perhaps not to the same degree as US-China, can do our part to minimise the risk of an outright decoupling or an outright conflict from happening,\" he added.\n\"Then, hopefully, we can manage the rivalry between the two superpowers, keep the peace in the world, and we can still have a reasonably good environment for us to continue thriving and flourishing,\" he said.\n___\n"
  },
  {
    "id": 1927,
    "title": "UPDATE2: U.S., Japan, Australia, India agree to boost free, open Indo-Pacific",
    "created_at": "2025-01-22",
    "text": "\n U.S. Secretary of State Marco Rubio agreed Tuesday with his counterparts from Japan, Australia and India to strengthen a free and open Indo-Pacific, just hours after he was sworn in as Washington's top diplomat.\n The four foreign ministers released a joint statement saying that \"the rule of law, democratic values, sovereignty, and territorial integrity\" should be upheld in the region, following a meeting of the grouping known as the Quad.\n The meeting in Washington was the first major diplomatic event of the second presidency of Donald Trump, a day after his inauguration.\n Rubio's meeting, intended to discuss major challenges in the Indo-Pacific amid China's rise in the region, with Japanese Foreign Minister Takeshi Iwaya, Australian Foreign Minister Penny Wong and Indian Foreign Minister Subrahmanyam Jaishankar indicates that the new Trump administration could be more supportive of multilateral cooperation than generally expected.\n They said the four countries \"strongly oppose any unilateral actions that seek to change the status quo by force or coercion\" and remain committed to reinforcing \"regional maricreated_at, economic and technology security in the face of increasing threats.\"\n The statement did not single out any country. However, a Japanese official revealed that North Korea was on the agenda.\n Rubio, a former Florida senator, has taken a hard-line approach to China that aligns with Trump's stance. In his confirmation hearing before the Senate Foreign Relations Committee last week, he said China is \"the most potent and dangerous near-peer adversary\" the United States has ever confronted.\n Arriving at the State Department for his first day ahead of the meeting, Rubio delivered remarks in which he reminded officials that voters decide the course of the United States and they have elected Trump.\n \"Our foreign policy is centered on one thing, and that is the advancement of our national interest,\" Rubio said, telling them also that \"there will be changes\" in the way the department operates, but such moves were not meant to be \"destructive\" or \"punitive.\"\n He stressed that the department needs \"to move faster than we ever have, because the world is changing faster than we ever have.\"\n The diplomatic partnership of the four democracies was raised to the foreign ministerial level in 2019, during Trump's first presidency.\n His predecessor Joe Biden elevated the Quad to the leader level in 2021 and hosted the first in-person Quad summit in September of that year in Washington.\n Iwaya told reporters Tuesday night at a Washington hotel that Rubio organizing the meeting just after Trump returned to the White House on Monday meant the new administration places special value on the four-way partnership.\n The Quad's origins date back to when the four countries coordinated their emergency responses and humanitarian aid following the 2004 Indian Ocean earthquake and tsunami.\n Although the Quad is not a security alliance, it has often been regarded as a counterweight to China's growing influence. Its areas of cooperation have been expanding in recent years, ranging from maricreated_at security and infrastructure to health protection and emerging technologies.\n The four countries have repeatedly underscored that they have come together to spread values such as democratic governance and the vision of a free and open Indo-Pacific, but China has criticized the Quad as an Asian version of NATO aimed at containing its growing influence.\n Biden hosted a Quad summit last September in his home state of Delaware, at which the leaders used some of the strongest language ever issued by the group. Without mentioning China by name, they voiced \"serious concern\" over \"the militarization of disputed features, and coercive and intimidating maneuvers in the South China Sea.\"\n \"We condemn the dangerous use of coast guard and maricreated_at militia vessels, including increasing use of dangerous maneuvers,\" they said.\n Notable new initiatives announced at the created_at included the launching of joint coast guard exercises. The move was seen as augmenting the security aspect of the Quad and sending a strong signal to China that its assertive maricreated_at actions against smaller countries such as the Philippines were unacceptable.\n==Kyodo\n"
  },
  {
    "id": 1929,
    "title": "Western defense companies size up Vietnam’s military market",
    "created_at": "2025-01-22",
    "text": "\nHANOI, Vietnam — Vietnam has traditionally been a loyal client of Soviet and Russian military equipment, but Western companies are looking at the Southeast Asian nation as a market with significant potential.\nTheir interest was evident at the Vietnam International Defense Expo – VIDEX 2024 for short – held here in late December.\nAmerican prime contractors such as Boeing, L3Harris, Lockheed Martin and Textron were in Hanoi for the second edition of this biennial exposition, as well as European conglomerates like Airbus, BAE Systems, Leonardo, Rheinmetall and Thales.\nAlso remarkable at VIDEX 2024 was the presence of kit belonging to the U.S. military, while Adm. Samuel J. Paparo, head of the U.S. Indo-Pacific Command, was in attendance as well.\nThe U.S. Army displayed a Stryker 8x8 armored vehicle and M777A2 towed howitzer, whereas the U.S. Air Force dispatched two A-10C Thunderbolt II aircraft from a South Korean base, and a C-130J Super Hercules from Japan.\nThe government of Vietnam has shown interest in the Hercules to plug gaping holes in its air transportation capability. A Lockheed Martin spokesperson told Defense News that the company was highlighting the “C-130J’s tactical-by-design” capabilities at VIDEX 2024.\nThe spokesperson added, “Lockheed Martin stands ready to support Vietnam and other U.S. partners and allies across the Indo-Pacific region in meeting their current and future mission requirements across all domains.”\nA Vietnamese deal for C-130Js is not unrealistic, as Vietnam has already procured a dozen T-6C Texan II trainer aircraft from American firm Textron. Five T-6Cs were delivered last November, and the remainder will follow this year.\nWashington annulled a weapon sales ban to the Southeast Asian country in 2016, and a comprehensive strategic partnership signed during President Joe Biden’s visit to Vietnam in 2023 is paving the way for even more deals.\nMarc Knapper, U.S. Ambassador to Vietnam, said at the show: “Our goal is to ensure that Vietnam has what it needs to defend its interests at sea, in the air, on the ground and in cyberspace.”\nKnapper continued, “This is why we came out in force in a truly historic, unprecedented participation by the United States government and private sector in this event, and it reflects our commitment to Vietnam and to Vietnam’s aspirations.”\nBoeing executive Dale McDowall told Defense News that his company’s presence at VIDEX 2024 was all about building relations with Vietnam.\nMcDowall said Boeing understands that maricreated_at security is critical to Vietnam, a country bordering the South China Sea. Boeing was thus promoting its Wave Glider unmanned surface vessel and ScanEagle drones.\nThe United States, under its Maricreated_at Security Initiative, supplied six ScanEagle systems to the Vietnam Coast Guard in 2022.\nAlso, because many parts of Vietnam are inaccessible and lack airstrips, McDowall said transport helicopters like the CH-47F Chinook “have huge potential” there.\nElsewhere, Natasha Pheiffer, BAE Systems’ managing director for Asia, said, “Vietnam is a new market for us.” She added, “We really are just exploring at the moment. There are no hard and fast opportunities for us per se,” though the company was supporting the U.S. government’s promotion of the M777 howitzer.\nWorking with Vietnam presents challenges too. “There isn’t a fixed procurement program, necessarily, which does make it a little more difficult to understand what it is they’re looking for,” Pheiffer noted.\nUnsurprisingly, Russia had a very visible presence at VIDEX 2024, with large exhibition booths and several vehicles on display, including a BMP-3 infantry fighting vehicle and Rubezh coastal missile system.\nAlso out in force showing their wares at Vietnam’s blue-ribbon defense show were the Czech Republic, India, Iran, Israel, Japan, South Korea, Turkey and the United Arab Emirates. Such a diverse list is an indication of Vietnam’s efforts to diplomatically balance relations with competing powers.\nHowever, both Russian and Western suppliers must also contend with up-and-coming defense companies from Vietnam itself. Viettel, owned by the Ministry of National Defense, is Vietnam’s largest defense company.\nViettel was the most prominent exhibitor at VIDEX 2024, and it is now moving into the production of kinetic weapons. An example is the VCS-01 Truong Son coastal defense missile system now operational in the Vietnamese Navy. The VCS-01 system fires the VSM-01A missile possessing a 50-mile (80km) range.\n"
  },
  {
    "id": 1930,
    "title": "THE WORLD; Rubio meeting signals importance of the Quad alliance; Here's why secretary of State gathered with counterparts from Australia, India and Japan. (Hint: China.)",
    "created_at": "2025-01-22",
    "text": "\nOn his first full day as secretary of State, Marco Rubio met Tuesday with his counterparts from a group of countries known as the Quad, which is made up of the United States, India, Japan and Australia, representing nearly 2 billion people and more than a third of global gross domestic product. The grouping has been around for 18 years but has recently grown in importance. What exactly is it?\n--\nA diplomatic partnership, but maybe more\nThe Quad was established in 2007 to bring together countries that had worked together in response to the devastating 2004 earthquake and tsunami in the Indian Ocean. Its members stress its diplomatic nature and broad focus on regional issues, including infrastructure, humanitarian aid, disaster relief, climate change and maricreated_at security.\nEven though security is only part of the mix, the Quad is a major component of the American strategy to counter China's growing assertiveness and vast territorial claims in the region, including to virtually all of the strategically important South China Sea and the democratic self-governing island of Taiwan. As a result, the group is frequently referred to as the \"Quadrilateral Security Dialogue\" though officially it's just the Quad.\nThe strategic element to the Quad has prompted China to accuse the four countries of attempting to form an \"Asian NATO,\" though it is a very different construction and has no mutual-defense pact, a key component of the North Atlantic Treaty Organization alliance.\nStill, after a Quad summit in September, the White House stressed that the members were working with partners throughout the region to \"bolster maricreated_at security, improve maricreated_at domain awareness, and uphold a free and open Indo-Pacific.\"\n--\nHow important is it?\nNot long after its founding, the Quad fell dormant and stayed that way for a decade until President Trump in his first term agreed with the leaders of Japan, Australia and India to revive it.\nThe meetings of the countries' top diplomats were elevated under Joe Biden's presidency to summits of leaders, most recently in September in Biden's home state of Delaware. Over Biden's four years in office, defense cooperation among the Quad members has deepened. Japan, Australia and the U.S. have all increased their defense spending, with the Americans increasingly targeting the Asia-Pacific region, while India has held its expenditure steady.\nAt the Delaware summit, the countries agreed to expand the partnership among their coast guards to improve interoperability and capabilities, with Indian, Japanese and Australian personnel sailing on U.S. ships in the region.\nJapan and Australia have also been broadly revamping their defense strategies, with Australia entering the AUKUS agreement with the U.S. and United Kingdom to obtain nuclear-powered submarines and other advanced capabilities.\n--\nWhat comes next?\nIt remains to be seen whether Trump will keep the Quad at the leaders level, or turn it back to the nations' top diplomats, though the fact that there will be a meeting in Washington the day after his inauguration signals it's likely to remain important.\nFor his part, Rubio called China \"the most potent, dangerous and near-peer adversary this nation has ever confronted\" during his confirmation hearing Wednesday, and the issues that gave rise to the rebirth of the Quad in Trump's first term have only intensified.\nAmong other things, China has been pursuing its regional territorial claims more aggressively, leading to direct confrontations with the Philippines and others, and working toward establishing a true \"blue-water\" navy capable of operating in seas far from China, including advancing toward the construction of nuclear-powered aircraft carriers, in a growing global challenge.\nAhead of the meeting with Rubio, Australian Foreign Minister Penny Wong called bilateral ties with the U.S. \"our most important strategic relationship\" and said she was happy a meeting of the Quad countries was being held so soon after the inauguration.\n\"It's a demonstration of the collective commitment of all countries to the Quad, an ironclad commitment in this created_at where close cooperation in the Indo-Pacific is so important,\" she told reporters in Washington over the weekend.\n\nGraphic\n \nPHOTO: SECRETARY of State Marco Rubio, second from right, met with Japan's Takeshi Iwaya, left, India's Subrahmanyam Jaishankar and Australia's Penny Wong.  PHOTOGRAPHER:Jacquelyn Martin Associated Press \n"
  },
  {
    "id": 1932,
    "title": "UPDATE3: U.S., Japan, Australia, India agree to boost free, open Indo-Pacific",
    "created_at": "2025-01-22",
    "text": "\n U.S. Secretary of State Marco Rubio agreed Tuesday with his counterparts from Japan, Australia and India to strengthen a free and open Indo-Pacific, just hours after he was sworn in as Washington's top diplomat.\n Following a meeting of the grouping known as the Quad, the four foreign ministers released a joint statement saying that \"the rule of law, democratic values, sovereignty, and territorial integrity\" should be upheld in the region, where China is increasingly seen as engaging in assertive behavior.\n The meeting in Washington was the first major diplomatic event of the second presidency of Donald Trump, a day after his inauguration.\n Rubio's discussions of key challenges in the Indo-Pacific with Japanese Foreign Minister Takeshi Iwaya, Australian Foreign Minister Penny Wong and Indian External Affairs Minister Subrahmanyam Jaishankar could signal that the Trump administration will be more supportive of multilateral cooperation than generally expected.\n Iwaya told reporters that \"it was very meaningful\" that Rubio's debut meeting was a Quad gathering and that the first joint statement of the new U.S. administration was released by the four countries.\n Iwaya said he believes the new administration places special value on the four-way partnership, noting that they agreed to meet together on a regular basis and prepare for the next summit to be hosted by India.\n The statement said the four countries \"strongly oppose any unilateral actions that seek to change the status quo by force or coercion\" and remain committed to reinforcing \"regional maricreated_at, economic and technology security in the face of increasing threats.\"\n It did not single out any country. However, a Japanese official revealed that North Korea was on the agenda.\n The official disclosed their discussions covered the nuclear issue but added that Rubio did not characterize North Korea as a \"nuclear power,\" when asked.\n On Monday, Trump had described North Korea as a \"nuclear power\" and said he believes the country's leader Kim Jong Un should be happy to see his return as \"we got along very well\" during the U.S. president's first term.\n It was unclear if his description of North Korea marked any departure from Washington's long-held position of not officially recognizing the country as a nuclear weapons state and aiming for its complete denuclearization.\n Rubio, a former Florida senator, has taken a hard-line approach to China that aligns with Trump's stance. In his confirmation hearing before the Senate Foreign Relations Committee last week, he said China is \"the most potent and dangerous near-peer adversary\" the United States has ever confronted.\n Arriving at the State Department for his first day ahead of the meeting, Rubio delivered remarks in which he reminded officials that voters decide the course of the United States and they have elected Trump.\n \"Our foreign policy is centered on one thing, and that is the advancement of our national interest,\" Rubio said, telling them also that \"there will be changes\" in the way the department operates, but such moves were not meant to be \"destructive\" or \"punitive.\"\n He stressed that the department needs \"to move faster than we ever have, because the world is changing faster than we ever have.\"\n The Quad was raised to the foreign ministerial level in 2019, during Trump's first presidency.\n His predecessor Joe Biden elevated the diplomatic partnership of the four democracies to the leader level in 2021 and hosted the first in-person Quad summit in September of that year in Washington.\n The Quad's origins date back to when the four countries coordinated their emergency responses and humanitarian aid following the 2004 Indian Ocean earthquake and tsunami.\n Although the Quad is not a security alliance, it has often been regarded as a counterweight to China's growing influence. Its areas of cooperation have been expanding in recent years, ranging from maricreated_at security and infrastructure to health protection and emerging technologies.\n The four countries have repeatedly underscored that they have come together to spread values such as democratic governance and the vision of a free and open Indo-Pacific, but China has criticized the Quad as an Asian version of NATO aimed at containing its growing influence.\n Biden hosted a Quad summit last September in his home state of Delaware, at which the leaders used some of the strongest language ever issued by the group. Without mentioning China by name, they voiced \"serious concern\" over \"the militarization of disputed features, and coercive and intimidating maneuvers in the South China Sea.\"\n \"We condemn the dangerous use of coast guard and maricreated_at militia vessels, including increasing use of dangerous maneuvers,\" they said.\n Notable new initiatives announced at the created_at included the launching of joint coast guard exercises. The move was seen as augmenting the security aspect of the Quad and sending a strong signal to China that its assertive maricreated_at actions against smaller countries such as the Philippines were unacceptable.\n==Kyodo\n"
  },
  {
    "id": 1941,
    "title": "CNOOC Ltd 2025 Strategy Preview Call - Final",
    "created_at": "2025-01-22",
    "text": "\nCorporate Participants\n* Wang Xin\nCNOOC Ltd - General Manager - Finance\n* Xinhuai Zhou\nCNOOC Ltd - President, Chief Executive Officer, Executive Director\n* Hongtao Yan\nCNOOC Ltd - Vice President\nConference Call Participants\n* Neil Beveridge\nAB Bernstein - Analyst\n* Editor\nPresentation\nOPERATOR: Ladies and gentlemen, good afternoon. Welcome to CNOOC 2025 strategy preview briefing. I would like to introduce to you management in attendance. CNOOC Limited Vice Chairman and CEO, Mr Zhou Xinhuai; President, Mr Yan Hongtao; General Manager of Finance Department, Ms Wang Xin.\nToday's briefing will be divided into two parts. First, our finance department, Ms Wang will present to you cn's 2025 strategy preview followed by a Q&A session for the Q&A session. There will be consecutive interpretations. Now I will pass the floor to Ms Wang.\nWANG XIN, GENERAL MANAGER - FINANCE, CNOOC LTD: Investors, analysts, media friends. Good afternoon. Welcome to Sea Limited 2025 strategy preview briefing as the stand line is just around the corner. I would like to take this opportunity to wish you all a happy new year and all health are the best and a prosperous year of the snake. Before we begin. Please review the disclaimer next page please.\nToday's presentation is divided into two parts. The first is the company's operating guidance for 2025 and the second part is outlook for the future. Now, let's take a look at our company's key operating plans and targets for 2025 let's look at the macro environment first. The global economy is expected to grow by 3.2% in 2025.\nAnd China's economy is expected to grow by 5%. According to the forecast of major organizations, global oil demand will continue to rise steadily in the next few years and Brent oil price will remain at 70 to 80 us D per barrel. Overall macro environment is favorable for us to continue to consolidate our strengths and drive our high quality development based on current macro environment and the actual situation of the company and adhering to concept high quality development, we have set out our operation targets for 2025 1st. Let me share with you some key indicators. CapEx RMB125 billion to RMB135 billion.\nSo this is basically the same as 2024 production target would be 760 to 780 million BoEs. This will be a historical high level. Reserve replacement ratio won't be less than 130%. We'll continue to maintain good health safety and environment performance. Next, I will elaborate on the above.\nCapEx for 2024 was well implemented and is expected to reach about RMB132 billion the basis of supporting stable production growth. CapEx budget for 2025 will remain stable at RMB125 billion to RMB135 billion.\nOf which exploration development and production capitalization accounts for 16% 61% and 20% percent respectively. China and overseas capital expenditures accounted for 68% and 22% respectively. Exploration is the leading business of the company in 2025. We'll focus on searching for mid to large sized oil and gas fuels continue to consolidate resource base for reserves and production growth and promote medium and long term sustainable development. Through high quality exploration, we adhere to exploration plan of stabilizing oil and increasing gas and put more weight on gas stabilizing the Bohai accelerating South China Sea, expanding East China Sea and exploring Yellow Sea and strengthening overseas.\nAt the same created_at, we'll advance unconventional oil and gas exploration this year, we will continue to maintain a high level of exploration workload in China to help increase reserves and production efficiently in China. We maintain reasonable exploration investment to ensure stable crude oil reserve. We'll focus on shallow to middle play, deep water and delay and implement exploration deployments in high and South China Sea in an orderly manner focusing on new areas and fuels.\nWe will continue to strengthen natural gas exploration and deployment. Expanding the scale of exploration based on the trillion dollar atmospheric zone in the South China, focusing on shallow to middle and deep play, focusing on deep and ultra deep play exploration in Bohai and actively promoting synergistic exploration of tight gas and deep play coal bed me onshore overseas will continue to focus on deployment in countries on both sides of the Atlantic and along the Belt and Road.\nIn addition to continuing to promote drilling at Diana Project and rolling exploration at Theni project. As well as actively promoting new projects in Mozambique and Iran and other seismic exploration work will promote selection of new projects and strive to act as an operator for development investment. We will actively promote key projects at home and abroad.\nAt the same created_at, we will improve quality management of drilling and completion wells and control progress of projects to further increase production and efficiency. In terms of investment in production capitalization will continue to optimize deployment of adjusted wealth to increase production of individual wealth. Promote detailed description of oil and gas reservoir reserves to ensure stable production of oil and gas fuels promote implementation of key energy saving and decarbonization projects such as flare gas recovery.\nProduction volume is expected to reach about 720 million barrels -- million BOEs in 2024, achieving upper end of original target in 2025 we will maintain production growth with production target of 760 to 780 million BOEs. I will now introduce several key new projects this year 26 6 billion ton oil field in the central Boha has benefited from application of engineering standardization which has significant short term development cycle. Taking only three years from discovery to production.\nFirst phase of the field development project will have a peak production rate of about 22,000 barrels of oil equivalent per day. Main production facilities of Kenley 10 2 oil field cluster development project phase one located in Southern BHA consists of a central processing platform and two wellhead platforms with peak production rates of about 19,000 bo us per day.\nWeho 11 4 oil field adjustment and enclosed area development project located in South China Sea will integrate developments of new area and the secondary development of old oil field with peak production of about 17,000 BOEs per day py block. 1,011 joint development project in the eastern part of South China Sea with peak production capacity of about 14,000 eoe per day commenced production January 2nd this year, Shanghai won phase two gas development project in South China Sea with a peak production capacity of about 160 million cubic feet of natural gas and 3,900 barrels of condensate per day was commissioned in September last year and nine new wells will be commissioned in the project this year with additional production capacity of about 110 million cubic feet of natural gas per day.\nAs for new overseas projects. Yellowtail project in Guyana will start production within the year with capacity of 200 thou 250,000 BOE per day co owns a 25% interest in the project according to the operators disclosure. The star block where the project is located is expected to have eight phases of projects in operation by 2030 with total production growing to 1.3 million barrels per day and capacity reaching 1.7 million barrels per day.\nThe booze seven project in Brazil has a capacity of 225%. BOE Sso earns 7.34% interest in the project. The Boze field where the project is located is expected to have 11 phases in operation by 2027. With total production volume of 1.5 million BOE S per day and production capacity of more than 2 billion B 2 million BOE S per day.\nNow, let's take a look at the company's future outlook in the next few years. We'll continue to solidly push forward the three major programs of increasing reserve and production, scientific and technological innovation and green development and implement quality improvement efficiency enhancement. So as to continuously improve our value creation ability and brain return to shareholders. We focus on high quality development, pursue efficient production and maintain steady growth and scale with production targets of 700 to 800 million BOE S in 2026 and 810 to 830 million BOE S in 2027.\nWhile pursuing production growth, we'll continue to promote research and application of new technologies to increase oil and gas reserves and production including continuous research on key exploration and development technologies to promote construction of intelligent oil and gas fields and relying on the high energy A I model to promote deep integration of digital intelligence technology with oil and gas industry.\nAt the same created_at, we'll deepen engineering standardization and comprehensively promote construction of excellent and intelligent drilling and completion. While developing oil and gas, we also actively practice green development steadily develop shallow water wind power, continue to promote integrated development of onshore and offshore new energy sources and continuously improve level of green power substitution by utilizing onshore power projects.\nIn 2025 we expect to consume more than 1 billion kilowatt hour of green power. An increase of about 30% year on year promote industrialization of CCS CC US. Built two offshore CC US bases in Bohai and Hainan actively promote offshore CCS CC US demonstration projects in Daya Bay and Yangtze River delta and study formation of offshore CC US Industry Alliance.\nIn addition, we'll do a good job in carbon asset management and incorporate total amount of intensity of carbon emission into investment evaluation decisions in face of fluctuations in international oil price will continue to promote quality efficiency and upgrading actions, maintain stable CapEx in the future on the basis of supporting stable growth and production continue to implement stringent cost control to maintain industry leading cost competitiveness and adhere to prudent financial policies to maintain healthy financial position.\nThe company will as always attach great importance to ESG work insist on integrating ESG concepts into the company's development strategy and go system and strive to become a leading force in increasing oil and gas reserves and production. A facilitator of green and low carbon development and the backbone for building a harmonious society.\nYou can do that all along. We attach a lot of importance to shareholder return and we will share our results with shareholders in the long term, our cash dividend and also our dividend policy from 2022 to 24 has been well recognized by the market. So comparing the other companies, we have taken into consideration our present operating foundation, we have set our 2025 to 2027 dividend policy. So with the A GM dividend payout for the whole year will not be lower than 45%.\nSo we will make sure that we can pay back to shareholders and take into consideration shareholders which and also our strategic plan and we will make adjustments to our dividend policy. We will also consider market circumstances and within the consents of ATM, we will also do share buy back in the Hong Kong stock market.\nThat's all my presentation. Thank you.\nQuestions and Answers\nOPERATOR: (Operator Instructions)\nUNIDENTIFIED PARTICIPANT: (foreign language)\n(interpreted)\nThe first question is for the period 2022 to 2024. Well, we understand that the dividend absolute value was 70 Hong Kong cents per share. And I'm pleased to know that you are going to enhance your dividend payout ratio to 45%. However, this created_at, the absolute value of dividend has not been mentioned. So I would like to know what are your considerations behind this decision?\nOf course, I understand that you have to take into consideration the possible use of funds by your company and also CapEx calculation. And then the second question is about the Bohai Bay area. I would like to understand more about the future development and I believe that there will be a future regional growth potential in the area. So what are some specific plans or concrete measures that will be put in place in order to achieve regional growth around Bohai? Thank you.\nXINHUAI ZHOU, PRESIDENT, CHIEF EXECUTIVE OFFICER, EXECUTIVE DIRECTOR, CNOOC LTD: (foreign language)\n(interpreted)\nNow let me answer the first question. Well, as said just now, this year, we have not mentioned the absolute value of dividend actually in the past cycle where usually the absolute value of dividends will not be provided. However, at that created_at, the market was at a very bad or poor condition. And there are also other reasons which are well known to all of us as a result, we had also withdrawn from the US. And at that created_at, we'd like to boost market confidence and get more support from investors.\nSo that's why with the approval from our board, we'd like to stabilize confidence. And so we provided an absolute value of dividend. Well, our company has been listed for 20-odd years already and all along, we have adhered to our principle and belief of making highly effective return to our shareholders. And based on that we make and also adjust our dividend policy as such. It is very important for our shareholders to be satisfied.\nAnd so as Ms Wang just mentioned, there are a basket of factors that we usually take into consideration in formulating our dividend policy, including the actual circumstances in the market shareholders wish and also our CapEx. So these are factors to consider and then with board approval, we will also make created_atly and appropriate adjustment to our dividend policy.\nAs regards to your second question? Well, MS Wang had said that in the coming three years. If oil price is normal, then we believe, well, we believe oil price will be in the range of around USD65 to USD85. Well, if that's the case, then we expect that we will have a rather big CapEx in the amount of [RMB100 billion to RMB135 billion]. So based on the long term oil price and also cash flow and also the our judgment in relation to oil demand and supply, then we will make adjustment and also we will come to a conclusion as regards to what should be done.\nSo in the past, there was a saying that for outstanding and excellent companies, they should be able to transcend both oil price cycle. So we will need to predict oil demand and also what the importance of oil in the energy mix is going to be like. So based on all these, we will formulate our mid to long term CapEx requirement and then we will definitely discuss with our investors as well. So as to come to a consensus and with all these inputs, we will be able to improve our operations and achieve high quality development.\nLet me answer your question about Bohai. Well, for co at least within the domestic market, in particular, Bohai is a very important crude oil production base for us and it is actually a very, very big cash cow for us as well. In the past, in the past years, in the past 40 years, we have been highly efficient and effective in our exploration and development. Basically, we have already formed a mutually connecting base including the onshore electricity business. So we'll continue to develop. So that as a result, the cost of development costs can come down.\nAt the same created_at, we also have to be effective and valuable in terms of arranging an overall stereoscopic exploration in the Bohai area by using such approaches and technique, then we can be more effective and more valuable. Now, at the same created_at, we have to pay attention to the 15th 5 year plan of our country. At the same created_at, we have to also look at our group company and the limited Company 15th 5-year plan in devising all the plans and actions.\nSo for Bohai oil and gas exploration and development plans, all these will be formulated in a scientific way. We understand that in the Bohai region, both oil and gas resources are very rich. There is all sorts of different resources available including condensate and also natural gas opportunities. So in Bohai oil field, we will continue to capitalize on our highly efficient and effective development work and we will further enhance our work by means of technological innovation and with the main exploration work leading our further development work, then we can ensure and also enhance sustainability of our shallow play exploration and development work.\nAt the same created_at, we will explore more into the mid to mid or mid high value added exploration work. So at the same created_at, we will also look into the deep play exploration and development. So all in all, we aim at developing a unified and an entire overall development and exploration strategy by doing all these, we can try our best to achieve progress in the midst of stability by means of highly effective development and also achieving low cost strategy and high return for our Bohai base.\nNow, Mr Yan is going to elaborate more because he is specializing in that particular region.\nHONGTAO YAN, VICE PRESIDENT, CNOOC LTD: (foreign language)\n(interpreted)\nLet me now supplement to what Mr Zhou just mentioned. So, in relation to our Bohai area, Bohai reserve is very rich. So recently, we have made new discovery in the deep play and also shallow play area. And we have confidence that we will be able to increase both reserve as well as production. And this is very beneficial in terms of our overall oil field development.\nAt the same created_at, we have made improvement and enhancement to our engineering work, our technology and management strategies and efficiency as well. So for example, the 266 oil field, we were able to make use of very good design and construction capabilities to shorten the overall lead, the overall construction lead created_at in the same year. Just now, we also mentioned the optimization of our drilling and completion wells, for instance, for our drilling wells, our efficiency is being enhanced by 20%.\nSo as a result, our CapEx situation can also benefit from such enhancement and inefficiency. And then for the old oil fields, they are the main bodies for our production and by achieving improvement in oilfield technology, even our working partners have commended us for the improvement and advancement that we have made. Well, actually, we find operation and management is something that we are indeed good at. So in the coming five to 10 years. We hope that we are able to enhance our, our extraction and recovery rates by 10% so that it can increase from the current 35% to 45%. So we don't need the same scale of new facilities and infrastructure construction in order to achieve the same results and outcome. So that's all I would like to supplement.\nOPERATOR: Okay. Thank you. All the questions are taken by Mr Zhou Xinhui, Vice Chairman CEO of the company and added by Mr Yan Hongtao, President of the company. (foreign language)\nNEIL BEVERIDGE, ANALYST, AB BERNSTEIN: Thank you very much Neil Beverage, Bernstein. Just a couple of questions. Production growth looks to be very good this year but guidance is a bit lower than last year. I think last year you guided to [780 to 800]. This year, you guided to [760 to 780]. I also noticed the CapEx guidance is a little bit lower also than last year. So are we seeing a delay in projects? Why is the guidance lower than last year? That's my first question. My second question is about the longer term CapEx guidance.\nYou know, for next year, your guidance is RMB125 billion to RMB135 billion. Should we expect CapEx to be, relatively flat for the next three years? If oil prices stay around 70 to $80 a barrel? And how much of your CapEx is dedicated to green low carbon development. The third question is really around share buybacks. You mentioned that right at the end of the presentation, CN is net cash. You're sitting on a lot of cash generating a lot of free cash flow, you could buy back a lot of your own stock. So what sort of guidance would you give the market in terms of, how much buybacks you're prepared to do? Thank you.\nXINHUAI ZHOU: (foreign language)\n(interpreted)\nLet me answer your last question first. Concerning share buyback. Of course, we will have to go according to the consent or approval by the AGM. At the same created_at, we have to look at our own shareholding structure. Our shareholding structure is different from companies like Exxonmobil, which is quite differentiated in these few years our CapEx was at a high level.\nHowever, we will not rule out the possibility or we will not negate the use of a share buyback as a tool all along. Well, a as you mentioned, we have good cash flow. We want to make sure that we have good cash flow in order to invest into good new projects and seize investment opportunities. We will have to seize good investment opportunities by referring to the oil price cycle. And at the same created_at, try our best to achieve high quality development.\nHere's my answer to your second question for our production volume guidance. Yes, the guidance is actually higher last year than this year. In these recent years, our production growth has been quite obvious and we have been very practical and we want to devise some very sound policies and strategies so as to achieve stability. So that's the basis that we come up with the guidance of 760 to 780.\nAnd as we have already disclosed, we have already made some disposal of some of the projects. And so as a result, production volume will come down, we have to be very prudent and practical in giving production guidance and estimates. So definitely we strive to increase our production volume and we also strive to improve our position in terms of cost and competition or competitiveness. So definitely we will believe that we will go for more production volume growth. And in these few years, in fact, production growth has been quite a lot already. So at this point in created_at, we need more sound and steady strategies in order to achieve our objective.\nThen concerning our investment guidance, I think just now an answer has already been given. But let me supplement in relation to green development and green investment regarding the guidance that we have given that is RMB125 billion to RMB135 billion. Well, that has not included a green investment or investment for green development.\nSo over the years, we have been capitalizing on our strengths and advantages offshore in our exploration work and we are trying our best to achieve integrated development of oil and gas and achieve technological innovation for further enhancement. And in this way, we will be able to achieve some substitution of existing energy resources by doing more decarboniation at the same created_at.\nIn relation to onshore power, we will tap this area to achieve replacement or substitution by green power or green electricity. And concerning the shallow water wind power again, we will be focusing in this area to give full play and capitalize on our wind power resources. But we will be doing this in a high in a method that is consistent with high standards.\nAnd also we would like to achieve scale and also high return in our wind power work. We will be very proactive in tying our work to make sure that it can meet our national as well as international standards as we all know in both our country and also in the international World Energy Transformation is something that won't change. So we will capitalize on our own advantages in the development of CCUS and CCS offshore reserves and we will wait till opportunities are ripe.\nSo if conditions and opportunities are right, then we can start the relevant work and then in the future, we will we believe that all our work will be conducive to the overall transformation so that everything will be progressing towards the right direction. Thank you.\nOPERATOR: Thank you. All. Questions are taken by Mr Zhou Xinhuai, the Vice Chairman, CEO of the company.\n(foreign language)\nUNIDENTIFIED PARTICIPANT: (foreign language)\n(interpreted)\nXINHUAI ZHOU: My first question is in relation to CapEx. So if oil price is going to stay stable, then in the coming three years, we believe that your CapEx will also be rather stable and in terms of production volume, it is going to be increased from 720 million BOEs to 810 million to even 830 million BOEs. So if your CapEx is going to stay flat, are you confident that you will be able to increase production volume as mentioned just now.\nAnd then the second question is, right now in China, the plan is to increase natural gas exploration as well as production. So can you give a guidance in relation to the breakdown between oil and gas?\n(foreign language)\nNow let me take the first question. I won't elaborate too much on CapEx structure. I would just answer the last point that you raised in that particular question that is, are we confident that we are able to achieve growth in production volume while CapEx is going to remain flat? Well, we have confidence because first of all, in the past years of our exploration and development work, we have already got some very significant especially overseas projects including the Brazil project and Diana project.\nAnd so we have a lot of confidence in relation to our knowledge and our understanding of the underground conditions. And we have also built a very advanced modeling technique and technology and we have also enhanced our production management capabilities a lot. So that's why we are able to become better in our intelligence work with the use of digital intelligence. And we are also very good at lowering or improving the amount of water concentration in our operations.\nSo all these are our strengths in particular with special reference to our technological and management capabilities. The second reason is our scale effects. So overall speaking, we are doing rolling and unified operations in our development work and as a result, marginal cost will come down. So that is also one advantage of our work.\nAnd thirdly, if you look at our Diana project, we have been working with our working partners to build some very good learning curve in terms of production volume target and also the growth in our reserves as well. So we have already formulated virtuous cycle. So we have confidence that we also have the ability that in the coming three years, we will be able to live up to the production volume guidance that we have already given. Of course, if there are major changes in oil price, then definitely at that created_at, we'll have to communicate with the market again.\nAnd definitely our core is to make sure that we can continue to sharpen our competitive advantage in terms of our low cost operation. We don't want to see only production volume growth with no efficiency. So more importance is being given to our competitive advantage. At the same created_at, we have to pay attention to our safety, environmental protection and ESG work. These are some very important fundamentals in our business development.\n(foreign language)\nWe are working very hard to enhance our natural gas production volume share in the overall production. However, we do not have the specific numbers to tell you. And in fact, it is not quite convenient for us to disclose those numbers regarding Bohai actually. Right now, it has already, it has been mentioned that we are focusing domestically in the three major Bay areas and the major region and we are enhancing our technological capabilities and our management efficiency.\nHoping that by doing all these our natural gas production volume share can rise and we are working very hard with our operators at Diana. We know that Diana is an area, especially at the Star Rock Lock is an area which is very rich in natural gas resources. So we will make use of our development work which is highly efficient and effective to enhance the overall production volume share of our overseas natural gas business.\nOPERATOR: Thank you. All questions are taken by Mr Zhou Xinghua, Vice Chairman, CEO of the company.\n(foreign language)\nUNIDENTIFIED PARTICIPANT: (foreign language)\n(interpreted)\nMy first question is that you have already disposed of your US projects. However, back then, you had not announced the gain from it. So is there some information that you can share? The second question is right now, President Trump had already assumed a position and well, he mentioned drill, baby drill. So do you find it a pity that you have already made an exit out of the US? And if you look at his energy policy, what kind of change or impact would it cause to the global crude oil market? And then the third question is Canada is going to be subject to higher tariffs. So again, what will be the impact on your business results?\nXINHUAI ZHOU: (foreign language)\nWell, first of all, we have to talk about the global asset, highly efficient and highly effective allocation in terms of global asset allocation. So, as you know, we have already made disposal and we have disclosed such disposal to the market already, but such disclosure is in accordance with market disclosure rules. So if you would like to get even further, more further details, we are not in a position, it is not convenient for us to disclose more.\nAnd regarding your second question about Trump 2.0 well, for sure, there will be bigger uncertainty that is going to be caused to the oil and gas market as well as energy market as a result of Trump's return to the US administration. And we believe that we have to adopt a critical thinking methodology in analyzing such impacts when it comes to offshore oil and gas development and exploration. Well, even though you are going to start building or erecting wells right now, it doesn't mean that you can immediately increase production volume next year.\nThat is definitely impossible. And as we know that us shale oil and gas production volume has been increasing steadily and they have been doing quite highly effective development and exploration. However, we know that the work or the business is basically taken up by traditional energy companies. And so they their work and their business and operations are really based on return on investment and return on assets. So we believe that this year for shale oil, the production volume may increase, but we don't foresee a big growth of that.\nAnd if you look at oil where there are a number of different attributes of oil, if it is being taken as an investment tool or as a capital operation tools, then that may lead to a big panic. Psychologically, at the same created_at, support will then be given to demand growth for our company. All along. We have been comparing ourselves with other companies, not based on absolute value, but we are comparing in terms of our own efforts and our hard work and also our own cost structure and cost advantage and our market competitiveness. So that's how we generate value for our shareholders.\nAnd then you also asked about whether or not there will be impact from tariff. Well, certainly there will be impact from tariff. However, the impact on our company will not be big. Thank you.\nOPERATOR: Thank you. All questions are taken by Mr Zhou Xinhui, Vice Chairman CEO of the company,\nLadies and gentlemen, because of created_at, we are going to conclude the Q&A session here. Thank you very much for joining. And at this point in created_at, I would like to take the opportunity to wish you all the best in the Chinese New Year. Thank you.\nEDITOR: Portions of this transcript that are marked (interpreted) were spoken by an interpreter present on the live call. The interpreter was provided by the company sponsoring this event.\n[Refinitiv, an LSEG business, reserves the right to make changes to documents, content, or other information on this web site without obligation to notify any person of such changes.\nIn the conference calls upon which Event Transcripts are based, companies may make projections or other forward-looking statements regarding a variety of items. Such forward-looking statements are based upon current expectations and involve risks and uncertainties. Actual results may differ materially from those stated in any forward-looking statement based on a number of important factors and risks, which are more specifically identified in the companies' most recent SEC filings. Although the companies may indicate and believe that the assumptions underlying the forward-looking statements are reasonable, any of the assumptions could prove inaccurate or incorrect and, therefore, there can be no assurance that the results contemplated in the forward-looking statements will be realized.\nTHE INFORMATION CONTAINED IN EVENT TRANSCRIPTS IS A TEXTUAL REPRESENTATION OF THE APPLICABLE COMPANY'S CONFERENCE CALL AND WHILE EFFORTS ARE MADE TO PROVIDE AN ACCURATE TRANSCRIPTION, THERE MAY BE MATERIAL ERRORS, OMISSIONS, OR INACCURACIES IN THE REPORTING OF THE SUBSTANCE OF THE CONFERENCE CALLS. IN NO WAY DOES REFINITIV OR THE APPLICABLE COMPANY OR THE APPLICABLE COMPANY ASSUME ANY RESPONSIBILITY FOR ANY INVESTMENT OR OTHER DECISIONS MADE BASED UPON THE INFORMATION PROVIDED ON THIS WEB SITE OR IN ANY EVENT TRANSCRIPT. USERS ARE ADVISED TO REVIEW THE APPLICABLE COMPANY'S CONFERENCE CALL ITSELF AND THE APPLICABLE COMPANY'S SEC FILINGS BEFORE MAKING ANY INVESTMENT OR OTHER DECISIONS.]\n"
  },
  {
    "id": 1943,
    "title": "Trump 2.0: How the new administration strengthens Quad Cooperation",
    "created_at": "2025-01-22",
    "text": "\nExplore the key outcomes from the 2025 Quad Foreign Ministers' Meeting, the strategic role of India's Jaishankar, and the upcoming Quad Leaders' Summit in India. Learn about the Quad's commitment to maricreated_at security and Indo-Pacific stability.\nIn the days following President Donald Trump's inauguration for his second term, a significant diplomatic event unfolded in Washington, D.C., as the foreign ministers of the Quad nations-India, Australia, Japan, and the United States-convened for their first meeting under the new administration. This meeting marked an important step in the Quad's evolving strategic role, emphasizing the member states' shared commitment to regional stability and countering growing global challenges, particularly China's assertiveness in the Indo-Pacific.\nJaishankar's Front Row Seat: Symbolism and Significance\nA striking moment during this meeting was India's External Affairs Minister S. Jaishankar's position in the front row, sending a powerful message about India's increasing influence in global geopolitics. Jaishankar's prominent placement underscored India's strategic importance within the Quad and highlighted the growing diplomatic and security cooperation between India and the U.S.\nIn his post-meeting remarks, Jaishankar pointed out that the meeting's timing-just hours after Trump's inauguration-reinforced the priority Quad holds in the foreign policy of its member countries. He emphasized the need to deepen cooperation, expand the Quad's agenda beyond security concerns, and intensify collaboration on global issues such as maricreated_at security, technology governance, and economic resilience.\nStrengthening the Quad Amid Rising Tensions\nThe Quad, originally formed in 2007, has emerged as a critical platform for the four countries to address regional security concerns, particularly China's territorial ambitions in the South China Sea and Taiwan Strait. While some critics, notably China, claim that the Quad represents an \"Asian NATO,\" the Quad countries themselves stress that it is a diplomatic forum-not a military alliance-focused on regional stability and prosperity.\nThe U.S., represented by newly-appointed Secretary of State Marco Rubio, reiterated its commitment to working closely with its allies to ensure a \"Free and Open Indo-Pacific.\" The joint statement issued at the conclusion of the meeting highlighted the Quad's shared commitment to upholding the rule of law and territorial integrity across the region, sending a strong message to China as tensions in the Indo-Pacific grow.\nKey Takeaways from the Quad Foreign Ministers' Meeting\nA Strong Message on Regional Stability: The joint statement emphasized the importance of maintaining peace and stability in the Indo-Pacific and reinforced the Quad's commitment to ensuring that no country can unilaterally change the region's status quo. This stance is particularly significant as territorial disputes with China intensify.\nDeepening Quad Cooperation: The Quad countries agreed to expand collaboration in several critical areas, including maricreated_at security, supply chain resilience, and technological partnerships. The ministers stressed the importance of making the Quad a more effective forum for addressing global challenges, signaling their intent to broaden the Quad's focus.\nIndia's Enhanced Diplomatic Profile: Jaishankar's prominent role in the meeting reflected India's growing influence on the global stage. His remarks underscored India's intention to help shape the Quad's future direction and its desire to collaborate more closely with the U.S. and other regional powers.\nThe Strategic Imperative of the Quad: Rubio's comments highlighted the Quad's strategic significance for the U.S. and its long-standing focus on countering China's rising influence. The meeting reaffirmed the Quad's importance in Washington's Indo-Pacific strategy.\nThe Road Ahead for Quad Cooperation: The Quad nations agreed to meet regularly in the coming months to prepare for the upcoming Quad Leaders' Summit in India. This summit will serve as a crucial platform to further solidify the Quad's vision and discuss its role in addressing key regional and global challenges.\nThe Upcoming Quad Leaders' Summit in India\nOne of the most eagerly anticipated outcomes of the renewed focus on the Quad is the upcoming Quad Leaders' Summit, which will be held in India later this year. This summit will provide an opportunity for the four leaders to deepen their cooperation and chart the future course for the Quad's diplomatic, economic, and security initiatives. While the exact date has yet to be finalized, the summit is expected to coincide with President Trump's visit to India, underscoring the growing strategic alignment between the two countries.\nIndia's role as host will be a significant diplomatic milestone, signaling its importance in the Quad and its broader Indo-Pacific strategy. The summit is likely to focus on strengthening maricreated_at security, expanding economic cooperation, enhancing technological collaboration, and addressing China's increasing influence. A central theme will be reinforcing the Quad's commitment to an inclusive, free, and open Indo-Pacific, where all countries can pursue prosperity without fear of coercion.\nThe Quad Coast Guard Drills: Enhancing Interoperability\nAn important area of focus during the ministerial meeting was the expansion of joint security initiatives, particularly the Quad Coast Guard drills. These drills aim to enhance interoperability among the Coast Guards of the four countries and improve their ability to respond to maricreated_at security challenges. The exercises focus on improving coordination in maricreated_at domain awareness, search and rescue operations, and protecting critical sea lanes.\nGiven the Indo-Pacific's vast maricreated_at trade routes and contested waters, the Quad nations have placed a high priority on ensuring freedom of navigation in the region. The Coast Guard drills serve as a demonstration of the Quad's commitment to maintaining regional stability and maricreated_at security. As tensions over territorial disputes and freedom of navigation continue to grow, these drills will likely expand in scope, solidifying the Quad's role as a key player in the Indo-Pacific's security architecture.\nThe Quad's Evolving Role in Global Diplomacy\nThe first Quad Foreign Ministers' Meeting under Trump 2.0 was a pivotal moment in the Quad's evolution, emphasizing its growing importance in shaping the future of the Indo-Pacific and its commitment to regional peace and stability. The meeting underscored the Quad's unity in responding to China's growing assertiveness and highlighted India's rising diplomatic stature on the global stage.\n"
  },
  {
    "id": 1945,
    "title": "China and US partners move closer as Trump returns to the White House",
    "created_at": "2025-01-22",
    "text": "\nChina's relations are starting to improve with Japan, India and other countries that former U.S. President Joe Biden courted, just as Donald Trump brings his more unilateralist approach back to the White House.\nThe change of leadership in Washington on Monday could be an opportunity for China, which has long railed against Biden's strategy of building partnerships with \"like-minded countries\" to counter its growing influence.\nBiden reinvigorated a grouping known as the Quad — the United States, India, Japan and Australia. China's relations with all three of those U.S. partners are improving, as are its ties with Britain. The durability of Biden's legacy is now in question. During his first term, Trump didn't hesitate to challenge traditional U.S. partners.\n\"It is possible that Trump may drift away from U.S. allies, making them pay more attention to China's role, and in fact it has provided a chance for China's diplomacy,\" said Wu Xinbo, dean of the Institute of International Studies at Fudan University in Shanghai. \"I think we should grasp the chance.\"\nBut U.S. National Security Council spokesperson Brian Hughes said that Trump \"has a record of rallying the world toward a more competitive stance with China.\" Trump agreed to a Free and Open Indo-Pacific strategy that Japan introduced during his first term and he backed excluding Chinese companies from telecom networks in the U.S. and many of its partners.\nOn Tuesday, Secretary of State Marco Rubio — hours after he was sworn in — met with the foreign ministers of Australia, India and Japan in Washington, a move that suggested engaging the Quad countries and countering China's influence will remain a priority for Trump.\nFence-mending with China has limits\nBeijing's rapprochement with the U.K. and Japan is in its early stages, and major differences remain that limit and could derail it.\nIndia turned the page with China on a bitter border dispute last October, but protested when Beijing created two new counties in an area claimed by both nations.\nStill, new leaders in Australia, the U.K. and Japan have shown a desire to warm relations with China, the world's largest manufacturer and a source of strategic minerals. The government in Beijing has reciprocated in part because it wants foreign investment to help revive its economy, which could be set back if Trump follows through on a threat to impose higher tariffs.\nChinese President Xi Jinping told European Council President Antonio Costa in a phone conversation last week that both sides could bring more \"stability and certainty\" to the turbulent global situation. China and Britain restarted economic and financial talks after a six-year hiatus when the U.K. Treasury chief visited Beijing this month.\n\"From China's point of view, improving relations with American allies and increasing economic cooperation will offset the shock to China-U.S. economic relations,\" Wu said.\nTrump's statements agitate U.S. allies\nIn Washington, there's a strong bipartisan consensus that the U.S. must prevail in its economic and tech rivalry with China to maintain its global leadership.\nDuring his confirmation hearing, Rubio called China \"the most potent and dangerous near-peer adversary this nation has ever confronted.\" Biden kept the tariffs Trump levied on China and imposed more on Chinese electric cars and solar cells.\nBut unlike Biden, Trump has irked U.S. allies and partners with his recent remarks on possibly annexing Greenland, an autonomous territory of NATO ally Denmark, and making Canada the 51st American state.\nHal Brands, senior fellow at the Washington-based think tank American Enterprise Institute, said he believes some top strategists in Beijing are \"salivating at the damage they think Trump is going to do to U.S. alliances and the opportunities this creates for Beijing to resurrect some of its relationships with ... Japan and Europe that had moved in a very sharply anti-China direction since COVID.\"\nTrump's rhetoric and attempts by adviser Elon Musk to interfere in British and German politics, \"are certain to have a ripple effect,\" said Sun Yun, director of the China program at the Stimson Center in Washington.\n\"Countries want to at the minimum keep their options open,\" she said. \"China is unlikely to be a better choice than the U.S., even under Trump, but it is important to find some counterbalance.\"\nThe Philippines isn't mending fences\nChina's relations aren't improving with every U.S. partner.\nThe Philippines complained recently about what it called a \"monster\" Chinese coast guard ship in nearby waters, and the foreign ministers of Japan and the Philippines said last week they would convey to Trump the urgent need for the U.S. to remain engaged in the region.\nChina and the Philippines did reach a temporary deal last July that has prevented further violent confrontations around Second Thomas Shoal, one of several outcroppings that both countries claim in the South China Sea.\nUncertainty about Trump's policies is prompting both China and Japan to seek a stable relationship, said Taizo Miyagi, an expert on Japanese diplomacy at Chuo University in Tokyo.\nA Japanese foreign minister has visited Beijing for the first created_at in seven years, and Chinese military officials were in Tokyo last week to resume defense exchanges after a five-year hiatus.\n\"In a way it is a Trump effect,\" Miyagi said. \"Many other countries are likely thinking the same and this could invigorate their diplomatic activities.\"\nBritain steers a new course with China\nBritish Prime Minister Keir Starmer has sought to rebuild ties with Beijing since his Labour Party's election victory last summer. It's a marked shift from predecessor Rishi Sunak, who in 2022 declared an end to his country's \"golden era\" of friendship with China.\nIn Britain's case, Trump's return may not be driving the rapprochement.\nMany European leaders may not welcome Trump's America-first agenda, \"but the idea that as a result they will all kowtow to Beijing for more trade is fanciful thinking on the part of some of our Chinese friends,\" said Steve Tsang, director of the SOAS China Institute at the University of London.\nMost would prefer to remain partners with Washington. French President Emmanuel Macron, outlining his vision for global diplomacy in a New Year's speech, declared that his country was \"a solid ally\" of Trump.\nHe and others hope that Trump will respond positively to their outreach. Much will depend on what path the returning U.S. president takes, and how the rest of the world reacts.\n"
  },
  {
    "id": 1953,
    "title": "Market Chatter: South Korea Nears $300 Million K9 Howitzer Deal with Vietnam",
    "created_at": "2025-01-22",
    "text": "\n South Korea and Vietnam are finalizing an agreement to export 20 K9 howitzers for $300 million, Pulse News reported Tuesday, citing various industry sources.\nIf concluded, this would be the first Korean defense export to a communist country.\nThe artillery units are likely to be stationed near Vietnam's northern border with China, which is an area marked by historic conflicts and ongoing disputes over the South China Sea, the report said.\n(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)\n"
  },
  {
    "id": 1964,
    "title": "FOREIGN MINISTRY SPOKESPERSON MAO NING'S REGULAR PRESS CONFERENCE ON JANUARY 22, 2025",
    "created_at": "2025-01-22",
    "text": "\nThe following information was released by the Ministry of Foreign Affairs of the People's Republic of China:\nPeople's Daily: The World Economic Forum Annual Meeting 2025 is being held in Davos, Switzerland. The WEF is an important platform for discussions of global economic issues. Could you share with us China's propositions?\nMao Ning: Member of the Standing Committee of the Political Bureau of the CPC Central Committee and Vice Premier of the State Council Ding Xuexiang delivered a special address at the World Economic Forum Annual Meeting. He shared four observations: first, jointly promote a universally beneficial and inclusive economic globalization; second, jointly uphold and practice true multilateralism; third, jointly foster new drivers and strengths for global economic development; fourth, jointly tackle major global challenges such as climate change, food security and energy security.\nVice Premier Ding Xuexiang stressed that economic globalization is an inherent requirement for the development of productive forces, and an inevitable result of technological advancement. It is not a \"you-lose-I-win\" zero-sum game, but a universally beneficial process where all can benefit and win together. Protectionism leads nowhere. Trade war has no winners. It's important to tackle the development challenges with universal benefit, and pool strengths with inclusive cooperation, so as to usher in a new phase of economic globalization that is more dynamic, more inclusive and more sustainable. We need to find a win-win and all-win solution, one that is based on mutually beneficial cooperation, and not only make the pie of economic globalization bigger, but also distribute it better.\nVice Premier Ding Xuexiang gave an overview of China's economy. He shared three major trends that characterize the Chinese economy: first, high-quality development is making solid progress; second, green and low-carbon transition is accelerating across the board; third, reform and opening up is moving up to a higher level. China will further intensify macro policies, continue high-quality development, effectively pursue higher-quality economic growth and appropriately increase economic output, and inject strong and sustained impetus to global economic development.\"\nChina News Service: In a press release on January 17, the US Department of Treasury announced sanctions against relevant Chinese company and citizen that were involved with Salt Typhoon's cyberattack. What's China's response?\nMao Ning: China opposes the accusations made by the Biden administration without any convincing evidence and their abuse of sanctions against China. In fact, the US has conducted large-scale and systemic cyberattacks on China for years. We have made very clear our concerns and opposition on this for many created_ats.\nWhen it comes to cyber issues, China and the US are countries with big influence. The two sides share similar concerns on safeguarding cybersecurity, especially the security of key infrastructure. It's important for the two countries to follow the principle of equality and mutual respect, frankly discuss issues of respective concerns on the basis of fact and evidence, observe the same international rules, and jointly keep the cyberspace peaceful and stable. The US needs to stop abusing sanctions.\nTASS: On Tuesday, President Donald Trump will levy tariff on Chinese exports to the US, with an expected start date of February 1. What is China's comment?\nMao Ning: We have made clear China's position on this issue multiple created_ats. We believe that there's no winner in a trade or tariff war, and we firmly uphold our national interests.\nGlobal created_ats: The Philippines' National Bureau of Investigation said they arrested a Chinese national and two Filipinos suspected of conducting espionage operations. Armed Forces of the Philippines Chief Romero Brawner Jr. said the Chinese spy was found near the US military bases in the Philippines, and Justice Secretary Jesus Crispin Remulla said they would ensure an airtight case against the Chinese spy to uphold the Philippines' sovereignty and security. What's China's response?\nMao Ning: The Chinese government, as always, asks Chinese nationals overseas to abide by local laws and regulations. We hope the Philippines will stick to the fact, stop shadow-chasing, stop peddling the so-called \"Chinese spy,\" and earnestly protect the lawful rights and interests of Chinese nationals in the Philippines.\nKyodo News: It was reported that foreign ministers of Japan and the US, as well as foreign ministers of Quad, met in Washington on January 21 to exchange views on issues including China's attempt to change the status quo in the East China Sea and the South China Sea. What is your comment on this?\nMao Ning: China believes that cooperation between countries should not target any third party. Engaging in group politics and bloc confrontation will not bring lasting peace and security, and is not conducive to peace and stability in the Asia-Pacific and the world as a whole. China's activities in relevant waters are lawful, legitimate and completely justified. We hope that relevant parties will do more things that help enhance mutual trust and cooperation between countries.\nThe New York created_ats: Has China changed the Chinese name that it uses for Secretary of State Rubio? If so, does that have a bearing on whether or not he's covered by China's sanctions?\nMao Ning: I am not yet aware of what you mentioned. If you ask me, instead of how his name is translated in Chinese, it's his actual name in English that is more important. On the sanctions, I want to say that my colleague made clear China's position yesterday. What I can tell you is that China's sanctions are aimed at the words and actions that harm China's legitimate rights and interests.\nAFP: The Thailand government today denied that it was planning to send 48 Uyghurs held in the country's detention centers back to China. These 48 people had fled China and were arrested in Thailand over a decade ago. Can the Foreign Ministry tell us if there are any plans with Thailand to receive these Uyghurs or give us any update?\nMao Ning: I'm not familiar with what you mentioned. More broadly, China's position on the issue of illegal immigration is consistent and clear. We resolutely fight activities of illegal immigration in any form and oppose any act of condoning or even supporting illegal immigration. China is a country under the rule of law and will properly handle relevant issue by strengthening international law enforcement and security cooperation.\nDragon TV: It's reported that on January 21, a fire at a hotel in Turkiye killed 76 people and injured 51. Turkish President Recep Tayyip Erdogan announced a day of national mourning to be observed on January 22. What's China's comment?\nMao Ning: We share the grief over the fatal fire accident that took place in Turkiye's Bolu province yesterday. Our hearts go out to the victims and those who have lost their loved ones, and we wish those who were injured speedy recovery.\nAFP: There are some reports on social media of a Chinese national having been killed in an attack in north Afghanistan. These reports say that a Chinese worker in the mining industry was killed last night in Takhar province. Can the Foreign Ministry confirm or give us any details on this attack and this Chinese national?\nMao Ning: I'm not yet familiar with what you mentioned. I believe our Embassy in Afghanistan will track the information over what's happened, and do its utmost to protect the lawful rights and interests of Chinese citizens and their safety.\nBloomberg: On TikTok. US President Donald Trump has said he would be open to Elon Musk or Oracle Corp. Chairman Larry Ellison purchasing social media app TikTok as part of a joint venture with the US government. Does the Foreign Ministry have any comment on this? And how would China feel about the US government being part of a joint venture that splits the ownership of TikTok?\nMao Ning: On TikTok, my colleagues and I have repeatedly stated China's principled position over the past few days, and you may refer to that.\nReuters: Could you tell us more on how the strategic communication channel on major topics between China and the US works? Who from the China side is speaking to the US on this channel and from which arm of the Chinese government? And likewise, who is on the US end of this channel?\nMao Ning: We have no information to share at this created_at.\nAFP: With the threat of 10 percent tariffs, are there any talks happening already or any negotiations going on?\nMao Ning: What I can say is that we stand ready to maintain communication with the US, properly handle differences, expand mutually beneficial cooperation and pursue a steady, sound and sustainable development of China-US relationship. China will also firmly defend its own interests.\nRT TV: Trump, shortly after being sworn in, threatens 100 percent tariffs on BRICS nations if they continue de-dollarization efforts. Do you have any response to this?\nMao Ning: As an important platform for cooperation among emerging markets and developing countries, BRICS advocates openness, inclusiveness and win-win cooperation, not bloc confrontation, and does not target any third party. The aim is to realize common development and prosperity. China stands ready to continue working with BRICS partners to deepen practical cooperation in various fields and make more contribution to the sustained and steady growth of the world economy.\nReuters: I just wanna follow up on the Thailand-Uyghur issue. The UN human rights experts released a statement yesterday urging Thailand to immediately stop the possible transfer of the 48 Uhghurs to China. In the statement, the UN warned, to quote the statement, that the group was at real risk of torture or other cruel, inhumane or degrading treatment or punishment if they are returned. How does China respond to this statement?\nMao Ning: Judging by your question, this is a matter regarding the judicial cooperation between two sovereign states. UN experts, whatever their role is, should fulfill their mandate in a just and objective manner in line with the purposes and principles of the UN Charter and the Code of Conduct for Special Procedures Mandate-holders of the Human Rights Council, and make sure that nothing they say or do interferes in the judicial sovereignty of UN member states and their normal judicial cooperation, instead of speaking out irresponsibly on those matters.\"\nBloomberg: Secretary of State Marco Rubio met Tuesday with his Quad counterparts from Australia, India and Japan. I'm just wondering if the Foreign Ministry has any comments on the meeting.\nMao Ning: This question was raised by Kyoto News. I already gave an answer.\nNBC: I just want to know if you have a latest comment on the Panama Canal issue. President Trump warned of the danger of China taking control of the canal, and he would like to take it back from Panama. Do you have any comment on this?\"\nMao Ning: We agree with Panama's President Jose Ral Mulino that Panama's sovereignty and independence are not negotiable, and the Panama Canal is not under direct or indirect control by any power. China does not take part in managing or operating the Canal. Never ever has China interfered. We respect Panama's sovereignty over the Canal and recognize it as a permanently neutral international waterway.\n"
  }
]