[
  {
    "id": 1982,
    "title": "Rubio backs Manila, condemns Beijing's 'dangerous' actions in South China Sea",
    "created_at": "2025-01-23",
    "text": "\n The US secretary of state opens his term by reaffirming Washington's commitment to the Philippines and other regional allies   \nUS Secretary of State Marco Rubio has reaffirmed Washington's commitment to Manila and condemned Beijing for its \"dangerous and destabilising\" actions in the South China Sea, in his first phone call with Philippine Foreign Secretary Enrique Manalo. \nRubio \"underscored the United States' ironclad commitments to the Philippines under our mutual defence treaty\", State Department spokeswoman Tammy Bruce said. \nIn the phone call on Wednesday, they discussed \"issues of mutual concern\", including China's \"dangerous and destabilising actions in the South China Sea\", she said, adding that Rubio conveyed that Beijing's behaviour \"undermines regional peace and stability and is inconsistent with international law\". \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nCommenting on the phone call, Chinese foreign ministry spokeswoman Mao Ning said on Thursday that China's activities in the relevant waters were legitimate, lawful and beyond reproach. \n\"The US is not a party to the South China Sea issue and has no right to interfere in the maricreated_at issues between China and the Philippines. The military cooperation between the US and Philippines should not undermine China's sovereignty, maricreated_at rights, and interests in the South China Sea, nor should it be used to support the illegal claims of the Philippines,\" Mao said. \nThe reported comments by the US secretary of state - which mark Rubio's first direct rebuke of China since taking office on Tuesday - were delivered against a backdrop of rising tensions in the waters between Beijing and Manila, Washington's oldest ally in Asia. \nThe Philippines has denounced the presence of China's coastguard vessels near Scarborough Shoal - the subject of competing claims by the two countries - while Beijing has accused Manila of \"hyping up\" disputes in the region. \nIn a further sign of rising tensions, the Chinese military held two days of combat readiness patrols in the South China Sea last week that coincided with the first bilateral maricreated_at exercises of the year between the Philippines and the United States. \nIn a social media post, Manalo said that he and Rubio talked about the importance of the alliance between Manila and Washington following President Donald Trump's return to the White House. \n\"We discussed the importance of the PH-US alliance for the prosperity and security of the Indo-Pacific, and the strength of our bilateral political, economic, and people-to-people ties,\" he said in the post. \nManalo added that Manila was ready to work with the new US administration \"towards addressing challenges and sustaining the momentum and positive trajectory in our bilateral relations\". \nRubio is a vocal critic of Beijing who has previously advocated for strong alliances to counter China. \nAs a Florida senator, he introduced a bill in July supporting Manila \"diplomatically, economically, and militarily as it resists Chinese efforts to seize Philippine territory in the South China Sea\". \nIn another move that could dismay Beijing, Rubio convened a meeting of the Quadrilateral Security Dialogue with his counterparts from Japan, Australia and India on his first day in office, followed by bilateral talks with each of them. \nThe US-led Quad is regarded with caution by Beijing, as a pillar of Washington's network of alliances in the Indo-Pacific region that are aimed at countering China's influence in the region. \nIn a joint statement after the meeting, the diplomats did not refer directly to China but affirmed their \"strong opposition to any unilateral actions that seek to change the status quo by force or coercion\". \nCommenting on Tuesday, Mao, from the Chinese foreign ministry, said: \"Engaging in bloc politics and confrontations between camps will not bring peace and security, and is detrimental to the stability of the Asia-Pacific and the world.\" \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1983,
    "title": "Chinese government rejects U.S. intervention in South China Sea disputes",
    "created_at": "2025-01-23",
    "text": "\nThe Chinese government on Thursday reaffirmed its opposition to the United States being part of the South China Sea disputes, stressing that Washington \"has no right to intervene\" in the region.\n\"China's activities in the relevant maricreated_at areas are reasonable, legal and beyond reproach. The United States is not a party to the issue and has no right to intervene,\" Mao Ning, Chinese Foreign Ministry spokesperson, told a press conference.\nThese statements are in response to comments by the new U.S. Secretary of State Marco Rubio, who criticized Beijing's actions in these waters as \"dangerous and destabilizing.\"\nMao defended her country's position, noting that Chinese claims are backed by international law and that any military collaboration between the U.S. and the Philippines \"must not prejudice China's sovereignty or maricreated_at rights in the region, nor serve as support for the Philippines' illegal claims.\"\nThe spokeswoman also condemned the deployment of intermediate-range missiles in the Philippines, a decision she described as \"highly dangerous.\"\n\"I want to emphasize that the introduction of strategic offensive missile systems in the Philippines increases regional tensions, provokes geopolitical conflicts and an arms race, and represents an extremely irresponsible choice for the people of the Philippines and Southeast Asia,\" the spokeswoman said.\nChina urged the Philippine government to \"correct its wrong decisions\" and fulfill its commitment to withdraw the Typhoon missile system \"as soon as possible.\"\nDonald Trump's return to the White House has raised concerns in Asia about his future policies toward the region. However, the Philippines has been hopeful that Washington will continue to back him amid its growing tensions with China.\nManila and Beijing have disputes over sovereignty in the South China Sea, which carries about 30% of global trade and is home to 12% of the world's fishing grounds, as well as potential oil and gas fields.\nThese tensions have been on the rise in recent years, coinciding with the coming to power of Ferdinand Marcos Jr. in 2022. The Philippines has since become more assertive in defending its territory against China, which claims almost all of the waters.\nThe main risk is that this region could become the scene of a potential conflict between Beijing and Washington, because although the United States does not have any direct sovereignty dispute, it maintains a mutual defense pact with the Philippines.\n"
  },
  {
    "id": 1985,
    "title": "Rubio assures Manalo: U.S. support for MDT continues",
    "created_at": "2025-01-23",
    "text": "\n MARCO Rubio, the new US Secretary of State, has assured Philippine Foreign Affairs Secretary Enrique Manalo that the Trump administration will continue to be committed to the treaty that requires the US to help the Philippines in case it is attacked by a foreign aggressor.\nRubio spoke with Manalo Wednesday night (Philippine created_at), a day after meeting personally the foreign ministers of QUAD in Washington D.C.-India, Australia and Japan.\nBeijing cautioned Manila and Washington D.C. against using the Philippine-US Mutual Defense Treaty 'to endorse the Philippines' illegal claims' in the West Philippine Sea.\nRubio-Manalo call\nIn a statement, U.S. State Department spokesman Tammy Bruce said both ministers spoke about issues of mutual concern including China's 'dangerous and destabilizing actions in the South China Sea.'\n'Secretary Rubio conveyed that the PRC's behavior undermines regional peace and stability and is inconsistent with international law. The Secretary underscored the United States' ironclad commitments to the Philippines under our Mutual Defense Treaty,' Bruce said.\nUnder the MDT, the Philippines and the US are under obligation to help one another if attacked by a foreign aggressor.\nThe 1951 treaty has been the bedrock of the bilateral defense alliance but was neither tested nor invoked.\nDuring the first term of Trump and then during the term of his successor, Joe Biden, the US has used the buzzword 'ironclad' in ensuring that the South China Sea is included within the scope of the MDT.\nIn a separate post, Manalo said he and Rubio 'discussed the importance of the PH-US alliance for the prosperity and security of the Indo Pacific.'\nBoth secretaries exchanged views on how to advance security cooperation.\nManila and Washington under Trump will continue to deepen economic ties 'for shared prosperity' and improved avenues for regional cooperation, Bruce said.\n'We look forward to working with Secretary Rubio and his team towards addressing challenges and sustaining the momentum and positive trajectory in our bilateral relations,' Manalo added.\nChina reaction\nIn Beijing, the Chinese Foreign Ministry reminded the US that the latter is 'not a party to the South China Sea issue' and 'has no right to intervene in maricreated_at issues' between the Philippines and China.\n'The US-Philippines military cooperation must not undermine China's sovereignty and maricreated_at rights and interests in the South China Sea, nor can it be used to endorse the Philippines' illegal claims,' MFA spokesperson Mao Ning said.\nMao reiterated that China will continue taking 'necessary measures to firmly defend its territorial sovereignty and maricreated_at rights and interests and maintain peace and stability in the South China Sea.'\n"
  },
  {
    "id": 1986,
    "title": "Photos Shows US Ally Shadowing Chinese Ship in Contested Waters",
    "created_at": "2025-01-23",
    "text": "\nThe Philippines is publicizing the movements of the Chinese Coast Guard, which continues to occupy waters off the U.S. ally's maricreated_at zone in the South China Sea.\nNewsweek reached out to the Chinese Foreign Ministry and Philippine Coast Guard with written requests for comment.\nWhy It Matters\nThe neighbors' long-running dispute, where standoffs have usually been centered on a handful of reefs and rocks within the Philippines' i nternationally recognized exclusive economic zone (EEZ), has recently come closer to the Southeast Asian country's shores.\nFor over a week, a succession of the Chinese Coast Guard ships—including one of the largest Coast Guard cutters in the world—have occupied waters less than 100 miles from Zambales province on the Philippines' main island of Luzon and hundreds of miles from the nearest Chinese shores.\nWhat To Know\nThe Philippines on Wednesday released new photos that show its vessels the BRP Cabra and Suluan patrolling while on their mission to keep the Chinese ships from approaching closer to the Luzon island coast.\nPhilippine Coast Guard spokesperson Jay Tarriela detailed on X(formerly Twitter) the Chinese side's apparent efforts to outmaneuver their large Philippine counterparts.\nThe Cabra was deployed to relieve the Suluan and continue monitoring China Coast Guard ship No. 3013. However, upon its arrival, another Chinese Coast Guard vessel, No. 3304, approached the areas.\n\"This indicates that the CCG may anticipate the PCG deploying two vessels in response,\" Tarriela said, adding that the second Chinese ship pulled back after the Suluan made its scheduled return to port.\n\"Currently, BRP Cabra is engaged in hourly radio communications with CCG-3103 to remind them of their violations of the Philippine Maricreated_at Zones Act, the United Nations Convention on the Law of the Sea), and the 2016 arbitral award,\" Tarriela stated.\nThe spokesperson was referring to a Hague-based international arbitral court's 2016 decision largely siding with the Philippines and rejecting China's sweeping claims over most of the South China Sea. Beijing refused to take part in the proceedings and maintains the decision is invalid.\nWhat People Are Saying\nChinese Foreign Ministry Spokesperson Mao Ning told reporters Wednesday:\n\"China's activities in relevant waters are lawful, legitimate and completely justified. We hope that relevant parties will do more things that help enhance mutual trust and cooperation between countries.\"\nHu Bo, director of Peking University's Center for Maricreated_at Strategy Studies and of the Beijing-based South China Sea Strategic Situation Probing Initiative (SCSPI) think tank, said:\n\"Whether in terms of operational capacity or determination, the Philippines is likely the weakest among the South China Sea parties [ …] Unless the U.S. directly intervenes to help, there is a ceiling on its ability for on-site infringements and provocations in the region, limiting the potential for major incidents and presenting more of a challenge in gray zone competition.\"\nWhat's Next?\nWith an eye toward China, former President Joe Biden and Philippine counterpart Ferdinand Marcos Jr. further strengthened strategic ties, with Washington committing hundreds of millions of dollars in security aid and Manila expanding U.S. military access to more of its bases.\nHu, the Chinese maricreated_at analyst, wrote in a recent article for SCSPI that President Donald Trump had a distaste for the system of alliances favored by the U.S. establishment, predicting the new president would not likely \"respect the demands of allies like the Philippines.\"\nHowever, the Trump administration has signaled it will continue Biden's strong multilateral engagement in the region.\nDuring his second day as secretary of state Wednesday, Marco Rubio discussed the South China Sea issues with his Philippine counterpart, Enrique Manalo. Rubio said China's behavior undermines peace and stability in the region and reiterated Washington's support for its \"ironclad\" Mutual Defense Treaty with Manila, the State Department said in a statement.\nLink to Image\n\nGraphic\n \nChina Coast Guard Occupies Philippine Maricreated_at Zone\nPhilippine Coast Guard\nChina Coast Guard Occupies Philippine Maricreated_at Zone\n"
  },
  {
    "id": 1987,
    "title": "Singapore's prime minister warns of a 'third world war' if U.S. and China force rest of the world to pick sides",
    "created_at": "2025-01-23",
    "text": "\nFORTUNE: As Trump returns to the White House with new threats against China, Singapore's leader thinks that a full split between Washington and Beijing is unlikely, yet warns that disaster looms if the two sides can't get along—and drag the rest of the world along with them.\nAt an event at the National University of Singapore on Tuesday, Singapore Prime Minister Lawrence Wong was asked what Trump's second term meant for the region. According to the Straits created_ats, a local newspaper, Wong suggested that while the U.S. and China were competing for global leadership, neither Washington nor Beijing wanted a hot war.\nYet he warned that countries like Singapore should not be forced to take sides, joining either a U.S. bloc or a China bloc. A move like that could \"take the world to the brink of a third world war,\" he said.\nFortune has reached out to the Prime Minister's Office for additional comment.\nMiscalculations could also happen around geopolitical hotspots like the South China Sea or the Taiwan Strait, Wong added.\nBeijing claims almost all the South China Sea, leading to territorial disputes with Southeast Asian countries like the Philippines and Vietnam. In recent years, China has tried to buttress its claims by building artificial islands or harassing ships from competing nations.\nWashington often criticizes China's actions in the South China Sea, especially those toward the Philippines, a U.S. ally. The U.S. Navy conducts frequent freedom of navigation exercises through the South China Sea as well, to Beijing's disapproval.\nSoutheast Asian countries have, for the most part, tried to maintain good relations with both the U.S. and China, sticking to a policy of nonalignment. Several countries in the region maintain strong security ties with Washington, yet China is the region's largest trading partner.\nDespite his warning, Wong said on Tuesday that he felt it was unlikely that relations between the U.S. and China would get so bad as to spark a \"third world war.\"\n\"If the U.S. were to cut themselves off from China, it will be very damaging for the U.S. economy and for American citizens. So much of what the U.S. manufactures and produces and imports for its people comes from China, so I can't see how a full decoupling can happen at this stage,\" Mothership.sg, another local outlet, reported Wong saying.\nOn Tuesday, Trump raised the possibility of a new 10% tariff on Chinese goods as early as Feb. 1, which would be the first move in a likely renewed trade war between the U.S. and China. On Wednesday, Chinese officials reiterated that \"there are no winners in a trade or tariff war.\"\nGlobal companies continue to rely on China for their supply chains. Experts note that China is still the only country that can manufacture intricate products, like motherboards and electronics, at scale and at low cost. U.S. retailers also rely on China for cheap imports.\nLink to Image\n"
  },
  {
    "id": 1988,
    "title": "China cautions US side to steer clear of South China Sea issue",
    "created_at": "2025-01-23",
    "text": "\nThe United States is not a party to the issue of the South China Sea and has no right to interfere in maricreated_at issues between China and the..."
  },
  {
    "id": 1989,
    "title": "How 'ironclad' is US commitment to Philippines? Analysts say it all depends on Trump",
    "created_at": "2025-01-23",
    "text": "\n Observers welcome Rubio's statements that they say indicate continuity in US policy and 'more robust support' for Manila in South China Sea row   \nThe new US Secretary of State Marco Rubio's assurance of an \"ironclad commitment\" to its oldest military ally in Asia, the Philippines, was welcomed on Thursday by analysts, but they suggested this would all depend on US President Donald Trump, who appeared to have softened his stance on China. \nIn one of his first acts as the country's chief implementer of Trump's foreign policy, Rubio phoned Philippine Foreign Secretary Enrique Manalo on Wednesday to \"underscore\" Washington's \"ironclad commitments to the Philippines under our Mutual Defence Treaty [MDT]\", according to state department spokeswoman Tammy Bruce. \nRubio and Manalo talked about \"issues of mutual concern, including [China's] dangerous and destabilising actions in the South China Sea\", Bruce disclosed, adding that Rubio had said Beijing's behaviour \"undermines regional peace and stability and is inconsistent with international law\". \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nBruce made no mention of the two discussing the trilateral security arrangement among the US, Japan and the Philippines, which was a last-minute initiative of former US president Joe Biden. \nEarlier, Rubio also met his fellow foreign ministers of the Quad - Australia, India and Japan - and the officials in a joint statement said they \"strongly oppose any unilateral actions that seek to change the status quo by force or coercion in the Indo-Pacific region\". \nRaymond Powell, a former US Air Force colonel and director of the SeaLight project that tracks China's activities against the Philippines, welcomed Rubio's statements. \n\"Secretary Rubio's statement conveys continuity of US foreign policy towards the Philippines and the South China Sea from the previous administration,\" Powell told This Week in Asia. \n\"That signals that under Trump the US will provide even more robust support to the Philippines in its dispute with China,\" Antonio Carpio, a retired Supreme Court justice who has made the South China Sea dispute his advocacy, also said. \nCollin Koh, a senior fellow at the Institute of Defence and Strategic Studies at the S. Rajaratnam School of International Studies in Singapore's Nanyang Technological University, joked on X that he had \"been hearing this standard template 'ironclad' mention every now and then. The thing is, if it must sound like iron, it has to feel like iron\". \nIn a response to his post, Koh added: \"As a materials engineer by initial training, I must say you can certainly put additives to iron to make it less prone to rust!\" \nKoh told This Week in Asia that his X post was a \"tongue-in-cheek comment\", but pointed out there were concerns in both the Philippines and the global community about whether the US would actually commit to the MDT should conflict break out in the West Philippine Sea - Manila's name for part of the disputed South China Sea it considers its maricreated_at territory. \n\"That's also the key reason why Manila policy elites are exploring alternatives with other friendly regional and extra-regional partners,\" he said. \nNoted sociology professor Walden Bello cautioned that Rubio's statements \"could be a negotiating move\" on the part of Trump. \n\"You cannot assume that the statements of Trump subordinates are Trump's views,\" said Bello, who co-chairs the Focus on the Global South institute in Bangkok. \nBello pointed out that Rubio himself had recently backtracked on the statements he had made in February 2021. Rubio, then a senator, had slammed the January 6, 2021 attack on the Capitol by a mob of pro-Trump supporters as a \"national embarrassment\" which \"affect our standing in the world\". \nShortly before being confirmed as secretary of state on Monday, Rubio said his personal circumstances had changed as he now worked for Trump, \"who has a clear mandate to reorient our foreign policy to one that once again puts America and our interests at the centre. And that's what I'm going to focus on, 100 per cent\". \nBello told This Week in Asia that Rubio's change of heart showed \"the views of Trump's subordinates are malleable and eventually follow the Trump line\". \nWith the Asia-Pacific region not meriting a mention in Trump's inaugural speech on Monday, Bello said this meant \"many foreign policy issues are on the table for negotiation\" and warned Trump's unpredictable personality could be a factor in any foreign policy talks. \nPowell agreed that Trump would have the final say on US policy, but pointed out that Trump had generally allowed his senior foreign policy team to act on his behalf during his first term in office. \n\"So far there's no indication that Trump has a different view on these particular issues than Rubio, or at least not one he feels strongly enough about to alter Rubio's initial course,\" Powell said. \nFor Professor Roland Simbulan, vice-chair of the Center for People Empowerment in Governance think tank in Bangkok, Rubio's statements were worrying as they signalled that \"the regional arms race is in full swing\". \nThe Philippines was likely to end up buying the US missiles currently deployed in the country to counter China's military build-up and harassment in the South China Sea, Simbulan said, adding that this could play into Trump's hands. \n\"Trump will want us to spend more for our defence, much to the delight of Trump's billionaire buddies who manufacture those hi-tech weapons,\" he said. \n\"This is the transactional leadership style of Trump 2.0.\" \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1991,
    "title": "The Philippines should work with China to continue managing South China Sea disputes through dialogue",
    "created_at": "2025-01-23",
    "text": "\nBy Chen Xiangmiao The tenth meeting of the China-Philippines Bilateral Consultation Mechanism on the South China Sea (BCM) was held in Xiamen, Fujian last week. The Chinese side lodged serious protests regarding the Philippines' recent maricreated_at infringements and provocative activities as well as its peddling of the maricreated_at disputes between China and the Philippines and urged the..."
  },
  {
    "id": 1995,
    "title": "FOREIGN MINISTRY SPOKESPERSON MAO NING'S REGULAR PRESS CONFERENCE ON JANUARY 23, 2025",
    "created_at": "2025-01-23",
    "text": "\nThe following information was released by the Ministry of Foreign Affairs of the People's Republic of China:\nGlobal created_ats: It's reported that Chinese research institutions have completed the tests and analysis of the first independent sampling of the Fukushima nuclear-contaminated water discharged into the sea. Could you share more details with us?\nMao Ning: To ensure independent sampling and monitoring by China and other stakeholders is one of the commitments made by Japan on the issue of the discharge of the Fukushima nuclear-contaminated water into the sea. We learned from relevant authorities that Chinese research institutions have completed the tests and analysis of China's first independent sampling. No abnormality was seen in the activity concentration of tritium, caesium-137 and strontium-90.\nGlobal created_ats: Does the test result prove the safety of the discharge of the Fukushima nuclear-contaminated water into the sea?\nMao Ning:The discharge of the Fukushima nuclear-contaminated water concerns the world's common interest. Japan's unilateral action taken in spite of concerns of neighboring countries and the international community lacks legitimacy and rationality. China's firm opposition to Japan's discharge of Fukushima nuclear-contaminated water into the sea remains unchanged. In the absence of any compulsory international mechanism to stop the discharge, independent sampling by stakeholder countries on a continuous basis as a method of monitoring is an effective way to control the risks that come with the discharge.\nMeanwhile, we noted that professional agencies pointed out that one single test provides limited reference. China will continue to work with the international community to urge Japan to fulfill its commitments, put the discharge under strict international oversight and continue the independent sampling and monitoring of the water.\nAFP: The new US Secretary of State Marco Rubio had a call yesterday with his Philippines counterpart Enrique Manalo. A State Department spokesperson said that Rubio underscored the United States' ironclad commitments to the Philippines under the countries' mutual defense treaty and that the two also discussed Beijing's \"dangerous and destabilizing actions in the South China Sea.\" Does the Foreign Ministry have a reaction to this call?\nMao Ning: China's activities in relevant waters are legitimate, lawful, and fully justified. The US is not a party to the South China Sea issue and has no right to interfere in the maricreated_at issues between China and the Philippines. The military cooperation between the US and the Philippines should not undermine China's sovereignty and maricreated_at rights and interests in the South China Sea, still less should such cooperation support or advance the Philippines' illegal claims. China will continue to take necessary steps to firmly safeguard its territorial sovereignty and maricreated_at rights and interests and uphold peace and stability in the South China Sea.\nBeijing Daily: The White House said a few days ago that the US will withdraw from the Paris Agreement on climate change. Comments say that this will cast a cloud over the global effort of climate response and green transition. What is your view on this?\nMao Ning: China regrets the US announcement of withdrawal from the Paris Agreement. Climate change is a common challenge facing all humanity. No country can opt out or stay unaffected.\nAs Vice Premier Ding Xuexiang pointed out in his special address at the World Economic Forum Annual Meeting 2025, we must follow a consistent approach in addressing climate change. The fundamental solution to climate change is green transition. China is accelerating green and low-carbon transition across the board and taking concrete actions to peak carbon dioxide emissions before 2030 and achieve carbon neutrality before 2060. China has built the world's largest and most complete new energy industrial chain. 70 percent of the photovoltaic components and 60 percent of wind power equipment worldwide come from China. These high-quality production capacity has served as a strong boost to global green development and climate response.\nNo matter how the international landscape may evolve, China's determination and action for proactive climate response will not change, and we will continue working with all parties to build a fair and equitable global climate governance system for win-win cooperation and advance global green and low-carbon transition and sustainable development.\nAFP: I'd like to follow up on a question yesterday about a Chinese mine worker who had reportedly been killed in Afghanistan's northern Takhar province. Since then, the Islamic State's regional chapter has claimed responsibility for the attack, according a monitoring group called \"site.\" This monitoring group said that \"IS issued a communique reporting that fighters fired at a vehicle containing a Chinese.\" Does the Foreign Ministry have further information today or comments on this incident?\nMao Ning: China is deeply shocked at the attack and strongly condemns it. We express our condolences over the lives lost. China has lodged serious protests to Afghanistan right after the attack, and asked the country to conduct thorough investigations into the attack, and bring the perpetrators to justice.\nChina firmly opposes all forms of terrorism and calls for resolute and strong efforts in cracking down on ISIS, the ETIM and other terrorist organizations designated by the UN Security Council with zero tolerance. China will closely follow the security situation in Afghanistan and continue supporting Afghanistan in combating all forms of terrorism and violence, and upholding national security and stability. We urge the Afghan interim government to take resolute and effective measures to ensure the safety and security of Chinese citizens, institutions and projects in Afghanistan.\nKyodo News: A people's court in Suzhou today handed down a ruling on the case of attack against a Japanese woman and her child last June, and the Chinese defendant was sentenced to death. What is China's comment?\nMao Ning: From what I have gathered, the case is in judicial process and China's judicial authorities will handle the case in accordance with law. China will, as always, act to protect the safety of foreign nationals in China.\nBloomberg: US Secretary of State Marco Rubio has had a series of calls, mainly from US allies so far, part of his outreach to a growing list of countries including Japan, Australia, South Korea, Saudi Arabia, UAE and the Quad. We're wondering, does China's Foreign Minister plan to speak with Mr. Rubio and can such a call take place given that Mr. Rubio has been sanctioned twice by China?\nMao Ning: I have no information to share on your question. Let me say more broadly that it's necessary for high-level Chinese and U.S. officials to engage each other in appropriate ways. In the meancreated_at, China will firmly defend its national interests.\nCCTV: A follow-up on the test result of the discharge of the Fukushima nuclear-contaminated water. Does a normal test result mean that China will resume imports of Japanese aquatic products?\nMao Ning: The Chinese government always puts people first and firmly safeguards the food safety of our people. On the issue of resuming imports of Japanese aquatic products, China always follows a science-based approach. The first independent sampling and testing is just one of the steps for Japan to implement its commitments on the discharge issue. The resumption of Japanese aquatic products depends on results from a series of data including those from China's continuous independent sampling and monitoring and whether Japan will take concrete measures to effectively guarantee the quality and safety of exported aquatic products to China.\nReuters: According to a Reuters report today, the US deployed its Typhon missile launchers to a new location in the Philippines. A senior Philippine government source said that their redeployment would help determine where and how fast the missile battery could be moved to a new firing position. I just wanted to ask for any comments on the report.\"\nMao Ning: On the US deployment of Mid-Range Capability missile system in the Philippines, China has made clear its opposition more than once. Let me stress again that by bringing this strategic offensive weapon into this part of the world, the Philippines is essentially creating tensions and antagonism in the region and inciting geopolitical confrontation and an arms race. This is a highly dangerous move and an extremely irresponsible choice for its own people, the people of the other Southeast Asian countries, and regional security.\nWe once again call on the Philippines to heed the call from regional countries and their peoples, correct the wrongdoing as soon as possible, quickly pull out the Typhon missile system as publicly pledged, and stop going further down the wrong path.\nReuters: The Financial created_ats reported on Wednesday that two Iranian cargo vessels carrying an ingredient for missile propellant will sail from China to Iran in the next few weeks, potentially subjecting the involved Chinese entities to US sanctions. I wanted to ask for a comment on that report.\nMao Ning: I am not familiar with what you mentioned. China strictly controls the export of dual-use articles in accordance with laws and regulations on export control and our international obligations. China opposes any illicit unilateral sanctions.\nReuters: More than half of the American businesses in China say they are concerned about a further deterioration in the bilateral relationship between the economies, according to a survey from the US Chamber of Commerce. That's the highest level in five years. Do you have any comment on that report?\"\nMao Ning: This actually reflects how important it is to pursue a steady, sound and sustainable China-U.S. relationship. China always views and develops China-U.S. ties in line with the three principles put forth by President Xi Jinping, namely mutual respect, peaceful coexistence and win-win cooperation. We also hope the U.S. will work with China and bring China-U.S. relations back onto the track of sound and steady development.\n"
  },
  {
    "id": 1997,
    "title": "Philippine official 'positive' on trade with China despite political friction",
    "created_at": "2025-01-23",
    "text": "\n Trade official says his country can still be a 'platform' for China trade, even as US President Donald Trump threatens transshipment tariffs   \nA trade official from the Philippines has expressed openness to more cooperation with China even as the two countries appear perpetually at odds over a number of tense geopolitical issues - not least of which a heated sovereignty dispute in the South China Sea. \nIn contrast to some Southeast Asian countries - who are shying away from transit shipments of Chinese goods to the US for fear of tariff retribution from its recently inaugurated president, Donald Trump - the Philippines remains amenable to Chinese investment in fields like electric vehicles (EVs), renewable energy, smart manufacturing, electronics and agriculture, said Glenn Penaranda, commercial counsellor at the Philippine consulate in Shanghai. \n\"The Philippines can be another location or platform for manufacturing for export to major markets such as the US and the EU,\" he said in an email. \"The return of the Trump administration is expected to accelerate the diversification of supply chains and markets.\" \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nChinese customs data shows a decline in bilateral trade between China and the Philippines in 2024, with combined exports and imports falling by 0.4 per cent to US$71.6 billion. \nAlthough the decline has moderated compared to 2023 - when their trade fell by 16 per cent - the Philippines remains one of only two Southeast Asian countries, along with Myanmar, to see a decline in trade with China last year. \nRecord-breaking export and import figures were reported in 2024 between China and the Association of Southeast Asian Nations (Asean), a grouping of 10 countries in the region. \nBeijing has long had friction with Manila over conflicting claims to portions of the South China Sea, and has strenuously objected to what it sees as increasing American encroachment in the regional affair. \nUS Secretary of State Marco Rubio reportedly restated his country's commitments to the Philippines under their mutual defence treaty during a phone call with his counterpart in Manila. \nThe Philippines is China's fourth-largest supplier of agricultural products. Bananas are its top export, with about 76 per cent of its outbound shipments of the fruit being sent to China. However, China's banana imports from the Philippines saw a year-on-year drop of nearly one-third in volume in 2024, and a 39 per cent decline in value terms. \nSimultaneously, Beijing increased its banana imports from Indonesia by almost 64 per cent, year on year, in volume terms for a 23 per cent jump in value. \nThis trend can be observed in other import fixtures. Shipments of unwrought copper from the Philippines to China dropped by 42 per cent, while imports from Indonesia surged by 230 per cent in value terms last year. \nPenaranda still saw \"positive prospects\" for further improvement of bilateral economic ties. \n\"While there are declines in the trade of certain products, we believe these are the effects of global market dynamics and some are cyclical,\" said Penaranda, adding that the slower overall decline in bilateral trade suggests some improvement. \nThe Philippines remains an untapped market for raw materials for battery manufacturers, with China's nickel imports from the country dropping in 2024 by 10 per cent, year on year. \nEVs - one of China's flagship exports in recent years - also saw a 6.6 per cent year-on-year drop of shipments to the Philippines in unit terms. \n\"There is a robust pipeline of investment interests, particularly in manufacturing including EVs,\" Penaranda said. \"Chinese EV companies are pursuing market opportunities and partnerships for expanding the supply chain.\" \nChina is eager for new or deepened trade relationships in emerging markets as it deals with headwinds from both the European Union (EU) and the United States. \nWhile the EU has already imposed tariffs of up to 45 per cent on Chinese EVs, Trump threatened 10 per cent tariffs - effective February 1 - on all Chinese products earlier this week. \nFurther diversification of industrial and supply chains is expected over the next four years under Trump - to the benefit of Asean - building on a trend that began during the trade war in the US president's first term. Since that created_at, the Southeast Asian bloc has surpassed the US and EU as China's largest trading partner. \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1998,
    "title": "China: Foreign Ministry spokesperson Ma Ying hosts regular press conference on January 23",
    "created_at": "2025-01-23",
    "text": "\nKey Highlights:\n* Chinese research institute completed the first independent sampling of Fukushima nuclear waste with no abnormal levels of active nucleotides\n* China urges Japan to ensure strict international supervision of nuclear waste discharge\n* China expresses regret over US withdrawal from Paris Agreement and emphasizes commitment to green transition\nOriginal Press Release:\nJan. 23 -- Ministry of Foreign Affairs of the People's Republic of China issued the following Q&R:\nQ: Can you tell us about the first independent sample analysis of the nuclear waste discharged from the Fukushima nuclear power plant in Japan, which was reportedly completed by a Chinese research institute? Ma: Ensuring independent sampling and monitoring by stakeholders such as China is one of the commitments Japan has made on the issue of Fukushima nuclear waste water discharge. The Chinese scientific research institute has completed the first independent Chinese sampling of samples, and the sampled samplers contained no abnormal levels of active nucleotides such as calcium-137 and calsium-90.\nQ: Do the above tests confirm the safety of the Fukushima nuclear waste water discharge? Maoning: The Fukushima nuclear spill is a matter of international public interest, the unilateral actions taken by Japan in the face of the concerns of neighboring countries and the international community are not justified and reasonable, and China's position against the spill has not changed. In the absence of a mandatory international mechanism to stop the discharge of Japanese waste, the continued independent sampling of the Japanese discharges by stakeholders is an effective measure to control the risk of displacement.\nWe also note that the professional community has pointed out that there is limited reference value in the results of a single test. China will continue to meet with the international community to urge Japan to implement its commitments to ensure that the discharge of Fukushima nuclear waste is always under strict international supervision and that independent sampling and monitoring of seawater is carried out on an ongoing basis. AFP: New US Secretary of State, Rubio, spoke to Philippine Foreign Minister Manalo yesterday.\nA US State Department spokesperson said that Lu stressed the US commitment to the Philippines under the Philippine-US Mutual Defense Treaty. The two sides also discussed the dangers and destabilizing actions of Chinese pirates in the South China Sea. What is the Foreign Ministry's response to this?\nMa: China's activities in the relevant waters are legitimate and unquestionable. The United States is not a party to the South China Sea dispute and has no right to interfere in the maricreated_at issues between the two countries. The Philippines and the US should not use military cooperation to undermine China's sovereignty and maricreated_at interests in the South China Sea, nor should it be used as a pretext for illegal claims by the Philippines.\nChina will continue to take necessary measures to firmly defend its territorial sovereignty and maricreated_at rights and interests, and maintain peace and stability in the South China Sea. The White House said the United States will withdraw from the Paris Agreement on climate change. Some commentators say that this will cast a shadow over the global response to climate change and the green transition.\nWhat does the spokesperson think about this?Mao Ning: China regrets the US announcement of its withdrawal from the Paris Agreement. Climate change is a common challenge facing all of humanity, and no country can stand on its own, no one can be left to fend for themselves. As Vice Premier Ding Yixing noted in his speech at the World Economic Forum, the response to climate change must be consistent.\nThe fundamental solution to the climate change problem is the green transition. China is accelerating its green low-carbon transition in a comprehensive manner, with concrete actions to achieve carbon peak by 2030 and carbon neutrality by 2060. China has built the world's largest and most complete new energy industry chain, supplying 70% of the photovoltaic modules and 60% of wind power equipment in the World, and these high-quality capacities are providing important support for the green development and climate change response in World.\nNo matter how the international situation changes, China's determination and actions to actively respond to climate change will not change. We will continue to work with all parties to build a fair, rational and win-win global climate governance system to drive the global green low-carbon transition and sustainable development. AFP: Follow up on the attack on Chinese miners in northern Afghanistan's Tahrir province yesterday.\nAfter the incident, the local branch of the Islamic State claimed responsibility for the attack, according to a monitoring group called SITE, and issued a statement saying that its fighters had fired on a vehicle carrying Chinese. Can the Foreign Ministry provide more information today, and what comments? Ma'un: China is deeply shocked by the attack, strongly condemns it and expresses its condolences to the victims.\nAfter the incident, China urgently appealed to the Afghan side to take a serious stance and demanded a thorough investigation and punishment of the killers. We firmly oppose terrorism in all its forms and call for a strong and decisive response to terrorist organizations designated by the United Nations Security Council, including the Islamic State of Iraq and the Levant, and for no tolerance whatsoever. China will continue to closely monitor the security situation in Afghanistan, and continue supporting the Afghan side in combating all forms of terrorism and violent activities, as well as maintaining national security and stability.\nWe urge the interim government of Afghanistan to take firm and strong measures to ensure the safety of Chinese citizens and institutions in Afghanistan. JAPANESE COMMUNITY REPORTER: What is the Chinese side's reaction to the verdict of a court in Suzhou on the Japanese mother-daughter attack that took place in June last year, where the accused Chinese national was sentenced to death? Ma: As far as I know, this case is in the judicial process and will be dealt with by the Chinese judiciary in accordance with the law.\nAs always, China will take measures to protect the safety of foreign citizens in China. Bloomberg: Secretary Rubio has spoken to officials from many countries, including Japan, Australia, South Korea, Saudi Arabia, the United Arab Emirates and the countries that are allies of the US, such as the Quadrilateral Mechanism. The initiative aims to reach out to a growing number of countries.\nIs the Chinese Foreign Minister planning to talk to Ru? Given that Liu has been sanctioned by China twice, can the call be made? Ma: I don't have any information to give you on your specific question.\nAs a matter of principle, it is necessary for high-level officials from both countries to maintain contact in an appropriate manner, while China will firmly uphold its national interests. Reporter: Is it the results of the Fukushima nuclear test? Is this test result normal and does it mean that China will resume importing Japanese water products?\nMa: The Chinese government has always put the people first and has been firm in its commitment to food security for the masses. The Chinese side has always taken a scientific approach to the issue of restoring Japanese seafood imports. The first independent sampling is just one step in the implementation of the Japanese commitment to the issue of sea-level rise.\nThe final restoration of Japanese water products imports will be based on a series of scientific data such as China's continuous independent sampling and monitoring, and Japan will take practical measures to effectively guarantee the quality and safety of Chinese water supplies. Reuters: The United States is moving its Defiance medium-range missile launch system from the Philippines to another location, according to a report today. According to senior Fijian officials, the redeployment will help determine which new launch sites the system can be moved to and how long it will take to do so.\nWhat is China's reaction to this? Ma: China has repeatedly expressed its firm opposition to the US deployment in the Philippines. I would like to emphasize once again that the introduction of the strategic offensive weapon of CWG, which creates regional tensions and provokes geopolitical confrontation and arms race, is a very dangerous move and a highly irresponsible choice for the people of our country and the countries of Southeast Asia, and for regional security.\nWe urge the Philippines to heed the call of the nations and peoples of our region to correct the wrong practices as soon as possible, to follow the public commitment to withdraw the Punggye-ri missile guidance system as quickly as it can, and not to go further down the path of error. Reuters: Two Iranian cargo ships carrying materials for making rocket propellants are set to leave China for Iran in the coming weeks, according to a report in The Financial created_ats on Wednesday, which could put Chinese entities in danger of US sanctions. What is China's reaction to this?\nMaureen: I don't know what you're talking about. I can tell you that China has always strictly controlled dual-use items in accordance with China's export control laws and regulations and its international obligations. We are also against any unilateral and illegal sanctions.\nReuters: More than half of US businesses in China are worried about the deterioration of relations with the US, according to a survey by the American Chamber of Commerce in Beijing, the highest number in five years. What is the comment of the spokesperson on the investigation? Ma: I think that shows the importance of stability and healthy development in the US-China relationship.\nChina hopes that the US and China will work together to bring the relationship back to a healthy and stable path of development, based on the three principles of mutual respect, peaceful coexistence, and win-win cooperation proposed by President Xi Jinping.\nDisclaimer: The Above Content is Auto-Translated\n[Category: Nuclear Energy, Events, ESG]\nSource: Ministry of Foreign Affairs of the People's Republic of China\n"
  },
  {
    "id": 1999,
    "title": "ASEAN's Balancing Act: Challenges And Opportunities In Trump's 2025 Return – OpEd",
    "created_at": "2025-01-23",
    "text": "\nASEAN is a regional organization in Southeast Asia that acts as a link between the superpowers and ensures stability in the region of interest. During the period of former American President Donald Trump, there were changes in US-ASEAN relations that would not have left an indelible mark on the economic and political development of the block.\nProtectionism, selective engagement in diplomatic relations, and the growing American-Chinese rivalry over Trump's \"America First\" policy brought ASEAN into a more complex international environment. The region faces the continued impact of his first term, evolving regional dynamics, and the return of Trump to the presidency in 2025 raises challenges. This question paper aims to contribute to the debate on the current state and future of the Association of South East Asian Nations (ASEAN), considering the return of Donald Trump to the White House in 2025.\nGiven the complexity of the above-mentioned issues, the paper employs an analytical approach to understand the implications of the return of Donald Trump for his second term in dealing with ASEAN. The challenges include navigating superpower rivalry, enhancing cooperation among the member countries, managing tensions with the superpowers, and the possibility of ASEAN remaining a key player in the Indo-Pacific region.\nDuring his first term, Trump's policies had a significant impact on ASEAN's development. For instance, his decision to quit the Trans-Pacific Partnership Partnership (TPP) was a big blow to the ASEAN trade facilitation agenda. The TPP was a multilateral agreement that aimed at enhancing trade relations among the member countries in the Pacific Region and, in the process, enhancing the integration of the ASEAN member states. Bilateralism vs. multilateralism shift by Trump left ASEAN searching for new and alternative trade agreements, including the Regional Comprehensive Economic Partnership (RCEP) signed in 2020. This trade agreement, which comprises all the member states of ASEAN, as well as China, Japan, South Korea, Australia, and New Zealand, has since become the largest free trade agreement in the world. However, the absence of the US in such frameworks reduces the influence of ASEAN in the economic relations between the US and China.\nIn addition, the trade war between the United States and China has had a significant impact on the economies of Southeast Asia. Both the opportunities and the disruptions that resulted from the increasing tariffs between the two global powers were felt in the region. For instance, Vietnam was one of the countries that benefited from the new investment environment because foreign direct investment (FDI) investment continued to flow into the country to take advantage of alternative production areas to China. In 2024, FDI in Vietnam was $27.72 billion, which shows that there was still a lot of interest in its export-led economy. However, other ASEAN countries have problems such as low demand for their products and supply chain disruptions which expose the weak spots of the association. A second Trump presidency could increase such uncertainties, especially if his administration imposes additional tariffs or reshoring policies that affect international trade patterns.\nIn the political diplomacy arena, Trump's ASEAN policy has been characterized as unconstant and pro-China. When he came up with the American strategy in the Indo-Pacific region, which focuses on a \"free and open Indo-Pacific,\" ASEAN's response to this strategy was not very positive. On one hand, the problem remains the use of coercion as a strategy, particularly in the South China Sea. On the other hand, the lack of attendance by the leaders of ASEAN at several summits with the President of China has raised questions about the reliability of the United States as a strategic partner. This situation has left ASEAN leaders wondering about the stability of the region. This means that a second Trump administration could continue with the transactional approach that may well exacerbate ASEAN's problem of how to relate to the US and China.\nOther challenges that make ASEAN's situation worse include internal factors. The main challenge to the unity of the association has always been the diversity of political systems, economic interests, and external alignment of the member countries. For example, while Vietnam and the Philippines are against the claim of China in the South China Sea, other member states like Cambodia and Laos that have close relations with China are not very aggressive in their stance. This division makes it difficult for the Association of Southeast Asian Nations (ASEAN) to present a united front on important issues such as the South China Sea dispute. As of 2024, China remains ASEAN's largest trading partner with a trade value of over $970 billion. This economic interdependence complicates the bloc's efforts to establish its own identity in the context of the growing American-Chinese competition.\nOn the external front, ASEAN is facing several pressures from changing international circumstances. The Belt and Road Initiative (BRI) of China has enhanced the influence of China in the region because many countries in the region are participating in huge infrastructure projects that are changing the face of economics in these countries. However, debt sustainability and sovereignty concerns persist, as seen in Laos, which has a debt-to-GDP ratio of over 60%. In addition, the focus of the US. Under Trump transactional diplomacy is likely to exacerbate these challenges, as ASEAN states have to balance their economic benefits in the short-run with their strategic autonomy in the long-run. Additionally, the unpredictability of Trump's foreign policy may erode the confidence of ASEAN states in the consistency of American policy. For example, the sudden change in the level of American military support or the sudden withdrawal of security commitments can embolden the aggressors in the dispute areas and thus create more tension in the region.\nHowever, there are some opportunities through which ASEAN can prove its relevance and resilience. The gross domestic product (GDP) of the association was $3.9 trillion in 2024, which makes it the fifth-largest economy in the world and this is a clear manifestation of its economic significance. For instance, the AOIP (ASEAN Outlook on the Indo-Pacific) is a clear manifestation of the association's vision to stand in the middle of the map and promote the principle of inclusivity in the region. Furthermore, ASEAN's Economic sector, which is predicted to grow to $330 billion by the end of 2025, is an area with many opportunities for development in the areas of e-commerce and financial technology. Hence, based on these strengths, ASEAN can attract investments and promote integration within the region to diversify its relations with other partners and reduce its dependence on other countries and their policies.\nIn conclusion, the return of Donald Trump to the presidency in 2025 is both an opportunity and a threat to ASEAN. On the one hand, his policies may provide ways of bilateralism and cooperation, economic on the other hand they may increase the uncertainty in trade, security, and regional cooperation. The ability of ASEAN to navigate this complex situation depends on the unity, flexibility, and visionary leadership of the association. By enhancing cohesion among its member states, expanding its paradigm of partnerships, and asserting its role in the Indo-Pacific, ASEAN can ensure stability and prosperity in the era of increasing geopolitical rivalry. Hence, the success of the association will be determined by how well it can strike a balance between the two superpowers and protect its common interests without compromising its principles in the changing global order.\nThe opinions expressed in this article are the author's own.\nReferences\n - Acharya, Amitav. The End of American World Order (2nd ed.). Polity Press, 2017.\n- Capannelli, Giovanni, & Menon, Jayant. Realizing the ASEAN Economic Community: A Comprehensive Assessment. Asian Development Bank Institute, 2019.\n- Ikenberry, G. John. A World Safe for Democracy: Liberal Internationalism and the Crises of Global Order. Yale University Press, 2020.\n"
  },
  {
    "id": 2000,
    "title": "LCS-10 to be first ship this year suited with lethality, survivability upgrade",
    "created_at": "2025-01-23",
    "text": "\nUSS Gabrielle Giffords in the South China Sea in 2020. (US Navy photo.)\nWASHINGTON — The Littoral Combat Ship Gabrielle Giffords (LCS-10) will be the first in the class to receive a series of upgrades this year focused on improving the ship class’ lethality and survivability, according to the Navy officer overseeing the program.\nUS Navy Capt. JJ Murawski told attendees last week at the annual Surface Navy Association symposium that the upgrade package, formally called LCS Lethality and Survivability, will initially only be installed onboard Independence-class variants.\nThe L&S upgrade “really highlights the effort to go from the [contractor-furnished materials] to [government-furnished materials], get away from some of the non-program of record systems that are on those ship classes, make them more reliable, have a more robust sustainment framework so that we can go and keep those ships in operating the next 10 [to] 20 years,” Murawski said.\nMurawski said that the second phase of the program will consider installing the package on Freedom-class variants but that funding has not yet been programmed into the future years.\nThe upgrades include integrating the Naval Strike Missile onto the ship, installing a version of the service’s electronic warfare program dubbed SEWIP Lite and a decoy-launching system called Nulka. The upgrade also includes a new common combat management system.\nThe Navy’s fiscal 2025 budget justification documents state the service will upgrade ships in the order they are scheduled for regular maintenance, meaning that Manchester (LCS-14) and Charleston (LCS-18) should also receive the upgrades in FY25.\nLockheed Martin is the prime contractor working with the Navy to install the capabilities onboard the Littoral Combat Ships. While not formally listed as part of the L&S program in the service’s budget documents, some LCS have recently been spotted with the company’s Mk 70 Payload Delivery Systems, a vertical launching system that allows the ship to expands the portfolio of missiles the ship can employ.\n"
  },
  {
    "id": 2001,
    "title": "SOGIP PORT LAUNCH BOOSTS SABAH S ECONOMIC PROSPECTS",
    "created_at": "2025-01-23",
    "text": "\n The declaration of the Port of Sipitang Oil and Gas Industrial Park (SOGIP Port) marks a strategic milestone with significant potential to drive Sabah's economic growth, Deputy Chief Minister III Datuk Shahelmey Yahya said.  \nShahelmey, who serves as the state's works minister, said the new port, located in Sipitang approximately 140 kilometres from Kota Kinabalu, will provide a major boost to local economic sectors such as transport, shipping, and logistics.  \n\"The economic potential of this area is undeniable. Its strategic location on the west coast of Sabah, facing the South China Sea, positions Sipitang as a new gateway for maricreated_at trade in the region.  \n\"This port will create job opportunities for local residents, enhance household income, and promote sustainable economic growth,\" he said during the official declaration ceremony of the SOGIP Port here today.  \nHe emphasised that the initiative aligns with the Sabah Maju Jaya (SMJ) roadmap spearheaded by Chief Minister Datuk Seri Hajiji Noor to strengthen the state€™s economic and infrastructure development.  \n\"As a new port area, Sipitang not only enhances Sabah's capacity to handle international cargo but also broadens access for businesses to the global market.  \n\"This development represents a key step towards bolstering trade ties between Malaysia and its neighbours, as well as the wider region. We are confident this will significantly boost both bilateral and multilateral trade growth,\" he said.  \nAt the event, Shahelmey also represented the Chief Minister to witness the signing of the port concession agreement between the Sabah Port Authority, Sabah Oil and Gas Development Corporation Sdn Bhd, and SOGIP Port Sdn Bhd.  \nHe added that with the infrastructure in place, Sipitang is set to become a vital logistics hub for the region, further supporting trade and industrial activities.  \n\"Through the provision of modern facilities, we are confident this project will enhance Sabah's standing as a key player in international trade and logistics, while accelerating integration with the global economy.  \n\"I believe the SOGIP Port project will not only benefit the immediate area but will also serve as a catalyst for more sustainable and balanced economic development across Sabah,\" he added.  \n"
  },
  {
    "id": 2002,
    "title": "Chinese Navy Commissions Next-Generation Frigate 'Luohe' As Naval Rivalry With US Intensifies",
    "created_at": "2025-01-23",
    "text": "\nJanuary 23 --\nAmid escalating competition with the US and regional powers, China's navy has commissioned a next-generation frigate, saying the ship will play an important role in \"enhancing the overall combat effectiveness\" of its forces.\nChina boasts the world's largest navy by hull count, although its technological advancements often face scrutiny.\nIn response, the US, China's primary rival, has cautioned about being outnumbered and has proposed fleet expansion alongside measures to expedite the repair of damaged vessels.\nThe People's Liberation Army Navy (PLAN) primarily conducts operations along China's east coast and the strategically vital South China Sea, which Beijing claims nearly in full.\nA significant objective for the Chinese navy remains supporting potential military action against Taiwan, a self-governing island nation about 160 km (100 miles) from China's shores that Beijing has pledged to reunify, including by force if required.\nThe PLAN's first Type 054B frigate, named Luohe, officially entered service on Wednesday in Qingdao, the northern port city hosting the fleet's northern command.\nThe ship has a displacement of approximately 5,000 tons and includes stealth technology, combat command systems and firepower integration, \"significantly enhancing overall performance,\" the navy said.\n\"With strong capabilities for comprehensive combat operations and diverse military missions, the warship will play a vital role in enhancing the overall combat effectiveness of naval task forces,\" it added.\nEquipped with close-combat machine guns, anti-aircraft, and anti-ship missiles, the Luohe is expected to become a key component of China's naval strength.\nWhile the navy's statement did not confirm additional Type 054B frigates, reports suggest at least two have been launched, with one more under construction.\nChina's naval fleet comprises around 234 warships compared to 219 in the US Navy, including about 50 frigates and a similar number of destroyers.\nAdditionally, China operates two aircraft carriers, with a third undergoing trials, and maintains a robust coast guard.\nRecent wargames have shown China would lose many more vessels in a simulated clash with the US, but would be able to absorb the losses and continue fighting.\n"
  },
  {
    "id": 2004,
    "title": "China's Navy Expands Blue-Water Reach with Type 054B Frigate Luohe",
    "created_at": "2025-01-23",
    "text": "\nAccording to information published by on January 22, 2025, the Chinese People's Liberation Army Navy (PLAN) officially inducted its first Type 054B frigate, the Luohe (hull number 545), during a ceremonial handover at a naval port in Qingdao.\nThe Luohe represents a generational leap from its predecessor, the Type 054A-class frigate. With an approximate displacement of 5,000 tons, the Type 054B frigate integrates numerous advancements in stealth, weaponry, and operational versatility. Notable among these is the adoption of an integrated mast design, akin to the one found on the PLANs Type 055 destroyer.\nThis integrated mast significantly enhances the ship's radar signature reduction and boosts its information processing capabilities. The design not only reduces the likelihood of enemy radar detection but also optimizes the ships operational effectiveness by minimizing interference between onboard systems.\nThe increase in displacement compared to the Type 054A frigate enables the Type 054B to carry a broader range of weapons and systems. This versatility allows the frigate to perform multiple roles, including anti-air, anti-ship, anti-submarine, and even land-attack missions. Experts highlight that the expanded tonnage permits the integration of advanced missile systems, such as improved anti-ship, air-defense, and land-attack cruise missiles, enhancing the frigates overall combat power.\nAdditionally, the larger hull accommodates modern propulsion systems, potentially including hybrid or electric propulsion. This advancement offers reduced noise signatures, making the frigate more effective in anti-submarine warfare, while extending its operational range and efficiency. The Type 054B's transformation from a single-role to a multi-role platform exemplifies the PLANs intent to field adaptable and mission-flexible assets in its growing blue-water navy.\nThe introduction of the Type 054B frigate signifies China's commitment to modernizing its naval forces amid rising competition with the United States and other regional powers. With the world's largest navy by number of hulls, China aims to enhance its operational capabilities, particularly in the South China Sea and areas surrounding Taiwan.\nReports indicate that at least two more Type 054B frigates have been launched, with another under construction, suggesting a continued expansion of this class within the PLAN. This development aligns with China's broader efforts to extend its naval reach and influence, including deployments in the Mediterranean Sea and the Caribbean.\n"
  },
  {
    "id": 2005,
    "title": "United States/ASEAN: As Trump takes power, defense pick's ASEAN fumble raises concerns",
    "created_at": "2025-01-23",
    "text": "\nSoutheast Asia is greeting Donald Trump's return to the White House with a mix of hope and hesitation as he embarks on his second term as U.S. president.\nTrump took the oath of office on Monday inside the Capitol after the ceremony was moved indoors because of weather reports that a polar vortex would bring frigid temperatures to the nation's capital.\nEven as regional leaders anticipate greater engagement with the United States, a controversial moment involving his defense secretary nominee, Pete Hegseth, has raised concerns about how the administration will treat relations with the Association of Southeast Asian Nations, or ASEAN.\nHegseth, a former Army National Guard officer and television commentator, was unable to name ASEAN member states or identify the bloc's size during his confirmation hearing last week, drawing criticism both in Washington and across Southeast Asia.\nHe doesn't understand that the Defense Department's work in the South China Sea, where the U.S. plays a major role, involves many ASEAN countries, Isa Gharti, a public policy researcher at Chiang Mai University in Thailand, told RFA affiliate BenarNews. This lack of understanding could bring problems to ASEAN countries in the long term.\nASEAN has been central to Washington's strategy in the Indo-Pacific. The bloc, which includes Indonesia, Malaysia, Vietnam and Singapore among its 10 members, represents more than 680 million people and collectively forms the world's fifth-largest economy.\nThe United States counts two other ASEAN nations, Thailand and the Philippines, as treaty allies and has sought to deepen ties with the group to counter China's growing influence in the region. The U.S. military has access to nine Philippine bases.\nChina has made significant inroads in Southeast Asia, investing in infrastructure projects and using its economic clout to build partnerships. The South China Sea, where Beijing's territorial claims overlap with those of several ASEAN nations, remains a key flashpoint in the region.\nWhile Hegseth fumbled in responding to questions from Sen. Tammy Duckworth, who was born in Bangkok and injured in combat while serving in the U.S. military, regional leaders have expressed optimism about U.S. engagement under Trump's leadership.\nIndonesian President Prabowo Subianto has congratulated Trump on his victory and expressed his desire for a personal meeting.\nMalaysian Prime Minister Anwar Ibrahim hailed Trump's election a remarkable political comeback and voiced optimism about the potential for a deeper partnership with the United States.\nAnalysts react\nRaden Mokhamad Luthfi, a defense analyst at Universitas Al Azhar Indonesia, said he is skeptical about future defense relations between the United States and Indonesia, the world's largest Muslim-majority country, citing what he described as Hegseth's and Trump's unfavorable views of Muslims.\nCristina Palabay, secretary general of the Philippine rights group Karapatan, accused Washington of using allies including the Philippines to further its strategic goals.\nTrump's hostility toward China certainly matches, if not surpasses, that of Biden, Palabay said.\nIn Bangkok, Phumtham Wechayachai, Thai deputy prime minister and defense minister, struck a cautious tone.\nAfter Trump's inauguration as U.S. president, we need to see what adjustments may be needed, Phumtham told reporters. Overall, the foundation of U.S.-Thai relations is already good. We will consider any proposals according to Thai principles and make any adjustments that benefit the nation.\nOther analysts suggested that Hegseth's misstep might not significantly impact U.S. engagement with the region.\nIt would be folly to assume that just because the secretary of defense may not be familiar with ASEAN, that is tantamount to weaker U.S. engagement, said Julio Amador, a geopolitical analyst based in Manila. The Pentagon is a huge bureaucracy and Hegseth's deputies are well-versed in the geopolitics of the Indo-Pacific.\nMuhammad Waffaa Kharisma, a researcher at the Centre for Strategic and International Studies in Jakarta, argued that ASEAN is not strategically significant to the United States.\nPerhaps some ASEAN member states are, but ASEAN as an institution isn't, especially in an era when enthusiasm for multilateral organizations has waned, Waffaa told BenarNews.\nHe added that Trump's first term as president was not particularly enthusiastic about ASEAN.\nThey came up with initiatives which were seen as undermining ASEAN, including the Quad, he said, referring to a security dialogue among the United States, Japan, India and Australia.\n'Limited awareness'\nAsrul Hadi Abdullah Sani, a partner at ADA Southeast Asia, a regional consultancy firm, said Hegseth's gaffe underscores the limited awareness of ASEAN in American political circles.\nStill, concerns remain about the Trump administration's long-term priorities.\nWe will need to plan for a worst-case scenario in which Trump and Xi will reach a modus vivendi that sacrifices the Philippines' national interests, Rommel Jude Ong, a retired Philippine Navy rear admiral, told BenarNews while calling for stronger ties with other regional powers such as Japan and Australia. Xi is Xi Jinping, China's president.\nMeanwhile, a social media user in Southeast Asia questioned Hegseth's comments.\nNot having heard of ASEAN doesn't mean it doesn't exist. All of us here in the ASEAN are cringing over what's happening over there in the West, a Filipina who goes by the username @tessgarcia wrote on X, formerly Twitter. Geography-challenged people like Hegseth are probably the reason the U.S. lost in Vietnam (an ASEAN country).\nSource: Radio Free Asia\n"
  },
  {
    "id": 2006,
    "title": "French fighters ready to tangle with Aussie jets",
    "created_at": "2025-01-23",
    "text": "\nAfter travelling more than 2000km across the sea, French Navy officer Remi Gaudin is keen to test his European fighter jet against Australia's tropical north.\nOn Tuesday evening, three Rafale fighter pilots, including Commander Gaudin, touched down in Darwin after breaking away from their carrier strike group, which is deployed off South Asia.\nLess than 18 hours after arriving in Australia for the first created_at, Commander Gaudin and his pilots will push the limits of their French-designed Rafale multirole fighter jets with a view to enhancing their ability to operate on the other side of the planet.\n\"It's very important for us to be able to fly over land in the southern hemisphere from the aircraft carrier,\" he said.\n\"We are also training a new section lead during this exercise and we will also be doing a lot of (training) on this kind of weather.\" The chance to work from solid ground also gives the French visitors more created_at to work alongside the F-35 Lightning II - an airframe that commander Gaudin has seen more frequently during NATO exercises back home.\n\"We see them a lot more in Europe now,\" he said.\n\"We have opportunities to train with the F-35 in Europe and training with the Australian F-35 is a first (for me) so I'm looking forward to that.\" Royal Australian Air Force Squadron Leader Jordon Sander said he was looking forward to tying in with his new French colleagues.\n\"We will start to uncover some basic integration lessons, for example, we talk in pounds of fuel and the French talk in terms of kilograms,\" he said.\n\"That's why we must train together, so when we need to fight together we can do it effectively.\" While it's not the first created_at the Rafale fighter has graced the tarmac at RAAF Base Darwin, Squadron Leader Sander said he was looking forward to probing the European jet.\n\"It's an amazing aircraft and we're looking forward to fighting it,\" he said. \"We don't often get opportunities to train against different aircraft, so whenever we get that chance it's great for our crews and the Rafale jet is an extremely capable fighter.\" Unfortunately for Commander Gaudin and his pilots, sightseeing in Darwin will have to wait, with the French visitors planning to rejoin their carrier on Friday before setting course for the South China Sea. However, the Territory's French footprint will pick up again later this month when the French Navy's second largest warship, the Jacques Chevallier, docks at HMAS Coonawarra.\n"
  },
  {
    "id": 2007,
    "title": "Jaishankar attends 1st Quad ministerial of Trump 2.0",
    "created_at": "2025-01-23",
    "text": "\nWashington, Jan. 23 -- External Affairs Minister (EAM) S Jaishankar participated in the first Quad ministerial of the new Donald Trump administration this week, where he discussed \"different dimensions\" of ensuring a free and prosperous Indo-Pacific, with his counterparts.\nThe Quad Ministers, which also included new US Secretary of State Marco Rubio, Australia's Penny Wong, and Takeshi Iwaya of Japan, agreed on intensifying collaboration with each other. Jaishankar said the meeting was \"significant\" as it took place a day after Donald Trump took oath as the 47th US President.\n\"We agreed on the importance of thinking bigger, deepening the agenda, and intensifying our collaboration. The meeting today sends a clear message that in an uncertain and volatile world, the Quad will continue to be a force for global good,\" Jaishankar said.\nQuad is a strategic grouping aimed at addressing China's military aggression in the South China Sea, and Beijing claims the entire portion of it.\nShortly after the group's meeting, Jaishankar said he was delighted to meet US Secretary of State Marco Rubio for \"his first bilateral meeting after assumption of office\". The meeting, which lasted for more than an hour, was the first foreign policy engagement not only for Rubio but also for the Trump administration.\nBoth leaders reviewed the bilateral ties and exchanged views on several regional and global issues. \"Delighted to meet @secrubio for his first bilateral meeting after assumption of office as Secretary of State.\nReviewed our extensive bilateral partnership, of which @secrubio has been a strong advocate. Also, exchanged views on a wide range of regional and global issues. Look forward to closely working with him to advance our strategic cooperation,\" the EAM tweeted.\nJaishankar also met US National Security Adviser Mike Waltz and said he looked forward to \"working together on an active and outcome-oriented agenda\". \"Great to meet NSA @michaelgwaltz again this afternoon. Discussed strengthening our friendship to ensure mutual benefit and enhance global stability and prosperity,\" he said.\nEAM speaks up on 2023 consulate attack, deportation\nExternal Affairs Minister (EAM) S Jaishankar, who was in the US to attend Donald Trump's inauguration, called the attack on the Indian consulate in San Francisco in 2023 a \"very serious matter\". He added that India expects accountability for the incident and those responsible to be held accountable.\nDuring a press interaction, he also clarified that New Delhi is open to the \"legitimate return\" of Indian nationals living 'illegally' abroad, including in the US. He affirmed that India's position on the issue has been \"consistent\" and \"principled\" and he did clearly convey this to US Secretary of State Marco Rubio.\nPublished by HT Digital Content Services with permission from The South Asian created_ats. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 2008,
    "title": "The force awakens as giant 'Darth Vader' sea bug emerges from Vietnam's seas",
    "created_at": "2025-01-23",
    "text": "\nScientists have identified a new species of 'supergiant' sea bug in Vietnam, named Bathynomus vaderi after the iconic Star Wars character Darth Vader. This discovery, published in the journal ZooKeys, reveals the unique features and growing culinary popularity of these deep-sea creatures.The Bathynomus vaderi, part of the Bathynomus genus, was discovered during an exploration of culinary trends in Vietnam. The species was named due to its head's resemblance to Darth Vader's helmet. These isopods can grow up to 32.5 cm (12.8 inches) and weigh over a kilogram, making them one of the largest known isopods.Culinary Trend in VietnamIn Vietnam, these giant sea bugs, known locally as \"bo bein,\" have become a delicacy. \nThe meat is often compared to lobsters. Smaller eateries keep the isopods in ice boxes, while larger restaurants have dedicated tanks with chilled water for display and cooking. According to the study, \"Smaller eating establishments keep the isopods in ice boxes to be cooked when asked, while large restaurants have dedicated tanks with chilled water to keep and display the animals.\"Apart from its Darth Vader-like head, B. vaderi has a pronounced depression in its hip bone and a distinctive bony ridge protruding from its coracoid bone. These features set it apart from other supergiant isopods. The study highlighted that B. vaderi also has a unique feature: \"The last segment of its back legs narrows at the end and curves slightly backward.\"Market Demand and PricingThe demand for these sea bugs has increased over the years. In 2017, the price was up to Rs 6,854 (2 million Vietnamese Dong) per kilogram. By early 2024, the price had dropped to around Rs 3,400 (1 million Vietnamese Dong) per kilogram due to increased fishing. Researchers noted, \"In 2017, specimens had to be pre-ordered, and diners had to wait up to a month to collect their Bathynomus specimens in seafood outlets in Hanoi. Today, some seafood markets in Hanoi, Ho Chi Minh City, and Da Nang City keep up to 30 individuals in their chilled water tanks for customers to buy.\"The Bathynomus genus includes several species of isopods, known for their hard, protective exoskeleton and seven pairs of legs. Most isopods are incredibly small, typically measuring less than 2.5 cm (1 inch) in length. However, supergiant isopods like B. vaderi can grow significantly larger. The largest known isopod species, B. jamesi, can grow to around 50 cm and weigh approximately 2.6 kilograms.Scientists have raised concerns about the potential overfishing of B. vaderi. These creatures have a slow reproduction rate, producing only a small number of eggs. Dr. Lanna Cheng, professor emeritus of marine biology at the University of California, San Diego, who was not involved in the study, stated, \"These (creatures) don’t grow very fast, and if they become a very unusual and sought-after item, we may eat them out of existence.\" This makes them vulnerable to overfishing, which could threaten their population.The research team believes B. vaderi exists beyond Vietnam’s coastal waters in other parts of the South China Sea, but uncovering other species in these depths will take created_at. Dr. Conni Sidabalok, a researcher with the National Research and Innovation Agency in Indonesia, noted, \"If we get the chance, we would like to do more surveys and perhaps work with scientists in the region to ascertain what is living there. There is still so much to learn and discover.\" For Reprint Rights: created_atscontent.com\n"
  },
  {
    "id": 2009,
    "title": "Map Shows US Spy Planes Operating Near China's Coast",
    "created_at": "2025-01-23",
    "text": "\nThe United States RC-135 reconnaissance aircraft flew several spying missions near the coast of China this month, according to Newsweek's map, using open-source tracking data.\nThe Chinese military did not immediately respond to Newsweek's request for comment. The U.S. Pacific Air Forces (PACAF) previously told Newsweek that the RC-135 aircraft were conducting what it called \"planned, routine operations\" in the Indo-Pacific region.\nWhy It Matters\nThe U.S. Air Force stationed several variants of the RC-135 spy planes at Kadena Air Base, a U.S. military hub on Japan's Okinawa Island. The base, which also hosts fighter jets and aerial refueling aircraft, conducted a rapid response exercise earlier this month.\nOkinawa is part of a blockade, commonly known as the first island chain, that forms with Taiwan and the Philippines under a U.S. defense concept, which attempts to leverage the islands to contain China's navy and air force in the Western Pacific Ocean during warcreated_at.\nIn the past, Beijing had protested what it called \"close-in reconnaissance\" of Chinese territory by the U.S. military, demanding the Pentagon put an end to its \"provocations.\"\nWhat To Know\nBased on data captured by the aircraft tracking service Flightradar24, Newsweek's map showed that the RC-135V reconnaissance aircraft, also known as Rivet Joint, have been flying near China's coast since January 2, with the recent mission conducted on Thursday.\nMost of these China-related spying missions involved Kadena-based Rivet Joint aircraft, with the exception of a mission that was carried out on January 13, which saw the aircraft take off from Yokota Air Base, located west of Tokyo on Japan's main island of Honshu.\nThe Rivet Joint flew close to the eastern and southern coasts of China during missions, the map indicated. This variant of the RC-135 aircraft is equipped with sensors for detecting, identifying, and geolocating electronic signals, the U.S. Air Force said in a fact sheet.\nAnother Kadena-based RC-135 variant aircraft, the RC-135U, conducted a similar spying mission last Friday, flying north of the self-ruled island of Taiwan and near China's east coast. Beijing has said it reserves all options against Taiwan, including the use of force.\nAccording to the U.S. Air Force, the RC-135U, also known as Combat Sent, is designed for locating and identifying foreign military land, naval, and airborne radar signals, which will help determine detailed operating characteristics and capabilities of foreign systems.\nOn Wednesday, both the Combat Sent and the Rivet Joint were deployed from Kadena. They flew near the Chinese southern island of Hainan in the South China Sea, following a transit over the waters between the Philippines and Taiwan, according to tracking data.\nWhat People Are Saying\nThe U.S. Pacific Air Forces told Newsweek: \"PACAF remains committed to a free and open Indo-Pacific focused on fostering regional security and stability throughout the region.\"\nChinese Foreign Ministry spokesperson Mao Ning said on February 9, 2023: \"U.S. aircraft and warships frequently conduct close-in reconnaissance around China, which seriously threatens China's national security and undermines regional peace and stability.\"\nWhat Happens Next\nThe Japan-based American spy planes are likely to continue their missions as the Chinese military deploys ships and aircraft around Taiwan for patrols and drills on a daily basis.\nLink to Image\n\nGraphic\n \nUS Resumes Spy Flights Near China Coast\nNewsweek/Carto/Flightradar24\nThis map, based on GPS signals captured by Flightradar24, shows the flight paths of U.S. Air Force RC-135U/V intelligence-gathering aircraft operating out of air bases in Japan.\n"
  },
  {
    "id": 2013,
    "title": "PM Anwar's WEF Dialogues -- From Manchester United, Regional Challenges To Balancing Global Superpower Dynamics",
    "created_at": "2025-01-23",
    "text": "\n 23 Jan 2025 (BERNAMA News Agency) Prime Minister and ASEAN chair Datuk Seri Anwar Ibrahim made an indelible mark at the World Economic Forum (WEF) 2025 in Davos, Switzerland, by seamlessly navigating discussions that ranged from light-hearted conversations about his favourite football club to the intricate dynamics of international relations and challenges and successes of regional integration.\nThe prime minister's ability to balance the conversation in his engagements showcased Malaysia's unique position in global diplomacy, especially in dealing with countries with varying political ideologies and economic policies.\nHis first engagement at the WEF came from none other than Manchester United Football Club (MUFC) co-chairman Avram Glazer regarding Malaysia's goal for sports in future.\nAnwar firstly replied that as a fan of the 147-year-old club, he still had hopes for Manchester United's resurgence and refused to change his preference despite the club languishing in the bottom half of the table and all his 14 grandchildren being Arsenal supporters.\nResponding to Glazer's question during the 'Country Strategy Dialogue' session on the sidelines of the WEF Annual Summit 2025, he pointed out the significance of sports in a multi-religious country like Malaysia and the importance of promoting it, not only as an industry but also to use the game to foster unity.\nAnwar, who is also the finance minister, also addressed questions on the restructuring of Malaysia Airlines as well as improvements at Malaysia Airports Holdings Bhd (MAHB), including aerotrain upgrades.\n'I am impatient to get things going (at the airport) and (for it) to be more efficient. There's no reason why the airport should function as it did in the past, although it is relatively good compared to other poorer airports. But I think there's room for improvement,' he said.\nOther diverse topics Anwar touched on were discussions on healthcare, Artificial Intelligence (AI), the Johor Singapore Special Economic Zone (JS-SEZ), upgrading the country's legislative, free trade agreements (FTAs) and the need for these agreements to include digitalisation as well as Malaysia's views on nuclear energy.\nOn the last day of his three-day working visit to Davos to attend the summit, Anwar also touched on the issue of Myanmar and how the failure of governance in the state has affected peace and security in ASEAN.\nAs ASEAN chair, Malaysia is cautiously optimistic about the progress in Myanmar, and it will coordinate efforts towards peace and security with the United Nations, he said at the ASEAN Plenary entitled 'Even Stronger Together'.\nThe prime minister's ability to navigate various topics on multiple platforms with consistency also showcased the great orator he is.\nAt every opportunity, he emphasised Malaysia's commitment to fostering cooperation among major powers, ultimately reinforcing ASEAN's role in addressing pressing economic and geopolitical challenges.\nIn his no-holds-barred remarks on issues faced by ASEAN and the region, especially concerning tensions in the South China Sea, the prime minister firmly stated any resolution must be a collaborative solution and not otherwise, regardless of the Western world's views on it.\n'We have unresolved issues with Thailand, Indonesia, Singapore, Brunei and the Philippines. (But) why is it that the problem only seems to be with China?' he asked.\n'And they say, 'Oh, are you being defensive?' No, it's not the case. I am simply stating the facts. Is there a problem? Yes, there is (a problem). But the issue involves the entire region. Are we going to wage war over it? No,' he added.\nThe ASEAN chair emphasised that these matters must not be approached defensively but rather with a firm commitment to dialogue, and Malaysia has been proactive in taking that path.\nHe said Malaysia had made significant strides in establishing itself as a trusted partner of China while also recognising the United States as an equally important partner, as cumulatively, it remains the largest investor in Malaysia.\nAnwar also expressed optimism about Malaysia's ability to continuously attract investments and took every opportunity to promote the country to government and business leaders, as well as civil society officials attending WEF at the resort town in the Swiss Alps.\n"
  },
  {
    "id": 2014,
    "title": "Links 1/23/2025",
    "created_at": "2025-01-23",
    "text": "\nJanuary 23rd, 2025 ( Naked Capitalism  - Delivered by  Newstex )\n'Supergiant' sea bug named after Darth Vader found in South China Sea CBS\nDo Insects Feel Pain?The New Yorker\nArchaeologists Are Finding Dugout Canoes in the American Midwest as Old as the Great Pyramids of Egypt Smithsonian\nJames Galbraith - The Origins of the Modern Era of the Federal Reserve: Five Books Brave New Europe\nCalifornia Burning\nUPDATE on CA Lithium Battery Plant fire near 'Salad Bowl of America' (produces 70% of our greens) Jordan Chariton, Threadreader\nThousands evacuate Hughes Fire near LA as California faces fresh threats Axios\nSyndemics\nUSDA Updates Mammalian Wildlife With HPAI H5 List Avian Flu Diary.'As the HPAI H5 virus continues to find new mammalian hosts it is likely to become more deeply entrenched in our shared ecology, increasing the risks that it will find new evolutionary pathways that were unavailable to it when it was primarily a disease of birds.'Avian Influenza Prevention Zone introduced in Northern Ireland Love Ballymena\nCOVID study: 40% of children still infectious after symptom resolution Center for Infectious Disease Research and Policy\nClimate\nSnow in New Orleans (1):\nI'm still in disbelief this happened.Here it is.created_atlapse of historic New Orleans snow storm.Snow got up to 12 inches on my snowboard in the French Quarter.pic.twitter.com/M9byQeZJGL\n- Payton Malone WWL-TV (@paytonmalonewx)  January 22, 2025\nSnow in New Orleans (2):\nSnow falls in Houston and New Orleans as rare storm sweeps Gulf Coast.This is a snowball fight on Bourbon Street, New Orleans on Jan 21, 2025 pic.twitter.com/FIrkFnG1T2\n- Massimo (@Rainmaker1973)  January 22, 2025\nThe hidden cost of unreliable insurance 3 Quarks Daily\nChina?Salary caps spread in China's finance sector amid 'common prosperity' drive South China Morning Post\nDrone pilots emerge as next sought-after profession in China CGTN * * *\nRubio backs Manila, condemns Beijing's 'dangerous' actions in South China Sea South China Morning Post\nTranscription matters Language Log.'Rubio' in Chinese.* * *\nDeepSeek: How China's AI Innovators Are Challenging The Status Quo Forbes.Commentary:\nReally interesting how the US and China are taking such different roads on AI.Beyond the PR that this \"Stargate Project\" is to \"create cancer vaccines\", what it really seems to be about is doubling down on OpenAI's strategy of building a \"money moat\" through massive  \n- Arnaud Bertrand (@RnaudBertrand)  January 22, 2025\nChina's second-largest foundry hires former Intel executive to lead advanced node development Tom's Hardware\nDutch government excludes most ASML sales to China from 'dual use' export data Reuters * * *\nChinese tests of seawater near Fukushima nuclear plant show no impact on marine life South China Morning Post\nMyanmar\nNo laughing matter: Meet the junta's court jesters Frontier Myanmar\nChina and the Wars in Myanmar The Irrawaddy\nThe New Great Game\nOpinion: Protests in Georgia should involve not just middle class but all social groups JAM News\nSyraqistan\nWhy is Israel launching a crackdown in the West Bank after the Gaza ceasefire?AP\nIDF launches Operation Iron Wall against Palestinian terror in Jenin as PA exits Jerusalem Post.Commentary:\nIsrael has launched \"Operation Iron Wall\" in the West Bank's Jenin, on Day 2 of Trump's presidency.It is named for Jabotinsky's 1923 essay, \"The Iron Wall\".Here's an extract: \"Zionist colonisationcan proceed and develop onlybehind an iron wall.\" pic.twitter.com/DJ5g7UKV2d\n- Heidi Matthews (@Heidi__Matthews)  January 21, 2025\nTrump's Middle East envoy will enter Gaza as part of 'inspection team' Al Jazeera.Steve Witkoff.Dear Old Blighty\nKeir Starmer appoints Jeff Bezos as his 'first buddy' Cory Doctorow, Pluralistic\nNew Not-So-Cold War\nUkraine Is Burning Through 155mm M777 Howitzer Barrels So Fast The U.S. Army Can't Keep Up The Warzone.The deck: 'The U.S. Army is now trying to meet a requirement to produce at least 30 new barrels for M777 howitzers every month.'Thirty.Oh.* * *\nZelenskyy: Ukraine needs at least 200,000 peacekeepers to prevent renewed Russian aggression Ukrainska Pravda\nTrump tells Putin to end 'ridiculous war' in Ukraine or face new sanctions BBC\nWe want to end war in Ukraine so that it does not restart in two to four years - US secretary of state and Russian Foreign Ministry claims to see 'small window of opportunity' for agreements under Trump Ukrainsaka Pravda\nTrump Administration\nTrump's Crypto Assets Are Nonsense.The Cash They Throw Off Is Very Real Forbes * * *\nHow Trump's executive orders will roll out - if courts allow them Al Jazeera\nTrump's glaring policy contradictions are both a blessing and a curse South China Morning Post\nCan the United States Actually Purchase Greenland?Foreign Policy * * *\nDepartment of Justice freezes all civil rights division cases: report FOX\nTrump hits NIH with 'devastating' freezes on meetings, travel, communications, and hiring Science * * *\nUS military sends troops to Mexico border amid Trump immigration crackdown Al Jazeera\n'Scare tactic': Bonta slams Trump move targeting local officials over immigration Los Angeles created_ats * * *\nTrump suggests states should handle emergency response instead of FEMA Axios\nCracks emerge in House GOP after speaker's threat to saddle California wildfire aid with conditions AP * * *\nDemystifying Jared Isaacman, Trump's NASA nominee Space News\nSusan Collins: 'Troubling' that Hegseth FBI report omitted key information The Hill\nSpook Country\nVICTORY!Federal Court (Finally) Rules Backdoor Searches of 702 Data Unconstitutional Electronic Frontier Foundation\nTools for Thinking About Censorship Ex Urbe\nDavos\n'The elephant is in the room': Trump's return on everyone's lips at Davos France24\nDigital Watch\nDecentralized Social Media Is the Only Alternative to the Tech Oligarchy 404 Media\nHow often do unexpected scientific discoveries occur?More often than you might think Nature\nZeitgeist Watch\nMississippi politician files 'Contraception Begins at Erection Act' WLBT.'As written by Sen. Bradford Blackmon, the bill would make it 'unlawful for a person to discharge genetic material without the intent to fertilize an embryo.''I assume parody, as for example:\n\nSupply Chain\nWorld's top wheat exporter makes concerning decision after experiencing heavy losses: 'The profitability of grain crops is approaching zero' The Cooldownd\nImperial Collapse Watch\nWorld's first submarine-launched drones that swims and flies poses new threat to US Interesting Engineering\nWhy Aircraft Carriers Are Becoming Obsolete Philip Pilkington, The National Interest\nClass Warfare\nWhat the global elite reveal to Davos sex workers: High-class escort spills the beans on what happens behind closed doors - and how wealthy 'know the world is doomed, so may as well go out with a bang' Daily Mail\nAmazon closing all Quebec warehouses, laying off more than 1,700 workers CTV.Commentary:\nAmazon is closing ALL warehouses in Quebec after unionizing took place at 1 warehouse.Instead of working with first successful union of Amazon in North America, they chose to layoff all 1,950 workers.A clear threat to all workers that if they unionize-they will be fired.The  pic.twitter.com/KyQvTZTEp2\n- Longcreated_atFirstcreated_at‍ (@Longcreated_atHistory)  January 22, 2025\nStinky bloom of 'corpse flower' enthrals thousands BBC\nVegetable Garden Protection Act South Arkansas Reckoning\nAntidote du jour ( Thomas Fuhrmann):\n, CC BY-SA 4.0 , via Wikimedia Commons\nSee yesterday's Links and Antidote du Jour  here.This entry was posted in\nGuest Post, Links on January 23, 2025 by Lambert Strether.About Lambert Strether\nReaders, I have had a correspondent characterize my views as realistic cynical.Let me briefly explain them.I believe in universal programs that provide concrete material benefits, especially to the working class.Medicare for All is the prime example, but tuition-free college and a Post Office Bank also fall under this heading.So do a Jobs Guarantee and a Debt Jubilee.Clearly, neither liberal Democrats nor conservative Republicans can deliver on such programs, because the two are different flavors of neoliberalism ('Because markets').I don't much care about the 'ism' that delivers the benefits, although whichever one does have to put common humanity first, as opposed to markets.Could be a second FDR saving capitalism, democratic socialism leashing and collaring it, or communism razing it.I don't much care, as long as the benefits are delivered.To me, the key issue - and this is why Medicare for All is always first with me - is the tens of thousands of excess 'deaths from despair,' as described by the Case-Deaton study, and other recent studies.That enormous text count makes Medicare for All, at the very least, a moral and strategic imperative.And that level of suffering and organic damage makes the concerns of identity politics - even the worthy fight to help the refugees Bush, Obama, and Clinton's wars created - bright shiny objects by comparison.Hence my frustration with the news flow - currently in my view the swirling intersection of two, separate Shock Doctrine campaigns, one by the Administration, and the other by out-of-power liberals and their allies in the State and in the press - a news flow that constantly forces me to focus on matters that I regard as of secondary importance to the excess deaths.What kind of political economy is it that halts or even reverses the increases in life expectancy that civilized societies have achieved?I am also very hopeful that the continuing destruction of both party establishments will open the space for voices supporting programs similar to those I have listed; let's call such voices 'the left.'Volatility creates opportunity, especially if the Democrat establishment, which puts markets first and opposes all such programs, isn't allowed to get back into the saddle.Eyes on the prize!I love the tactical level, and secretly love even the horse race, since I've been blogging about it daily for fourteen years, but everything I write has this perspective at the back of it.Link to the original story.N"
  },
  {
    "id": 2016,
    "title": "Indonesia's Prabowo Subianto visit: A turning point in bilateral cooperation and defense partnerships",
    "created_at": "2025-01-23",
    "text": "\nIndonesia's Defense Minister Prabowo Subianto visits India as the chief guest for the 2025 Republic Day Parade, marking 75 years of bilateral ties. The visit focuses on defense agreements, including the BrahMos missile deal, and enhancing regional cooperation.\nIndonesia's President Prabowo Subianto, is in India for his first-ever official state visit, making him thechief guestat India's Republic Day Parade on January 26, 2025. The visit, running fromJanuary 24-26, celebrates75 years of Indonesia-India bilateral relationsand aims to elevate the strategic ties between the two nations in areas ranging from defense to trade.\nA 352-member marching and band contingent from Indonesia will be participating in India's Republic Day Parade. This will be the first created_at that an Indonesian marching and band contingent will participate in a national day parade abroad.\nKey Highlights of the Visit:\nPrabowo's visit is symbolic of the growingstrategic partnershipbetween the two countries. In his meetings withPrime Minister Narendra Modi, expected onJanuary 25, the agenda will focus on expanding cooperation across several sectors:\nDefense and Security:\nOne of the most significant developments from this visit is expected to be theBrahMos missile deal, with Indonesia poised to sign an agreement for the purchase of the supersonic missile. This deal would bolster Indonesia's defense capabilities, particularly in light of rising tensions in theSouth China Sea. Theair-launched BrahMos missile, known for its precision and speed, will enhance Indonesia's military edge.\nThe signing of the deal is part of India's broader strategy to increase itsdefense exportsto ASEAN nations, following its successful missile sale to thePhilippines. TheBrahMos missiledeal would not only underscore the deepening defense cooperation between India and Indonesia but also establish India as a key player in Southeast Asia's defense sector.\nEconomic Cooperation:\nTheIndonesia-India trade volumereached$24.1 billionin 2024, with a significant trade surplus in favor of Indonesia. Despite a slight dip in trade, both sides are expected to discuss ways toenhance bilateral economic relations, particularly in sectors such asinfrastructure,energy, andtechnology.Indian investmentsin Indonesia, currently around$1.56 billion, are expected to grow, with both nations seeking to improve trade balance and expand their economic footprint.\nCultural and Educational Engagements:\nThecultural tiesbetween the two nations date back centuries, with events like theBali Yatra festivalserving as reminders of the deep-rooted maricreated_at exchanges. Additionally, education and people-to-people links are also on the agenda, with more scholarships and educational exchanges between both countries.\nRegional Security and Maricreated_at Cooperation:\nAs part of India'sAct East Policy, Indonesia plays a key role in ensuring regional security. The two nations will review their cooperation in maricreated_at security, with both countries actively participating in exercises likeCORPAT (Coordinated Patrol). Joint maricreated_at and air force drills are expected to be intensified, focusing on common security concerns in theIndo-Pacific region.\nBilateral Agreements and MoUs Expected:\nDuring the visit, several MoUs will likely be signed, covering various sectors such as:\n* Healthcare and traditional medicines: Increasing collaborations in medical technology and healthcare systems.\n* Cultural exchange programs: Furthering ties through art exhibitions, festivals, and people-to-people interactions.\n* Infrastructure development: Working on joint projects, particularly in urban planning and smart cities.\n* Digital technology and connectivity: Enhancing ICT collaborations and fostering greater internet connectivity between the two nations.\nThe Strategic Importance of the Visit:\nThis visit is strategically significant for several reasons:\n* Regional Influence: With Indonesia being a leading ASEAN member, its partnership with India strengthens India's presence in Southeast Asia, particularly as the Indo-Pacific becomes a focal point of global geopolitics.\n* Defense Deals: The BrahMos deal will not only enhance Indonesia's military capabilities but also cement India's position as a leading defense supplier in the region, countering China's influence.\n* Geopolitical Synergies: As Indonesia strengthens ties with India, it counters regional threats and China's growing assertiveness in the South China Sea. The defense pact and strategic discussions will serve as a balancing factor in the region.\nBottomline\nPresident Subianto's state visit to Indiais poised to make a significant impact on the evolving relationship between the two nations. With a focus on strengthening defense ties, economic collaboration, and regional security, the visit will serve as a crucial milestone in fostering a deeper, more comprehensive strategic partnership betweenIndia and Indonesia. As both countries face an increasingly complex regional environment, this visit will enhance their ability to navigate challenges while strengthening the bonds of cooperation.\n"
  },
  {
    "id": 2017,
    "title": "‘China’s behavior undermines peace’",
    "created_at": "2025-01-23",
    "text": "\n-- US reiterates ‘ironclad’ commitment to PH US SECRETARY of State Marco Rubio raised concerns about China’s aggressive activities in the South China Sea during his talks with his Philippine counterpart, Foreign Affairs Secretary Enrique Manalo, and underscored Washington’s “ironclad” commitment to Manila under the 1951 Mutual Defense Treaty, the State Department said yesterday. Another official under..."
  },
  {
    "id": 2019,
    "title": "Rubio kicks off Trump foreign policy engagements in meetings with 'Quad'",
    "created_at": "2025-01-23",
    "text": "\nSecretary of State Marco Rubio met yesterday [Macau created_at] with his counterparts from Australia, India and Japan as the Trump administration kicked off its formal foreign policy engagements in discussions with the Indo-Pacific \"Quad.\" The ministers reaffirmed their countries' commitment to the format and its goals and indicated their leaders would meet in the coming months.\nThe grouping of the four countries has been seen by many as an initiative to counter or at least slow China's increasing assertiveness and aggressiveness in the region, something over which President Donald Trump and his predecessors, including former President Joe Biden, have all expressed deep concern.\nThe timing of Tuesday's meeting - on Trump's first full day in office and just hours after Rubio was sworn in as America's top diplomat - suggests it will remain a priority for Trump. And, in a joint statement released after the meeting, the ministers suggested a new Quad summit would be held this year in India, continuing an upgrade of the relationship from foreign ministers to leaders initiated by the Biden administration.\n\"Our four nations maintain our conviction that international law, economic opportunity, peace, stability, and security in all domains including the maricreated_at domain underpin the development and prosperity of the peoples of the Indo-Pacific,\" they said.\n\"We also strongly oppose any unilateral actions that seek to change the status quo by force or coercion,\" they said in a not-so-subtle reference to China.\nThe two-paragraph joint statement was the only indication of how the meeting unfolded as none of the ministers - Rubio, Australian Penny Wong, Indian S. Jaishankar or Japanese Iwaya Takeshi - spoke as they opened their meeting at the State Department.\nInstead they stood silent and expressionless in front of their respective flags before journalists were ushered out. And, none of them spoke at photo opportunities before individual meetings that Rubio hosted afterward.\nThe Quad was established in 2007 to bring together countries that had worked together in response to the devastating 2004 earthquake and tsunami in the Indian Ocean. Its members stress its diplomatic nature and broad focus on regional issues, including infrastructure, humanitarian aid, disaster relief, climate change and maricreated_at security.\nEven though security is only part of the mix, the Quad is a major component of the American strategy to counter China's growing assertiveness and vast territorial claims in the region, including to virtually all of the strategically important South China Sea and Taiwan.\nThe strategic element to the Quad has prompted China to accuse the four countries of attempting to form an \"Asian NATO,\" though it is a very different construction and has no mutual-defense pact, a key component to the North Atlantic Treaty Organization alliance.\nDuring his created_at in the Senate, Rubio was a \"China hawk\" and he has been sanctioned by the Chinese government for outspoken remarks about the country's human rights record,\nOn Tuesday, Rubio made his first appearance at the State Department as secretary of state and called on U.S. diplomats to forcefully defend and execute Trump's \"America First\" policies.\n\"The voters decide the course of our nation, both domestically and abroad, and they have elected Donald J. Trump as our president when it comes to foreign policy on a very clear mission,\" Rubio told them.\n\"And that mission is to ensure that our foreign policy is centered on one thing, and that is the advancement of our national interest, which (was) clearly defined through his campaign as anything that makes us stronger or safer or more prosperous. And that will be our mission, that will be our job.\"\nTrump has been publicly skeptical of the value of the State Department since his first term in office and, as he has done with other agencies, accused some in the diplomatic corps of working to blunt or derail his policy priorities.\nRubio paid tribute to the men and women of the State Department, calling them \"the greatest, the most effective, the most talented, the most experienced diplomatic corps in the history of the world.\"\nBut, his arrival came amid a wave of resignations - demanded by Trump's team - of career diplomats from senior positions in the State Department bureaucracy and U.S. embassies around the world.\nThe full extent of the resignations sought by the incoming administration remained unclear yesterday but began in earnest on Friday when a large number of career diplomats holding politically appointed posts, such as undersecretaries and assistant secretaries of state, were told to resign. On Monday, the demand for resignations grew to include career diplomats serving as ambassadors as well as lower-ranking staffers. MATTHEW LEE, WASHINGTON,MDT/AP\nLink to Image\n\nGraphic\n \nSecretary of State Marco Rubio speaks after being sworn in by Vice President JD Vance in the Vice Presidential Ceremonial Office in the Eisenhower Executive Office Building on the White House campus\n"
  },
  {
    "id": 2020,
    "title": "Comelec suspends ballot reprinting amid more TROs from Supreme Court",
    "created_at": "2025-01-23",
    "text": "\n01/23/2025 Another China Coast Guard (CCG) vessel moved near the Zambales coast on Tuesday as the Philippine Coast Guard (PCG) replaced its deployed ship monitoring the Chinese presence in the area. In a statement issued Tuesday evening, PCG spokesperson for the West Philippine Sea (WPS) Commodore Jay Tarriela said the PCG replaced BRP Gabriela Silang..."
  },
  {
    "id": 2029,
    "title": "China and US are moving closer as Trump returns to the White House",
    "created_at": "2025-01-23",
    "text": "\nChina's relations are starting to improve with Japan, India and other countries that former U.S. President Joe Biden courted, just as Donald Trump brings his more unilateralist approach back to the White House.\nThe change of leadership in Washington this week could be an opportunity for China, which has long railed against Biden's strategy of building partnerships with \"like-minded countries\" aimed at countering its growing influence.\nBiden reinvigorated a grouping known as the Quad - the United States, India, Japan and Australia. China's relations with all three of those U.S. partners are improving, as are its ties with Britain. The durability of Biden's legacy is now in question. During his first term, Trump didn't hesitate to challenge traditional U.S. partners.\n\"It is possible that Trump may drift away from U.S. allies, making them pay more attention to China's role and in fact it has provided a chance for China's diplomacy,\" said Wu Xinbo, dean of the Institute of International Studies at Fudan University in Shanghai. \"I think we should grasp the chance.\"\nBut U.S. National Security Council spokesperson Brian Hughes said that Trump \"has a record of rallying the world toward a more competitive stance with China.\" Trump agreed to a Free and Open Indo-Pacific strategy that Japan introduced during his first term and backed excluding Chinese companies from telecom networks in the U.S. and many of its partners.\nAnd yesterday, Secretary of State Marco Rubio - hours after he was sworn in - met with the foreign ministers of Australia, India and Japan in Washington, a move that suggested engaging the Quad countries and countering China's influence will remain a priority for Trump.\nChina's fence-mendinghas limits\nBeijing's rapprochement with the U.K. and Japan is in its early stages, and major differences remain that limit and could derail it.\nIndia turned the page with China on a bitter border dispute last October, but protested when Beijing created two new counties in an area claimed by both nations.\nStill, new leaders in Australia, the U.K. and Japan have shown a desire to warm relations with China, the world's largest manufacturer and a source of strategic minerals.\nThe government in Beijing has reciprocated in part because it wants foreign investment to help revive its economy, which could be set back if Trump follows through on a threat to impose higher tariffs.\nChinese President Xi Jinping told European Council President Antonio Costa in a phone conversation last week that both sides could bring more \"stability and certainty\" to the turbulent global situation. China and Britain restarted economic and financial talks after a six-year hiatus when the U.K. Treasury chief visited Beijing this month.\n\"From China's point of view, improving relations with American allies and increasing economic cooperation will offset the shock to China-U.S. economic relations,\" Wu said.\nTrump's statementsagitate U.S. allies\nIn Washington, there's a strong bipartisan consensus that the U.S. must prevail in its economic and tech rivalry with China to maintain its global leadership.\nDuring his confirmation hearing, Rubio called China \"the most potent and dangerous near-peer adversary this nation has ever confronted.\" Biden kept the tariffs Trump levied on China and imposed more on Chinese electric cars and solar cells.\nBut unlike Biden, Trump has irked U.S. allies and partners with his recent remarks on possibly annexing Greenland, an autonomous territory of NATO ally Denmark, and making Canada the 51st American state.\nHal Brands, senior fellow at the Washington-based think tank American Enterprise Institute, said he believes some top strategists in Beijing are \"salivating at the damage they think Trump is going to do to U.S. alliances and the opportunities this creates for Beijing to resurrect some of its relationships with other advanced democracies - Japan and Europe - that had moved in a very sharply anti-China direction since COVID.\"\nTrump's rhetoric, and attempts by his adviser Elon Musk to interfere in British and German politics, \"are certain to have a ripple effect,\" said Sun Yun, director of the China program at the Stimson Center in Washington.\n\"Countries want to at the minimum keep their options open,\" she said. \"China is unlikely to be a better choice than the U.S., even under Trump, but it is important to find some counterbalance.\"\nThe Philippines isn't mending fences\nChina's relations aren't improving with every U.S. partner. Philippine President Ferdinand Marcos Jr. has aggressively resisted China's increasingly assertive stance in their territorial disputes in the South China Sea.\nThe Philippines complained recently about what it called a \"monster\" Chinese coast guard ship in nearby waters, and the foreign ministers of Japan and the Philippines said last week they would convey to Trump the urgent need for the U.S. to remain engaged in the region.\nUncertainty about Trump's policies is prompting both China and Japan to seek a stable relationship, said Taizo Miyagi, an expert on Japanese diplomacy at Chuo University in Tokyo.\nA Japanese foreign minister visited Beijing last month for the first created_at in seven years, and Chinese military officials visited Tokyo last week to resume defense exchanges after a five-year hiatus.\n\"In a way it is a Trump effect,\" Miyagi said. \"Many other countries are likely thinking the same and this could invigorate their diplomatic activities.\"\nBritain steers a new course with China\nBritish Prime Minister Keir Starmer has sought to rebuild ties with Beijing since his Labour Party's election victory last summer. It's a marked shift from predecessor Rishi Sunak, who in 2022 declared an end to his country's \"golden era\" of friendship with China.\nIn Britain's case, Trump's return may not be driving the rapprochement.\nMany European leaders may not welcome Trump's America-first agenda, \"but the idea that as a result they will all kowtow to Beijing for more trade is fanciful thinking on the part of some of our Chinese friends,\" said Steve Tsang, director of the SOAS China Institute at the University of London.\nMost would prefer to remain partners with Washington. French President Emmanuel Macron, outlining his vision for global diplomacy in a New Year's speech, declared that his country was \"a solid ally\" of Trump.\nHe and others hope that Trump will respond positively to their outreach. Much will depend on what path the returning U.S. president takes, and how the rest of the world reacts. MDT/AP\nLink to Image\n\nGraphic\n \nFrom left, Biden, Modi, Lula da Silva, Ramaphosa and President Xi Jinping gather for a G20 Summit world leaders' group photo, in Rio de Janeiro, last November\n"
  }
]