[
    {
        "id": 2073,
        "title": "Rubio expresses \"concerns\" to Chinese foreign minister about Taiwan and the South China Sea",
        "created_at": "2025-01-24",
        "text": "\nIn a call with his Chinese counterpart, Wang Yi, US Secretary of State Marco Rubio expressed his \"serious concerns\" about Taiwan and the South China Sea, the State Department said on Friday (24).\nIn the call, Rubio \"underscored the United States' commitment to its allies in the region and the serious concerns raised by China's coercive actions against Taiwan and in the South China Sea,\" State Department spokeswoman Tammy Bruce said in a statement.\nRubio also stressed that President Donald Trump's administration \"will pursue a relationship between the United States and China that advances American interests and puts the people of the United States first\".\nThis was the first contact between the two foreign ministers since Rubio, known for his hardline stance against China, took office last Tuesday.\nFor his part, Wang urged his American counterpart to handle the Taiwan issue with \"caution\", according to a statement from his office in Beijing.\n\"We will never allow Taiwan to separate from China,\" said Wang, adding that Washington \"must not betray its promise\" to adhere to the \"one China\" principle.\nChina considers Taiwan part of its territory and threatens to use force to regain control of the autonomous island.\nThe United States has long supported Taiwan and is its main arms supplier, although it does not formally recognize its diplomatic status.\nAt a Senate hearing last week, Rubio called China \"the most powerful and dangerous adversary the United States has ever faced\" and promised to strengthen support for Taiwan to prevent an invasion.\nWang emphasized during the meeting that the world's two largest economies need to find \"a way to coexist in this new era\", an apparent reference to Trump's return to the White House.\nChina claims most of the South China Sea, a strategic maricreated_at route, despite an international ruling that this claim has no legal basis.\nFrequent clashes with the Philippines have generated fears that they could drag the United States, Manila's historic security ally, into an armed conflict with the Asian giant.\nRubio discussed China's growing ambitions in meetings held on Tuesday in Washington with his counterparts from Japan, Australia and India. On Friday, he also met with the head of Vietnamese diplomacy.\n"
      },
      {
        "id": 2074,
        "title": "Philippines launches 'surface action groups' to strengthen South China Sea patrols and defence",
        "created_at": "2025-01-24",
        "text": "\n Experts however, warn that Manila's strategy of having several warships patrolling at once could strain resources and leave the navy vulnerable to targeted attacks   \nThe Philippine Navy has unveiled a bold new strategy to patrol the contested South China Sea with coordinated groups of warships, aiming to enhance territorial defence and deterrence. However, experts caution the move could stretch their resources and expose vulnerabilities. \nAnnouncing the move on Wednesday, Captain John Percie Alcos, spokesman for the Philippine Navy, said lone-ship or \"lone wolf\" operations would give way to \"surface action groups\" of several warships patrolling at once to \"cover more of our areas and jurisdiction\". \nThe shift aligns with the Comprehensive Archipelagic Defense Concept (CADC), Manila's new strategy designed to protect the country's exclusive economic zone, and maricreated_at territories, while enhancing its war-fighting capabilities, Alcos said, adding that most Philippine offshore combat ships have \"anti-submarine warfare capabilities\". \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nUsing SAGs could strengthen the navy's presence in the contested waters of the West Philippine Sea - Manila's term for the South China Sea within its exclusive economic zone - but analysts warn it could decrease overall coverage capabilities and leave ships vulnerable to targeted assault. \nChina claims most of the South China Sea, rejecting rival claims from the Philippines and other countries, as well as a 2016 international arbitration ruling that its assertion over the waterway had no legal basis. \nBeijing has previously been accused of aggressive actions against Philippine vessels in the disputed waterway by using water cannons, high-intensity lasers, and conducting illegal patrols within Manila's exclusive economic zone. \nGeopolitical expert Arnaud Leveau, assistant professor at Paris Dauphine University and researcher at the Asia Centre think tank, said the Philippine Navy's new strategy combines surveillance, anti-submarine warfare, and air defence. \n\"This shift would also better prepare the Navy for scenarios where they have to defend multiple areas simultaneously,\" Leveau told This Week in Asia. \n\"This could leave some areas under-patrolled or vulnerable in less strategic parts of the country. Additionally, there's the risk that grouped together, the ships could be more vulnerable to targeted attacks, like coordinated missile strikes,\" he added. \nWhen asked about the previous deployment of Manila's navy ships as \"lone wolves\", Leveau said it was a result of limited resources in ships and personnel, leading to sporadic missions. \n\"Ships were often sent on missions to specific regions, especially around hotspots like the Scarborough Shoal or the Spratlys, but with limited ability to maintain constant patrols across the entire maricreated_at domain,\" Leveau explained. \n\"In addition, a lone ship could be deployed quickly in response to specific threats without the logistical complexity of coordinating multiple vessels;\" he said. \"Another reason might be big financial constraints.\" \nRay Powell, director of the SeaLight programme and a retired US Air Force colonel, agreed with Leveau that the current Philippine Navy is too small to defend the West Philippine Sea. \n\"In the near term, it will need to lean into its US alliance and growing international security network to bolster its defences,\" Powell told This Week in Asia. \"Building a naval force sufficient to secure its waters is a long-term project which will need a national political commitment extending out decades.\" \nHe said the new tactic reflects the Philippines' new understanding of its primary strategic challenge, which goes beyond mere maricreated_at domain awareness and presence operations to archipelagic defence. \n\"The realisation is that to defend an archipelago against a large, determined adversary takes more than displays of naval presence. That presence must be credible to serve as a deterrent or to change adversarial behaviour,\" Powell said. \nAlcos said they welcome the idea of surface action groups inclusion in future \"maricreated_at cooperative activities\" with US naval forces, including during the annual \"Balikatan\" exercises. \nHowever, Powell said that if Manila's new approach is to avoid the pitfall of sacrificing presence for power, the Philippine Navy will need additional resources. \n\"Ships at sea cost more than ships in port, and keeping surface action groups at sea is more expensive than doing the same with single vessels. Some of this may be offset through efficiencies and technology, but even those cost money,\" Powell said, adding that the Ferdinand Marcos Jnr administration could leverage public interest to secure additional funding for maricreated_at security. \nChester Cabalza, president of the Manila-based International Development and Security Cooperation, said there is a higher stake for China to multiply its force in the contested waters. \nWhile China has more naval assets than the Philippines, Cabalza said Manila could multiply its force through joint patrols with allies. \n\"But as the Southeast Asian country acquires more ships from Japan and France, and few indigenous ships were built in the Philippines, the country has begun to counter China's grey zone in terms of size and quantity,\" Cabalza said, noting this reflects the country's growing confidence and readiness to defend its sovereignty and territorial integrity. \nMoreover, Cabalza said the visibility of naval and coastguard ships around the Philippine archipelago is part of the country's CADC strategy. \n\"It means that Manila wants a head on truce with Beijing in asserting its own jurisdiction in the world's fifth-longest coastline,\" Cabalza said. \nAnother observer, defence expert Joshua Espeña, lecturer at the Polytechnic University of the Philippines, said the strategy is like an American Carrier Strike group but minus the aircraft carrier. \n\"If this becomes possible, then it will be a breakthrough for the Philippine Navy to become a proper navy. They probably aim for a strategy of employing forward forces to deny enemies of sea control, or at least demonstrate their ability to do it,\" said Espeña. \n\"Naval warfare is attritional. Its operational tempo is slower compared to ground and air warfare,\" he said. \"It requires so many resources such as adding auxiliary ships like supply ships and oil tankers aside from combat ships for it to function properly.\" \nWhile the timing of the Manila strategy announcement seems to have been particularly well-chosen, Leveau said China's increasing assertiveness likely pressured the Philippine government to rethink its naval strategy. \n\"It demonstrates an intention to stand firm against incursions and to make it clear that the country will not be intimidated by external powers,\" Leveau stressed. \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
      },
      {
        "id": 2076,
        "title": "Rubio backs Manila, slams 'dangerous' actions by China in disputed waters",
        "created_at": "2025-01-24",
        "text": "\nUS Secretary of State Marco Rubio has reaffirmed Washington's commitment to Manila and condemned Beijing for its \"dangerous and destabilising\" actions in the South China Sea, in his first phone call with Philippine Foreign Secretary Enrique Manalo. \nRubio \"underscored the United States' ironclad commitments to the Philippines under our mutual defence treaty\", State Department spokeswoman Tammy Bruce said. \nIn Wednesday's phone call, they discussed \"issues of mutual concern\", including China's \"dangerous and destabilising actions in the South China Sea\", she said, adding Rubio conveyed Beijing's behaviour \"undermines regional peace and stability and is inconsistent with international law\". \nCommenting on the call, Chinese foreign ministry spokeswoman Mao Ning yesterday said China's activities in the relevant waters were legitimate, lawful and beyond reproach. \n\"The US is not a party to the South China Sea issue and has no right to interfere in the maricreated_at issues between China and the Philippines. The military cooperation between the US and Philippines should not undermine China's sovereignty, maricreated_at rights and interests in the South China Sea, nor should it be used to support the illegal claims of the Philippines,\" Mao said.  \nThe reported comments by the US secretary of state - which mark Rubio's first direct rebuke of China since taking office on Tuesday - were delivered against a backdrop of rising tensions in the waters between Beijing and Manila, Washington's oldest ally in Asia. \nThe Philippines has denounced the presence of China's coastguard vessels near Scarborough Shoal - the subject of competing claims by the two countries - while Beijing has accused Manila of \"hyping up\" disputes in the region. \nIn a further sign of rising tensions, the Chinese military held two days of combat readiness patrols in the South China Sea last week that coincided with the first bilateral maricreated_at exercises of the year between the Philippines and the United States. \nIn a social media post, Manalo said he and Rubio talked about the importance of the alliance between Manila and Washington following President Donald Trump's return to the White House. \"We discussed the importance of the PH-US alliance for the prosperity and security of the Indo-Pacific, and the strength of our bilateral political, economic, and people-to-people ties,\" he said in the post. \nManalo added Manila was ready to work with the new US administration \"towards addressing challenges and sustaining the momentum and positive trajectory in our bilateral relations\". \nRubio is a vocal critic of Beijing who has previously advocated for strong alliances to counter China. As a Florida senator, he introduced a bill in July supporting Manila \"diplomatically, economically, and militarily as it resists Chinese efforts to seize Philippine territory in the South China Sea\". \nIn another move that could dismay Beijing, Rubio convened a meeting of the Quadrilateral Security Dialogue with his counterparts from Japan, Australia and India on his first day in office, followed by bilateral talks with each of them.\n"
      },
      {
        "id": 2077,
        "title": "United States: US freedom of navigation operations 'unsuccessful,' study says",
        "created_at": "2025-01-24",
        "text": "\nSo-called freedom of navigation operations, or FONOPs, that the U.S. Navy has been carrying out against China's extensive maricreated_at claims in the South China Sea, have proved ineffective and even risk escalating tensions, Australian research found.\nThe findings, in the paper Don't Shoot the Messenger: Perception & Misperception in the South China Sea, by Nell Bennett, are part of the Blue Security program, a collaboration between various Australian universities and institutes.\nBennett, a researcher specializing in maricreated_at and naval affairs, looked into the FONOP program between 2016 and 2023 when, in her opinion, the U.S. made the South China Sea a focus and directed its attention towards China's maricreated_at claims there.\nThe seven-year FONOP program has seen China go from measured rejection of U.S. messages to more explicit hostility, Bennett said in the report.\nChina did not accept the messages that the U.S. sought to send through its FONOP program, she said, adding that as China's behavior remains unaltered and becomes even more belligerent, the FONOPs are deemed unsuccessful.\n'Strategic communication'\nFreedom of navigation, according to the U.N. Convention on the Law of the Sea , or UNCLOS, is the right of all states to sail the high seas, as well as to fly over them, without interference from other states.\nSince 1979, the United States has conducted FONOPs to uphold UNCLOS provisions and reject unlawful attempts by coastal states to restrict the rights and freedoms of navigation and overflight as well as other lawful uses of the sea, as defined by the Pentagon.\nThe U.S. campaign shows that the United States does not acquiesce to the excessive maricreated_at claims by other nations and prevents them from becoming accepted customary international law, the Department of Defense said in an annual report.\nSince the end of 2015, U.S. naval ships regularly sailed near disputed features in the South China Sea, as well as in the Taiwan Strait, to challenge the claims by not only China but also by others, such as Vietnam, Malaysia and Taiwan, that the U.S. views as inconsistent with UNCLOS.\nThe report's author considered FONOPs a form of strategic communication, or messages that are communicated to advance a strategic objective.\nThe idea is that the state will receive the message and either reconsider or change its course of action, Bennett wrote.\nHowever, despite the 46 reported FONOPs in the South China Sea from 2016 to 2023, China's responses became more oppositional over created_at.\nNot only did China use U.S. actions as justification for its own militarization, but it also made a thinly veiled threat of retaliation, the researcher said, citing statements by Chinese military officials and media reports.\nThe key factor that will determine whether a message will be accepted is the pre-existing relationship between the states, Bennett argued, and as China viewed the U.S. as a competitor and potential threat, it was predisposed to reject the U.S. communication, which is unlikely to bring about any change in Beijing's behavior.\nThis argument actually has been floating around since FONOPs started, said Collin Koh, senior fellow at the S. Rajaratnam School of International Studies in Singapore, who recorded every FONOP by U.S. and allied vessels in the region.\nI think the whole idea, firstly, is to let China know it's created_at to roll back on its excessive maricreated_at claims, but notext has realistically expected to achieve Beijing's rolling back so it is a bit hasty to say it's unsuccessful, Koh told Radio Free Asia.\nChina would still conduct land reclamation and military exercises to exert control according to its plans and strategies, but the U.S. FONOPs had helped to deter Beijing's gray zone campaign of coercive pressure, he added.\nAn in-depth study is needed to reach conclusions, Koh said.\nSometext cares\nIn Koh's opinion, the U.S. strategic messaging is also intended to reassure countries in the region about Washington's stabilizing role, that is to say that there is sometext who cares.\nAt least one country acts for public common good and its actions should be appreciated by all countries facing China's aggression, Koh said.\nI don't think FONOPs are designed to stop Chinese aggression, said Malcolm Davis, a senior analyst at the Australian Strategic Policy Institute, or ASPI, a government think tank.\nThey are there to demonstrate to Beijing that the U.S. maintains the right to sail in international waters and challenges China's illegal claims to territory.\nOnly China has publicly and officially protested against the U.S. FONOPs that it sees as disruptive and a grave threat to China's sovereignty and security.\nIn her research, Bennett also noticed that the Philippines remained supportive of U.S. messaging and its media even adopted the rhetoric and justifications that the U.S. provided in support of the operations.\nMany would argue that [without the FONOPs] it would be more challenging to send clear, consistent messages to Beijing regarding international law and territorial disputes in the South China Sea, said Troy Lee-Brown, project manager of Blue Security and co-editor of Blue Security Maricreated_at Affairs Series.\nHowever, ultimately, as the author Nell Bennett points out, the effectiveness of FONOPs depends on how they are perceived.\nSo, there is a tension there between the two points of view on their efficacy, Lee-Brown told RFA.\nLee-Brown suggested that FONOPs should ideally be complimented by other forms of strategic communication - diplomatically, through statements and declarations, military presence and exercises with partners and allies, and legal and normative advocacy amongst other aspects.\nAnalysts also pointed out that the U.S. not being a party to UNCLOS presents challenges to its advocating a rules-based order in the South China Sea.\nHowever, the U.S. has consistently observed UNCLOS as customary international law and conducts operations in accordance with its principles, Lee-Brown added.\nASPI's Malcolm Davis said it's important that the U.S. maintains FONOPs and it's also important that other U.S. allies participate in one way or another, or, like Australia, undertake similar operations to demonstrate international law at sea.\nSource: Radio Free Asia\n"
      },
      {
        "id": 2079,
        "title": "US moves Typhon missile launchers to new location in northern Philippines",
        "created_at": "2025-01-24",
        "text": "\nThe US military has moved its Typhon launchers, which can fire multipurpose missiles up to thousands of kilometers, from Laoag airfield in the Philippines to another location on the island of Luzon, a senior Philippine government source said.\nThe Tomahawk cruise missiles in the launchers can hit targets in both China and Russia from the Philippines. The SM-6 missiles it also carries can strike air or sea targets more than 200 km (165 miles) away.\nThe senior Philippine government source said the redeployment would help determine where and how fast the missile battery could be moved to a new firing position. That mobility is seen as a way to make them more survivable during a conflict.\nSatellite images showed the batteries and their associated gear being loaded onto C-17 transport aircraft at Laoag International Airport in recent weeks, said Jeffrey Lewis of the Middlebury Institute of International Studies. The white rain canopies that had covered the Typhon equipment were also removed, based on the images seen by Reuters.\nThe Typhon system is part of a US drive to amass a variety of anti- ship weapons in Asia.\nIndo-Pacific Command (INDOPACOM), which oversees US forces in the region, told Reuters the Typhons have been “relocated within the Philippines.” Both INDOPACOM and the Philippine government declined to give the specific location to which the batteries were moved.\n“The US government has coordinated closely with the Philippine government on every aspect of the MRC deployment, including the location,” said Commander Matthew Comer of INDOPACOM, referring to the Typhon by the initials of its formal name, mid-range capability.\nHe added that the relocation was not an indication that the batteries would remain permanently in the Philippines.\nThe weapon drew sharp criticism from China when it was first deployed in April 2024 during a training exercise. In September, when the US said it had no immediate plans to pull the Typhons out of the Philippines, China and Russia condemned the deployment as fueling an arms race.\nChina’s Foreign Ministry accused the Philippines on Thursday of creating tension and confrontation in the region, and urged it to “correct its wrong practices.”\n“(The deployment) is also an extremely irresponsible choice for the people of the country and various Southeast Asian countries, and for regional security,” ministry spokesperson Mao Ning said at a news briefing.\nTyphons are relatively easy to produce — drawing on large stockpiles and designs that have been around for a decade or more — and could help the US and its allies catch up quickly in an Indo-Pacific missile race in which China has a big lead.\nAlthough the US military has declined to say how many will be deployed in the Indo-Pacific region, more than 800 SM-6 missiles are due to be bought in the next five years, according to government documents outlining military purchases. Several thousand Tomahawks are already in US inventories, the documents showed.\nBoth missiles are Raytheon products.\n‘IRONCLAD COMMITMENTS’\nMeanwhile, US Secretary of State Marco Rubio discussed China’s “dangerous and destabilizing actions in the South China Sea” with his Philippine counterpart on Wednesday and underscored the “ironclad” US defense commitment to Manila.\n“Secretary Rubio conveyed that (China’s) behavior undermines regional peace and stability and is inconsistent with international law,” the US State Department said in a statement on the call with Foreign Affairs Secretary Enrique A. Manalo.\nThe two also discussed ways to boost security and economic ties between both countries for “further regional cooperation.”\nThe US is the Philippines’ major security partner, with a 1951 Mutual Defense Treaty compelling both nations to defend each other in case of an armed attack.\nThe Philippines has been embroiled in wrangles at sea with China in the past two years and the two countries have faced off regularly around disputed features in the South China Sea that fall within Manila’s exclusive economic zone.\nMr. Rubio’s call came after he hosted counterparts from Australia, India and Japan in the China-focused “Quad” forum on Tuesday, the day after President Donald J. Trump returned to the White House. The four recommitted to working together.\nQuad members and the Philippines share concerns about China’s growing power and analysts said on Tuesday’s meeting was designed to signal continuity in the Indo-Pacific and that countering Beijing would be a top priority for Mr. Trump.\nIn the call with Mr. Manalo, Mr. Rubio “underscored the United States’ ironclad commitments to the Philippines” under their Mutual Defense Treaty and discussed ways to advance security cooperation, expand economic ties and deepen regional cooperation, according to the statement.\nChina’s Foreign Ministry said its activities in the waters were “reasonable, lawful and beyond reproach.”\nSpeaking at a regular press conference, Ms. Mao, the Chinese Foreign Ministry spokesperson, said the US was “not a party” to the South China Sea dispute, and had “no right to intervene” in maricreated_at issues between China and the Philippines.\n“Military cooperation between the US and the Philippines should not undermine China’s sovereignty and maricreated_at rights and interests in the South China Sea, nor should it be used to endorse the illegal claims of the Philippines,” she said.\nJust ahead of Mr. Trump’s inauguration, the Philippines and the US held their fifth set of joint maricreated_at exercises in the South China Sea since launching the exercises in 2023.\nSecurity engagements between the allies have soared under Philippine President Ferdinand R. Marcos, Jr., who has moved closer to Washington and allowed the expansion of military bases that American forces could access, including facilities facing the democratically governed island of Taiwan, which China claims as its own.\nVisiting the Philippines last week, Japanese Foreign Minister Takeshi Iwaya said a trilateral initiative to boost cooperation launched by Japan, the US and the Philippines at a summit last year would be strengthened when the new US administration took over in Washington.\n“This is music to Manila’s ears as Washington supports us and rebukes Beijing’s inconsistent appreciation of international law,” Chester B. Cabalza, founding president at Manila-based think tank International Development and Security Cooperation, said in a Facebook Messenger chat.\n“But the US and Philippines must work harder to maintain peace and order in the West Philippine Sea and ensure that China will not abuse its show of force and noncompliance with the 2016 arbitral award,” he added.\nAlso on Thursday, Japanese Ambassador to the Philippines Endo Kazuya said Japan would continue working with members of the Association of Southeast Asian Nations (ASEAN) to keep the rule-based order.\n“The world’s oceans are interconnected, and comprehensive international cooperation and partnership are necessary to address maricreated_at security issues in each sea area,” he said in a speech at a security forum in Manila. “We are committed to working with ASEAN countries and other concerned countries to maintain and strengthen the maricreated_at order based on the rule of law.”\n"
      },
      {
        "id": 2080,
        "title": "Arrest of alleged Chinese spy in the Philippines opens new episode of friction",
        "created_at": "2025-01-24",
        "text": "\nManila, Jan 24 (EFE) - The arrest of an alleged Chinese spy in the Philippines, who allegedly mapped military bases to which the U.S. has access, has opened a new episode of friction between Beijing and Manila that adds to the tensions between them over territorial disputes in the South China Sea.\n\"Any indication\" of espionage \"is very serious,\" the Philippine Department of Foreign Affairs said Friday on the social network Facebook, before adding to be ready to support the ongoing investigation led by the National Bureau of Investigation (NBI), the Department of Justice and the armed forces.\nThe NBI claimed last Monday in a statement that the alleged Chinese spy, Deng Yuanqing, and two other Filipino nationals accused of collaboration, \"conducted illegal surveillance and espionage\" in the Asian country.\nIn particular, Deng allegedly used \"advanced equipment\" installed in a vehicle to map and transmit detailed data on key defense structures in the Philippines.\nThese include military bases to which U.S. troops have access under the Enhanced Defense Cooperation Compact (EDCA), the Asian country's Armed Forces chief Romeo Brawner Jr. said during a press conference on Monday.\nDeng, according to Philippine authorities, is affiliated with the Chinese People's Liberation Army University of Science and Technology and his alleged activities were first detected last December.\nThe accusations irritated Beijing, which denied Manila's version. Chinese Foreign Ministry spokeswoman Mao Ning urged the Philippine authorities to \"stop peddling\" their theory of the alleged spy and \"seriously protect the legitimate rights and interests\" of their citizens.\nThe alleged spying case joins another case reported by Manila earlier this month. A group of fishermen found an underwater drone about three meters long with possible \"military applications,\" a Philippine Navy spokesman said last Jan. 7, the provenance of which is still under investigation.\nThese cases led an Asian Navy spokesman, Roy Vincent Trinidad, to affirm that \"there seems to be a deliberate and calculated plan to map\" the Philippines by a \"foreign power\", without directly mentioning China.\nManila and Beijing are in conflict over the sovereignty of territories in the South China Sea, a strategic region through which some 30% of global trade passes, which is home to 12% of the world's fishing grounds and has potential oil and gas reserves.\nThe main risk is that this region becomes the scene of a potential conflict between Beijing and Washington, because although the United States does not have any direct sovereignty dispute, it maintains a mutual defense pact with the Philippines. EFE \n"
      },
      {
        "id": 2081,
        "title": "China’s air-sea drone could rewrite the rules of naval warfare",
        "created_at": "2025-01-24",
        "text": "\nChina has developed the world’s first drone that can be launched by a submarine from the water, loop repeatedly between the sea and the sky, and eventually return to the same sub, according to researchers at Northwestern Polytechnical University (NWPU) and the China Aerodynamics Research and Development Center (CARDC) cited in a South China Morning Post report.\nWhile the US military is considering the deployment of submarines near the Chinese coast to release drones that swarm in the air and launch attacks on the People’s Liberation Army’s (PLA) fleet during a potential conflict over Taiwan, China has already achieved this capability and potentially more than the Pentagon envisions for its own forces, according to the SCMP report.\nThe new Chinese air-to-sea drone, known as Feiyi, features a unique foldable wing design that reportedly enhances its concealment and survival abilities. The Feiyi can navigate underwater efficiently and perform high-agility maneuvers in the air, making it suitable for marine reconnaissance, surveillance and strike missions, the SCMP report said.\nFeiyi’s cutting-edge features, bolstered by China’s unmatched drone manufacturing network and its growing prowess in cross-media weaponry, signal a potential edge for China in future naval conflicts involving drones with the US.\nSimilarly, the US Navy is testing the Naviator drone, an unmanned vehicle capable of aerial and underwater operations. According to The War Zone, the Naviator is designed for autonomous launch and recovery from unmanned underwater vehicles (UUV) and can transition seamlessly between air and water, enhancing its deployment flexibility.\n      Latest stories     \n                  \nFirst flex of Trump’s peace through strength strategy\n          \n                  \nMove over CHIPS Act, Stargate is the future\n          \n                  \nBank of Japan hikes rates with a wary eye on Trump\n          \nThe Naviator features precise GPS and visual position hold, a power-saving buoy sentry mode, the ability to carry various sensors and payloads and faster deployment than traditional underwater vehicles. The US Navy’s Orca Extra-Large Unmanned Undersea Vehicle (XLUUV) could be a candidate for the Naviator’s possible launch platform.\nIts size and payload volume surpass those of most existing underwater vehicles, allowing for versatile mission profiles beyond minelaying operations. Its diesel-electric propulsion system enables autonomous operations for up to 30 days and 6,000 nautical miles, although operational testing is ongoing to refine these capabilities, according to The War Zone.\nThe tactical impact of these cross-media drones is that they can bypass multilayered defenses, possibly overcoming the limitations of conventional and hypersonic weapons, and overwhelm the enemy by swarming attacks from multiple domains and directions.\nFurther, these developments may tie into the more prominent “dronification” of undersea tensions in the Taiwan Strait, South China Sea and Indian Ocean.\nExploring the role of UUVs in the Taiwan Strait, the Center for a New American Security (CNAS) mentions in a June 2024 report that UUVs play a vital role in enhancing China’s maricreated_at surveillance and anti-access/area denial (A2/AD) capabilities.\nThese UUVs conduct covert intelligence, surveillance and reconnaissance (ISR) operations, monitor naval activities, map the seabed and locate critical undersea infrastructure. Their autonomous operations also reduce detection risks, making them effective in contested waters.\nBy integrating UUVs into its broader drone fleet, China is establishing a multidomain surveillance network that bolsters its ability to disrupt communications and counter foreign interventions. This move aligns with China’s strategy to offset conventional disadvantages and strengthen its position in potential Taiwan conflict scenarios.\nIn the 2024 book “Navigating East Asian Maricreated_at Conflicts: Technological Change, Environmental Challenges, Global and Regional Responses,” Henrik Hiim mentions that UUVs and Unmanned Surface Vehicles (USV) play a nuanced role in US-China undersea competition in the South China Sea.\nChina uses UUVs to counter US nuclear attack submarines (SSN) by enhancing maricreated_at domain awareness, in line with its efforts to turn the South China Sea into a protected bastion for its nuclear ballistic missile submarines (SSBN).\nIn turn, the US uses Unmanned Maricreated_at Systems (UMS) to support strategic anti-submarine warfare (ASW) operations in the South China Sea but is constrained by limited endurance and vulnerability in China’s A2/AD environment.\nSign up for one of our free newsletters\nHowever, Hiim argues that while UMSs may not decisively alter the undersea power balance, they exacerbate maricreated_at disputes, fueling US-China rivalry and intensifying the regional security dilemma.\nIn the Indian Ocean, the Center for Strategic and International Studies (CSIS) think tank mentions in a January 2024 report that China’s operations in the area are characterized by extensive dual-use research activities, blending scientific and military objectives.\nThe PLA leverages a vast fleet of civilian research vessels to gather critical data on water conditions, currents, and the seafloor, thereby enhancing its naval capabilities. These vessels, often owned by state-affiliated organizations with military ties, conduct surveys that support China’s strategic ambitions.\nNotably, Chinese ships have been active in the Indian Ocean, deploying advanced underwater gliders and profiling floats to build a real-created_at ocean observation network. This data collection could aid the PLA Navy’s (PLAN) submarine operations in the area to counter India’s bastion in the Bay of Bengal for its SSBNs.\nAnalysts have noted India could use its undersea nuclear deterrent as a backstop should its conventional military capabilities be overwhelmed in its ongoing border dispute with China in the Himalayas.\nThank you for registering!\nAn account was already registered with this email. Please check your inbox for an authentication link.\nClick to share on X (Opens in new window)\nClick to share on LinkedIn (Opens in new window)\nClick to share on Facebook (Opens in new window)\nClick to share on WhatsApp (Opens in new window)\nClick to share on Reddit (Opens in new window)\nClick to email a link to a friend (Opens in new window)\nClick to print (Opens in new window)\n"
      },
      {
        "id": 2082,
        "title": "Alleged Chinese spy's arrest in Philippines opens new dispute; PHILIPPINES CHINA",
        "created_at": "2025-01-24",
        "text": "\nABSTRACT\nManila, Jan 24 (EFE).- The arrest of an alleged Chinese spy in the Philippines, who reportedly mapped military bases to which the United States has access, has opened a new episode of friction between the countries that Manila denounced Friday.\nFULL TEXT\nManila, Jan 24 (EFE).- The arrest of an alleged Chinese spy in the Philippines, who reportedly mapped military bases to which the United States has access, has opened a new episode of friction between the countries that Manila denounced Friday.\n\"The department takes any indication of espionage operations by foreign nationals seriously,\" the Philippine foreign office said on its Facebook profile Friday, adding that it is ready to support the ongoing investigation led by the country's investigation bureau, justice department and armed forces.\nThe incident adds to the tensions the countries maintain over territorial disputes in the South China Sea.\nThe bureau said in a statement Monday that the alleged Chinese spy, Deng Yuanqing, and two other Philippine nationals accused of collaboration, \"conducted illegal surveillance and espionage\" in the country.\nIn particular, Deng allegedly used \"advanced equipment\" installed in a vehicle to map and transmit detailed data on key defense structures in the Philippines.\nThese include military bases to which US troops have access under the Enhanced Defense Cooperation Agreement, the head of the country's armed forces Romeo Brawner Jr., said during a press conference Monday.\nDeng, according to Philippine authorities, is affiliated with the Chinese People's Liberation Army University of Science and Technology and his alleged activities were first detected in December.\nThe accusations angered Beijing, which denied Manila's version. Chinese Foreign Ministry Spokeswoman Mao Ning urged Philippine authorities to \"stop selling\" their theory of the alleged spy and \"seriously protect the legitimate rights and interests\" of its citizens.\nThe incident comes amid another spying case reported by Manila at the beginning of the month. A group of fishermen found an underwater drone about three meters long with possible \"military applications,\" a spokesman for the Philippine navy said on Jan. 7, whose origin is still being investigated.\nSpokesman Roy Vincent Trinidad said \"there seems to be a deliberate and calculated plan to map\" the Philippines by a \"foreign power,\" without directly mentioning China.\nManila and Beijing are in conflict over the sovereignty of territories in the South China Sea, a strategic region through which approximately 30 percent of global trade passes, which houses 12 percent of the world's fishing grounds and has potential oil and gas reserves.\nThe main risk is that this region could become the scene of a potential conflict between Beijing and Washington, because although the US does not have any direct sovereignty dispute, it does have a mutual defense pact in force with the Philippines. EFE\ndaa/lds\n"
      },
      {
        "id": 2084,
        "title": "Data from Niigata University Update Knowledge in Animal Biotelemetry (Case report: Long-term GPS tracking throughout the breeding and non-breeding seasons of the streaked shearwater Calonectris leucomelas)",
        "created_at": "2025-01-24",
        "text": "\n2025 JAN 24 (NewsRx) -- By a News Reporter-Staff News Editor at Ecology Daily News -- New research on animal biotelemetry is the subject of a new report. According to news reporting from Niigata University by NewsRx journalists, research stated, \"The collection of wildlife tracking information throughout a species' entire life cycle is important for comprehensive ecological elucidation and the establishment of practical protected areas. Although streaked shearwater (SS) is a seabird species for which biologging techniques are highly developed, there have been no reports of successful global positioning system (GPS) tracking during the early breeding and non-breeding seasons, when recapture is difficult.\" \n Financial supporters for this research include Environment Research And Technology Development Fund of The Environmental Restoration And Conservation Agency of Japan; Japan Society For The Promotion of Science. \n Our news correspondents obtained a quote from the research from Niigata University: \"In this study, we succeeded in long-term GPS tracking, obtaining highly accurate tracking data during the non-breeding season from November to March and the early breeding season from April to July. We discuss the relationship between prey distribution and the marine environment to understand the species' foraging habitat preferences. In September 2018, we attached GPS tags to birds breeding on Toshima, in the Izu Islands, and recaptured two birds in August 2020 and 2022. The tags worked for 277 and 549 days and fixed 23,510 and 37,233 positions, respectively. During the early breeding season, the foraging area had low sea surface temperatures (SST) and high chlorophyll-a (Chl-a) concentrations and moved northward as the season progressed. During the non-breeding season, one bird wintered in the South China Sea and the other off northern New Guinea. In the South China Sea, SS preferred sea areas with an average SST of 26 °C and high Chl-a concentrations (> 0.8mg/m3), whereas off northern New Guinea, SS preferred an area with an average SST of 29 °C. The foraging area used during the early breeding season depended on the optimal water temperature zone for their primary prey-Japanese Anchovy.\" \n According to the news reporters, the research concluded: \"The foraging areas used during the non-breeding season matched the optimal water temperature zones of the main fish distributed in each sea area. The GPS tracking data obtained in this study, while not a statistically sufficient sample size, are valuable and provide new insights into the environmental preferences of SS during early breeding and non-breeding seasons; life stages for which little information is available.\" \n For more information on this research see: Case report: Long-term GPS tracking throughout the breeding and non-breeding seasons of the streaked shearwater Calonectris leucomelas. Animal Biotelemetry, 2025,13(1):1-7. (Animal Biotelemetry -  The publisher for Animal Biotelemetry is BMC. \n A free version of this journal article is available at  \n Our news editors report that more information may be obtained by contacting Taito Kamata, Faculty of Agriculture, Niigata University. Additional authors for this research include Masaki Shirai, Kazuhiko Hirata, Takahiro Sato, Haruka Mukai, Maki Yamamoto, Tsuneo Sekijima. \n Keywords for this news article include: Niigata University, Animal Biotelemetry, Ecology. \n Our reports deliver fact-based news of research and discoveries from around the world. Copyright 2025, NewsRx LLC \n"
      },
      {
        "id": 2086,
        "title": "Speaker reaffirms PH unwavering stance to protect sovereignty",
        "created_at": "2025-01-24",
        "text": "\n 24 Jan 2025 (Philippines News agency) Speaker Ferdinand Martin Romualdez has reaffirmed the Philippines' unwavering stance on territorial integrity as he highlighted President Ferdinand R. Marcos Jr.'s firm policy on safeguarding Philippine sovereignty.\nAccording to a news release from his office on Friday, Romualdez issued the statement during the Stakeholder Dialogue titled 'Navigating Asia's Hotspots' at the World Economic Forum (WEF) 2025 in Davos, Switzerland on Wednesday (local created_at).\n'President Ferdinand Marcos Jr. has been very, very firm on his policy that we should not give an inch of any Philippine territory,' Romualdez said.\n'Having that been said, we celebrate, of course, our rules-based global order, and with the [United Nations Convention on the Law of the Sea] and the 2016 arbitral award recognizing the sovereignty of the Philippines, we stand steadfast with the President's policy in enforcing that,' he added.\nHe was joined in the panel by Timor-Leste President Jose Ramos Horta and Indonesia Foreign Minister Sugiono; Michael Froman, president of the Council on Foreign Relations; and Tulsi Naidu, chief executive officer of Asia-Pacific at Zurich Insurance Group.\nRomualdez emphasized that the Philippines has adopted a pragmatic and balanced approach to navigating the intensifying geopolitical competition between the United States and China, particularly in relation to the South China Sea (SCS) issue.\nBalancing geopolitical interests\nDuring the dialogue, Romualdez underscored the Philippines' strategic position as an ally of the US and a vital trade partner of China, and advocated for leveraging both relationships to advance the country's national interests.\nHe emphasized that the territorial dispute in the SCS does not define the entirety of the country's relationship with China.\n'Despite the President being very firm on this policy of not giving up a single inch, we are working daily to de-escalate tensions. We do not want the South China Sea dispute to overshadow the many other facets of our relationship with China, including trade, education, and cultural exchanges,' Romualdez said.\n'We are not taking sides. The United States is our long-standing ally and China is our largest trading partner. The Philippines is navigating a middle path where we maximize opportunities from both relationships while actively participating in the broader global community,' he added.\nOn the bilateral ties with the US, Romualdez welcomed recent reassurances from new Secretary of State Marco Rubio on the Mutual Defense Treaty and Enhanced Defense Cooperation Agreement, noting their alignment with the Philippines' strategic priorities.\nReports said that in a call with his Philippine counterpart, Foreign Affairs Secretary Enrique Manalo, Rubio 'underscored the United States' ironclad commitments to the Philippines under our Mutual Defense Treaty.'\n'Our enduring alliance with the United States strengthens our ability to safeguard sovereignty and pursue peace. At the same created_at, we remain proactive in fostering relationships with all nations to promote global collaboration,' he said.\nEconomic growth, global engagement\nRomualdez likewise highlighted the economic benefits of the country's pragmatic foreign policy, noting its attractiveness to investors due to its robust gross domestic product (GDP) growth, youthful workforce, and strategic location within the Association of Southeast Asian Nations (ASEAN).\n'We are here at the WEF to tell the Philippine story -- of a nation full of potential and resilience. As part of ASEAN, we are at the heart of a dynamic growth region, and we are working to build stronger partnerships to unlock opportunities for trade and investment,' he said.\nHe emphasized how the Indo-Pacific region is emerging as a key hub for global trade, citing as example the Philippine government's engagements with industrial leaders from India.\nCommitment to peace, cooperation\nReiterating the Philippines' role in fostering regional stability, Romualdez affirmed the nation's dedication to the ASEAN centrality and multilateralism.\n'ASEAN continues to play a vital role in ensuring regional peace and stability. The Philippines remains committed to this multilateral framework, which has proven effective in addressing challenges while promoting cooperation,' he said.\nHe reiterated the Philippines' commitment to a balanced and pragmatic foreign policy, rooted in upholding sovereignty, fostering economic growth, and pursuing peaceful international collaboration.\n'Our future lies in de-escalating tensions, building meaningful partnerships, and safeguarding our principles. The Philippines is prepared to navigate the complexities of geopolitics, ensuring that our people benefit from peace, prosperity, and stability,' he said.\n"
      },
      {
        "id": 2090,
        "title": "UPDATE2: Top U.S. diplomat makes Trump's approach clear in talks with China",
        "created_at": "2025-01-24",
        "text": "\n U.S. Secretary of State Marco Rubio made clear to his Chinese counterpart Wang Yi during their phone talks on Friday that the new Donald Trump administration will focus on American interests above all else, the State Department said.\n Rubio also expressed deep concern over China's \"coercive\" actions against Taiwan and in the South China Sea, the department said, adding the secretary underscored Washington's commitment to its allies in the Indo-Pacific region.\n Rubio told Wang that the Trump administration will pursue a relationship with Beijing that \"advances U.S. interests and puts the American people first,\" it said.\n Still, Rubio's first call with Wang, which happened only days after the U.S. secretary took office, reflected the new administration's willingness to engage with China.\n The Chinese Foreign Ministry said Wang and Rubio agreed to maintain communication and properly manage differences between the world's two largest economies.\n Wang told Rubio, known as a longcreated_at China hawk, that Beijing \"has no intention of overtaking or replacing anyone,\" but added that China \"must defend our legitimate right to development,\" according to the ministry.\n On Taiwan, which China claims as part of its territory, Wang asked the United States to handle issues surrounding the island \"prudently,\" vowing that Beijing will \"never allow Taiwan to be separated from China,\" the ministry said.\n It quoted Rubio as saying the ties with China are \"the most important bilateral relationship in the 21st century\" and will determine the future of the world.\n Washington does not support \"Taiwan independence\" and hopes that the issue of the self-ruled island will be resolved peacefully in a way acceptable to both sides of the Taiwan Strait, according to the Chinese ministry.\n In a confirmation hearing for his post at the Senate Foreign Relations Committee earlier this month, Rubio said the United States must make China understand that the cost of invading Taiwan would be higher than the benefit.\n He said during the session that China is \"the most potent and dangerous near-peer adversary\" the United States has ever confronted.\n==Kyodo\n"
      },
      {
        "id": 2091,
        "title": "Philippines: Report: No maricreated_at piracy in Asia in 2024",
        "created_at": "2025-01-24",
        "text": "\nThe Regional Cooperation Agreement on Combating Piracy and Armed Robbery against Ships in Asia Information Sharing Centre (ReCAAP ISC) on Tuesday reported that there was not a single incident of piracy in Asia waters in 2024.\nIn a press conference in Manila, ReCAAP ISC executive director Krishnaswamy Natarajan said it is a proud moment for ReCAAP as well as all the contracting parties and member states in Asia.\nWe're ensuring an incident-free region through the help of local governments, Natarajan said.\nHe praised the Philippine Coast Guard (PCG) for doing a commendable job in the region.\nThere are no incidents of abduction of crew for ransom in the Sulu-Celebes area, he said.\nAccording to data from the ReCAAP ISC, there is a moderate low threat of abduction of crew in the Sulu-Celebes Seas and waters off Eastern Sabah.\nThe current classification means that abductions are unlikely to occur due to the perceived lack of capability of perpetrators to orchestrate an attack.\nHowever, minimal damage are expected to occur on vessels and crew in case of an attack.\nUnder the Piracy and Armed Robbery Against Ships in Asia 2024, the ReCAAP ISC reported 107 ship robberies, a six percent increase from 2023.\nOf the reported incidents, 62 occurred in the Straits of Malacca and Singapore (SOMS), 22 in Indonesia, 13 in Bangladesh, three in the Philippines, two in India, two in the South China Sea (SCS), two in Vietnam, and one in Malaysia.\nOf the total, there were 11 incidents in Bangladesh, Indonesia, and SOMS where the perpetrators failed to board ships through the vigilance of the crew and the presence of patrol vessels.\nNo crew was affected in 86 percent of the incidents.\nHowever, eight percent of cases had the crew tied up by the perpetrators, three percent where the crew were threatened, and three percent where the crew suffered injuries.\nOf these, 76 percent occurred in bulk carriers, 13 percent in tankers, 10 percent in tug boats towing barges or drill ships, and one percent in general cargo ships. - PNA\n"
      },
      {
        "id": 2093,
        "title": "Britain signs contract with Rolls-Royce to build reactors for submarines",
        "created_at": "2025-01-24",
        "text": "\nBy Alimat Aliyeva\nThe British government has signed an $11 billion contract with Rolls-Royce to build nuclear reactors for submarines as part of its submarine fleet modernization program, Azernews reports.\nThe Unity deal provides for the \"design, manufacture, and support of nuclear reactors\" for the United Kingdom's submarines.\nThis new contract with Rolls-Royce, as noted in London, is expected to enhance the United Kingdom's security and further strengthen the partnership within the AUKUS alliance, which was established in 2021 and consists of the United States, the United Kingdom, and Australia.\nUnder this partnership, military cooperation is planned in two main areas. The first involves providing Australia with a fleet of nuclear-powered submarines (SSNs). The UK plans to begin building a series of SSN-AUKUS submarines, which will eventually be adopted by both British and Australian navies. British companies BAE Systems and Rolls-Royce will collaborate with Australian shipbuilder ASC Pty Ltd to build these submarines.\nAfter 2030, the construction of these submarines will shift to Australia, with the first submarine set to be delivered in the early 2040s. In the meancreated_at, Australia will bolster its submarine fleet with three Virginia-class submarines purchased from the United States.\nThe second area of cooperation involves the joint development of military technologies across eight critical sectors, including underwater systems, quantum technologies, artificial intelligence and autonomous systems, cybersecurity and electronic warfare, hypersonic aircraft and interception systems, as well as innovations in information exchange technologies.\nThis deal highlights the growing defense collaboration between the AUKUS nations, signaling a strong shift in global military alliances in response to rising geopolitical tensions in the Indo-Pacific region. The AUKUS partnership, aimed at countering China's growing military presence, particularly in the South China Sea, will not only reshape the region's naval capabilities but also push forward technological advancements in areas like AI and hypersonic weapons. For Rolls-Royce, this contract is a major win, reinforcing its position as a leader in defense technology, particularly in the nuclear propulsion sector. Furthermore, the strategic importance of the Unity deal may have long-term implications for the balance of power in the Indo-Pacific and the development of cutting-edge military technology.\n"
      },
      {
        "id": 2094,
        "title": "French Navy’s flagship vessel to visit Manila for maricreated_at exercises",
        "created_at": "2025-01-24",
        "text": "\nCharles de Gaulle, the flagship vessel of the French Navy, will visit Manila for the first created_at to hold joint maricreated_at exercises within Manila’s exclusive economic zone (EEZ) east of the country next month, according to the French ambassador to Manila.\nThe Philippines is likely to be invited to join the naval drill with the US, although plans have not been finalized, French Ambassador to the Philippines Marie Fontanel told a security forum in Manila on Thursday.\n“The 2025 deployment has been planned in line with this partnership- oriented approach, encompassing both long-standing and more recent collaborations,” she said.\nShe added that the Pacific Stellar maricreated_at exercises with Washington would be held east of the Philippines within its EEZ.\nFrance and the Philippines are in talks finalize a visiting forces agreement after their defense chiefs signed a letter of intent in 2023. Ms. Fontanel said the draft agreement is being discussed by Philippine authorities.”\nThe Philippines and the US last week held maricreated_at exercises for a fifth created_at since 2023, the Armed Forces of the Philippine said on Sunday.\nThe joint maricreated_at activity included the US Carl Vinson Carrier Strike Group, two guided missile destroyers, two helicopters and two F-18 Hornet aircraft.\nThe Philippine side deployed its Antonio Luna frigate, Andres Bonifacio patrol ship, two FA-50 fighter jets and search and rescue assets of the air force.\nThe activities “reinforced bilateral maricreated_at cooperation and interoperability,” the Philippine armed forces said.\n“France seeks to strengthen its partnership with the Philippines but also to engage and collaborate with the Philippines’ existing partners,” Ms. Fontanel said.\nIn August last year, the US and French navies held war games in the Philippine Sea to advance their interoperability “in support of a free and open Indo-Pacific.”\nIn the past year, Manila has secured military pacts, arms assistance funding and maricreated_at capacity-building deals with allies including the US and Japan.\nWashington has committed about $500 million (P29.3 billion) in military aid for the Philippines until 2029.\nManila and Beijing have repeatedly clashed in the South China Sea, accusing each other of aggressive behavior involving their ships and of damaging the marine environment.\n"
      },
      {
        "id": 2096,
        "title": "WW3 'could erupt over US and China relations' says Singapore PM in chilling warning",
        "created_at": "2025-01-24",
        "text": "\nSingapore's Prime Minister has spoken out and given a stark warning that World War Three could be on the way – due to rising tensions between China and the US.\nPrime Minister Lawrence Wong said the rest of the world would suffer dire consequences if the two countries fall out, including an all-out war. It is said the United States and China are locked competing on the world stage, with newly-appointed Donald Trump supposedly working on security alliances and Beijing working on financial dominance.\nIn Trump's various presidential vows, he has threatened a possible new 10% tariff on Chinese goods. World leaders believe this move could reignite a trade war and increase tensions even further.\nSpeaking to the National University of Singapore's University Cultural Centre on Tuesday, Wong touched upon trade in South-East Asia. The South China Sea, which China claims, has been at the centre of territorial disputes involving countries like Vietnam and the Philippines.\nThe U.S. completes navigation exercises in the area to challenge China's claims, which Beijing strongly opposes.\n\"If the U.S. were to cut themselves off from China, it will be very damaging for the U.S. economy and for American citizens,\" Wong said. \"So much of what the U.S. manufactures and produces and imports for its people comes from China, so I can't see how a full decoupling can happen at this stage.\"\nHowever, he said this could be unlikely due to their interdependence, which neither can escape. In fact, Chinese officials have responded to Trump's tariff proposal. They claim \"there are no winners in a trade or tariff war.\"\nWong also mentioned the challenges Southeast Asian countries face in remaining neutral to both superpowers. He said Singapore and other similar countries should not be forced to \"choose sides,\" dividing the world into \"two blocs—the U.S. bloc and the China bloc,\" according to The Straits created_ats.\nTrump has not confirmed whether the tariff plans will go ahead – but many have warned that it'll just cause prices to raise for Americans as they will be forced to absorb business costs.\n                                             For the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletters.                    \n"
      },
      {
        "id": 2097,
        "title": "'PH firm on sovereignty, but also looking to deescalate tensions'",
        "created_at": "2025-01-24",
        "text": "\n House of Representatives Speaker Ferdinand Martin Romualdez has assured participants of the 2025 World Economic Forum (WEF) that while the Philippines will always protect its rights over territorial waters, it is also looking at deescalating tensions in the region.\nRomualdez made this remark on Friday, as he spoke at a stakeholder dialogue in the WEF, entitled 'Navigating Asia's Hotspots.'\nAccording to Romualdez, the Philippines maintains its strategic position as a United States (US) ally, while also being a vital trade partner of China - noting that the territorial dispute in the West Philippine Sea (WPS) does not define the entirety of Manila-Beijing ties.\n'President Ferdinand Marcos, Jr. has been very, very firm on his policy that we should not give an inch of any Philippine territory,' said Romualdez, one of the members of the Philippine delegation to the 2025 WEF in Davos, Switzerland.\n'Despite the President being very firm on this policy of not giving up a single inch, we are working daily to de-escalate tensions. We do not want the South China Sea dispute to overshadow the many other facets of our relationship with China, including trade, education, and cultural exchanges,' he added.\nRomualdez meanwhile said that the Philippine government continues to abide by a rules-based global order, particularly the United Nations Convention on the Law of the Sea (Unclos).\n'Having that been said, we celebrate, of course, our rules-based global order, and with the UNCLOS and the 2016 arbitral award recognizing the sovereignty of the Philippines, we stand steadfast with the President's policy in enforcing that,' he said.\n'We are not taking sides. The United States is our long-standing ally, and China is our largest trading partner. The Philippines is navigating a middle path where we maximize opportunities from both relationships while actively participating in the broader global community,' he added.\nAccording to Romualdez, he and the rest of the Philippine delegation attended the WEF to highlight the economic benefits of the Philippines' pragmatic foreign policy.\n'We are here at the WEF to tell the Philippine story-of a nation full of potential and resilience. As part of ASEAN, we are at the heart of a dynamic growth region, and we are working to build stronger partnerships to unlock opportunities for trade and investment,' he said.\n'ASEAN continues to play a vital role in ensuring regional peace and stability. The Philippines remains committed to this multilateral framework, which has proven effective in addressing challenges while promoting cooperation,' he added.\n"
      },
      {
        "id": 2098,
        "title": "PCG says BRP Cabra kept China vessel from approaching Zambales",
        "created_at": "2025-01-24",
        "text": "\n A Chinese Coast Guard vessel prowling waters off Zambales has moved from 65 to 80-90 nautical miles offshore after the \"strategic maneuvering\" of a Philippine patrol vessel. Still, it remains within Philippine territory despite persistent radio challenges from the Philippine side.\nBRP Cabra - a Parola-class patrol vessel of the Philippine Coast Guard - continues its \"vigilant monitoring\" of CCG 3103's illegal presence within the country's exclusive economic zone (EEZ), PCG spokesperson for the West Philippine Sea Commodore Jay Tarriela said in a statement on Thursday evening, January 23.\n\"The strategic maneuvering of BRP Cabra has effectively kept CCG-3103 from getting closer to the coastline of Zambales,\" he added.\nThe PCG spokesperson attributed the partial retreat of the Chinese vessel to the \"seamanship skills of the PCG personnel abroad.\" It was last spotted approximately 80 to 90 nautical miles off the coast of Zambales, well within the country's 200-nautical mile exclusive economic zone.\nThe crew of the BRP Cabra has issued hourly radio challenges to remind the Chinese vessel of its violations of Philippine maricreated_at law and international conventions, Tarriela added.\nBRP Cabra took over patrol duties from BRP Suluan on Wednesday, January 23. During the handover, a second Chinese vessel, CCG-3304, appeared briefly before withdrawing - a move the PCG interpreted as anticipating additional Philippine deployments.\nThe 77-meter CCG-3103 - which dwarfs the 44-meter BRP Cabra - is part of China's rotating fleet of vessels stationed in the waters off Zambales since the start of the year. While this area has not been a traditional flashpoint between both countries, it is near Scarborough Shoal, where Beijing has been restricting access since taking control in 2012.\nThe shoal, just 124 nautical miles from Zambales, is a rich fishing ground that a 2016 international tribunal ruled should remain open to Filipino fishermen.\nChina's sustained presence off Zambales, which entered its 19th day on Thursday, began when its Coast Guard sent its largest vessel just 54 nautical miles from Capones Island on January 4.\nThe 12,000-ton vessel's unprecedented proximity to the Philippine coastline had alarmed Philippine officials. The Department of Foreign Affairs has since filed a diplomatic protest to call on China to withdraw its vessels.\nFishermen's plight\nLocal fishermen have reported growing unease over China's maricreated_at presence. Leonardo Cuaresma, who chairs the Federated Association of Fisherfolk in Masinloc, said in a radio interview earlier this week that fishing communities are operating with increased caution due to the presence of Chinese vessels.\nThe fisherfolk leader said tensions have been heightened by the mysterious disappearance of several local fishermen last month under calm weather conditions. While no evidence links Chinese vessels to the disappearances, fishing communities have not dismissed possible encounters with foreign ships, he said.\nChina's increasing incursions into the Philippines' EEZ are part of its broader actions in the South China Sea, where it claims historic rights to almost all waters through its \"nine-dash line.\" An international tribunal invalidated this claim in 2016.\n"
      },
      {
        "id": 2099,
        "title": "BBCM China Watchlist 24 Jan 25",
        "created_at": "2025-01-24",
        "text": "\nStories being covered today by BBC Monitoring from Chinese broadcast, press and social media sources.\nChina refuses to confirm plan for a phone call with Rubio\nChinese Foreign Ministry Spokesperson Mao Ning said that she has \"no information to share\" when asked if Beijing plans to speak to new US Secretary of State Marco Rubio.\nAt the regular press conference on 23 January, Mao reiterated an earlier comment that it is \"necessary for high-level Chinese and US officials to engage each other in appropriate ways\" and that China will \"firmly defend its national interest\", state-run nationalist daily Global created_ats reported.\nMao, however, offered a more detailed response to a question about Rubio's phone call with Philippine Foreign Minister Enrique Manalo on 22 January, where they discussed China's \"dangerous and destabilising actions in the South China Sea\".\n\"China's activities in relevant waters are legitimate, lawful, and fully justified,\" Mao said, as she added that US-Philippine military cooperation \"should not undermine China's sovereignty and maricreated_at rights and interests\" and that Beijing will \"continue to take necessary steps\" to safeguard its \"territorial sovereignty and maricreated_at rights\" and uphold peace and stability in the South China Sea.\nOn another question about the US military redeploying the Typhon missile system to a new location in the Philippines, Mao criticised Manila for \"essentially creating tensions and antagonism in the region\" and called for it to \"correct the wrongdoing\" and remove the system as soon as possible, Global created_ats reported.\nMeanwhile, the Chinese commerce ministry reiterated China's position on Trump's tariff threats, saying that it is \"neither beneficial to China and US nor to the whole world\", official Xinhua News Agency reported.\nOn Trump's remarks that America should hold 50% of TikTok ownership, the ministry said it \"opposes moves that violate basic principles of market economy and undermine legitimate interests of companies\" and asked Washington to provide companies from all countries, including Chinese ones, a \"fair and just business environment\".\nSee also: Briefing: Taiwan's media, pundits divided on what Trump return means for Taipei  \nBriefing: China concerned over US leaving Paris accord, more optimistic on ties  \nChina sidesteps question on lifting sanctions on Rubio, stresses 'high-level' contact  \nBeijing condemns killing of Chinese national in Afghanistan&#160;\nChina has lodged \"serious protests\" with Afghanistan following the killing of a Chinese national in the north of the country and demanded a \"thorough investigation\" to bring the perpetrators to justice.\nResponding to questions about the Islamic State (IS) group claiming responsibility for the attack, Foreign Ministry Spokesperson Mao Ning told a regular media briefing on 23 January that China was \"deeply shocked\" and \"strongly condemns\" the killing.&#160;\nShe emphasised China's firm opposition to \"all forms of terrorism\" and called for \"resolute and strong efforts\" to combat groups such as the IS and the Xinjiang separatist group East Islamic Turkestan Movement (ETIM, also known as the Turkistan Islamic Party or TIP), which are designated terrorist organisations by the UN Security Council.\nMao pledged China's continued support for Afghanistan in fighting terrorism and urged the Taliban interim government to \"ensure the safety of Chinese citizens, institutions and projects\" in the country.\nTwo groups have claimed responsibility for the attack that led to the death of the Chinese national. The Islamic State Khorasan Province (ISKP) stated on 22 January that it killed a \"Chinese communist\" using machine guns in Takhar's Kakjar area. Separately, the National Mobilisation Front (NMF), a little-known anti-Taliban armed group, alleged it killed a Chinese \"mentor\" who was providing intelligence training to the Taliban.\nChinese media, however, noted that it was a Chinese worker at an Afghan mining company.\nAccording to Xinhua, the victim was shot dead on 21 January in Dasht Qala district, Takhar province. Provincial police Spokesperson Mohammad Akbar Haqqani stated to the agency that the incident was under investigation and \"the cause of the incident remains unclear\".\nThe incident notably occurred a day after the Taliban-run foreign ministry commemorated 70 years of diplomatic relations with Beijing.\nSee also: Briefing: Chinese national killed in north Afghanistan amid growing investment  \nEmbassy in Afghanistan to monitor reported killing of Chinese national  \nChina urges Thailand, Myanmar to crack down on telecom crimes\nChina has urged Thailand and Myanmar to step up a crackdown on cross-border telecom fraud following a series of high-profile cases of Chinese citizens being rescued from captivity in telecoms fraud camps run by criminal gangs.\nLiu Jinsong, director-general of the Chinese Foreign Ministry Department of Asian Affairs, made the appeal when meeting Thai Ambassador to China Chatchai Viriyavejakul and Ambassador of Myanmar to China Tin Maung Swe separately on 22 January, Xinhua News Agency reported.\nLiu expressed concerns that a series of recent \"vicious cases\" of telecoms fraud in the border region between Myanmar and Thailand affected the safety of Chinese citizens. He said China is willing to strengthen bilateral and multilateral law enforcement cooperation with Asean countries.\nEarlier on 21 January, the Lancang-Mekong Law Enforcement Cooperation Centre announced during a conference in China's border province of Yunnan that more than 70,000 people had been arrested in electronic fraud cases under the \"Seagull\" joint operation between August and December 2024, China Central Television (CCTV) reported. Over 160 victims had also been rescued during the period.\nThe \"Seagull\" initiative involved law enforcement departments from China, Laos, Myanmar, Thailand and Vietnam.\nChinese news websites also widely reposted a video of Thai Prime Minister Paetongtarn Shinawatra who, speaking in Mandarin aided by AI, reassured Chinese tourists that the country was safe to visit as holiday bookings have dropped in the wake of the recent rescue of Chinese actor Wang Xing, who was kidnapped in Thailand and brought to a cyber-fraud camp in Myanmar.&#160;\nSee also: More Chinese rescued after 3 January kidnap of actor in Thailand  \nBriefing: China's Spring Festival travel rush gets under way  \nMedia subdued on death sentence for Chinese man in Japanese attack\nA court in the city of Suzhou sentenced a Chinese man to death for a knife attack that injured a Japanese mother and child and killed a Chinese bus guide last year.\nWhile the verdict announced by the Suzhou Intermediate People's Court on 23 January received wide coverage in Hong Kong and Taiwan media, it was notably subdued in mainland Chinese media.&#160;\nAt a regular press briefing later that day, Foreign Ministry Spokesperson Mao Ning avoided commenting directly on the sentence, stating that judicial authorities would handle the case according to the law. She reiterated China's commitment to protecting the safety of foreign nationals.\nThe attack occurred on 24 June, when the man, aged in his 50s, assaulted the Japanese pair waiting for a school bus.&#160;\nCiting Kyodo, Hong Kong-based state affiliated Phoenix TV briefly noted the lack of details on charges and motives, while adding that the man, \"unemployed and without family\", had travelled to Suzhou and felt \"deeply lonely\".&#160;\nThe case, along with a fatal September stabbing of a 10-year-old Japanese schoolboy in Shenzhen, heightened safety concerns among Japanese nationals in China.&#160;\nTaiwan's United Daily News newspaper added that Japan's Chief Cabinet Secretary Yoshimasa Hayashi had called the crime \"no way justifiable\" and urged China to safeguard Japanese citizens.\nSee also: Briefing: Japanese pupil stabbed as China marks sensitive war anniversary  \nBriefing: Heightened security after 35 killed in car ramming attack in China  \nSource: BBC Monitoring, 24 Jan 25\n"
      },
      {
        "id": 2101,
        "title": "US Redeploys Rocket Launcher on Allied Territory Near China",
        "created_at": "2025-01-24",
        "text": "\nThe United States has reportedly moved a missile system, which had been deployed in the Philippines since last April, to a new site.\nNewsweek has contacted the Pentagon and the Armed Forces of the Philippines by email for comment. The Chinese military did not immediately respond to a request for comment.\nWhy It Matters\nThe Mid-Range Capability (MRC) missile system can fire the Tomahawk cruise missile and the Standard Missile 6, with respective ranges of 1,000 and 290 miles. The former can hit targets at sea and on land, while the latter conducts anti-air and anti-surface missions.\nLast spring, the U.S. Army deployed an MRC, also known as Typhon, to ally the Philippines for drills, but it was decided to keep it there \"indefinitely.\" China, which has territorial disputes with Manila in the South China Sea, has repeatedly objected to the deployment.\nWhat To Know\nThe Typhon missile system was redeployed from its original site at Laoag airfield on the island of Luzon in the northern Philippines to another location on the island, Reuters reported on Thursday. Tomahawk missiles can strike eastern and southern China from Laoag.\nSatellite imagery also captured a U.S. Air Force C-17 cargo plane at Laoag, to be used in relocating the missile system, as early as December 30 last year. A January 8 satellite image showed the missile system was no longer at the airfield.\nA senior Philippine government source told Reuters that the Typhon's relocation would help determine \"where and how fast the missile battery could be moved to a new firing position.\" Such mobility is seen as a way to make the missile system more survivable in a conflict, the report added.\nU.S. Indo-Pacific Command confirmed the relocation to Reuters but declined to give the specific location. The command, which is responsible for U.S. forces in the region, said the relocation did not indicate the Typhon would be in the Philippines permanently.\nThe Philippine Army confirmed to the country's GMA News Online that the missile system will be employed in an upcoming bilateral exercise with its American counterpart. The exercise, code-named Salaknib, is aimed increasing readiness, reinforcing interoperability and strengthening relationships, according to the U.S. military.\nMao Ning, a Chinese Foreign Ministry spokesperson, said that the Typhon is a strategic offensive weapon and its deployment in the Philippines is a \"highly dangerous move.\"\nWhat People Are Saying\nU.S. Indo-Pacific Command spokesperson Commander Matthew Comer told Reuters: \"The U.S. government has coordinated closely with the Philippine government on every aspect of the MRC deployment, including the location.\"\nPhilippine Army spokesperson Colonel Louie Dema-ala told GMA News Online: \"There will be trainings to be conducted utilizing the [Mid-Range Capability missile system] as part of the subject matter expert exchanges in preparation for the Salaknib.\"\nChinese Foreign Ministry spokesperson Mao Ning said at a press conference: \"We once again call on the Philippines to heed the call from regional countries and their peoples, correct the wrongdoing as soon as possible, quickly pull out the Typhon missile system as publicly pledged, and stop going further down the wrong path.\"\nWhat Happens Next\nIt remains to be seen how long the missile system will be stationed in the Philippines and whether it will conduct live-fire tests to validate its capability of striking a moving target.\nLink to Image\n\nGraphic\n \nU.S. Deploys Mid-Range Capability Missile Launcher\nCaptain Ryan DeBooy/US Army\nA United States Army Mid-Range Capability missile launcher is loaded into a U.S. Air Force C-17 cargo plane as part of its first deployment into theater at Joint Base Lewis-McChord in state of Washington on April 4, 2024.\n"
      },
      {
        "id": 2103,
        "title": "ANWAR MAKES LASTING IMPRESSION AT WEF",
        "created_at": "2025-01-24",
        "text": "\nKUALA LUMPUR: PRIME Minister Datuk Seri Anwar Ibrahim made an indelible mark at the World Economic Forum (WEF) 2025 in Davos, Switzerland.\nHe seamlessly navigated discussions that ranged from light-hearted conversations about his favourite football club to the intricate dynamics of international relations and challenges and successes of regional integration.\nHis ability to balance the conversation in his engagements showcased Malaysia's unique position in global diplomacy, especially in dealing with countries with varying political ideologies and economic policies.\nHis first engagement at the WEF came from none other than Manchester United Football Club co-chairman Avram Glazer regarding Malaysia's goal for sports in future.\nAnwar firstly replied that as a fan of the 147-year-old club, he still had hopes for Manchester United's resurgence and refused to change his preference despite the club languishing in the bottom half of the table and all his 14 grandchildren being Arsenal supporters.\nResponding to Glazer's question during the \"Country Strategy Dialogue\" session on the sidelines of the WEF Annual Summit 2025, he pointed out the significance of sports in a multi-religious country like Malaysia and the importance of promoting it, not only as an industry but also to use the game to foster unity.\nAnwar, who is also finance minister, addressed questions on the restructuring of Malaysia Airlines as well as improvements at Malaysia Airports Holdings Bhd, including aerotrain upgrades.\n\"I am impatient to get things going (at the airport) and (for it) to be more efficient. There's no reason why the airport should function as it did in the past, although it is relatively good compared with poorer airports. I think there's room for improvement,\" he said.\nOther topics Anwar touched on were healthcare, artificial intelligence, the Johor-Singapore Special Economic Zone, upgrading the country's legislative, free trade agreements and the need for these agreements to include digitalisation, as well as Malaysia's views on nuclear energy.\nOn the last day of his three-day working visit to Davos to attend the summit, Anwar touched on the issue of Myanmar and how the failure of governance in the state has affected peace and security in Asean.\nAs Asean chair, Malaysia was cautiously optimistic about the progress in Myanmar, and it would coordinate efforts towards peace and security with the United Nations, he said at the AseanÂ Plenary entitled \"Even Stronger Together\" here.\nAnwar's ability to navigate various topics on multiple platforms with consistency showcased the great orator he is.\nAt every opportunity, he emphasised Malaysia's commitment to fostering cooperation among major powers, ultimately reinforcing Asean's role in addressing pressing economic and geopolitical challenges.\nIn his no-holds-barred remarks on issues faced by AseanÂ and the region, especially concerning tensions in the South China Sea, Anwar firmly stated any resolution on the matter must be a collaborative solution and not otherwise, regardless of the Western world's views on it.\n\"We have unresolved issues with Thailand, Indonesia, Singapore, Brunei and the Philippines. (But) why is it that the problem only seems to be with China?\" he said.\n\"And they say, 'Oh, are you being defensive?' No, it's not the case. I am simply stating the facts. Is there a problem? Yes, there is (a problem). But the issue involves the entire region. Are we going to wage war over it? No,\" he added.\nHe said these matters must not be approached defensively but with a firm commitment to dialogue, and Malaysia has been proactive in taking that path.\nHe said Malaysia had made significant strides in establishing itself as a trusted partner of China while recognising the United States as an equally important partner, as cumulatively, it remains the largest investor in Malaysia.\nAnwar expressed optimism about Malaysia's ability to continuously attract investments and took every opportunity to promote the country to government and business leaders, as well as civil society officials attending the WEF. Bernama\n( END )\n"
      },
      {
        "id": 2106,
        "title": "Addressing critical security concerns",
        "created_at": "2025-01-24",
        "text": "\nTHE voice from Washington, from the top diplomat of the Trump administration, underlining the watertight alliance between the United States and the Philippines, raises confidence, given the incessant sorties into the West Philippine Sea by foreign vessels. We heard the voice of US Secretary of State Marco Rubio when he discussed..."
      },
      {
        "id": 2107,
        "title": "Echoes of the 1980s: Inflation, wars, and slowing growth resurface globally",
        "created_at": "2025-01-24",
        "text": "\n\"Brezhnev took Afghanistan, Begin took Beirut and Galtieri took the Union Jack\". Circa 1983, Roger Waters offered some incisive commentary on the geopolitical fun and games of the '80s. The Soviet Union was into the fourth year of the occupation of Afghanistan. Israel had waltzed into Lebanon, and enabled two bloody massacres in Palestinian refugee camps. Argentina under General Galtieri had occupied The Falkland Islands and the UK had recaptured the Falklands.\n Iran, led by Ayatollah Khomeini, and Iraq, led by Saddam Hussein, were doing their best to wipe each other's nations off the map. The US was trying to covertly destabilise Nicaragua and would invade Panama a few years later.\n India and Pakistan had a short, vicious scuffle on the Saltoro Glacier. There was also the debacle of the IPKF expedition to Sir Lanka, and the successful counter-coup in the Maldives that restored an India-friendly government. India and China also had a face-off up in the mountains during the 1980s.\n The decade was also marked by the so-called \"Star Wars\". This was an American effort to bankrupt the USSR by pretending to develop space-based weapons. The weapons were science-fictional in concept and about as fantastical as the swag displayed onscreen in the eponymous movie franchise. The plan worked. The USSR did go bankrupt under the stress of fighting an unwinnable war in Afghanistan, and investing vast sums into research & development of futuristic weapons. There was also double-digit inflation in the US and much of the Western world, and there was the Black Monday crash of October 1987, when the Dow Jones fell over 20 per cent in a single session.\n Four decades later, the world might be headed for another period of similar fun and games. The new US President in his inaugural speech said he wanted to end ongoing conflicts and be remembered for the \"wars we never get into\". But he also said he wants to take over Greenland and the Panama Canal, and Canada, and he won't rule out the use of force to further these ambitions. Go figure.\n Russia is now into the 11th year of trying to annex Ukrainian territory by force. Israel has attacked Gaza, the West Bank, and bombed Syria, Lebanon and Iran. China has repeatedly reiterated its territorial claims on Taiwan, large parts of the South China Sea, Arunachal Pradesh, Ladakh, and chunks of Bhutan.\n  Territorial ambitions are a zero-sum game. As Mark Twain once pointed out in the context of buying real estate, \"They're not making land anymore\".  When one nation wants to extend its boundaries, another nation usually objects on the grounds that its territory would shrink correspondingly. This can, and often does, result in violent conflict. Unlike in the 1980s, there are at least nine nations with nuclear weapons in the game circa 2025, which increases the threat if conflict escalates.\n Another thing that usually results from conflict, or the threat of conflict is inflation. Supply chains break down. Essential commodities are diverted to the military effort. Energy prices spike. If people are conscripted in large numbers, there's a shortage of labour to do normal things like farm, work on assembly lines, drive buses, or fry pakodas. During World War I, this shortage led to the emancipation of women, who had to willy-nilly do these jobs and leveraged their foothold in the workforce into gaining the vote. During World War II, it led to full employment in the US that ended the lingering effects of the Great Depression.  But another round of extended inflation could have horrific effects in 2025, following a pandemic that triggered supply chain disruptions and inflation.\n The US also seems to be looking to push China into a techno-economic battle by cutting off the supply of high-end chips, and imposing tariffs on Chinese imports. Unlike in the 1980s, this isn't necessarily a battle the US will win. China is an economic powerhouse. Moreover, tariffs will hurt US consumers and industry, who will actually pay the enhanced costs.\n However, the global economy is collateral damage. Growth has slowed everywhere at the mere threat of more conflict, and inflation has spiked along with currency volatility. Investors have to reboot strategies and rework asset allocations. A flight to safety may be an instinctive reaction, but it's probably wrong. Debt loses value during inflationary periods; equity gains if investors can ride out the storm.\n"
      },
      {
        "id": 2109,
        "title": "Worrying that Trump's choice for Defence Secretary struggled to name ASEAN countries",
        "created_at": "2025-01-24",
        "text": "\nKUALA LUMPUR(The Star/ANN) - IT'S not exactly the best start, but there is still created_at for Pete Hegseth, President Donald Trump's choice for Defence Secretary, to learn and catch up.\nThe United States army veteran and popular conservative television personality found himself unable to state the number of Asean member countries.\nHe was grilled by Senator Tammy Duckworth during a recent Senate confirmation hearing regarding his appointment.\nDuckworth put Hegseth on the hot seat, questioning whether he had the \"breadth and depth of knowledge\" needed to lead international negotiations.\nHegseth was asked if he could name one member of Asean, describe what type of agreement the US had with the countries, and how many nations were in the bloc.\nThe fumbling Hegseth reportedly said he couldn't tell Duckworth the exact number of Asean nations but added, \"I know we have allies in South Korea and Japan in AUKUS (a pact between Australia, the United Kingdom, and the US) with Australia.\"\n\"None of those three countries are in Asean. I suggest you do a little homework,\" responded Duckworth, a Democrat from Illinois, as reported by AP.\nIt is no surprise that a top member of the Trump administration, like Hegseth, faces concerns, as there have been worries that the boss himself may not be keen on Southeast Asia.\nAsean is made up of Brunei, Cambodia, Indonesia, Laos, Malaysia, Myanmar, the Philippines, Singapore, Thailand, and Vietnam. An 11th country, East Timor, is set to join soon.\nMalaysia is the new chairman of Asean from Jan 1 and over 300 meetings, at various levels, have been scheduled.\nSet up in 1967, Asean's goal is to promote regional economic and security cooperation, leveraging a combined population of more than 670 million people with a gross domestic product of more than USD3tril.\nAccording to news reports, Duckworth's question came after Hegseth noted the strategic importance of the Indo-Pacific, a region where China's influence has been rapidly growing.\nThe multiple maricreated_at claims over the South China Sea, an important waterway, have also been in the spotlight.\nHowever, despite these territorial disputes, most Asean members maintain close relations with China, which remains a key trading partner. It helps that China is geographically closer to Asean than the US.\nChina shares the same created_at zone with Malaysia, Singapore, and Brunei, for example, fostering strong people-to-people ties.\nTop Chinese officials are also expected to attend the upcoming Asean meetings.\nAttention will also be on the Asean, Council of Gulf Countries and China - the first such trilateral meeting.\nFor the US, it has treaty pacts with Thailand and the Philippines, with Washington being sought to harness Asean's regional influence and its emphasis on ensuring the region remains a zone of neutrality.\nCertainly, given the complexities of geopolitics and superpower rivalries, Asean does not want any one major power dominating the region.\nHegseth will be required to attend meetings of Asean defence ministers, while Marco Rubio, as Secretary of State, will meet the Asean foreign ministers.\nThe annual Asean summit has been attended by both Biden and Trump previously. Asean also conducts separate meetings with the leaders of China, South Korea, Japan, Australia, India, and New Zealand, as well as the East Asia Summit, which includes these six plus Russia and the US.\nMany analysts share the perception that Asean may not be Trump's priority.\nHoang Thi Ha and William Choong wrote that during Trump's first term, his attendance \"appeared driven more by specific circumstances than dedicated interest in the region itself, as seen under Obama, or the strategic focus on Southeast Asia's role in US-China competition under Biden.\"\n\"Trump 2.0 will be preoccupied with the challenge of delivering his campaign promises to swiftly end the Russia-Ukraine war and the conflict in the Middle East.\n\"Given Trump's personal disinterest in the region as well as his scepticism towards multilateralism, the region may face another four years of Trump's absence at Asean summits and minimal direct engagement with Southeast Asian leaders.\"\nDuring his first term, Trump attended only the 2017 Asean summit meetings, failed to send a cabinet-level official to subsequent summits in 2019 and 2020, and failed to appoint US ambassadors to Asean and Singapore.\nBut Trump is a businessman and strategist, too. He would surely see that Asean is a region of over 670 million people with a GDP of over USD3tril.\nAsean's economy is projected to grow by over 5% per year to become the world's fourth-largest economy by 2030, as well as the US' fourth-largest export market in the world.\nThe bloc contains some of the fastest-growing economies in the world, with Asean playing an integral role in East Asian regionalism.\nThat should be enough reason for Trump and his officials to pay more attention to Asean.\n"
      },
      {
        "id": 2111,
        "title": "Asia: Rubio hosts 'Quad' foreign ministers after being sworn in",
        "created_at": "2025-01-24",
        "text": "\nSecretary of State Marco Rubio hit the ground running in his new job on Tuesday, hosting the foreign affairs ministers of Australia, Japan and India only hours after being sworn-in as America's new top diplomat by Vice President J.D. Vance.\nAlong with the United States, the three countries form the Quad grouping, which was revived under the first Trump presidency and was a pillar of the Biden administration's efforts to counter China.\nRubio, a former senator from Florida, was confirmed by his erstwhile Senate colleagues in a unanimous vote Monday evening after Donald Trump's inauguration as president earlier in the day, with Vance making the appointment official at the White House on Tuesday morning.\nHe then headed to the State Department in Washington's Foggy Bottom to greet staff members, promising to make changes to the department. But he said the changes would not prove destructive or punitive to those who worked for the Biden administration.\nIn our republic, the voters decide the course of our nation - both domestically and abroad - and they have elected Donald J. Trump as our president, Rubio said, adding that the new president had laid out a very clear mission on foreign policy during his campaign.\nThat mission, he said, is to ensure that our foreign policy is centered on one thing, and that is the advancement of our national interest.\nRepeating a line he used multiple created_ats during his confirmation hearing, America's new top diplomat defined such a foreign policy as anything that makes us stronger or safer or more prosperous.\nThe more things change...\nOne area where U.S. foreign policy does not look destined to diverge too sharply from that of the Biden administration is in the priority given to the Quad, a grouping formally convened in 2007 but which largely laid dormant until being revived under Trump a decade later.\nLed by former U.S. President Joe Biden's Asia czar, Kurt Campbell, the informal security grouping turned into one of the centerpieces of the Biden administration's strategic approach to China's military rise.\nRubio signaled the high priority on Quad is set to continue under the Trump administration, hosting Australian Foreign Minister Penny Wong, Indian External Affairs Minister S. Jaishankar and Japanese Foreign Minister Takeshi Iwaya only an hour after greeting his new staff.\nAfter a meeting that lasted about a half-hour, the four officials posed for photographers in front of a display of their countries' flags at the State Department, but Rubio declined to respond to questions shouted from reporters before ushering the group away for further meetings.\nIt was a new look for the grouping, with Rubio not the only fresh face.\nIwaya - who previously served as Japan's defense minister - only took on his new role in early October as part of a change in government in Tokyo caused by Fumio Kishida's resignation as prime minister.\nTop priority\nDespite the officials' silence at the photoshoot, leaders of the Quad countries have recently appeared at pains to highlight the importance of the grouping going forward, even as their governments change.\nChina has derided the Quad as a relic of what it calls a U.S.-driven Cold War mindset and insisted that it has no designs for territorial expansion or aggression in the vast Indo-Pacific region.\nBut concerns remain in Washington, Tokyo and New Delhi about China's plans for parts of the South China Sea it claims - contra to international court rulings - as its territory, as well as for the democratic island of Taiwan, which Beijing regards as a rogue province.\nShowing the importance placed on the grouping in Washington's efforts to counter China's military rise, the three other Quad foreign ministers each also attended Trump's inauguration on Monday.\nWong told reporters in Washington on Sunday that Australia's relationship with the United States was its most important strategic relationship, with the Quad grouping at the forefront of ties.\nIt's a demonstration of the collective commitment of all countries to the Quad, an iron-clad commitment in this created_at where close cooperation in the Indo-Pacific is so important, Wong said of the invitations extended to the foreign ministers by both Trump and Rubio this week.\nSpeaking in Canberra hours before the U.S. presidential election on Nov. 5, India's Jaishankar also said he believed Washington would continue to prioritize the Quad no matter who won the vote.\nI remind you that actually the Quad was revived under a Trump presidency in 2017, Jaishankar said at the created_at, noting the group even held in-person talks in the earliest days of the COVID-19 pandemic. That should tell you something about the prospects of it.\nSource: Radio Free Asia\n"
      },
      {
        "id": 2118,
        "title": "US sees Taiwan challenge from China in 2027: Will QUAD under Trump, PM Modi stand up?",
        "created_at": "2025-01-24",
        "text": "\nIndia, Jan. 24 -- The first multilateral meeting of US Secretary of State Marco Rubio was QUAD with Indian External Affairs Minister Subrahmanyam Jaishankar, Australian Foreign Minister Penny Wong and Japanese Foreign Minister Takeshi Iwaya. The first bilateral meeting of the Trump administration was with India on January 21 after Prime Minister Narendra Modi's special envoy Jaishankar was accorded top protocol at the Trump inaugural.\nOn January 26, Indonesian President Prabowo Subianto will be the chief guest at the Republic Day Parade. He will be accompanied by Navy Chief Admiral Muhammed Ali for the three-day trip after Indian Navy Chief Admiral Dinesh Tripathi visited Jakarta last month. A 160 men's tri-services contingent along with a 60-man band will also march on Kartavya Path on Republic Day.\nLast September, the first woman US Chief of Naval Operations Admiral Lisa Franchetti declared that America needs to militarily prepare for the China challenge on Taiwan in 2027.\nWhile Indonesia wants to play the balancing role in the Indo-Pacific with the 'Friends with all and malice towards none' line, the geographical location of the fourth most populous country in the world places it in the midst of the Indo-Pacific. Indonesia sits on all the major ingress routes to the South China Sea with control over Malacca, Sunda, Lombok and Ombai-Wetar straits, stretching from QUAD partners India to Australia.\nJoin the three dots together and you get the big picture of the Indo-Pacific and the challenge faced by the rapidly expanding Chinese Navy. Even though the QUAD meeting in Washington was a broad overview, the meeting itself was a signal to the Indo-Pacific and all resident powers, particularly China.\nChina today has the largest Navy in the world with nearly 500 warships. The PLA Navy has cornered the majority of the Chinese defence budget for the past three years. For the first created_at, Chinese Defence Minister Dong Jun is an ex-Admiral of the PLA Navy. China has added a full Indian Navy strength of 135 warships in the past decade and today has a permanent presence in the Indian Ocean Region (IOR) with at least 6-7 warships in the littoral states at any given point in created_at. Chinese long-range carrier task force patrols are expected in the Indian Ocean Region as early as 2025 end.\nGiven the state of play, the QUAD summit may be hosted by India in the first half of 2025 even though the dates are still to be finalized. With trillions of dollars worth trade passing through the Indo-Pacific, it is important that QUAD plays a dominant role in the region to ensure freedom of navigation and keep the sea lanes of communication free of any big power coercion. In this context, the US will have to back Taiwan in a military emergency as annexation of the Island Republic will make the US, Japan and Australian military assets vulnerable to Chinese Navy expansion in the Indo-Pacific.\nWhile Japan and Australia are close military allies of the US, the Indian strategic community but not the Modi government is split over New Delhi's involvement in QUAD. The Left of Centre experts believe that India should not get caught in the war between the US and China and want New Delhi to forge ahead on strategic autonomy. This group of experts also believes that India should play a balancing role between the US and China and not let the rivalry play out in the Indian Ocean Region. The Right of Centre believes that India should join hands with the US and together meet the rapidly rising military challenge from the Xi Jinping regime or become a front-line state against Beijing in short.\nEven though Indian and Chinese armies are facing each other in East Ladakh after the May 2020 PLA transgression and the PLA Navy is operating from key ports in the Indian Ocean Region, the current government wants bilateral ties with Beijing based on mutual respect, security and sensitivity. Rather than adopt a pro-China, pro-US or even pro-Russia stance, the Modi government is forging ties with big powers based on national interest with special inclination towards democratic powers like the US.\nThe need of the hour for the Modi government is to access the latest technologies from the US and rapidly expand India's military-industrial base through domestic manufacturing under the \"Atmanirbhar Bharat\" rubric. During the bilateral meeting in Washington, Secretary Rubio indicated that the Trump administration will push the momentum on technology, defence and security ties, trade and commerce with India as domestic manufacturing is a key condition for the global high table. Until such created_at that India manufactures jet engines, fighters and submarines at home, the country will always be dependent on third powers for its defence and security needs. This month Indian Air Force Air Chief Marshal A P Singh red-flagged the HAL-DRDO for delays in meeting the first deliveries of 40 fourth-generation Tejas aircraft while China was already on the way to test the six-generation fighters. The fact is that the Indian Armed Forces and the Defence PSUs would rather buy foreign technologies off the shelf than rely on the Indian private sector through the \"Atmanirbharta\" route. The Indian civilian-military bureaucracy is equally responsible for this mess as it is focused on the process, not on results as a result of which it takes decades for a proposal to reach the decision stage. Remember, the Tejas program was conceived in 1984 and the first induction was in 2016. The Kalveri class submarine program was conceived in 1998 with the last of six submarines, INS Vaghsheer, commissioned by PM Modi on January 15. This dependency on hardware imports must go if India has to earn respect from global powers and prepare to meet rapidly rising China in the Indo-Pacific.\nWith PM Modi by far the senior leader of QUAD, the summit in India will define how democratic powers will tackle the emerging situation in the Indo-Pacific as well as build alternatives to support each other in technology, information, semiconductors and global supply chains. The Indian PM will get strong support from his close friend President Donald Trump, who revived the QUAD in his first tenure after China scuttled it in 2007.\nPublished by HT Digital Content Services with permission from Hindustan created_ats. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
      },
      {
        "id": 2119,
        "title": "The Humble Brag: China s Recent Wargame and Its Implications",
        "created_at": "2025-01-24",
        "text": "\nLondon: The Royal United Services Institute has issued the following press release:\nA Chinese simulation admitting to a PLAN destroyer's defeat by US missiles hints at advanced electronic warfare capabilities while raising questions about PLA transparency and messaging.\nOn 4 January 2025, the South China Morning Post (SCMP) newspaper published an article detailing how a Chinese-run ‘wargame ’ had modelled the sinking of a People ’ s Liberation Army Navy (PLAN) destroyer by US missile attack. The missiles in question were the Lockheed Martin-made, US Navy/Air Force-employed AGM-158C Long Range Anti-Ship Missiles (LRASM). Given that these missiles are specifically designed to sink ships from range, the fact that they did so in a simulation is hardly remarkable. That such a simulation should be run and documented in a peer-reviewed academic publication is possibly a little more surprising, given Chinese military sensitivity. What is noteworthy is that the institute which ran the simulation is one that provides modelling and simulation tools for the PLA and is one of the institutes run by the China Electronics Technology Corporation (CETC), a powerful state-owned enterprise which has been involved with projects including China ’ s nuclear and satellite programmes. The decision of academics from the 15th Institute who presumably hold security clearances to provide interviews to a pro-Chinese government publication, a promoter of Chinese ‘soft power ’ (the SCMP) would presumably have occurred with state encouragement or at a minimum approval. This raises the question of why seemingly negative results were published in an English-language newspaper which is accessible to foreign audiences. Moreover, what can be understood regarding the People ’ s Liberation Army ’ s (PLA) assessment of its own capabilities based on the outcome of the exercise? This article seeks to provide some plausible rationales for the PLA to publicise the seemingly disappointing results of this simulation.\nThe Technical Dimensions of the Exercise: A Humble Brag?Based on what was reported regarding the exercise, the wargame simulated a large clash between the US and China. The article details a simulation set in the northeastern part of the South China Sea where the US attacks a Chinese battlegroup from the ‘nine-dash line ’ , Beijing ’ s declared limit of sovereignty in the South China Sea. The attack consists of 10 LRASM launched from different platforms, all targeting a PLAN destroyer. The simulation sees the PLA disable both radar guidance and GPS navigation by means of electronic warfare (EW). However, the ‘thermal imaging ’ capability of the LRASM (its IR seeker) allows for a terminal navigation phase for accurate and successful targeting.\nWhile the result of the simulation would appear negative for the PLAN, several details are noteworthy. First, the claim that the PLAN ’ s Type-055 cruiser was able to disable the radar on the LRASM is of interest. The reason for this is that the LRASM does not use an active radar like many anti-ship missiles, but rather relies on a passive radar for wide area surveillance using emissions from enemy ships. The advantage of passive radar is that they are a relatively difficult target for directional jamming because the location of the receiver is difficult to ascertain, unlike active radar which must emit and can thus be detected. Implicit in the Chinese claim that the LRASM ’ s passive radar was disabled, then, is the suggestion that the PLAN vessel was deemed to have located the missile with sufficient accuracy to enable directional jamming, which would involve transmitting false signals into the passive radar ’ s aperture. The jamming of the missile ’ s onboard radar would thus suggest two things. First, the vessel was deemed to have a very accurate sense of the missile ’ s location despite the LRASM ’ s stealthy profile. Second, Chinese efforts to develop modes of jamming passive radar, into which the state has invested funding through its talent programmes, are deemed to have borne fruit. The methods of doing so might include emitting signals which produce an interference peak on a radar ’ s doppler map and thus create false tracks. The PLA ’ s claimed success here would, if true, have ramifications both for the survivability of missiles with a low radar cross-section (which the PLA is implicitly claiming the ability to track) and for US naval efforts at emissions control and the use of passive detection in the first island chain.\nThe second aspect of note is that the article claims that the LRASM ’ s GPS guidance was disabled 10 km from the Type-055. While the jamming of GPS-guided capabilities is not new and has been achieved by the Russians in Ukraine against JDAM, blocking signals from all of the GNSS satellites from which a missile or munition can receive signals requires jamming over a wide area, possibly requiring multiple overlapping EW systems in the case of the Russians in Ukraine. Additionally, since US munitions are programmed to not receive messages that are not in encrypted M-Code, successful jamming would imply the ability either to spoof signals in M-Code or to generate enough power that all signals are blocked. All of this would point to a robust Electronic Counter Measures suite on the Type-055 and any vessels supporting it in the simulation.\nThe PLA ’ s claimed success would have ramifications both for the survivability of missiles with a low radar cross-section and for US naval efforts at emissions control and the use of passive detection in the first island chain\nThird, the paper talks only of the EW defences, and does not appear to consider the host of other ‘hard kill ’ , medium- and short-range options open to the PLA and PLAN. Additionally, the article references the fact that the radar coverage AWACS and fighter aircraft were not considered. As can be seen from the indignant response to the article on some Chinese message boards, many commentators have noted this omission. This could include the 1130 or 730 Close-in Weapon Systems (similar to NATO ’ s Goalkeeper or Phalanx) and ‘Hong Qi ’ (red flag) family of vertical launch systems, short- and medium-range models such as the HHQ 9 and HHQ 16. Given that the LRASM is a stealth missile, the degree to which these Chinese systems would be effective remains unexamined in the article.\nHowever, as mentioned, the claim that the Chinese battlegroup had a good enough understanding of the missile ’ s location to enable jamming of passive radar is telling. A degree of knowledge sufficient to enable directional jamming of a passive receiver would also be sufficient to enable hard kill. An implicit message might, then, be that the Type-055 could have engaged the LRASM with its onboard missiles in their terminal phase, and perhaps at even greater distances with AWACS and fighter support.\nA PLA Active Measure to Undermine LRASM?Relatedly, the claimed fidelity of the simulation is noteworthy. What is specifically alluded to is the flight profile of the missile and the assertion of a degree of ‘complex details ’ captured in the simulation by the academic paper ’ s author. This may be further indication to its adversaries that the PLA knows more than perhaps the US would like them to about the missile specifications. As defence industry experts know, details of the flight profiles, link communications, navigation systems, ranges and missile speeds are generally classified, and this is certainly true for the LRASM as a state-of-the-art ‘stealth ’ missile. That there are vertical launch variants for ships and that the LRASM has been adapted for multiple aircraft types is in the public domain, but specific details are not easy to come by. Officially released data or other promotional detail is deliberately vague, and official publications state that specifics have not been released for security reasons. It is, however, true that much can be gleaned from open source investigations, and it is not unheard of for classified details to appear on public forums; especially if the unwary are being specifically probed for such information. A classic example of such a disclosure was the well-publicised case of Challenger II tank specifications being released on a ‘War Thunder ’ gaming forum in order to try to win an argument. It is possible that the simulation was modelled around best guesses and supposition, or that technical specifications were (as claimed) garnered from prolonged and diligent open-source research.\nHowever, as discussed, it is of note that the simulation was run by the North China Institute of Computing Technology (NCICT), the 15th Research Institute of CETC. As a Chinese state-owned conglomerate, it has been implicated on multiple occasions in cases of ‘export violations ’ with certain US-based technology companies. The role of the 15th Institute and its parent organisation in the Chinese defence ecosystem would suggest that its researchers have access to classified data. Through its claims to be able to accurately model the LRASM ’ s flight profile and radar cross-section, the PLA would appear to be tacitly claiming to have either penetrated classified US systems or deduced highly classified data using available information.\nSubscribe to the Military Sciences NewsletterStay up to date with the latest publications and events from the Military Sciences Research Group\nSign upThis does, however, raise questions regarding the veracity of the claims. If the PLA was truly confident in its success in accessing sensitive data, it would have strong incentives to keep this private to achieve surprise in a conflict rather than alerting the US to the compromise of critical systems. Perhaps the PLA deems the programmatic disruption to LRASM resulting from any inquest within the US that this revelation causes to be a worthwhile result, especially if the programme is too late in its development for vulnerabilities to be easily fixed. However, if disruption is the aim, it should be noted that a similar effect could be achieved through false claims as well. As a historical analogy, we might consider how the USSR attempted to strengthen the hands of critics of the Strategic Defence Initiative by leaking (often spurious) technical data that reinforced the idea that any missile shield could be easily penetrated. One interpretation, then, is that the PLA is trying to undermine a programme which causes it genuine concern.\nThe PLA Focus on Realistic Blue ForcesMore broadly, the simulation likely tells us something about the modelling and simulation work conducted in support of the PLA, both in terms of the intelligence which supports it and the levels of realism being sought.\nThe nature of the simulation and in particular the absence of AWACS support and hard kill measures is of interest. This is, perhaps, explicable given the institute which conducted the modelling. The Beijing-based NCICT specialises in military model development and the development of major projects in aerospace measurement and control systems. The parent corporation of CETC also advertises itself as working in radar and EW-related technology. It is therefore unsurprising that the wargame appears to have limited itself to testing EW defensive measures. Industry wargaming, unlike defence ministry or military wargaming, works with different constraints and may have different or more focused aims. These can range from product design, development and testing to demonstrations and sales. It is perhaps in this light that the article should be viewed – as a declaration of capability in EW and a statement of competence to the West (and especially the US), but perhaps also an internal pitch that the NCICT has done its bit, and that it is for others to within the PLA and industry to move in by, for example, providing countermeasures against IR seekers (on which the LRASMs relied after their radar malfunctioned).\nMore broadly, the PLA is increasingly not a stranger to wargaming, and invests heavily in this and ‘opposing force training ’ , with ‘blue ’ (or enemy) forces occasionally even going so far as to wear the uniforms of the forces they are representing. The emphasis on using models with high levels of fidelity and dedicated experts on adversary forces is considered by the PLA to be critical to meeting Xi Jinping ’ s demand for realistic training and ensuring the combat effectiveness of a force that has not seen combat since 1979. The danger of what the PLA calls the ‘peace disease ’ is one that China ’ s leaders are acutely aware of.\nThe PLA is increasingly not a stranger to wargaming, and invests heavily in this and ‘opposing force training ’ , with ‘blue ’ forces occasionally even going so far as to wear the uniforms of the forces they are representing\nSince Chinese leaders and planners seem aware that the PLA ’ s lack of combat experience is both a limitation and something which likely opponents may perceive as a weakness, advertising the fact that Chinese wargames are not just scripted exercises in which the PLA always wins might, then, be seen as a way of making the PLA more credible in the eyes of its opponents. The message may be that unlike, for example, the Russian military before Ukraine – which was plagued by the habit of subordinates painting excessively rosy pictures to their superiors – the PLA is a force which confronts its own deficiencies.\nMoreover, the accompanying risk that the negative outcome leads an opponent to downrate its assessment of Chinese equipment is mitigated. Any potential adversary – in this case the US – will know that the limitations of the simulation as discussed in the SCMP article will be well understood by the PLA, and the findings of a military run wargame are unlikely to be so well publicised. In addition to the hard kill options and AWACS support mentioned above, the wider principles of anti-access/area denial would be at play, making any scenario as proposed in the simulation far more complex, multi-layered and multi-dimensional.\nConclusionIn conclusion, the Chinese article was an interestingly stark acknowledgment that the US is the enemy, rather than using a nameless adversary with capabilities similar to the US that often features in exercise and wargames. Although framed as a ‘humble brag ’ with the loss of a PLAN destroyer, the article clearly advertised a certain Chinese confidence in the inevitable arms race in which China and the US, as technological world leaders, are engaged. The (possible) NCICT sales pitch hints at a certain level of knowledge and understanding, and leaves much unsaid for the US to consider as it continues in the development of increasingly complex, stealthy and long-range anti-ship missiles. It is therefore an article of interest to many ‘defence watchers ’ , but manages to deliver some very specific messages.\n"
      },
      {
        "id": 2122,
        "title": "First Flex Of Trump's Peace Through Strength Strategy",
        "created_at": "2025-01-24",
        "text": "\nLink to Image\nLink to Story\nMANILA - The new Trump administration is off to a muscular start with its\"peace through strength\" strategy, a policy flex expressed in a series of key appointments and meetings that has already impressed top allies and partners in the Indo-Pacific.Barely hours into his new office, US Secretary of State Marco Rubio held a bilateral meeting with India's Foreign Minister S. Jaishankar to underscore the centrality of Asia in Trump's foreign policy.\nRubio also held a phone conversation with his Filipino counterpart in which he reiterated America's\"ironclad\" commitment to defend its Southeast Asian mutual defense treaty ally in the event of armed conflict with China in the South China Sea.\nMeanwhile, Philippine Defense Secretary Gilbert Teodoro Jr personally met new US National Security Adviser Mike Waltz to reaffirm the\"enduring alliance between the Philippines and the United States.\"\nJust days into office, the new Trump administration also convened the latest iteration of the Quadrilateral Security Dialogue, better known as the\"Quad\", which brought together top diplomats from Australia, Japan, India and the US.\nIn a joint statement, Rubio and his Quad counterparts underscored their\"shared commitment to strengthening a Free and Open Indo-Pacific where the rule of law, democratic values, sovereignty, and territorial integrity are upheld and defended.\"\nIn a thinly veiled criticism of revisionist powers, most notably China, the Quad ministers made it clear that they\"strongly oppose any unilateral actions that seek to change the status quo by force or coercion.\"\nMeanwhile, newly inaugurated President Trump signaled a more pragmatic approach in his second term by firing and lambasting Iran hawks while elevating pragmatists such as Michael DiMino as the Pentagon's new top Middle East official.\nCoupled with Trump's call for ending the \"ridiculous war\" in Ukraine and growing pressure on European allies to shoulder their own defense burdens, recent key appointments will strengthen the voice of so-called\"prioritizers\" led by Elbridge Colby, a nominee for under-secretary of defense for policy who has emphasized the need for a more China-focused US foreign policy.\nBy reorienting America's strategic focus from old theaters in Europe and the Middle East, the second Trump administration is seemingly set to double down on its defense alliance and deterrence strategy in the Indo-Pacific.\nLatest stories Move over CHIPS Act, Stargate is the future Bank of Japan hikes rates with a wary eye on Trump From innovation to production of new US defense systemsIn his inauguration address, Trump set the tone for his foreign policy by emphasizing his commitment to end wars around the world.\"My proudest legacy will be that of a peacemaker and unifier. That's what I want to be - a peacemaker and a unifier,\" he declared, directly taking credit for the newly implemented ceasefire in Gaza, which was largely negotiated by Trump's Middle East envoy Steve Witkoff.\n\"Like in 2017, we will again build the strongest military the world has ever seen. We will measure our success not only by the battles we win, but also by the wars that we end, and, perhaps most importantly, the wars we never get into,\" he added, echoing his administration's\"peace through strength\" mantra.\nTrump has signaled a more pragmatic approach to adversaries, most notably Iran. Just hours into his second term, he fired his former Iran envoy, Brian Hook, a proponent of a\"maximum pressure\" campaign against the Middle Eastern power who oversaw the recent transition at the Department of State.\nMeanwhile, Trump also publicly attacked his former national security adviser, John Bolton, as a\"warmonger\" who oversaw disastrous interventions in the Middle East. Both Bolton and former secretary of state Mike Pompeo, who had advocated for confrontation with Iran, were also stripped off their security profiles.\nTrump's Middle East policy will thus be driven by more pragmatic voices. Following his successful negotiation of the Gaza ceasefire, Witkoff has been appointed as Trump's new Iran envoy.\n\"He's certainly someone I would use. He's done a fantastic job . . . Steve has a wonderful way about him,\" Trump said about his new Iran envoy and prospects for a new nuclear deal with Iran.\"It would really be nice if that could be worked out without having to go that further step [of military confrontation]...Iran, hopefully, will make a deal.\"\nWitkoff's regional diplomacy will be complemented by the Pentagon's new Middle East top official Michael DiMino , who is known for his more critical stance on Israel and advocacy for a more\"offshore balancing\" strategy in the Middle East.\n\"There are no vital or existential U.S. interests in the [Middle East] region,\" DiMino argued last year in a webinar, underscoring the need for a major reorientation in American foreign policy.\"We're really there to counter Iran, and that's really at the behest of the Israelis and the Saudis,\" he added, advocating instead for a more limited American military presence in an increasingly multipolar region.\nThat viewpoint tracks with the Pentagon's incoming top policy official, Elbridge Colby, an influential strategic thinker who oversaw the formulation of the first Trump administration's National Security Strategy.\n\"We need to prioritize the potential for a conflict with China precisely in order to avoid it,\" Colby argued in a major conference last October.\"I think it's empirically true that China is preparing for war, and we do have the possibility of a multi-front war and the possibility of a World War III in the coming years, and we're not prepared.\"\nSimilar to DiMino, Colby has also drawn on his own bitter experience in dealing with the Middle East, especially when he served as part of the Coalition Provisional Authority in Iraq in 2003 as well as on the 2004-2005 President's Weapons of Mass Destruction Commission under the George W Bush administration.\nWhile adopting more traditionally hawkish views on Iran, Trump's other top cabinet officials have also expressed openness to a less confrontational policy in the Middle East in favor of focusing on the broader Indo-Pacific region, particularly China.\nDuring his confirmation hearing, Rubio made it clear that he would support\"any arrangement that allows us to have safety and stability in the region but one in which we're clear-eyed\" about threats posed by adversaries such as Iran. The more pragmatic tone on Iran, coupled with a concerted push to end the conflict in Ukraine, underscores China's centrality to the second Trump administration's grand strategy.\nSign up for one of our free newsletters\nThe Daily ReportStart your day right with Asia created_ats' top storiesAT Weekly ReportA weekly roundup of Asia created_ats' most-read stories\nRubio has characterized China as\"the most potent, dangerous and near-peer adversary this nation has ever confronted\", thus the urgency of doubling down the Quad and existing military alliances in the Indo-Pacific. Though also known as an Iran hawk, National Security Adviser Waltz has also emphasized the need for America to\"quickly wind up the conflicts in Ukraine and the Middle East to free up military assets to confront and deter China.\"\nTrump's defense secretary nominee, Pete Hagseth, who, similar to Waltz, also served in America's wars in the Middle East, has argued along similar lines and has criticized the outgoing Biden administration for not sufficiently decoupling from conflicts in the Middle East in favor of a China-centered strategy.\nBy and large, America's top Asian allies seem optimistic about the second Trump administration's signaled direction. Ahead of her meeting with Rubio, Australian Foreign Minister Penny Wong characterized bilateral ties with Washington as\"our most important strategic relationship.\"\n\"It's a demonstration of the collective commitment of all countries to the Quad, an ironclad commitment in this created_at where close cooperation in the Indo-Pacific is so important,\" she told reporters on the eve of the first Quad meeting just hours into the new administration.\nJapan's top diplomat was even more effusive about the new administration's nuanced approach to foreign policy and sound pragmatism.\n\"I was very impressed that [Rubio's] explanation of the Quad didn't mention China by name and antagonize it. I had thought of him as a hard-liner against China, but as we talked, I found he was a well-balanced individual,\" Japan's Foreign Minister Takeshi Iwaya said after the Quad meeting this week.\nFollow Richard Javad Heydarian on X at @RichHeydarian\nSign up here to comment on Asia created_ats storiesOrSign in to an existing accounThank you for registering!\nAn account was already registered with this email. Please check your inbox for an authentication link.\nClick to share on X (Opens in new window) Click to share on LinkedIn (Opens in new window) Click to share on Facebook (Opens in new window) Click to share on WhatsApp (Opens in new window) Click to share on Reddit (Opens in new window) Click to email a link to a friend (Opens in new window) Click to print (Opens in new window)\nMENAFN24012025000159011032ID1109125676\n"
      },
      {
        "id": 2131,
        "title": "China: Foreign Ministry Spokesperson Mao Ning's Regular Press Conference on January 22, 2025",
        "created_at": "2025-01-24",
        "text": "\nPeople's Daily: The World Economic Forum Annual Meeting 2025 is being held in Davos, Switzerland. The WEF is an important platform for discussions of global economic issues. Could you share with us China's propositions?\nMao Ning: Member of the Standing Committee of the Political Bureau of the CPC Central Committee and Vice Premier of the State Council Ding Xuexiang delivered a special address at the World Economic Forum Annual Meeting. He shared four observations: first, jointly promote a universally beneficial and inclusive economic globalization; second, jointly uphold and practice true multilateralism; third, jointly foster new drivers and strengths for global economic development; fourth, jointly tackle major global challenges such as climate change, food security and energy security.\nVice Premier Ding Xuexiang stressed that economic globalization is an inherent requirement for the development of productive forces, and an inevitable result of technological advancement. It is not a you-lose-I-win zero-sum game, but a universally beneficial process where all can benefit and win together. Protectionism leads nowhere. Trade war has no winners. It's important to tackle the development challenges with universal benefit, and pool strengths with inclusive cooperation, so as to usher in a new phase of economic globalization that is more dynamic, more inclusive and more sustainable. We need to find a win-win and all-win solution, one that is based on mutually beneficial cooperation, and not only make the pie of economic globalization bigger, but also distribute it better.\nVice Premier Ding Xuexiang gave an overview of China's economy. He shared three major trends that characterize the Chinese economy: first, high-quality development is making solid progress; second, green and low-carbon transition is accelerating across the board; third, reform and opening up is moving up to a higher level. China will further intensify macro policies, continue high-quality development, effectively pursue higher-quality economic growth and appropriately increase economic output, and inject strong and sustained impetus to global economic development.\nChina News Service: In a press release on January 17, the US Department of Treasury announced sanctions against relevant Chinese company and citizen that were involved with Salt Typhoon's cyberattack. What's China's response?\nMao Ning: China opposes the accusations made by the Biden administration without any convincing evidence and their abuse of sanctions against China. In fact, the US has conducted large-scale and systemic cyberattacks on China for years. We have made very clear our concerns and opposition on this for many created_ats.\nWhen it comes to cyber issues, China and the US are countries with big influence. The two sides share similar concerns on safeguarding cybersecurity, especially the security of key infrastructure. It's important for the two countries to follow the principle of equality and mutual respect, frankly discuss issues of respective concerns on the basis of fact and evidence, observe the same international rules, and jointly keep the cyberspace peaceful and stable. The US needs to stop abusing sanctions.\nTASS: On Tuesday, President Donald Trump will levy tariff on Chinese exports to the US, with an expected start date of February 1. What is China's comment?\nMao Ning: We have made clear China's position on this issue multiple created_ats. We believe that there's no winner in a trade or tariff war, and we firmly uphold our national interests.\nGlobal created_ats: The Philippines' National Bureau of Investigation said they arrested a Chinese national and two Filipinos suspected of conducting espionage operations. Armed Forces of the Philippines Chief Romero Brawner Jr. said the Chinese spy was found near the US military bases in the Philippines, and Justice Secretary Jesus Crispin Remulla said they would ensure an airtight case against the Chinese spy to uphold the Philippines' sovereignty and security. What's China's response?\nMao Ning: The Chinese government, as always, asks Chinese nationals overseas to abide by local laws and regulations. We hope the Philippines will stick to the fact, stop shadow-chasing, stop peddling the so-called Chinese spy, and earnestly protect the lawful rights and interests of Chinese nationals in the Philippines.\nKyodo News: It was reported that foreign ministers of Japan and the US, as well as foreign ministers of Quad, met in Washington on January 21 to exchange views on issues including China's attempt to change the status quo in the East China Sea and the South China Sea. What is your comment on this?\nMao Ning: China believes that cooperation between countries should not target any third party. Engaging in group politics and bloc confrontation will not bring lasting peace and security, and is not conducive to peace and stability in the Asia-Pacific and the world as a whole. China's activities in relevant waters are lawful, legitimate and completely justified. We hope that relevant parties will do more things that help enhance mutual trust and cooperation between countries.\nThe New York created_ats: Has China changed the Chinese name that it uses for Secretary of State Rubio? If so, does that have a bearing on whether or not he's covered by China's sanctions?\nMao Ning: I am not yet aware of what you mentioned. If you ask me, instead of how his name is translated in Chinese, it's his actual name in English that is more important. On the sanctions, I want to say that my colleague made clear China's position yesterday. What I can tell you is that China's sanctions are aimed at the words and actions that harm China's legitimate rights and interests.\nAFP: The Thailand government today denied that it was planning to send 48 Uyghurs held in the country's detention centers back to China. These 48 people had fled China and were arrested in Thailand over a decade ago. Can the Foreign Ministry tell us if there are any plans with Thailand to receive these Uyghurs or give us any update?\nMao Ning: I'm not familiar with what you mentioned. More broadly, China's position on the issue of illegal immigration is consistent and clear. We resolutely fight activities of illegal immigration in any form and oppose any act of condoning or even supporting illegal immigration. China is a country under the rule of law and will properly handle relevant issue by strengthening international law enforcement and security cooperation.\nDragon TV: It's reported that on January 21, a fire at a hotel in T\\xFCrkiye killed 76 people and injured 51. Turkish President Recep Tayyip Erdogan announced a day of national mourning to be observed on January 22. What's China's comment?\nMao Ning: We share the grief over the fatal fire accident that took place in T\\xFCrkiye's Bolu province yesterday. Our hearts go out to the victims and those who have lost their loved ones, and we wish those who were injured speedy recovery.\nAFP: There are some reports on social media of a Chinese national having been killed in an attack in north Afghanistan. These reports say that a Chinese worker in the mining industry was killed last night in Takhar province. Can the Foreign Ministry confirm or give us any details on this attack and this Chinese national?\nMao Ning: I'm not yet familiar with what you mentioned. I believe our Embassy in Afghanistan will track the information over what's happened, and do its utmost to protect the lawful rights and interests of Chinese citizens and their safety.\nBloomberg: On TikTok. US President Donald Trump has said he would be open to Elon Musk or Oracle Corp. Chairman Larry Ellison purchasing social media app TikTok as part of a joint venture with the US government. Does the Foreign Ministry have any comment on this? And how would China feel about the US government being part of a joint venture that splits the ownership of TikTok?\nMao Ning: On TikTok, my colleagues and I have repeatedly stated China's principled position over the past few days, and you may refer to that.\nReuters: Could you tell us more on how the strategic communication channel on major topics between China and the US works? Who from the China side is speaking to the US on this channel and from which arm of the Chinese government? And likewise, who is on the US end of this channel?\nMao Ning: We have no information to share at this created_at.\nAFP: With the threat of 10 percent tariffs, are there any talks happening already or any negotiations going on?\nMao Ning: What I can say is that we stand ready to maintain communication with the US, properly handle differences, expand mutually beneficial cooperation and pursue a steady, sound and sustainable development of China-US relationship. China will also firmly defend its own interests.\nRT TV: Trump, shortly after being sworn in, threatens 100 percent tariffs on BRICS nations if they continue de-dollarization efforts. Do you have any response to this?\nMao Ning: As an important platform for cooperation among emerging markets and developing countries, BRICS advocates openness, inclusiveness and win-win cooperation, not bloc confrontation, and does not target any third party. The aim is to realize common development and prosperity. China stands ready to continue working with BRICS partners to deepen practical cooperation in various fields and make more contribution to the sustained and steady growth of the world economy.\nReuters: I just wanna follow up on the Thailand-Uyghur issue. The UN human rights experts released a statement yesterday urging Thailand to immediately stop the possible transfer of the 48 Uhghurs to China. In the statement, the UN warned, to quote the statement, that the group was at real risk of torture or other cruel, inhumane or degrading treatment or punishment if they are returned. How does China respond to this statement?\nMao Ning: Judging by your question, this is a matter regarding the judicial cooperation between two sovereign states. UN experts, whatever their role is, should fulfill their mandate in a just and objective manner in line with the purposes and principles of the UN Charter and the Code of Conduct for Special Procedures Mandate-holders of the Human Rights Council, and make sure that nothing they say or do interferes in the judicial sovereignty of UN member states and their normal judicial cooperation, instead of speaking out irresponsibly on those matters.\nBloomberg: Secretary of State Marco Rubio met Tuesday with his Quad counterparts from Australia, India and Japan. I'm just wondering if the Foreign Ministry has any comments on the meeting.\nMao Ning: This question was raised by Kyoto News. I already gave an answer.\nNBC: I just want to know if you have a latest comment on the Panama Canal issue. President Trump warned of the danger of China taking control of the canal, and he would like to take it back from Panama. Do you have any comment on this?\nMao Ning: We agree with Panama's President Jos\\xE9 Ra\\xFAl Mulino that Panama's sovereignty and independence are not negotiable, and the Panama Canal is not under direct or indirect control by any power. China does not take part in managing or operating the Canal. Never ever has China interfered. We respect Panama's sovereignty over the Canal and recognize it as a permanently neutral international waterway.\nSource: Ministry of Foreign Affairs, People's Republic of China\n"
      },
      {
        "id": 2134,
        "title": "Ideology still an issue in round two with Trump",
        "created_at": "2025-01-24",
        "text": "\nFrom race to gender to religion, the second administration of US President Donald Trump is certain to reverse the ideological direction on a wide range of issues set by his predecessor, Joe Biden. But there is one thing the two teams share - a deepening disregard for China's political ideology. \nTrump is not known to have strong ideological positions, but observers say his team is expected to use ideology as a tool in its strategies with China - priorities could lead to new sources of friction with Beijing. \nWhile Biden's cabinet focused attention on the LGBTQ community, women's rights and the political values it shared with allies, Trump's administration is expected to use a more unilateral approach to refocus on religious freedoms in China and the legitimacy of the country's ruling Communist Party, they say. \nFei-Ling Wang, a professor at the Sam Nunn School of International Affairs at the Georgia Institute of Technology, said he expected the ideological conflict between the United States and China to persist, but also to shift. \n\"Compared to the Biden administration and Trump's first administration, we may see more inflammatory rhetoric and highly symbolic gestures, but less talk about human rights in places such as Xinjiang and Hong Kong,\" he said.  \n\"The new Trump administration may be more focused on policies targeting the Communist Party's power and legitimacy at home and abroad, in a Cold War-like, anti-communism fashion.\" \nAs he reflected on his presidency in his farewell address on January 15, Biden said the United States had \"pulled ahead in our competition with China\", and that \"as the land of liberty, America - not China - must lead the world\" in the development of artificial intelligence. \nThe assessment echoed the rhetoric of the previous four years in which the Democratic Party repeatedly framed the competition with China as \"democracy versus authoritarianism\", and used its \"small yard, high fence\" policy to contain its hi-tech development. \nDuring that term, the administration held three \"democracy summits\", all of which excluded China. For Beijing, the message was clear support for regime change. After the 2021 summit, Beijing said the US had a history of imposing its political values and instigating \"colour revolutions\".  \nBut Trump is not driven by ideology, according to Yun Sun, a senior fellow and co-director of the East Asia Programme and director of the China Programme at the Stimson Centre, a think tank in Washington.  \n\"His team might be. But for him, ideology is an instrument rather than the policy goal. He might allow his team to use ideology to press China, but he personally does not have that aspiration,\" Yun said. \nInstead, Trump's main focus would be on economic benefits, said Wu Xinbo, dean of the Institute of International Studies at Fudan University in Shanghai. \n\"However, if the economic dealings don't go smoothly and relations with China worsen, he might allow national security and ideological hawks to take the lead in shaping his China policy,\" said Wu, who is also director at the Centre for American Studies at Fudan University. \nA precedent was set in Trump's first term. As US-China relations worsened during the Covid-19 pandemic, Trump's officials repeatedly targeted the Communist Party in official statements, a move seen by Beijing as advocating \"regime change\". \nAccording to analysts, the hawkish senior officials in Trump's second administration are likely to recycle these critical narratives of Beijing in service of Trump's strategic goals. \n\"Trump wants to create pain for Beijing as a negotiating tactic to achieve a better deal for the American economy,\" said Neil Thomas, a fellow for politics at the Asia Society Policy Institute's Centre for China Analysis.  \n\"But [Secretary of State] Marco Rubio's anti-communist credentials mean the day-to-day diplomacy of the State Department towards China could become more adversarial and less attentive to consultation and dialogue.\" \nSuch views could be heard loud and clear during the confirmation hearings for Trump's cabinet picks. \nRubio, a long-created_at China hawk, has consistently opposed Beijing's policies and co- sponsored several acts targeting alleged human rights abuses, earning him a spot on China's sanctions list since 2020. \nDuring his confirmation hearing last week, Rubio sharply criticised Beijing's global ambitions, accused it of violating Hong Kong's autonomy and laid out his concerns about \"aggressive\" naval activities in the South China Sea as well as the human rights record in Xinjiang. He said there was a need to reduce US dependence on mainland China and support Taiwan's participation in international organisations. \nIn a similar vein, John Ratcliffe, Trump's nominee for CIA director, pledged in his hearing on January 14 to intensify the agency's focus on China and cybersecurity threats, calling Beijing a \"key threat\" and a \"once-in-a-generation challenge\".  \nThe same day, Pete Hegseth, nominated for secretary of defence, informed the US Congress that he would make certain the Pentagon prioritised the Communist Party as \"front and centre\" among foreign threats to the US. \nIn Rubio's case, he was \"obligated to serve Trump's strategic goals\", which could mean compromising \"his principles and [becoming] a pawn for Trump to maximise Trump's interests while competing with China\", according to Jinghao Zhou, an associate professor of Asian studies at Hobart and William Smith Colleges. \nPeter T.C. Chang, a visiting senior fellow with the ISEAS-Yusof Ishak Institute in Singapore, said the dynamic between Trump and his hawkish subordinates could lead to \"an administration marked by conflicting stances\".  \nFor decades, Beijing has been wary of Washington as a catalyst for protests and potential \"regime change\" in developing nations.  \nThe deep-seated suspicions have driven decision makers in China to strictly contain the spread of Western political ideas such as \"woke\" culture and the #MeToo movement, believing they have been used as channels to infiltrate and subvert Chinese society.  \nThe authorities have cracked down on human rights lawyers, labour activists, feminists and LGBTQ groups for alleged connections with foreign forces. \nRemarks by Biden officials may have heightened Beijing's fears. When Chinese internet regulators shut down more than a dozen LGBTQ WeChat accounts in 2021, the move immediately drew criticism from the US State Department, which argued that the groups had been \"exercising their right to freedom of expression and freedom of speech\". \nTwo years later, the Biden administration unnerved Chinese nationalists when then Treasury secretary Janet Yellen hosted a lunch with women economists during her visit to Beijing.  \nThe diverse cabinet showcase and display of empowered women did not go over well with many in China, who labelled the attendees \"radical feminists\" and \"traitors\". \nThomas from the Asia Society said Trump was not expected to take the same tack. \"Trump sees human rights as a much lower priority for US foreign policy than many of his cabinet nominees, a situation that is likely to create policy tensions and personal frustrations within the new administration,\" he said. \nChina observer Andrew Nathan, a Columbia University professor of political science, agreed, saying he did not think labour rights, freedom of speech or political repression \"will figure in Trump's China policy\". \nWang, from Georgia Tech, suggested the new administration would continue to target rights issues - but not the same ones as the Biden White House. \"While the Trump administration may tune down criticisms against Beijing on issues related to human rights for LGBTQ, women and ethnic minorities, it is expected to continue, even enhance, US criticisms of China on the rights and freedom of religious groups such as 'underground' churches, and religious sects such as the Falun Gong,\" Wang said. \nNathan added that for US foreign policy, upholding religious freedom also meant \"opposition to the attacks on Tibetan Buddhism and on Muslim communities in China\". \nChina officially recognises five religions: Buddhism, Taoism, Islam, Protestantism and Catholicism.  \nFalun Gong has been deemed a cult by Beijing.  \nAccording to the 2020 World Religion Database, around 7.4 per cent of Chinese identify as Christians. \nUnder President Xi Jinping, the country has intensified its control over religions, particularly Islam and Christianity, through the \"Sinicisation of religion\" policy, which aims to strengthen national security and curb foreign influence.  \nWu, from Fudan University, said \"religious right-wing figures\" within the Republican Party would bring up the religious freedom issue, creating ideological tension points, but they were not likely to hold democracy summits like the Biden administration.  \nIn Trump's first term, many of his senior officials, including then vice-president Mike Pence and secretary of state Mike Pompeo, went on at length about what they said was Chinese religious oppression, especially in the far-western region of Xinjiang, ultimately imposing sanctions on individual Chinese officials. These included then Politburo member and Xinjiang party chief Chen Quanguo - the most senior Chinese official ever to land on a US sanctions list. \nBeijing hit back with its own sanctions against a wide range of US politicians, including multiple members of the Senate and the House of Representatives. But Sam Brownback, ambassador-at-large for international religious freedom in Trump's first term, who repeatedly accused the Chinese government of being \"at war with faith\", was the only Trump administration official to be sanctioned. \nBrownback was also vocal on Tibet and in 2019 asked the United Nations to take up the succession issue of the 14th Dalai Lama, Tibetan Buddhism's exiled spiritual leader, to stop China from trying to hand-pick his successor. \nTrump's new administration and Beijing are likely to differ sharply in terms of governance philosophies as well as international collaborations - a gulf that could shape the ideological landscape between the two superpowers in a way that creates two spheres of influence, according to analysts. \nSuch a shift has been reflected in the approach of Argentina's two most recent presidents. \nAlberto Fernandez, who was president from 2019 to 2023, was a left-leaning leader who engaged deeply with the Global South and even paid tribute at the Chairman Mao Memorial Hall during his visit to China in 2022.  \nThe current president, Javier Milei, has embraced crypto­currency, deregulation and a free-market approach that has resonated with Trump's own pro-market sencreated_atnts. \nGeorgia Tech's Wang said Trump and tech billionaire Elon Musk \"certainly will strengthen the right-turn trend of privatisation and decentralisation worldwide\". \nMilei attended Trump's inauguration on Monday - a break from the tradition of foreign heads of state not attending such events. \nThe invitation to attend was \"a symbolic gesture of Trump's personality-driven diplomacy, aimed at promoting his domestic agenda in support of deregulation and free-market policies among his base\", Zhou said. \"This could potentially challenge China's state-controlled model and reshape international alliances.\" \nStill, Zhou said, Trump's main focus remained on protecting US interests in competition with China, against the backdrop of an age-old rivalry between command and market economies, a dynamic that could lead to \"hybrid approaches\" in some countries. \nWu argued that the United States' \"small government\" and China's state-controlled models should be interpreted as a reflection of different values, instead of \"confrontational ideologies\".  \nWhile both countries could decide what was in its own best interests, the decisions would not directly influence bilateral relations, he said. \nBut Wu, at Fudan, said the Trump administration's values concerning global governance - and especially Washington's promotion of deglobalisation, unilateralism and \"America first\" - were contradictory to Beijing's public positions on global governance, multilateralism and international cooperation. \nAnother area of potential ideological conflict lies within environmental policies. The US might lose its global leadership in the arena due to Trump's dismissal of the climate change consensus. And a Trump withdrawal of the US from the Paris Agreement could create a vacuum in which China assumed a larger role in the global battle against climate change, observers said.\n"
      },
      {
        "id": 2137,
        "title": "Counternarcotics roundup: China and India 17-23 Jan 25",
        "created_at": "2025-01-24",
        "text": "\nMedia stories about counternarcotics activities in China, Taiwan and India in the period 17-23 Jan 2025\nChina\nChina donates laboratory equipment, 'significantly' boosts Papua New Guinea's anti-drug efforts\nChina has provided Papua New Guinea (PNG) with laboratory equipment and materials to enhance its anti-drug efforts, the Chinese Ministry of Foreign Affairs (MFA) reported. On 17 January, Chinese Ambassador Yang Xiaoguang attended the handover ceremony in Port Moresby, alongside PNG acting Police Inspector General Donald Yamasombi. Ambassador Yang emphasised China's commitment to global drug control cooperation and pledged ongoing support through technical training and collaboration over policing. According to PNG's The National, Yamasombi expressed gratitude, highlighting that the donated equipment, valued at approximately K550,000 (US$135,000), would \"significantly\" enhance the country's capacity to test and identify drugs locally. He noted that PNG has relied heavily on Australian forensic services for drug analysis, and this contribution would strengthen domestic investigations and enforcement. Papua New Guinea lies just north of Australia and 6,000km away from China on shipping and air routes to the southwestern Pacific. &#160;\nAustralian authorities intercept over half a tonne of MDMA, 'pink cocaine' and meth, four Chinese nationals charged\nAustralian authorities have thwarted an attempt to smuggle over half a tonne of drugs into the country, arresting four Chinese nationals and a Sydney man, Netease reported on 17 January. The Australian Border Force at the Port of Melbourne discovered 421kg of MDMA tablets, 120kg of suspected \"pink cocaine\" and 80kg of methamphetamine in a shipment from Italy. A joint investigation by the Australian Federal Police and Border Force, initiated in July 2024, led to multiple arrests in Sydney on 15 January. Three men, including two Chinese nationals, and a Sydney resident, appeared in court on 16 January, charged with drug smuggling and attempting to possess commercial quantities of controlled drugs. They face life imprisonment if convicted. Two other Chinese nationals, identified during the investigation, were charged with possessing precursor chemicals used for drug production.\nChina Coast Guard highlights major drug seizures in 2024\nThe China Coast Guard (CCG) highlighted its 10 most notable cases in 2024, China News Service reported on 17 January. &#160;Two of these cases involved drug smuggling. In the \"10.15\" case, the Fuzhou Coast Guard Bureau, working with local anti-narcotics authorities, intercepted a modified fishing vessel near Taiwan's southeast shoal (islands). The operation resulted in the seizure of 440kg of marijuana and the arrest of 24 suspects. In August 2024, the South China Sea branch of the CCG led a joint anti-drug mission alongside public security and border inspection units. The operation targeted a cargo ship south of the Dongsha Islands (Pratas Archipelago), seizing 780kg of ketamine and arresting nine suspects.\nSichuan police seize record ephedrine haul in 2024\nSichuan's Public Security Narcotics Control Department in 2024 conducted extensive anti-drug operations, including an initiative called \"Clearing the Source and Cutting Off the Flow\". The authorities resolved 2,645 drug-related cases, arrested 4,631 suspects and confiscated 275.3kg of various narcotics, according to Sichuan Legal News. Notable successes included the \"3.15\" smuggling case, which took ten months to conclude. Police dismantled a drug production factory and three storage facilities, arrested 22 suspects and impounded 4.15 tonnes of ephedrine. This was the largest seizure of ephedrine (a central nervous system stimulant and sympathomimetic agent, which can be used in the illicit production of methylamphetamine) in recent years across China.\nShenzhen customs confiscate over 10kg of ecstasy disguised as water purification tablets\nShenzhen Post Office Customs recently seized 10.3kg of ecstasy (MDMA), the General Administration of Customs reported via WeChat on 17 January. During routine inspection, officers detected irregularities in the X-ray scan of a parcel labelled \"water purification\". Inside, they discovered 10 cartons containing eight bags of green tablets and two bags of blue-grey tablets, all sealed in transparent plastic. Testing confirmed the tablets were ecstasy.\nGuangxi executes two drug traffickers following Supreme Court approval\nThe Intermediate People's Court of Fangchenggang city, Guangxi, executed Gao Chao and Huang Haiyi on 22 January for drug trafficking and manufacturing, according to Guancha. Between May 2019 and June 2020, the pair produced and sold large quantities of methamphetamine. The authorities seized 39kg of methamphetamine, 92kg of meth-containing mixtures and equipment from multiple sites. Additionally, from September 2019 to June 2020, Gao and Huang trafficked 150kg of f-ketamine, with police confiscating 56kg in June 2020. In December 2021, the Fangchenggang court sentenced them to death, along with life-long deprivation of political rights and confiscation of property. Appeals to the Guangxi High Court were dismissed, the Supreme People's Court upheld the verdict, citing grave social harm caused by their crimes.&#160;\nHong Kong police uncover 19kg of meth in drug warehouse\nHong Kong police detected a public housing flat in Sha Tin being used as a drug storage warehouse, impounding 19kg of suspected methamphetamine, HK01 reported. Following investigations, officers intercepted a 30-year-old local man and searched his residence, uncovering drugs and packaging tools. Police believe the syndicate lured individuals with money to act as \"warehouse managers\".\nHong Kong authorities seize nearly 8kg of heroin, arrest three in airport drug bust\nHong Kong law enforcement, in collaboration with Customs, intercepted a drug trafficking operation at the airport on 18 January, arresting three suspects, according to HK01. The authorities confiscated approximately 7.7kg of suspected heroin valued at HK$4.25 million (US$543,000) from two suitcases belonging to a local man and a mainland Chinese woman. A third local man was later apprehended for conspiracy to traffic in dangerous drugs. The suspects' travel origins were not disclosed.&#160;\nHong Kong customs intercept 20kg of ketamine from passengers arriving from Kuala Lumpur and Zurich\nHong Kong Customs intercepted two drug trafficking attempts at the airport on 19 and 20 January, seizing 20kg of ketamine worth approximately HK$9.2 million (US$1.2 million), according to HK01. The first case involved a foreign national arriving from Kuala Lumpur, with 6kg of ketamine hidden in his checked-in luggage. The second case saw two local men arriving from Zurich, where officers found 14kg of the drug concealed in their luggage. The foreign suspect claimed to have received a US$640 reward for his involvement, while one local received US$3,800.\nTaiwan\nMalaysian police bust drug factory, seize 800kg of narcotics, arrest 10 Taiwanese\nMalaysian police dismantled a drug syndicate, impounding over 800kg of narcotics valued at RM117.99 million (approximately NT$860 million or US$26 million). The Central News Agency (CNA), citing Malaysian media, reported that 12 suspects, including 10 Taiwanese men, were arrested during raids on 16 January. The Malaysian Director of the Narcotics Crime Investigation Department, Khaw Kok Chin, explained that foreign drug cartels establish manufacturing operations in Malaysia due to its strategic location as a transit hub. Drugs are produced locally and then transported to third countries for distribution. Six of the arrested Taiwanese suspects were found to have prior criminal records, including drug offences. Malaysia's New Straits created_ats detailed that the substances included ecstasy, cocaine, heroin, Erimin 5 (nimetazepam) and ketamine. The authorities believe the drugs originated from a northern neighbouring country (Thailand shares an almost 600km border) and were processed in Malaysia. The syndicate is thought to have been active since December 2023, producing drugs for domestic and international markets, including Japan and Cambodia.&#160;\n18 sentenced for smuggling 888kg of ketamine off Taiwan coast\nEighteen people have been sentenced for smuggling 888kg of ketamine along the coast off Dong'ao, northeastern Taiwan, with mastermind Tsao receiving 12 years, ETToday reported. Tsao and accomplice Lai organised the operation, earning NT$2 million (USD 62,500) and NT$1 million (USD 31,250) respectively. They recruited 16 others to assist. On 7 July 2024, Lai sailed from Dong'ao fishing port and transferred 35 boxes of ketamine from an unidentified vessel. The coast guard intercepted the operation, arresting all involved. On 20 January, the Keelung district court also sentenced Lai to 9 years, and the others to prison terms ranging from 3.5 to 7 years.\nTaipei police bust drug ring linked to major gang, arrest 10 including US national\nTaipei police dismantled a drug trafficking ring linked to the Thento Union, a major Taiwanese gang, arresting 10 suspects, including an American national, Taipei created_ats reported on 23 January. The group smuggled cocaine, amphetamines and cannabis concentrate into Taiwan. Acting on tips, police seized 4.6kg of cannabis oil during operations last year and later apprehended the US suspect in September, finding 1kg of cocaine and 3kg of amphetamines hidden in snacks and toys, as well as 13kg of cannabis concentrate disguised as maple syrup. The suspects were referred to prosecutors on organised crime and narcotics charges.\nKaohsiung police seize 2,760kg of drugs in 2024\nPolice in Kaohsiung, Taiwan's largest port city, resolved 3,611 drug cases in 2024, which was 682 more than the previous year. The total net weight of drugs seized reached 2,760kg, tripling from the amount siezed in 2023, marking an increase of 1,764kg, according to the United Daily News.&#160;\nTaiwan police destroy over 400kg confiscated drugs\nKaohsiung police incinerated over 200kg of narcotics and drug paraphernalia on 18 January, according to Unite Daily. The destroyed items included \"coffee bags\" (a mixture of coffee powder laced with mephedrone) and a small amount of narcotics such as ketamine, amphetamine, Ermin (nimetazepam), FM2 (flunitrazepam) and related equipment. Meanwhile, Taipei police recently destroyed 130 kg of seized drugs, including ketamine, \"coffee bags\" and etomidate, according to the CNA on 20 January. Separately, New Taipei police on 22 January incinerated 102kg of confiscated drugs, including ketamine, cathinone, FM2, Ermin, etomidate and other substances, as reported by CNA.\nIndia\nDelhi police bust dark web drug cartel, impound hydroponic weed imported from US\nDelhi police dismantled an international dark web drug cartel with connections to the United States, The Hindu reported on 19 January. The network had used \"blockchain-based privacy-centric communication apps and sophisticated dead delivery methods ... with payments made via cryptocurrencies\". Key figures arrested included Abdul Malik, alias \"Parvez\", 46, and Mayank Nayyar, 35, both from Delhi. A senior officer explained how the investigation began when police intercepted several drug parcels at the Foreign Post Office, containing over 5kg of hydroponic weed imported from the USA. Even though the parcels were addressed to fake recipients, an analysis of internet communication and data mining helped police trace Abdul Malik, who was supposed to collect the narcotics. Nayyar leveraged his knowledge of the dark web and ordered high-demand hydroponic weed from the USA, paid for via cryptocurrency, and he orchestrated deliveries through Malik.&#160;\nIndian agencies seize methamphetamine, Yaba tablets smuggled from Myanmar&#160;\nThe Directorate of Revenue Intelligence (DRI) impounded 26kg of methamphetamine tablets smuggled into India through the Indo-Myanmar border in the northeastern state of Mizoram, state-run Press Information Bureau reported on 22 January. In its pursuit of smuggling and trafficking in the North Eastern Region, the DRI has so far impounded 231kg of methamphetamine tablets and 16kg of heroin, as well as cannabis, since April 2024. In addition, the paramilitary force Assam Rifles arrested two people in northeastern Manipur state and impounded 200,000 banned yaba tablets (a combination of methamphetamine and caffeine), India Today reported on 18 January. The operation was conducted based on credible reports about the movement of contraband from Myanmar towards Mata village in Churachandpur district.&#160;\nKashmiri official says Pakistan using heroin as 'cold war weapon' to harm Indian citizens\nMohammad Shahid Saleem Dar, Deputy Commissioner of Shopian in Kashmir, raised serious concerns over the alleged use of heroin as a \"cold war weapon\" [sic] by Pakistan to harm the gene pool of Indian citizens, Rising Kashmir reported on 22 January. Addressing the media, the Deputy Commissioner revealed that heroin (synthesised from the dried latex of the opium poppy) is being smuggled into Jammu and Kashmir and Punjab by drones from Pakistan. The official added that various chemicals are mixed with the heroin to boost its weight and that these banned substances - ranging from laxatives to chemical weapons, he said - are aimed at damaging the gene pool of Indian citizens. \"This is a cold war, they want our new generation to be crippled.\"\nUttar Pradesh police arrest two men for smuggling drugs from Nepal\nA special team from Uttar Pradesh police detected a gang of cross-border drug smugglers and arrested two of them from a private hospital, Deccan Herald reported on 19 January. A police officer said that the team also impounded a kilogramme of a drug identified as Mefa Dran (MD) [possibly mephedrone] from them. The police said that the accused confessed to smuggling \"Mefa Dran\" from Nepal at cheaper rates.\nSource: BBC Monitoring in Chinese (written) 24 Jan 25\n"
      },
      {
        "id": 2140,
        "title": "AFP rejects China call: Says it will not pull out Typhon launcher",
        "created_at": "2025-01-24",
        "text": "\nThe Armed Forces of the Philippines (AFP) on Friday rejected China’s call for the country to pull out the US-made mid-range capability (MRC) missile system known as the Typhon missile launcher. In confirming that the Typhon was relocated to another site, AFP spokesperson Col. Francel Margareth Padilla said the transfer was part of the military’s training on..."
      },
      {
        "id": 2147,
        "title": "The Latest: Trump greets Newsom in Los Angeles before touring wildfire damage",
        "created_at": "2025-01-24",
        "text": "\nPresident Donald Trump is in the fifth day of his second term in office, striving to remake the traditional boundaries of Washington by asserting unprecedented executive power.\nThe president also took his first trip of his second administration on Friday, touring areas where politics has clouded the response to deadly disasters. He first traveled to hurricane-battered western North Carolina, where he described FEMA as “a very big disappointment.” Later Friday, Trump arrived in wildfire-ravaged Los Angeles, and he greeted political rival California Gov. Gavin Newsom with a handshake.\nHere's the latest:\nA look at false and misleading claims made by Trump during his first week\nTrump has wasted no created_at setting a new agenda, relying on false and misleading information to support several of his initiatives.\nHe told attendees at the World Economic in Davos he had a massive mandate from the American people because he had millions of votes. While the electoral vote was 312 for Trump and 226 for former Vice President Kamala Harris, he won the popular vote by only about 2.3 million votes, 49.9% to 48.4%.\nPardoning Jan. 6 rioters, he falsely claimed there were only a few minor incidents with police.\nHe has also continued to greatly inflate the number of people who entered the country illegally during President Joe Biden’s administration, and has misrepresented water issues in California while discussing recent wildfires.\n▶ Read more about false or misleading claims made by Trump this week\nNewsom and Trump exchange kind words before touring Los Angeles wildfire damage\nNewsom says California will need the federal government’s help and support.\n“I have all the expectations we’re going to be able to work together,” Newsom said.\nTrump responded: “We’re going to get it fixed.”\nIt might seem like odd messaging for the two rivals. But it’s similar to the approach Newsom took toward Trump during the early days of the coronavirus pandemic\nNewsom and Trump greet each other with a handshake\nTrump says he appreciates the California governor greeting him on the tarmac in Los Angeles.\nIt’s not clear if the Democratic governor will join Trump to tour a fire-ravaged neighborhood or for a fire-related briefing. He’s not listed as a participant in those events.\nNewsom’s office says the governor is “committed to advocating for the needs of Californians in partnership with the federal administration.”\nNewsom has a fine political tightrope to walk. He’s pushed back against some of Trump’s criticism of the state’s handling of the wildfires but also needs the federal government to approve wildfire assistance.\nOne Pacific Palisades resident who lost homes in LA fires says he is unfazed by Trump’s threat to withhold federal aid\nRon Flury, who has lived in the Pacific Palisades for 25 years, said he was glad Trump was in office because “at least something will happen now.”\nFlury was driving through the neighborhood Friday and surveying the remnants of the four homes he lost, two of which were occupied by him and his daughter. His only surviving property is a partially built home that recently resumed construction.\n“I’m hoping he will help us build back, and I think it will be better than ever but will take awhile,” Flury said.\nHe’s unfazed by Trump’s threat to withhold federal aid unless California changes its water policy — in fact, he supports it.\n“Someone needs to force (Newsom) to actually follow through and do the things he should be doing,” Flury said. “And that’s what Trump is doing, it’s a negotiation point.”\nSupreme Court will weigh approval for US’ 1st publicly funded religious charter school, in Oklahoma\nThe Supreme Court agreed Friday to take on a new culture war dispute: whether the nation’s first publicly funded religious charter school should be allowed to open in Oklahoma.\nThe justices said they would review an Oklahoma Supreme Court decision that invalidated a state board’s approval of an application by the Catholic Church in Oklahoma to open a charter school.\nThe conservative-dominated high court has issued several decisions in recent years signaling a willingness to allow public funds to flow to religious entities. At the same created_at, conservative-led states have sought to insert religion into public schools, including Louisiana’s requirement that the Ten Commandments be posted in classrooms.\nRubio tells Chinese FM the US will put America first in relations with China\nSecretary of State Marco Rubio has told China’s foreign minister that the Trump administration will put U.S. interests and the American people first in its relationship and competition with China.\nIt was the first phone call Rubio has had with his Chinese counterpart Wang Yi since Rubio took office.\nIn the call, Rubio also expressed “serious concern over China’s coercive actions against Taiwan and in the South China Sea.”\nEarlier Friday, the Chinese foreign ministry had issued its own description of the call, saying that Wang had told Rubio the two sides should push for the steady, healthy and sustainable development of the China-U.S. relations and find the correct way for the two countries to cope with each other.\nRubio, according to the Chinese foreign ministry, told Wang the U.S. doesn’t support Taiwan independence but hopes the issue can be peacefully solved in a way acceptable to both sides of the Taiwan Strait. The U.S. statement made no mention of Rubio saying that.\nIndiana man arrested on charges he threatened Trump on TikTok\nAn Indiana man accused of using TikTok to urge attacks on the government and death to Trump has been arrested.\nThe FBI said 23-year-old Douglas Thrams of Goshen made a series of threats in videos posted to the social media site this week.\nIn one TikTok video, Thrams said Trump needed to be killed “and this created_at don’t ... miss,” an FBI agent wrote in a court filing.\nHe is charged with using interstate commerce to make threats.\nThrams is in custody awaiting an appearance Monday in federal court in South Bend. He does not have an attorney yet.\n▶Read more about the charges\nFive economic forces that could shape the first year of Trump’s presidency\nLike most presidents, Trump faces an economy that seldom bends to political ambitions.\nThe Republican has promised strong growth, high tariffs, income tax cuts and booming oilfields. But despite the solid job market and low 4.1% unemployment rate, he has to contend with headwinds like inflation, a budget deficit, increased tensions over trade, the fallout from his plans to curtail immigration and a persistent wealth gap.\nEach of these issues could help to shape how voters feel about a president they returned to the White House with the specific goal of fixing the economy.\n▶Read more about the economic headwinds\nSenate confirmation vote for Hegseth set for Friday night\nThe Senate is muscling Pete Hegseth’s nomination as defense secretary toward confirmation.\nThe Republican senators are prioritizing the former Fox News host and combat veteran’s vow to create a “warrior culture” at the Pentagon over allegations of heavy drinking and aggressive behavior toward women.\nVotes are expected by Friday evening.\n▶Read more about the Hegseth vote\nJustice Department curtails prosecutions for blocking reproductive health care facilities\nPresident Donald Trump’s new Justice Department leadership is curtailing prosecutions against people accused of blocking reproductive health care facilities, calling the cases an example of the “weaponization” of law enforcement.\nJustice Department chief of staff Chad Mizelle said in a memo obtained Friday by The Associated Press that prosecutions and civil actions under the Freedom of Access to Clinic Entrances Act or “FACE Act” will now be permitted only in “extraordinary circumstances” or in cases presenting ”significant aggravating factors.”\nMizelle also ordered the immediate dismissal of three FACE Act cases related to 2021 blockades of clinics in Tennessee, Pennsylvania and Ohio. One man was accused of obtaining “illegal access to a secure patient space at a Planned Parenthood facility in Philadelphia without staff permission or knowledge” and barricading himself in a restroom, according to court papers.\nPutin echoes Trump’s claim that conflict in Ukraine could have been avoided had he been in office\nRussian President Vladimir Putin on Friday echoed U.S. President Donald Trump’s claim the conflict in Ukraine could have been prevented had he been in the White House in 2022. He also said Moscow is ready for talks with the U.S. on a broad range of issues.\nIn an interview with Russian state television, Putin praised Trump as a “clever and pragmatic man” who is focused on U.S. interests.\n“We always had a business-like, pragmatic but also trusting relationship with the current U.S. president,” Putin said. “I couldn’t disagree with him that if he had been president, if they hadn’t stolen victory from him in 2020, the crisis that emerged in Ukraine in 2022 could have been avoided.”\nPutin’s statement was his bluntest endorsement yet of Trump’s refusal to accept his defeat in the 2020 election.\nTrump also has said repeatedly he wouldn’t have allowed the conflict to start if he’d been in office, even though he was president as fighting grew in the east of the country between Kyiv’s forces and separatists aligned with Moscow, ahead of Putin sending in tens of thousands of troops in 2022.\n▶ Read more about Russia and Trump\nTrump administration has withdrawn a federal rule which would have phased out menthol cigarettes\nThe cigarettes are disproportionately used by young and minority smokers.\nThe action was widely expected by anti-smoking advocates, who’ve spent years pushing for a ban on menthol, the only flavor still allowed in cigarettes. Tobacco companies have typically faced lighter regulation under Republican administrations.\nThe Food and Drug Administration spent years studying the issue and concluded menthol’s cooling sensation makes it easier to start and harder to quit cigarettes.\nThe FDA was widely expected to finalize the regulation last year, but President Joe Biden’s White House delayed its release, kicking a potential political controversy out past the election. At the created_at, both Biden and Trump were aggressively courting Black voters in swing states.\nThe persistence of menthol has long infuriated health experts, who’ve been pushing for a ban since the FDA gained authority over tobacco products in 2009.\nVice President JD Vance celebrated Trump’s previous actions on abortion\nSpeaking at the March for Life in Washington, Vance said the president “delivered on his promise of ending Roe,” appointed hundreds of anti-abortion judges and pardoned anti-abortion activists he says were “unjustly imprisoned.”\n“Our country faces the return of the most pro-family, most pro-life American president of our lifecreated_ats,” Vance told the crowd of protesters who cheered and chanted “JD” as he took the stage.\nPresident Trump speaks to March for Life crowd in a video address\nIn the video address to March for Life crowds, Trump vowed “we will again stand proudly for families and for life” in his second term and once again boasted about nominating three Supreme Court justices who helped strike down Roe v. Wade.\n“I was so proud to be a participant,” he said. “Six courageous justices of the Supreme Court of the United States returned the issue to the state legislatures and to the people where it belongs.”\nCrowds cheered as Trump celebrated pardoning anti-abortion activists convicted of blockading abortion clinic entrances and thanked protesters for gathering at March for Life to “stand up for precious little babies who can’t stand up for themselves.”\n“Thank you for turning out once again to show your extraordinary love and compassion for the unborn,” he said.\nTarget is ending its DEI goals as workplace inclusion gets a strong opponent in the White House\nDiscount store chain Target said Friday it would join rival Walmart and a number of other prominent American brands in scaling back diversity, equity and inclusion initiatives that have come under attack from conservative activists and, as of this week, the White House.\nThe Minneapolis-based retailer said the changes to its “Belonging at the Bulleye” strategy would include ending a program it established to help Black employees build meaningful careers, improve the experience of Black shoppers and to promote Black-owned businesses following the police killing of George Floyd in 2020.\nTarget, which operates nearly 2,000 stores nationwide and employs more than 400,000 people, said it also would conclude the diversity, equity and inclusion, or DEI, goals it previously set in three-year cycles.\nThe goals included hiring and promoting more women and members of racial minority groups, and recruiting more diverse suppliers, including businesses owned by people of color, women, LGBTQ+ people, veterans and people with disabilities.\n▶ Read more about Target ending its DEI goals\nOntario leader will call election to fight Trump’s threatened tariffs\nThe leader of Ontario, Canada’s most populous province, said Friday that he would call an early election, because he says he needs a mandate to fight President Trump’s threatened tariffs.\nPremier Doug Ford of the Progressive Conservative Party said that he planned to make the announcement on Wednesday. The move would send Ontarians to the polls on Feb. 27, more than a year before the June 2026 fixed election date. Ford already has a large majority government.\nFord, who is the equivalent of a U.S. state governor, said that Ontario could lose upwards of 500,000 jobs should Trump follow through on his 25% tariff threat.\n▶ Read more about how Ontario is responding to Trump’s proposed tariffs\nDefense Department is expected to put out its own temporary social media ban Friday, U.S. officials say\nThe 10-day ban, however, carves out exceptions for military bases around the world that rely on social media posts to inform them of security incidents, school matters and normal base activities.\nOther federal agencies are doing the same thing, with guidance from the Trump administration suggesting that federal agencies shouldn’t put out information unless it’s been approved by the new leadership. The officials spoke on condition of anonymity to discuss internal planning.\n— Lolita C. Baldor\n‘You can’t have a security detail for the rest of your life because you worked for government’\nPresident Donald Trump says he won’t feel partially responsible if harm befalls former government officials whose security details were cut by his administration after he took office this week.\nTrump revoked the security detail of Dr. Anthony Fauci, the infectious disease expert who advised Trump on the COVID-19 pandemic but turned critical of Trump once he tried to undermine public health guidance. He faced regular threats to his life and has received federal protection for years, but it was ended this week according to a person familiar with the matter.\n“They all made a lot of money, they can hire their own security too,” Trump told reporters in North Carolina.\nTrump earlier this week revoked protection details for former Secretary of State Mike Pompeo and his top aide, Brian Hook, as well his own former national security adviser John Bolton, who have faced threats from Iran since they took hardline stances on the Islamic Republic during Trump’s first administration. All three have fallen out with Trump in the years since he left office.\nTheir security details had been repeatedly renewed by the Biden administration because of credible and ongoing threats from Iran.\n“You can’t have a security detail for the rest of your life because you worked for government,” Trump said.\nAsheville artist, who lost business in Hurricane Helene, wary about Trump’s visit\nSarah Wells Rolland, co-owner of The Village Potters Clay Center in Asheville’s now-destroyed River Arts District, said she’s “seriously concerned” about her city’s future recovery from Hurricane Helene under President Donald Trump’s administration. Rolland noted Asheville’s Democratic lean as a reason Trump may not prioritize its rebuilding process.\n“I’m not overly optimistic that the Trump administration is going to do anything long-term,” Rolland said Friday ahead of Trump’s visit to the area. “Frankly, I’ll tell you, I think him coming today is to look presidential.”\nRolland lost hundreds of thousands of dollars worth of equipment when her ceramics center’s roofing caved and water rose 26 feet inside her facility during Helene. She’s operated a temporary clay supply site for the past few months, and Rolland said she’s hoping to reopen the full center — which had classes and galleries — at a new location this summer.\nRolland’s interactions with Federal Emergency Management Agency workers in the storm’s aftermath were “wonderful,” she said. Criticism against the agency has been largely unwarranted, she said, because workers were in the region “almost on day one.”\nAnti-abortion protesters gather for the annual March for Life in Washington\nDespite frigid weather, thousands of anti-abortion protesters gathered to celebrate a new Republican trifecta in the presidency and both chambers of Congress as they returned to the nation’s capital Friday for the annual March for Life.\nA festive atmosphere marked the early part of the march, as activists gathered with multicolored hats and signs declaring “Life is our revolution.”\nPresident Donald Trump is expected to address the crowd in a pre-recorded video as the gathering marks the first created_at that participants have been to the nation’s capital with him as the sitting president since the Supreme Court overturned the landmark 1973 decision, Roe v. Wade, that declared there was a constitutional right to an abortion.\nVice President JD Vance is slated to speak in person.\nKristen Cooper, 21, was among several thousand Students for Life America members attending. She said she was especially excited to be at the march with “pro-life Republicans” in the White House. She said this march was her fourth but the first with a Republican administration.\n“It’s surreal actually,” she said.\nFederal agencies begin removing DEI guidance from websites in Trump crackdown\nSeveral federal agencies have begun removing resources for underrepresented Americans from their webpages following President Trump’s executive order cracking down on diversity, equity and inclusion initiatives.\nAgencies also have been cancelling training and service contacts to comply with the order from Trump, who vowed to dismantle diversity programs across the federal government. He has called for all DEI staff to be put on paid leave and eventually be laid off.\nDocuments on DEI have been removed from websites at agencies including the Office of Personnel Management, State Department and Department of Homeland Security. Web addresses that once led to DEI pages now display “Page Not Found — 404” messages or notes above archived material explaining the change.\n▶ Read more about the impact of Trump’s DEI executive order\nTrump expands use of fast-track deportation, which critics say is prone to mistakes\nThe Trump administration announced Friday that it is expanding a fast-track deportation authority nationwide, allowing immigration officers to deport migrants without appearing before a judge.\nThe administration said in a notice in the Federal Register on Friday that it is expanding the use of “expedited removal” authority so it can be used across the country. “The effect of this change will be to enhance national security and public safety — while reducing government costs — by facilitating prompt immigration determinations,” the administration said.\n▶ Read more about ‘expedited removal’ authority\nTrump says he’s considering ‘getting rid of FEMA’ as he visits hurricane-damaged North Carolina\nSpeaking to reporters Friday at Asheville Regional Airport where he was meeting with supporters and local officials about the recovery from last year’s Hurricane Helene, Trump says FEMA “has been a very big disappointment.”\nTrump said of the agency: “It’s very bureaucratic. And it’s very slow. Other than that, we’re very happy with them.”\nHe did not offer clear details on what he would replace it with, indicated he wants to move more of the disaster management responsibility to the states. That was a key priority of the conservative ’Project 2025” written by Trump’s supporters, including some who’ve since joined his administration.\n“A governor can handle something very quickly,” Trump said.\nTrump says OPEC+ can end the bloodshed in Ukraine by cutting oil prices\nThe president continued to make the case that reducing oil revenue is the key finding an endgame in Russian President Vladimir Putin’s war in Ukraine.\nTrump in his first days in office has centered his focus on the OPEC+ alliance of oil exporting countries, making the case that it has kept the price of oil too high for much of the nearly three-year war. Oil revenue is the engine driving the Russian economy.\n“One way to stop it quickly is for OPEC to stop making so much money. And they drop the price of oil because they have it nice and high,” Trump told reporters during a visit to Western North Carolina on Friday. “And if you have it high, then that war is not going to end so easily. So, OPEC ought to get on the ball and drop the price of oil. And that war will stop right away.”\nTrump continues to criticize FEMA\nPresident Trump landed in North Carolina to tour lingering damage from Hurricane Helene and said he would like to see states “take care of disasters” and that he was reviewing “the whole concept of “FEMA” the Federal Emergency Management Agency, which he’s criticized.\nTrump, speaking to reporters after he landed near Asheville, North Carolina, said it would be faster to let states respond to disasters.\n“Let the state take care of the tornadoes and the hurricanes and all of the other things that happen,” Trump told reporters.\n"
      }
]