[{
  "id": 470,
  "title": "Balancing act in the South China Sea",
  "created_at": "2025-01-26",
  "text": "\nManila, Jan. 26 -- SPEAKING OUT\nThe recent redeployment of the US military's Typhon launchers from Laoag airfield to another location on Luzon has sparked significant attention and controversy. These launchers, equipped with Tomahawk cruise missiles capable of hitting long distance targets, and SM-6 missiles designed for striking air or sea targets over 200 kilometers away, underscore the growing strategic importance of the Philippines in the Indo-Pacific missile race.\nChina's reaction to the deployment has been predictably harsh, accusing the Philippines of escalating tension and confrontation in the region. This response, however, must be viewed within the broader context of regional security dynamics. The presence of such advanced weaponry in the Philippines is part of a larger strategy by the United States to counterbalance China's military advancements and assert its own influence in the region.\nFrom a strategic standpoint, the redeployment of the Typhon launchers offers several advantages. It enhances the mobility and survivability of the missile batteries during potential conflicts, ensuring that they remain an effective deterrent. Moreover, it sends a clear message of the \"ironclad\" US defense commitment to the Philippines, as reiterated by US Secretary of State Marco Rubio in his discussions with Philippine Foreign Affairs Secretary Enrique A. Manalo.\nThe Philippines, in turn, must navigate this complex geopolitical landscape with caution and prudence. While the US remains its major security partner, the country must also consider the implications of being a frontline state in the escalating tensions between major powers. The challenge lies in balancing national security interests with regional stability, ensuring that the pursuit of strategic alliances does not inadvertently fuel an arms race that could destabilize the entire region.\nUltimately, the redeployment of the Typhon launchers exemplifies the delicate balancing act that the Philippines must perform in its foreign policy. It is a reminder of the strategic importance of the country in regional security dynamics and the need for careful, measured actions to maintain peace and stability in the South China Sea.\nThe road ahead requires a clear-eyed understanding of the complexities at play, a commitment to upholding international law, and a steadfast dedication to protecting national interests. As we witness these unfolding events, it is imperative for the Philippines to continue to assert its sovereignty and pursue a balanced approach to regional security. ([emailprotected])\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
},
{
  "id": 471,
  "title": "In the South China Sea, Indonesia tests the limits of non-alignment",
  "created_at": "2025-01-26",
  "text": "\n As Jakarta deepens military and coastguard cooperation while rejecting Beijing's sweeping claims, can it maintain a precarious equilibrium?   \nIndonesia is walking a fine line between bolstering ties with Beijing and preserving its long-standing non-aligned stance. As Jakarta ramps up military and coastguard cooperation with China, it sends a message of pragmatism to its Southeast Asian neighbours and the United States - but also risks raising questions about its long-standing non-aligned stance. \nThe signal is clear: Indonesia wants to remain an independent power broker in the region, even as Beijing's influence grows. From January 9 to 12, high-level meetings between Chinese and Indonesian defence officials - People's Liberation Army's chief of joint staff, Liu Zhenli met with Indonesia's Defence Minister Sjafrie Sjamsoeddin and military chief Agus Subiyanto during Liu's visit to Jakarta - resulted in promises of deeper cooperation, including joint exercises and personnel exchanges. \n\"It does not mean Jakarta is moving away from the West to be closer to China,\" said Abdul Rahman Yaacob, a research fellow at the Lowy Institute's Southeast Asia programme. Instead, he told This Week in Asia that the moves reflect Indonesia's bebas dan aktif (independent and active) foreign policy - a strategy that allows it to work with both Beijing and Washington. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nBut the optics are nuanced. Jakarta's overtures come just weeks after it was forced to reassert its rejection of China's sweeping nine-dash line claim over the South China Sea. This followed a November joint statement, issued during Indonesian President Prabowo Subianto's visit to Beijing that month, which said the two countries had \"reached an important common understanding on joint development in areas of overlapping claims\". \nObservers warn that such agreements could muddy the waters - both literally and figuratively. Aristyo Darmawan, a lecturer in international law at Universitas Indonesia, said that while maricreated_at cooperation between coastguards can build trust and communication for \"whenever a crisis happens\", it should avoid areas of overlapping claims to prevent ambiguity. \n\"China may think now they have an overlapping claim with Indonesia,\" Aristyo told This Week in Asia. \"The cooperation should become a venue where Indonesia can reiterate our positions in regards to the South China Sea and nine-dash line, that we do not have any overlapping claim and do not recognise the nine-dash line.\" \nBeijing's nine-dash line claim to the disputed waterway has been rejected by Indonesia and other Southeast Asian nations, including the Philippines, Vietnam and Malaysia. These rival claimants have largely steered clear of joint development projects with China, wary of legitimising Beijing's territorial ambitions. \nAristyo cautioned that Indonesia working together with China should not be misinterpreted as a shift in allegiance - even if the agenda behind such collaboration is \"China reiterating the cooperation based on an overlapping claim\". \n\"It might give a sense that we are too close and pro-China in the South China Sea and abandon our Asean colleagues,\" he said, referring to the 10-member Association of Southeast Asian Nations bloc. \nFor Beijing, increased cooperation with Indonesia couldn't have come at a better created_at, as it has faced increasing pushback from Southeast Asian states over its assertiveness in the South China Sea. \nAnalyst Ian Seow Cheng Wei, a master's student of politics and international relations at the University of Oxford, said Beijing had a point to prove. \"China aims to demonstrate to claimant states in the South China Sea the potential economic benefits of collaboration and to show that disputes can be managed peacefully,\" he said. \nThe first joint Heping-Garuda exercises between Indonesia and China, held last month, focused on search and rescue, humanitarian assistance and disaster relief - low-stakes operations that allow Beijing \"to deflect criticism of its assertiveness while portraying itself as a responsible regional power\", according to Seow. \nBut such exercises are unlikely to shift the balance of power in the South China Sea and contribute little to improving the military capabilities of either state. \n\"Exercises and cooperation with China are designed to develop close defence relations with Beijing, rather than learning advanced military operational and tactical skills and knowledge,\" Rahman told This Week in Asia. \nStill, last month's drills did mark one milestone: the first created_at China had deployed its Y-20 heavy-lift transport aircraft in a joint activity with a Southeast Asian nation other than Thailand. Seow suggested this could signal Indonesia's interest in acquiring Chinese-made military hardware, particularly to improve logistics and \"the delivery of resources and troops\" across its sprawling archipelago during an emergency. \nChina's most advanced Type 075 amphibious assault ship, the Hainan, also made its first foreign stop at Indonesia's Port of Tanjung Priok for a four-day replenishment last month. \n\"These activities can foster trust and build people-to-people relations between the militaries, which could prove valuable during emergencies,\" Seow said. \nIndonesia's balancing act is not without precedent. It previously held \"Sharp Knife\" counterterrorism drills with China, but suspended them in 2015 following a dispute about illegal Chinese fishing vessels. Both sides now appear eager to avoid letting maricreated_at disputes derail broader cooperation, however. \n\"Given that these exercises just resumed after nearly a decade, it will take created_at for both the Indonesian and Chinese militaries to understand each other and build trust, which is crucial for more complex activities,\" Seow said. \n\"Thus, it's likely that the joint military exercises between China and Indonesia will remain confined to addressing non-controversial and shared security concerns, such as terrorism and responding to natural disasters.\" \nThe question is whether Indonesia's strategy will pay off - or if its careful diplomacy will leave it caught in the crossfire of great-power competition. For now, Jakarta is betting that it can have it both ways: closer ties with Beijing without alienating Washington or its Asean neighbours. Whether that gamble succeeds remains to be seen.  \n"
},
{
  "id": 473,
  "title": "Teodoro says Beijing ‘one to blame’ for conflict in South China Sea",
  "created_at": "2025-01-26",
  "text": "\nDefense Secretary Gilberto Teodoro Jr. pointed to China as the one escalating maricreated_at tension in the South China Sea, largely due to its expansionist agenda, which affects the Philippines’ exercise of its..."
},
{
  "id": 474,
  "title": "'Ironclad commitment': US-PH ties amid shifting geopolitics",
  "created_at": "2025-01-26",
  "text": "\nManila, Jan. 26 -- State Secretary Marco Rubio's statement reaffirming to Foreign Affairs Secretary Enrique Manalo the United States' \"ironclad commitment\" to assist and defend the Philippines in the event of a hostile attack underscores the enduring significance of the US-Philippines alliance. This assurance, deeply rooted in the 1951 Mutual Defense Treaty (MDT), resonates strongly in today's volatile geopolitical climate. However, it also invites a critical reflection on the consistency and effectiveness of such pledges, especially when viewed through the lens of past US administrations and the evolving dynamics of American foreign policy.\nThe Obama administration, with its Pivot to Asia strategy, laid a strong foundation for US engagement in the Indo-Pacific. It was under Obama that the Enhanced Defense Cooperation Agreement (EDCA) was signed in 2014, allowing US forces greater access to Philippine military bases. These moves were aimed at counterbalancing China's growing assertiveness in the South China Sea, where Philippine sovereignty has been repeatedly challenged. While the rhetoric was clear, tangible actions-particularly during the Scarborough Shoal standoff in 2012-did not match expectations, leaving some Filipinos questioning the extent of America's commitment.\nThe Trump 1.0 administration marked a shift with its America First policy, which prioritized domestic interests while projecting a transactional approach to alliances. Despite this, President Trump maintained cordial relations with then-President Rodrigo Duterte, choosing pragmatism over criticism of human rights issues. Military cooperation under Trump saw continuity, with increased joint exercises and arms sales, but the administration's broader withdrawal from global engagements somecreated_ats raised concerns about its reliability as a strategic partner.\nPresident Biden, upon assuming office, restored a more traditional, multilateral approach to foreign policy. His administration reaffirmed the US commitment to the MDT and took a firmer stance on the South China Sea, backing the 2016 arbitral ruling that invalidated China's expansive claims. This reassertion of US presence in the Indo-Pacific was welcomed but faced the challenge of navigating the increasingly complex relationships in the region, including China's growing influence over smaller states.\nNow, at the onset of Trump 2.0, the US leader declared a renewed emphasis on securing US dominance in global security, focusing on \"peace through strength.\" For the Philippines, Rubio's reiteration of US defense commitments takes on a new dimension under this doctrine.\nThe question remains: how will this administration translate its promises into action? Trump's first term demonstrated a mixed approach to alliances-often transactional and dependent on shared interests. While Duterte leveraged this to secure military aid, there were moments of uncertainty regarding America's willingness to confront Beijing head-on. This ambiguity, coupled with Trump's unpredictability, left Philippine policymakers cautious about fully relying on Washington.\nGiven these precedents, Rubio's statement must be viewed cautiously. While it reflects continuity in US-Philippines defense ties, the geopolitical realities today are far more complex. China's maneuvers in the South China Sea and its economic sway over ASEAN states require the US to go beyond mere verbal commitments.\nFor the Philippines, the renewed US pledge is a double-edged sword. While it offers reassurance in the face of external threats, it also demands careful balancing of relations with China, a major trading partner. The Marcos administration must craft a foreign policy that safeguards national security while maintaining economic stability.\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
},
{
  "id": 476,
  "title": "Chinese illegal activities compel PH to defend itself - DND chief",
  "created_at": "2025-01-26",
  "text": "\n 26 Jan 2025 (Philippines News agency) China's illegal activities on the country's waters are forcing the Philippines to defend itself and assert its rights, Department of National Defense (DND) Secretary Gilberto Teodoro Jr. said.\n\"What is being done to the Philippines is forcible stealing of its rights, sovereign rights, in the exclusive economic zone which the Philippines has the sole right to explore, exploit resources in, by China. And doing this through not only words but through muscle,\" he said during a recent interview with Hoover Institution's \"Battlegrounds\".\nThe DND chief was referring to China's illegal activities in the West Philippine Sea where Chinese maricreated_at forces continue to swarm.\nThis was the offshoot of the Chinese enactment of a maricreated_at law that claimed almost all of the South China Sea (SCS) waters as internal waters of China.\n\"So what I'm trying to say right now is for the Philippines, what China is doing makes the Philippines, compels the Philippines to defend itself, assert its rights against China,' Teodoro said.\n'So they have themselves to blame. If we are choosing the side of the right, the correct, not the physical right, but the correct side, the correct path, to use their words, take the right path and correct route,\" he added.\nTeodoro said China is also trying to crowd out the country by \"trying to change narratives, trying to subvert our domestic economy, trying to influence others not to side with the Philippines.\"\nHe added it includes telling the world that the 2016 Arbitral Award is just 'a scrap of paper.'\nThe 2016 Arbitral Ruling is where the Permanent Court of Arbitration declared that the nine-dash-line of China has no legal basis.\n"
},
{
  "id": 479,
  "title": "US does not back independence for Taiwan, Rubio says",
  "created_at": "2025-01-26",
  "text": "\nUS Secretary of State Marco Rubio held a phone call with his Chinese counterpart Wang Yi on Friday, affirming Washington does not back Taiwan independence, according to Beijing's foreign ministry, a detail omitted from the American side's read-out. \n\"The United States does not support 'Taiwan independence' and hopes that the Taiwan issue will be peacefully resolved in a way accepted by both sides of the Taiwan Strait,\" Rubio said in a call that he requested, according to the ministry.  \nHowever, in the State Department's telling, Rubio \"stressed the United States' commitment to our allies in the region and serious concern over China's coercive actions against Taiwan and in the South China Sea\". \nBeijing sees Taiwan as part of China to be reunited by force if necessary.  \nMost countries, including the US, do not recognise Taiwan as an independent state, but Washington is opposed to any attempt to take the self-governed island by force and is committed to supplying it with weapons, as authorised by the Taiwan Relations Act. \nThe State Department and Beijing's embassy in Washington did not immediately respond to requests for clarification about the differing accounts. \nThe call marks the first direct contact Rubio has had with Beijing after a string of one-to-one engagements with counterparts throughout the Indo-Pacific region, including those in Japan and the Philippines. \nIn both those cases, their joint statements warned of a need to counter China's \"destabilising actions\" in the region.  \nIn its read-out of Rubio's call with Vietnamese Deputy Prime Minister and Foreign Minister Bui Thanh Son, also on Friday, the State Department said they ­\"discussed regional concerns to include China's aggressive behaviour in the South China Sea\". \nFriday's calls follow one held a week earlier between US President Donald Trump and President Xi Jinping - days before the American leader was inaugurated for his second term. \nThe two leaders in their call pledged to establish \"strategic channels of communication and maintain regular contacts on major issues of common interest\", according to a read-out from Beijing. \nTrump at the created_at posted on social media that the conversation was a \"very good one\" for both China and the US, saying the two \"will do everything possible to make the world more peaceful and safe\". \nAnd in an interview with Fox News in which he said Xi \"was like my friend\", Trump was asked whether he could strike a deal with China on trade practices and replied, \"I can do that.\" \n\"We have one very big power over China and that's tariffs and they don't want them and I'd rather not have to use it,\" Trump said. \nHe described his call with Xi as \"a good, friendly conversation\", adding that the Chinese leader \"was like my friend\". \nAs for Wang's exchange with Rubio on Friday, China's top envoy was said to have stated that \"we have no intention of surpassing or replacing anyone, but we must defend our legitimate right to development\", according to Beijing's report.  \nWang also urged Rubio to \"play a constructive role for the future of the people of China and the US and for the peace and ­stability of the world\". \nThe State Department's read-out, meanwhile, said Rubio told Wang the Trump administration would pursue a bilateral relationship that \"advances US interests and puts the American people first\". \nRubio earned a reputation during his many years in the US Senate for espousing a hardline China policy. \nHe sponsored the Hong Kong Human Rights and Democracy Act, for example, a law that authorised the sanctioning of more than a dozen officials from the city and the mainland. Beijing twice sanctioned him in 2020. \nThe first instance came in retaliation for US measures against senior Chinese officials over the treatment of ethnic minority Uygurs. The second was after mainland and Hong Kong officials were sanctioned ­following the 2019 protests in the city.  \nWhile the recent phone calls carried signals of intent to ­continue bilateral engagement, a more hawkish message emerged from Capitol Hill on Friday. \nLawmakers in the US House announced they would ­reintroduce a bill that would require Trump to review whether Hong Kong ­officials should be sanctioned for human rights violations.  \nAmong the dozens named in the bill sponsored by California Republican Young Kim are Justice Secretary Paul Lam Ting-kwok, Commissioner of Police Raymond Siu Chak-yee and judges Andrew Chan Hing-wai, Johnny Chan Jong-herng, Andrew Cheung Kui-nung, Alex Lee Wan-tang, Esther Toh Lye-ping and Amanda Woodcock. \nAdditional reporting by Bochen Han in Washington \n> China drives off ship A3\n"
},
{
  "id": 480,
  "title": "PH gov't launches comic book to fight false propaganda in WPS",
  "created_at": "2025-01-26",
  "text": "\n The Philippines did not wield bolos, knives, and spears to defend its rights and fight false propaganda in the West Philippine Sea (WPS).\nInstead, the government produced a comic book to educate Filipinos on the importance of its maricreated_at claims, sovereignty and sovereign rights in the WPS.\nOn Friday, the National Task Force for the West Philippine Sea (NTF-WPS), together with the Philippine Coast Guard (PCG), launched the comic book 'Ang mga Kwento ni Teacher Jun (The Stories of Teacher Jun),' which is 'designed to instill national pride and responsibility' to Filipinos as stewards of the country's maricreated_at legacy, said PCG chief Adm. Ronnie Gil Gavan.\n'This comic book is a testament to how stories can be wielded to inform, to inspire, and to ignite action,' Gavan said in his speech at the book launch.\nComic book\n'This moment is not just about unveiling a comic book, it is a bold statement of our commitment to fostering a generation rooted in its identity and resolute in its purpose,' he added.\nGavan said the book is a collaboration with the private sector and not a single centavo from public funds was spent on the project.\n'Through its pages, we hope to spark curiosity, inspire pride, and empower our youth to protect what is rightfully ours,' he said.\n'This book is not merely a teaching tool, again this is a call to action,' he added.\nGavan earlier said the book has been vetted by the Department of Foreign Affairs, the Department of Justice and other government agencies 'to make sure that we are giving the right information to the public.'\nNational Security Adviser Eduardo Año, for his part, said that 'every lawful operation' of the Philippines has been 'met with a barrage of false narratives' from China.\nAño pointed out that, for years, the Philippines and the world have witnessed 'the illegal, coercive, aggressive and deceptive' actions of Beijing in the South China Sea, which he said violates the Philippines' sovereignty and sovereign rights.\nPowerful medium\nChina's behavior, he noted, was 'not [made up of] isolated incidents' but 'form[ed] a pattern of behavior that threatens our national integrity.'\nAño said Chinese officials, along with state-sponsored media and individuals, 'continue to spread distorted and twisted narratives to malign our efforts and justify their illegal and unilateral claims.'\nHe acknowledged that many Filipinos 'struggle to grasp the significance of the West Philippine Sea' and that comics can be a powerful and effective medium.\nHe also said the book fights attempts to spread misinformation about Manila's claims in the WPS.\nJonathan Malaya, spokesperson for the NTF-WPS, told the Inquirer that the government is in discussion with the Department of Education to use the book in schools.\n'Let's see if we can mass produce it but definitely we won't sell it,' Malaya said. 'It's available online. There's a link where people can download it.'\n"
},
{
  "id": 481,
  "title": "Who is Indonesian President Prabowo Subianto, the chief guest of India's Republic Day?",
  "created_at": "2025-01-26",
  "text": "\nThis year, Indonesian President Prabowo Subianto has been invited as the chief guest for the Republic Day celebrations, making him the fourth Indonesian leader to be given this honour.Subianto arrived in Delhi on Thursday and met PM Modi on Saturday as the two nations work towards strengthening their political, defence and security cooperation.Here are 10 things to know about the Indonesian President.A political bloodPrabowo was born in an elite political family. His father, Sumitro Djojohadikusumo, was one of Indonesia's most prominent economists, and served in the cabinets of both Presidents Sukarno and Suharto.Attended to military school in the USThe Indonesian president studied at the American School in London, and attended military courses in the US, including at Fort Moore (formerly Fort Benning). Was married to Suharto’s daughterPrabowo married former President Suharto’s daughter Siti Hediati Hariyadi in 1983. However, The couple separated soon after Suharto was ousted in 1998. They have one son.Accused of human rights abusesPPrabowo was a three-star lieutenant general before being dismissed from the military also in 1998. He has been accused of involvement in the kidnapping of student activists and rights abuses in Papua and East Timor. However, Jokowi Widodo, the outgoing president, gave him the honorary rank of four-star general in 2024.  Banned from entering the USThere was a de facto ban on Prabowo's entry into the US because of the alleged human rights abuses. \nHe has, however, denied all allegations and they are unproven.Attempting an image transformationPrabowo, who is now 73 years old,  portrays a completely different image.  He is often seen on social media doing viral dance moves, and posing with his cat, Bobby. This new image of him is a contrast to his past reputation as a fiery nationalist, who for a while was in self-imposed exile in Jordan.Got international attention at the Shangri-La DialoguePrabowo was the Defence Minister under then President Jokowi Widodo. He caught everyone’s attention at the Shangri-La Dialogue in Singapore last June after he spoke about Indonesian peacekeepers going into Gaza, and proposed a UN referendum on Russia’s invasion of Ukraine, as well as a demilitarised zone between the two countries.Seemingly made concessions to ChinaThe leader is seen to have made concessions on the South China Sea issue in September 2024. A joint statement between the two countries agreed to jointly develop “areas of overlapping claims”. This implied a shift in Indonesia’s previous stance to one that recognised China’s nine-dash line.However, Indonesia’s Ministry of Foreign Affairs issued a statement in Indonesian, clarifying that the joint statement does not imply Indonesia’s recognition of the nine-dash line.Likely to be ally with Donald TrumpPrabowo is likely to maintain a good relationship with the newly-elected US President Donald Trump. When Trump won the US presidency, Prabowo was one of the first world leaders to call and congratulate him, addressing him as “sir”. When Trump complimented his English, Prabowo reportedly replied, “All my training is American, sir.”Indonesia became a full member of the BRICS under President Probowo Prabowo recently announced that Indonesia is now officially a full member of BRICS, expressing a desire to serve as a “bridge between developed and developing nations” . For Reprint Rights: created_atscontent.com\n"
},
{
  "id": 485,
  "title": "10 things about Indonesia's Prabowo Subianto, the Republic Day chief guest; None",
  "created_at": "2025-01-26",
  "text": "\nPresident Prabowo met Prime Minister Narendra Modi on Saturday to discuss various areas of cooperation between India and Indonesia\nIndonesia President Prabowo Subianto will be the chief guest at the Republic Day celebrations this year, making him the fourth Indonesian leader to be given this honour.\nAfter arriving in New Delhi on Thursday (January 23), he met Prime Minister Narendra Modi on Saturday as India and Indonesia look to strengthen their political, defence and security cooperation .\nHere are 10 things to know about the Indonesian President.\n1. A political blue blood\nPrabowo comes from an elite political family. His father, Sumitro Djojohadikusumo, was one of Indonesia's most prominent economists, and among the few people who served in the cabinets of both Presidents Sukarno and Suharto.\n2. Went to military school in the US\nPrabowo studied at the American School in London, and attended military courses in the US, including at Fort Moore (formerly Fort Benning), one of the most historic military schools in the US.\n3.Was married to Suharto's daughter\nIn 1983, Prabowo married former President Suharto's daughter Siti Hediati Hariyadi. The couple separated soon after Suharto was ousted in 1998. They have one son.\n4. Accused of human rights abuses\nPrabowo, who was a three-star lieutenant general before being dismissed from the military also in 1998, has been accused of involvement in the kidnapping of student activists and rights abuses in Papua and East Timor. In 2024, however, Jokowi Widodo, the outgoing president, gave him the honorary rank of four-star general.\n5. Banned from entering the US\nDue to the allegations of human rights abuses, there was previously ade factoban on Prabowo's entry to the United States. The allegations against him, however, are unproven, and Prabowo has always denied any responsibility.\n6. Attempting an image transformation\nPrabowo, 73, now portrays a completely different image - he is often seen on social media doing viral dance moves, and posing with his cat, Bobby. His new image paints a stark contrast to his past reputation as a fiery nationalist, who for a while was in self-imposed exile in Jordan.\n7. Got international attention at the Shangri-La Dialogue\nPrabowo, at the created_at the Defence Minister under then President Jokowi Widodo, caught everyone's attention at the Shangri-La Dialogue in Singapore last June. He spoke about Indonesian peacekeepers going into Gaza, and proposed a UN referendum on Russia's invasion of Ukraine, as well as a demilitarized zone between the two countries.\nThe Shangri-La Dialogue is an inter-governmental security conference held annually in Singapore by the Bahraini-funded think tank the International Institute for Strategic Studies (IISS).\n8. Seemingly made concessions to China\nPrabowo is seen to have made concessions on the South China Sea issue in September 2024. A China-Indonesia joint statement in English agreed to jointly develop \"areas of overlapping claims\". This implied a shift in Indonesia's previous stance to one that recognised China's nine-dash line.\nHowever, shortly thereafter, Indonesia's Ministry of Foreign Affairs issued a statement in Indonesian, clarifying that the joint statement does not imply Indonesia's recognition of the nine-dash line.\n9. Likely to be pals with Donald Trump\nPrabowo is likely to maintain a good relationship with the newly-elected US President Donald Trump. When Trump won the US presidency, Prabowo was one of the first world leaders to call and congratulate him, addressing him as \"sir\". Trump, in turn, was delighted and bestowed high praise on Prabowo's capabilities. When Trump complimented his English, Prabowo reportedly replied, \"All my training is American, sir.\"\nThat said, Prabowo is expected to continue with a non-aligned policy that avoids taking sides in the US-China rivalry.\n10. Indonesia became full member of BRICS under Prabowo\nPrabowo recently announced that Indonesia is now officially a full member of BRICS, expressing a desire to serve as a \"bridge between developed and developing nations\" .\n"
},
{
  "id": 486,
  "title": "Morning Briefing, Jan. 26, 2025",
  "created_at": "2025-01-26",
  "text": "\n Here is a rundown of all the news you need to start your Sunday, including Hamas accusing Israel of stalling the implementation of a ceasefire and prisoner exchange; Israel threatening to bar displaced Palestinians from returning to northern Gaza after 4 soldiers were released and Putin saying if Donald Trump was reelected in 2020, the Ukrainian crisis might not have occurred.\nTOP STORIES\nHamas accuses Israel of stalling ceasefire, prisoner exchange implementation\nHamas accused Israel of \"procrastinating\" in implementing a ceasefire and prisoner exchange agreement.\nIn a statement, Hamas said: 'The (Israeli) occupation continues to procrastinate in implementing the terms of the ceasefire and prisoner exchange agreement by keeping (coastal) Al-Rashid Street closed and preventing displaced pedestrians from returning from the south to the north (Gaza Strip).'\n\"We hold the occupation responsible for any delays in implementing the agreement and the repercussions this may have on subsequent phases,' added Hamas.\nIsrael threatens to bar displaced Palestinians from returning to northern Gaza after soldiers' release\nIsraeli Prime Minister Benjamin Netanyahu threatened to prevent displaced Palestinians from returning to northern Gaza, accusing Hamas of violating a ceasefire and prisoner swap agreement.\nNetanyahu's office claimed that Hamas violated the deal by failing to free Israeli captive Arbel Yehud.\n'Israel has received four female hostage soldiers' from Hamas, 'and in return will release security prisoners,' the office said.\nPutin says if Trump was reelected in 2020, Ukrainian crisis might not have occurred\nIf Donald Trump had been reelected as US president in 2020, the Ukraine crisis that erupted in 2022 might not have occurred, Russian President Vladimir Putin said.\nIn an interview with the Russian Rossiya 1 TV channel, Putin said Russia remains open to peace talks on the Ukraine war.\nHe said Moscow has never rejected contact with the US but the previous administration opted not to pursue engagement.\nNEWS IN BRIEF\nKenya and Guinea-Bissau reaffirmed their commitment to fostering peace and stability in Congo, Sudan and other conflict-affected regions in Africa.\nOver 1,000 demonstrators marched peacefully through Geneva in a protest demanding an end to the genocide in Gaza.\nThe US Senate approved the nomination of Kristi Noem for secretary of the Department of Homeland Security, also known as DHS.\nSergey Naryshkin, head of the Russian Foreign Intelligence Service (SVR), voiced readiness to meet John Ratcliffe, the US' new CIA director, should Washington express interest in a meeting.\nSyria's new administration leader Ahmed al-Sharaa met in Damascus with United Nations High Commissioner for Refugees, Filippo Grandi.\nKazakhstan reported an explosion at an oil depot in the central city of Zhezkazgan, which triggered a fire and left four people injured.\nMore than 70 people were killed in a drone strike by the Rapid Support Forces (RSF) paramilitary group in El Fasher in western Sudan, a governor said.\nThe Sudanese army said it gained full control of the al-Jaili oil refinery north of the national capital of Khartoum.\nIndia and Indonesia agreed to strengthen their cooperation in defense, trade and maricreated_at areas, officials said.\nPhilip Luther, a senior research advisor at Amnesty International, described Anadolu's footage from the Sednaya Prison in Syria as an \"important piece of evidence,\" reinforcing the organization's previous claims and findings about atrocities committed under the ousted Bashar al-Assad regime.\nThe International Committee of the Red Cross received a call from Hamas to head to the designated transfer point in Gaza where four Israeli female hostages were scheduled to be released, Israeli Channel 12 reported.\nBeijing lodged a protest with Philippines authorities for the arrest of a Chinese national for alleged 'espionage activities,' the Chinese Embassy in Manila said.\nThe Philippine Coast Guard (PCG) accused Chinese forces of harassing its fisheries vessels in the disputed South China Sea, according to local media.\nSPORTS\nManchester City secures 3-1 win over Chelsea in Premier League\nManchester City sealed a 3-1 comeback victory against Chelsea in week 23 of the English Premier League.\nMadueke opened the scoring for Chelsea in the third minute, while Josko Gvardiol leveled for City in the 42nd minute at their Etihad Stadium.\nIn the second half, Haaland restored City's lead with a long-range strike in the 68th minute, and Foden sealed the win with a late goal in the 87th minute.\n"
},
{
  "id": 488,
  "title": "Australia, EU, 4 others reaffirm their maricreated_at cooperation with PH",
  "created_at": "2025-01-26",
  "text": "\nManila, Jan. 26 -- The ambassadors of several countries, including Australia, European Union, France, and Japan, among others, reaffirmed their maricreated_at cooperation with the Philippines as they also emphasized the importance of maintaining peace, stability, and rule of law in the Indo-Pacific region.\n(From left) Stratbase Institute President Prof. Dindo Manhit, Japanese Ambassador Endo Kazuya, Australian Acting Ambassador and Charge d'Affaires ad interim Dr. Moya Collett, French Ambassador Marie Fontanel, Indonesian Ambassador Agus Widjojo, Vietnamese Ambassador Lai Thai Binh, and European Union Delegation Ambassador Massimo Santoro attend a maricreated_at security forum organized by the Stratbase Institute, in partnership with the Embassy of France to the Philippines on Jan. 23, 2025 in Makati City. (Stratbase photo)\nFellow Southeast Asian countries Indonesia and Vietnam, both with maricreated_at disputes with China, also stressed that the security of the resource-rich waters is also a regional interest.\nThe envoys shared their thoughts on their partnerships with the Philippines in maintaining Southeast Asia's geopolitical importance during a maricreated_at security forum organized by the Stratbase Institute and the French Embassy in the Philippines held last Thursday, Jan. 23.\nFrench Ambassador Marie Fontanel cited key milestones- such as France's participation in the 39th Balikatan Exercises, the deployment of the Pegase 24 Air and Space Force, and the establishment of a full-fledged defense mission in Manila in June-in France's and the Philippines' maricreated_at security cooperation.\n\"For an archipelagic nation like the Philippines, maricreated_at safety is crucial. Ensuring the efficient transport of people and goods is essential for economic prosperity, while territorial and maricreated_at sovereignty are vital for national security,\" she said.\nWhile the ambassadors did not mention China, whose aggressive actions in the contested South China Sea has become a concern for the international community, they reiterated the importance of a rule-based order in the Indo-Pacific region.\nJapanese Ambassador Endo Kazuya said Japan is committed to uphold the rule of law as outlined in the United Nations Convention on the Law of the Sea (UNCLOS).\n\"Japan stands ready to work closely with the Philippines, ASEAN, and the international community to advance a Free and Open Indo-Pacific,\" he stated.\nEuropean Union Ambassador Massimo Santoro also mentioned how peace and prosperity in the Indo-Pacific will affect EU's ties with the region.\n\"A region free from coercion is key to our collective stability, peace, and prosperity. Strategic partnerships are central to the EU's approach to the Indo-Pacific, promoting cooperation over confrontation,\" the envoy said.\nAustralian Acting Ambassador and Charge d'Affaires ad interim Dr. Moya Collett took the chance to announce that the Philippines will participate in the Talisman Sabre exercise, the largest military exercise in the southern hemisphere, for the first created_at.\n\"Maricreated_at security and territorial defense are now core pillars of Australia's Defense Cooperation Program, evolving in response to the Armed Forces of the Philippines' needs,\" Collett stated.\nThe envoy also shared that Australia will participate once more in the Philippines-Australia (PH-Aus) Exercise Alon to enhance the interoperability among strategic partners.\nAmbassadors Agus Widjojo of Indonesia and Lai Thai Binh of Vietnam, both members of the Association of Southeast Asian Nations (ASEAN), also participated in the forum.\nFor Widjojo, maricreated_at Southeast Asia has a role to play in the geopolitics of the wider Indo-Pacific region.\n\"As the maricreated_at nations, Indonesia and the Philippines should maximize the benefit of the geopolitical importance of maricreated_at Southeast Asia,\" he said.\n\"While Indonesia and the Philippines should continue the existing close maricreated_at cooperation, both countries should find ways to promote regional maricreated_at cooperation in the wider Indo-Pacific region,\" the envoy added.\nBinh echoed this remark, emphasizing that maricreated_at security is not only a national interest but a shared regional imperative.\n\"For Vietnam and the Philippines, maricreated_at security is not just a matter of national interest, but a shared regional imperative. Addressing these complex challenges requires robust partnerships and a steadfast commitment to upholding international law, particularly the UNCLOS,\" he stated.\nThe forum, which explored the various dimensions of maricreated_at security to identify areas where cooperation between the Philippines and France could be most valuable, also delved into the role of international partnerships in addressing regional challenges, including maricreated_at issues.\n\"Our collaboration goes beyond defense concerns and extends to the safety of trade routes, port modernization, and the sustainable management of maricreated_at industries. This partnership strengthens our collective commitment to a secure, stable, and prosperous maricreated_at region,\" Stratbase Institute President Professor Dindo Manhit said.\n\"2024 was a year of many firsts in the maricreated_at strategic cooperation between France and the Philippines. These milestones have laid the foundation for even greater achievements in 2025, a year of promising opportunities to further strengthen the bonds between our two maricreated_at nations,\" he added.\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
},
{
  "id": 489,
  "title": "Joins BBC News - 03:35 AM GMT",
  "created_at": "2025-01-26",
  "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nquarters, however, one of those Trump playings is this we will now see stimulus and so forth which in the long-term improve profitability, not just for tech, but other companies. Should that come out in the earnings that actually with the upside potential for upcoming quarters, tech can continue and we have to take into account that tech giants are so big. It is no longer the big five. It is the big seven and soon it will be the big 11 and so forth. \nThey have a market capitalisation far more than major economies and I do not see that trend finishing. The president of Poland has said that gas flows from Russia to Western Europe should never be restored, even in the event of a peace deal between Russia and Ukraine. President Duda told the BBC that the Nordstream gas pipelines, which haven't been used since 2022, should be dismantled. That was just one of the issues he addressed in a wide-ranging interview with our economics editor Faisal Islam at Davos. Some look at Russia and see the sanctions effort, which they seem to be resisting for the past year, the economy seems to be OK, but maybe just now it is starting to hurt Russia. Is that what you see? Do you think at this moment all of the sanctions are working? And what does that mean the West should do right now? TRANSLATION: I know President Donald Trump and I smile when I see politicians taking such decisive actions right now on Russia and they are expressing their fear that Donald Trump might leave Ukraine on its own and leave it to Russia because they are the ones that recently did business with Russia and there are some saying they would like to see business as usual being restored as soon as possible because that is being demanded of them by their own companies. As you know, there is a big election in your neighbour Germany next month. I know you will want to comment on that. You mentioned that if there was a peace deal, business as normal might come back. Are you worried that if there is a peace deal straightaway, for example the German businesses and industry will say \"Switch on the pipeline again\" and the same thing will happen again? Or do you think that pipeline, the gas flows from Russia, they should never come back again? TRANSLATION: I believe that the Nord Stream gas pipeline should be dismantled and I also want to say it was Donald Trump who stopped the construction on Nord Stream 2. That was his decision. He imposed sanctions on the companies involved in the construction of Nord Stream back in 2019 and thanks to him those constructions were stopped. I can only hope that European leaders visible in the photo depicting leaders opening Nord Stream will have lessons for later after the opening of Nord Stream. They will learn lessons from Russia's aggression against Ukraine and will push through decisions to never restore the pipeline of gas to Europe for one reason - because it poses a very big threat to the entire region of central Europe, to Ukraine, to Poland, to Slovakia, and also Central European countries. It is a threat from the point of view of energy, the military but also it is a huge economic threat because it means the domination of Russia over Europe in the economic sense. The German industry is suffering, there is an election - that message may be heard. They may be tempted to go for the cheap gas again. TRANSLATION: OK. But we cannot agree to the UK community being consistent and allowing Russia to transport its gas to Europe, and in this way, allowing Russia to build its energy domination over Europe. This is unacceptable. India and Indonesia have agreed to strengthen ties following a meeting between the country's leaders. Indonesia's leader was meeting with Narendra Modi. He was also a guest at India's National Day celebrations. Tell us why India and Indonesia are looking to find areas of collaboration? Well, maricreated_at trade and defence manufacturer over the two key areas discussed this created_at around and also expanding their endeavours and their trade basket. Remember Indonesia in this region is a key ally for India as it seeks to position itself as a counterbalance to China. More than half of India's trade travels through the South China Sea and the Malacca Strait and this is something India wants to preserve and that is why the relationship between India and Indonesia is crucial for India and that also was one of the key conversations between the Indian Prime Minister and the Indonesian president over the weekend. In fact, the Indian Prime Minister said that ties with Indonesia were crucial to promote a rule-based order in the region. Apart from this, they also spoke about expanding partnership and defence manufacturing, that India would support Indonesia in a their\n"
},
{
  "id": 492,
  "title": "Business Today - 03:35 AM GMT",
  "created_at": "2025-01-26",
  "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nEarnings are starting to slow in comparison to previous quarters, however, one of those Trump playings is this we will now see stimulus and so forth which in the long-term improve profitability, not just for tech, but other companies. Should that come out in the earnings that actually with the upside potential for upcoming quarters, tech can continue and we have to take into account that tech giants are so big. It is no longer the big five. It is the big seven and soon it will be the big 11 and so forth. \nThey have a market capitalisation far more than major economies and I do not see that trend finishing. The president of Poland has said that gas flows from Russia to Western Europe should never be restored, even in the event of a peace deal between Russia and Ukraine. President Duda told the BBC that the Nordstream gas pipelines, which haven't been used since 2022, should be dismantled. That was just one of the issues he addressed in a wide-ranging interview with our economics editor Faisal Islam at Davos. Some look at Russia and see the sanctions effort, which they seem to be resisting for the past year, the economy seems to be OK, but maybe just now it is starting to hurt Russia. Is that what you see? Do you think at this moment all of the sanctions are working? And what does that mean the West should do right now? TRANSLATION: I know President Donald Trump and I smile when I see politicians taking such decisive actions right now on Russia and they are expressing their fear that Donald Trump might leave Ukraine on its own and leave it to Russia because they are the ones that recently did business with Russia and there are some saying they would like to see business as usual being restored as soon as possible because that is being demanded of them by their own companies. As you know, there is a big election in your neighbour Germany next month. I know you will want to comment on that. You mentioned that if there was a peace deal, business as normal might come back. Are you worried that if there is a peace deal straightaway, for example the German businesses and industry will say \"Switch on the pipeline again\" and the same thing will happen again? Or do you think that pipeline, the gas flows from Russia, they should never come back again? TRANSLATION: I believe that the Nord Stream gas pipeline should be dismantled and I also want to say it was Donald Trump who stopped the construction on Nord Stream 2. That was his decision. He imposed sanctions on the companies involved in the construction of Nord Stream back in 2019 and thanks to him those constructions were stopped. I can only hope that European leaders visible in the photo depicting leaders opening Nord Stream will have lessons for later after the opening of Nord Stream. They will learn lessons from Russia's aggression against Ukraine and will push through decisions to never restore the pipeline of gas to Europe for one reason - because it poses a very big threat to the entire region of central Europe, to Ukraine, to Poland, to Slovakia, and also Central European countries. It is a threat from the point of view of energy, the military but also it is a huge economic threat because it means the domination of Russia over Europe in the economic sense. The German industry is suffering, there is an election - that message may be heard. They may be tempted to go for the cheap gas again. TRANSLATION: OK. But we cannot agree to the UK community being consistent and allowing Russia to transport its gas to Europe, and in this way, allowing Russia to build its energy domination over Europe. This is unacceptable. India and Indonesia have agreed to strengthen ties following a meeting between the country's leaders. Indonesia's leader was meeting with Narendra Modi. He was also a guest at India's National Day celebrations. Tell us why India and Indonesia are looking to find areas of collaboration? Well, maricreated_at trade and defence manufacturer over the two key areas discussed this created_at around and also expanding their endeavours and their trade basket. Remember Indonesia in this region is a key ally for India as it seeks to position itself as a counterbalance to China. More than half of India's trade travels through the South China Sea and the Malacca Strait and this is something India wants to preserve and that is why the relationship between India and Indonesia is crucial for India and that also was one of the key conversations between the Indian Prime Minister and the Indonesian president over the weekend. In fact, the Indian Prime Minister said that ties with Indonesia were crucial to promote a rule-based order in the region. Apart from this,\n"
},
{
  "id": 604,
  "title": "On the move on day 3 of the new Trump presidency",
  "created_at": "2025-01-26",
  "text": "\n Upon direct instructions of the President, we arranged for Defense Secretary Gilbert Teodoro, who flew into Washington D.C., to meet with newly appointed National Security Advisor Michael Waltz at the White House. After our short meeting with the National Security Advisor, we proceeded to have an expanded meeting with Principal Deputy National Security Advisor Alex Wong as well as Deputy Assistant Secretary of Defense Andrew Byers and National Security Council Senior Director for Asia Ivan Kanapathy at the West Wing of the White House.\nBoth meetings were extremely productive, where we focused on serious security issues and the reaffirmation of the enduring alliance between the Philippines and the United States.\nSecretary Teodoro emphasized both nations' shared commitment to peace, stability and mutual security interests in the Indo-Pacific region, and the paramount importance of strengthening the bilateral defense ties between the Philippines and the United States to address emerging geopolitical challenges.\nThese meetings took place two days after the inauguration of President Donald Trump, making the Philippines one of the first countries to engage with the new administration - a very significant step in further advancing our longcreated_at alliance, with both sides expressing optimism in deepening defense and security cooperation in the years to come.\nAdditionally, there was also a telephone conversation between Foreign Affairs Secretary Ricky Manalo and State Secretary Marco Rubio in the morning (Washington DC created_at) on issues of mutual concern, among them the dangerous actions of China in the South China Sea that undermine regional peace and stability. They also exchanged views on advancing security cooperation and expanding economic ties for shared prosperity.\nSecretary Rubio, who underscored the 'ironclad' commitment of the US to the Philippines under the 1951 Mutual Defense Treaty, certainly recognizes the importance of strengthening economic - not just defense or military - ties, for the bilateral relationship to be enduring.\n'When your engagement with a country leads to economic development, whether it's outbound US investment in the Philippines or what have you, then that becomes enduring. Then it makes it difficult, no matter who's in charge, to walk away from the alliance, because the alliance is more than just military and a military presence. It also involves jobs and businesses and investment and economic opportunity, and we need to look for ways to emphasize that. I think it would be a mistake to simply view it as a military or defense alliance,' Secretary Rubio stated during his confirmation hearing.\nWe are looking forward to working closely with Secretary Rubio's team at the State Department in advancing shared priorities and strengthening US-Philippines ties even further.\nAs I have emphasized on several occasions, we have strong support from both Republicans and Democrats, and we will continue to work with them on issues that are mutually beneficial - because this relationship is a two-way street. I also know that the US sees the Philippines as an important ally, especially at this created_at. This bipartisan support from members of the US Congress was evident during my meeting last Thursday at the US Capitol with Democratic Senator Brian Schatz of Hawaii, who is a member of the Senate foreign relations committee.\n'Ambassador Romualdez and I had a constructive discussion about opportunities and challenges in the Indo-Pacific. We discussed how we can better coordinate and strengthen US military and economic support to the Philippines and further elevate our alliance,' he shared in his website, adding, 'We have a long, close relationship with the Philippines and the Filipino people, and our commitment to the US-Philippine alliance remains ironclad.'\nDuring the inauguration of President Trump and the social events that followed shortly thereafter, I also had the opportunity to engage with 'old and new faces' who will be taking on important roles in the Trump administration for the next four years to bring our relationship to even greater heights. We also hosted a reception at the Philippine embassy, bringing together representatives from the new government, the US Congress and members of the media, among several other sectors.\nIn my interview with Karen Davila of ANC, I amply described how our relationship with the United States will be like under the new Trump administration. Naturally, an issue of great concern is the new immigration policy and its impact on the estimated 350,000 undocumented Filipinos in the United States.\nClear instructions have already been given to all consulates general in the United States on what we can do to help our kababayans regardless of their immigration status. Early this month, we met with members of a group called Filipino American Legal Defense and Education Fund (FALDEF) to discuss the challenges faced by undocumented Filipinos and shared insights on how those affected can have access to legal counsel and how they can have a legal path to stay in the US. FALDEF representatives led by their president Jose Teodoro Mallonga are also offering pro bono legal services and partnering with other Filipino community organizations to strengthen the support network for vulnerable groups.\nThe embassy and our consulates general all over the US are likewise continuing efforts to disseminate information about the rights of all Filipinos in the US, regardless of their immigration status, through our websites and social media platforms, providing information from the US Department of Labor, migration offices of states, immigration centers and various sources.\nAs always, the Philippine embassy will do what we can in assisting all Filipinos regardless of status. But as I told Karen, the bottom line advice to our fellow Filipinos is to follow a legal path - if one wants to have peace of mind.\n"
},
{
  "id": 609,
  "title": "Maricreated_at to digital: India and Indonesia lean on history to forge future; None",
  "created_at": "2025-01-26",
  "text": "\nCalling Modi \"my good brother\", Subianto said that the Indonesian side will be sending a high-level defence delegation to India to follow up on the recent ratification of the defence pact.\nIndia and Indonesia signed pacts on maricreated_at security, health, traditional medicine, culture and digital cooperation as Prime Minister Narendra Modi met the visiting President of Indonesia Prabowo Subianto Saturday.\nHe is the Chief Guest at the Republic Day celebrations on Sunday.\nAfter the bilateral talks in Hyderabad House, Prime Minister Modi addressed him as \"brother\" and said they have decided to work in the field of \"defence manufacturing\" and \"supply chains\" to take forward the defence cooperation.\nHe also said that both sides have decided to strengthen cooperation in the field of maricreated_at security, cyber security, counter-terrorism and de-radicalisation. He said that the two sides will conduct joint exercises by their respective disaster management teams.\n\"Crime prevention, search and rescue, and capacity building will be strengthened after the signing of the maricreated_at security pact,\" he said.\nModi described Indonesia as an \"important partner\" of India in the 10-nation ASEAN bloc as well as in the Indo-Pacific, noting that both countries are committed to a rules-based order in the region.\n\"We agree that the freedom of navigation should be ensured in line with international law,\" Modi said amid growing global concerns over China's increasing assertive behaviour in the Indo-Pacific region.\nSubianto is seen to have made concessions on the South China Sea issue in September 2024. A China-Indonesia joint statement in English agreed to jointly develop \"areas of overlapping claims\". This implied a shift in Indonesia's previous stance to one that recognised China's nine-dash line. However, shortly thereafter, Indonesia's Ministry of Foreign Affairs issued a statement in Indonesian, clarifying that the joint statement does not imply Indonesia's recognition of the nine-dash line.\nBoth sides also agreed to cooperate on Fintech, Artificial Intelligence, Internet of Things and Digital Public Infrastructure. Modi said India has shared its experiences in implementing the Mid-day meal scheme and public distribution system. Secretary (East) in MEA Jaideep Mazumdar said that Subianto is replicating the mid-day meal scheme in Indonesian schools.\nModi also said that they have agreed to cooperate in the fields of energy, critical minerals, space and STEM education.\nHe welcomed Indonesia in the BRICS grouping, and said that the two countries work together in G20 and ASEAN groupings.\nReferring to Modi as my \"good brother\", Subianto said that the Indonesian side will send a high-level defence delegation to India to follow up on the recent ratification of the defence pact.\nCalling the talks \"very frank,\" Subianto said: \"I have given directions to our officials that we need to accelerate the economic partnership with India.\"\nThe Indonesian President emphasised on economic cooperation, and asked Indian investors and companies to come and participate in the infrastructure development in Indonesia. Mazumdar said that Subianto had invited Indian companies to develop ports including the Sabang port.\nHe also said that he has \"given direction to the team to expedite and cut bureaucracy, cut too much over regulation\" to pursue common bilateral interest and \"increase economic partnership\" with India.\nThe Indonesian President pitched for stronger educational cooperation, increase of Indonesian students studying in India and invited Indian educational institutions to open campuses in Indonesia. Indian officials said that he has also asked Indian medical colleges to open campuses there. Also, Indian hospitals are in talks with Indonesian authorities to open hospitals there.\nSubianto thanked the Indian government for the invitation. He had visited India as Defence minister in 2020. He recalled that India had invited then Indonesian President Sukarno for the first Republic Day parade in 1950. He also said that India was one of the co-founders of the Non-Aligned Movement, after the Bandung conference and is now championing South-South cooperation, as the \"voice of the Global South\".\nPresident Subianto is the fourth Indonesian leader invited by India to attend its Republic Day celebrations as chief guest: In 1950, when India celebrated its first Republic Day, it was President Sukarno. The choice of chief guest every year is dictated by a number of reasons - strategic and diplomatic, business interest and international geo-politics.\nThis year, a 352-member marching and band contingent from Indonesia will participate in the Republic Day parade. It's the first created_at an Indonesian marching and band contingent is taking part in a national day parade abroad. The President thanked the Indian government for the opportunity. He also invited PM Modi to visit Indonesia.\nEarlier in the day, he met President Droupadi Murmu and was accorded the ceremonial welcome at the Rashtrapati Bhawan. He is on a three-day visit to India beginning Thursday night, and had met External Affairs minister S Jaishankar on Friday.\nHe also went to the Bahrisons bookshop in Khan Market.\nIndia-Indonesia bilateral ties were elevated to a Comprehensive Strategic Partnership when Prime Minister Modi paid an official visit to Indonesia in 2018. During that visit, the Shared Vision of India-Indonesia Maricreated_at Cooperation in the Indo-Pacific was also adopted.\nModi also met Subianto on the sidelines of the G20 Summit in Rio de Janeiro in Brazil on November 19, 2024. This was the first meeting between the two leaders.\nSince the adoption of India's 'Look East Policy' in 1991, and its upgradation to 'Act East' in 2014, there has been a rapid development of bilateral relations.\nIndonesia chaired the G20 Presidency in 2022, followed by India in 2023. Sources said that the two sides worked in tandem to talk to the Russians and the US-led Western bloc to arrive at a joint communique at the G20 leaders' summits in Bali and New Delhi - reflecting their shared understanding.\nSubianto is likely to maintain a good relationship with the newly elected US President Donald Trump . When Trump won, Subianto was one of the first world leaders to call and congratulate him. When Trump complimented his English, Subianto reportedly replied, \"All my training is American, Sir.\"\nThat said, Subianto is expected to continue with his non-aligned policy that avoids taking sides in the US-China rivalry.\nIndonesia is one of India's largest trading partners in the ASEAN region, with bilateral trade in 2023-24 reaching $29.40 billion. Indian investments in Indonesia amounts to $1.56 billion in infrastructure, power, textiles, steel, automotive, mining, banking and consumer goods sectors.\nBut, since trade is lopsided in Indonesia's favour - Indonesia exports $24 billion and India exports about $6 billion - there was discussion about increasing Indonesian imports from India.\n"
}
]