[
  {
    "id": 618,
    "title": "Philippines accuses China's forces of harassing fisheries vessels",
    "created_at": "2025-01-27",
    "text": "\nChinese coast guard ships and a Chinese navy helicopter harassed a group of Philippine fisheries vessels conducting a scientific survey in a hotly disputed area of the South China Sea, forcing them to cancel the operation, the Philippine coast guard said Saturday.\nBeijing has repeatedly asserted sovereignty over most of the South China Sea and accused rival claimant states, including the Philippines, Vietnam and Malaysia of encroachment. China has demarcated its territorial claims with a 10 dashed-line printed on maps but has not provided the exact coordinates.\nThe incident took place Friday near Sandy Cay, three small uninhabited sandbars flanked by an artificial island base of Chinese forces and a Philippines-occupied island in the Spratlys archipelago, the coast guard said.\nThe Chinese coast guard ships approached two larger vessels, which maneuvered to avoid a collision, and a navy helicopter flew low over two smaller boats deployed by the ships, forcing the survey to be called off.\nA Chinese coast guard statement said that it drove the Philippine ships away after they entered the waters without China's permission and attempted to land on the cay - which is called Tiexian Reef in Chinese - and conduct sand sampling.\nVideos released by the Philippine coast guard show a Chinese coast guard ship sailing very close to a vessel officials identified as belonging to the Philippines. Another video shows a Chinese military helicopter hovering low over the rough seas near a vessel flying a Philippine flag.\nThe latest flare-out of the long-simmering territorial disputes in one of the world's busiest trade and security passageways could test President Donald Trump's commitment to maintain America's role as a counterweight to China, which has increasingly carried out assertive actions in the disputed waters.\nHis predecessor, Joe Biden, strengthened an arc of security alliances in Asia while in office in a bid to curb China's aggressive actions in the South China Sea, East China Sea and around Taiwan, a self-governed island which Beijing has vowed to take by force if necessary.\nSecretary of State Marco Rubio in a telephone call last week with his Philippine counterpart, Enrique Manalo, discussed issues of mutual concern, including \"the People's Republic of China's dangerous and destabilizing actions in the South China Sea,\" State Department spokesperson Tammy Bruce said.\nRubio \"conveyed that the PRC's behavior undermines regional peace and stability and is inconsistent with international law,\" Bruce said in a readout of the call.\nRubio \"underscored the United States' ironclad commitments to the Philippines under our Mutual Defense Treaty,\" Bruce said.\nBiden and his administration had repeatedly warned China that the U.S. is obligated to help defend the Philippines, its oldest treaty ally in Asia, if Filipino forces, ships and aircraft come under armed attack including in the South China Sea. China has warned the U.S. to stay away from what it says is a purely Asian dispute.\nIn 2017, China accused the Philippine military of secretly plotting to occupy and build a structure on one of the three sandbars, about 2.5 nautical miles  from the Philippine-occupied Thitu Island, two senior Philippine officials told The Associated Press at the created_at.\nChina protested and surrounded the sandbars with three navy ships, a coast guard ship and 10 suspected militia ships, according to a confidential Philippine government security report seen by the AP at the created_at.\nChinese and Philippine diplomats resolved the issue by agreeing that forces from both sides should not set foot on the sandbars, the two Philippine officials said.\nChinese ships, however, have continuously kept watch off the sandbars since then, according to the Philippine military.\nSeparately, the Philippine coast guard said it has been ordering Chinese coast guard ships to stay away from the Scarborough Shoal, another disputed area about 124 nautical miles off the northwestern Philippines.\nThe Chinese coast guard ships have approached up to 60 nautical miles from the Philippines coast in recent weeks, well within the country's exclusive economic zone, a stretch of water where a coastal state has exclusive rights to tap resources, but where foreign ships have rights of \"innocent passage\" as provided under the U.N. Convention on the Law of the Sea, the Philippine coast guard said.\nThe Chinese coast guard has defied the Philippine coast guard order to leave the area, which it said falls within Chinese waters. It warned the Philippines \"to immediately stop all infringement activities, provocations and false accusations.\" JIM GOMEZ, MANILA,MDT/AP\nLink to Image\n\nGraphic\n \nA Chinese Coast Guard boat sails around Sandy Cay in the South China Sea, last week\n"
  },
  {
    "id": 619,
    "title": "The State of the South China Sea: Coercion at Sea, Slow Progress on a Code of Conduct",
    "created_at": "2025-01-27",
    "text": "\nFour major developments shaped the security environment in the South China Sea in 2024: (1) increased Chinese coercion against Philippine naval vessels and aircraft; (2) adoption of a new maricreated_at defense strategy by the Philippines; (3) Vietnam’s stepped-up construction activities in the Spratly Islands; and (4) slow progress in negotiations on a Code of Conduct (COC). Chinese..."
  },
  {
    "id": 620,
    "title": "China/Republic of Korea (South Korea): Analysts: China normalizing its claims to maricreated_at zone shared with South Korea",
    "created_at": "2025-01-27",
    "text": "\nSouth Korea should increase efforts to prevent China from normalizing its claims to sovereignty over a disputed maricreated_at area in waters the two countries share, analysts say.\nChina has been doing it for decades in the South China Sea, analysts say, where it has been using so-called gray zone tactics to assert its claims over vast stretches of maricreated_at territory - claims contested by several neighboring countries in the area.\nRecent Chinese activity in the waters it shares with South Korea has prompted analysts' warnings that Beijing is doing the same to Seoul.\nSouth Korean officials said earlier this month that China had installed a steel structure in disputed waters west of South Korea, The Chosun Daily in Seoul reported.\nUsing reconnaissance satellites, South Korean intelligence agencies detected the structure last month and estimate that it exceeds 50 meters in width and height, The Chosun Daily said.\nThe structure was spotted in the disputed area known as the Provisional Measures Zone, or PMZ, in the Yellow Sea, which South Korea calls the Western Sea. The zone is where the exclusive economic zones of the two countries overlap.\nThe zone was established in 2001 to manage the overlapping claims to the area. Building any kind of facility and conducting activities unrelated to fishing are banned in the area until the dispute is settled.\n'Gray zone strategy'\n\"It is likely that these recent actions are tied to a gray zone strategy that slowly encroaches on this area in ways that over the long-term reinforces their claims,\" said Terence Roehrig, an Asia-Pacific security expert and lecturer at the University of Wisconsin-Madison.\n\"The goal of a gray zone strategy is to slowly force the target state to accept a new normal in the area. Seoul must ensure that does not happen by continuing to assert its position and insist that the delimitation of these waters be settled through negotiation,\" Roehrig continued.\n\"China views the Yellow Sea as a crucial area for its security and potential gateway into the Chinese heartland. It is likely that eventually, these structures may have some military use,\" he added.\nGray zone tactics blur the line between what is legal and illegal through paramilitary coercions designed to weaken an adversary over created_at. China's tactics have included building artificial islands and making incursions, pushing the boundary of what is allowed to project military power and control sea routes.\n\"The incident demonstrates China is using the same strategy it employed in the South China Sea with South Korea now,\" said Rahman Yaacob, research fellow for the Southeast Asia program at the Lowy Institute.\nAccording to Yaacob, China has used gray tactics to build civilian structures in the South China Sea since the early 1990s. China installed structures in Mischief Reef back then, saying their purpose was to support fishermen, he said.\n\"We now know Mischief Reef has been converted into a military base on an artificial island,\" Yaacob said.\nChina now has a military base on an artificial island it built on Mischief Reef, which is in the Spratly Islands. Mischief Reef is also claimed by multiple countries that protest China's military buildup.\nAdmiral John Aquilino, the former U.S. Indo-Pacific commander, said in 2022 that China seemed to have completed the construction of missile arsenals, aircraft hangers, radar systems and other military facilities in Mischief Reef.\nDavid Maxwell, vice president of the Center for Asia Pacific Strategy, said China might want access to \"the mineral rights under the sea and to be able to transit freely in the area so it can control commerce and flow of activities in the area\" close to South Korea.\nSustained structures in the region could impact naval operations of South Korea and the U.S., he continued.\n\"It's important that South Korea, in particular, but also the United States, Japan and other allies do not allow China to normalize its activities,\" Maxwell added. \"That's what it wants to do - normalize its presence so it can claim it as its sovereign [maricreated_at] territory.\"\nIn response to South Korea's protests, China said last year that the structures were for supporting fishing activities. The Yellow Sea is a key fishing site for China.\n\"It's certainly possible that the structures are used to support fishing activities,\" said Tabitha Grace Mallory, a founder and CEO of China Ocean Institute and a University of Washington professor focusing on China's ocean policy.\n\"The fact that these structures are being built unilaterally in the PMZ is just unnecessarily provocative,\" she added.\nTelling VOA on Tuesday that he is \"not familiar with the situation,\" Liu Pengyu, a spokesperson for the Chinese Embassy in Washington, said, \"I would like to point out that China is a responsible country that has always carried out distant-water fishery and marine scientific activities in accordance with laws and regulations.\"\nExploiting political turmoil\nSome analysts say China could be taking advantage of Seoul's political situation to install the structure in the disputed waters.\nThe installation coincides with the political chaos stemming from South Korean President Yoon Suk Yeol's short-lived declaration of martial law.\n\"China is helping to create the political chaos in South Korea so that it can conduct these activities inside South Korea's economic exclusive zone\" and \"act with impunity,\" Maxwell said.\nOthers are unsure whether the two incidents are related.\n\"I don't know if this is explicitly tied to exploiting [South Korea's] political turmoil,\" said Andrew Yeo, the SK-Korea Foundation chair in Korea studies at the Brookings Institution.\n\"But Beijing may be testing South Korea's political resolve over disputed maricreated_at claims, especially if we anticipate that the Trump administration will press [Seoul] to do more to counter Chinese threats in the Indo-Pacific,\" Yeo continued.\nPatrick Cronin, the Asia-Pacific security chair at the Hudson Institute, said Beijing does not want to push South Korea too hard, although it has an opportunity to do so, because \"China has an interest in opening a healthy relationship with South Korea, especially at a created_at when it thinks it is going to have a more amendable government in place.\"\nCronin was referring to main opposition Democratic Party leader Lee Jae-myung, considered pro-China, having a shot at running for the next presidential election, which could be held in few months if the Constitutional Court rules in favor of Yoon's impeachment. - VOA\n"
  },
  {
    "id": 621,
    "title": "CCG use acoustic device to harass PH ship",
    "created_at": "2025-01-27",
    "text": "\nA CHINA Coast Guard (CCG) vessel reportedly used a long-range acoustic device (LRAD) to harass a Philippine Coast Guard (PCG) ship patrolling the coastline of Zambales on Saturday.\nCommo. Jay Tarriela, PCG spokesman for the West Philippine Sea, said on Sunday the LRAD was used by CCG 3103 on the BRP Cabra.\nThe crew of the Cabra said they heard a loud, piercing sound from the CCG 3103.\nTarriela said it was the first created_at the Chinese coast guard had used the LRAD, which can project powerful sound waves over great distances.\nIt is typically used for crowd control and can produce pain-inducing levels of sound capable of causing hearing damage.\nTarriela said the Cabra had \"successfully pushed back\" to 90 to 95 nautical miles Chinese ships that were sailing too close to the Zambales coast.\nHe said the PCG vessels also constantly issued radio challenges to the intruding ships.\nThe challenges are not just routine but \"firm assertions\" that the actions of the CCG violate the Philippine Maricreated_at Zones Act, the United Nations Convention on the Law of the Sea (Unclos), and the 2016 Arbitral Award, which definitively rules against China's extensive claims in the South China Sea, Tarriela said.\nThe Chinese coast guard has been trying to keep a presence in Philippine waters. Recently, CCG 3304 was relieved by CCG 3103.\nAccompanying the CCG 3103 is the CCG-5901, referred to as the \"monster ship\" because of its huge size.\n"
  },
  {
    "id": 622,
    "title": "Philippines: Speaker reaffirms PH unwavering stance to protect sovereignty",
    "created_at": "2025-01-27",
    "text": "\nSpeaker Ferdinand Martin Romualdez has reaffirmed the Philippines' unwavering stance on territorial integrity as he highlighted President Ferdinand R. Marcos Jr.'s firm policy on safeguarding Philippine sovereignty.\nAccording to a news release from his office on Friday, Romualdez issued the statement during the Stakeholder Dialogue titled Navigating Asia's Hotspots at the World Economic Forum (WEF) 2025 in Davos, Switzerland on Wednesday (local created_at).\nPresident Ferdinand Marcos Jr. has been very, very firm on his policy that we should not give an inch of any Philippine territory, Romualdez said.\nHaving that been said, we celebrate, of course, our rules-based global order, and with the [United Nations Convention on the Law of the Sea] and the 2016 arbitral award recognizing the sovereignty of the Philippines, we stand steadfast with the President's policy in enforcing that, he added.\nHe was joined in the panel by Timor-Leste President Jose Ramos Horta and Indonesia Foreign Minister Sugiono; Michael Froman, president of the Council on Foreign Relations; and Tulsi Naidu, chief executive officer of Asia-Pacific at Zurich Insurance Group.\nRomualdez emphasized that the Philippines has adopted a pragmatic and balanced approach to navigating the intensifying geopolitical competition between the United States and China, particularly in relation to the South China Sea (SCS) issue.\nBalancing geopolitical interests\nDuring the dialogue, Romualdez underscored the Philippines' strategic position as an ally of the US and a vital trade partner of China, and advocated for leveraging both relationships to advance the country's national interests.\nHe emphasized that the territorial dispute in the SCS does not define the entirety of the country's relationship with China.\nDespite the President being very firm on this policy of not giving up a single inch, we are working daily to de-escalate tensions. We do not want the South China Sea dispute to overshadow the many other facets of our relationship with China, including trade, education, and cultural exchanges, Romualdez said.\nWe are not taking sides. The United States is our long-standing ally and China is our largest trading partner. The Philippines is navigating a middle path where we maximize opportunities from both relationships while actively participating in the broader global community, he added.\nOn the bilateral ties with the US, Romualdez welcomed recent reassurances from new Secretary of State Marco Rubio on the Mutual Defense Treaty and Enhanced Defense Cooperation Agreement, noting their alignment with the Philippines' strategic priorities.\nReports said that in a call with his Philippine counterpart, Foreign Affairs Secretary Enrique Manalo, Rubio underscored the United States' ironclad commitments to the Philippines under our Mutual Defense Treaty.\nOur enduring alliance with the United States strengthens our ability to safeguard sovereignty and pursue peace. At the same created_at, we remain proactive in fostering relationships with all nations to promote global collaboration, he said.\nEconomic growth, global engagement\nRomualdez likewise highlighted the economic benefits of the country's pragmatic foreign policy, noting its attractiveness to investors due to its robust gross domestic product (GDP) growth, youthful workforce, and strategic location within the Association of Southeast Asian Nations (ASEAN).\nWe are here at the WEF to tell the Philippine story -- of a nation full of potential and resilience. As part of ASEAN, we are at the heart of a dynamic growth region, and we are working to build stronger partnerships to unlock opportunities for trade and investment, he said.\nHe emphasized how the Indo-Pacific region is emerging as a key hub for global trade, citing as example the Philippine government's engagements with industrial leaders from India.\nCommitment to peace, cooperation\nReiterating the Philippines' role in fostering regional stability, Romualdez affirmed the nation's dedication to the ASEAN centrality and multilateralism.\nASEAN continues to play a vital role in ensuring regional peace and stability. The Philippines remains committed to this multilateral framework, which has proven effective in addressing challenges while promoting cooperation, he said.\nHe reiterated the Philippines' commitment to a balanced and pragmatic foreign policy, rooted in upholding sovereignty, fostering economic growth, and pursuing peaceful international collaboration.\nOur future lies in de-escalating tensions, building meaningful partnerships, and safeguarding our principles. The Philippines is prepared to navigate the complexities of geopolitics, ensuring that our people benefit from peace, prosperity, and stability, he said. - PNA\n"
  },
  {
    "id": 623,
    "title": "China: Foreign Ministry Spokesperson Mao Ning's Regular Press Conference on January 23, 2025",
    "created_at": "2025-01-27",
    "text": "\nGlobal created_ats: It's reported that Chinese research institutions have completed the tests and analysis of the first independent sampling of the Fukushima nuclear-contaminated water discharged into the sea. Could you share more details with us?\nMao Ning: To ensure independent sampling and monitoring by China and other stakeholders is one of the commitments made by Japan on the issue of the discharge of the Fukushima nuclear-contaminated water into the sea. We learned from relevant authorities that Chinese research institutions have completed the tests and analysis of China's first independent sampling. No abnormality was seen in the activity concentration of tritium, caesium-137 and strontium-90.\nGlobal created_ats: Does the test result prove the safety of the discharge of the Fukushima nuclear-contaminated water into the sea?\nMao Ning:The discharge of the Fukushima nuclear-contaminated water concerns the world's common interest. Japan's unilateral action taken in spite of concerns of neighboring countries and the international community lacks legitimacy and rationality. China's firm opposition to Japan's discharge of Fukushima nuclear-contaminated water into the sea remains unchanged. In the absence of any compulsory international mechanism to stop the discharge, independent sampling by stakeholder countries on a continuous basis as a method of monitoring is an effective way to control the risks that come with the discharge.\nMeanwhile, we noted that professional agencies pointed out that one single test provides limited reference. China will continue to work with the international community to urge Japan to fulfill its commitments, put the discharge under strict international oversight and continue the independent sampling and monitoring of the water.\nAFP: The new US Secretary of State Marco Rubio had a call yesterday with his Philippines counterpart Enrique Manalo. A State Department spokesperson said that Rubio underscored the United States' ironclad commitments to the Philippines under the countries' mutual defense treaty and that the two also discussed Beijing's dangerous and destabilizing actions in the South China Sea. Does the Foreign Ministry have a reaction to this call?\nMao Ning: China's activities in relevant waters are legitimate, lawful, and fully justified. The US is not a party to the South China Sea issue and has no right to interfere in the maricreated_at issues between China and the Philippines. The military cooperation between the US and the Philippines should not undermine China's sovereignty and maricreated_at rights and interests in the South China Sea, still less should such cooperation support or advance the Philippines' illegal claims. China will continue to take necessary steps to firmly safeguard its territorial sovereignty and maricreated_at rights and interests and uphold peace and stability in the South China Sea.\nBeijing Daily: The White House said a few days ago that the US will withdraw from the Paris Agreement on climate change. Comments say that this will cast a cloud over the global effort of climate response and green transition. What is your view on this?\nMao Ning: China regrets the US announcement of withdrawal from the Paris Agreement. Climate change is a common challenge facing all humanity. No country can opt out or stay unaffected.\nAs Vice Premier Ding Xuexiang pointed out in his special address at the World Economic Forum Annual Meeting 2025, we must follow a consistent approach in addressing climate change. The fundamental solution to climate change is green transition. China is accelerating green and low-carbon transition across the board and taking concrete actions to peak carbon dioxide emissions before 2030 and achieve carbon neutrality before 2060. China has built the world's largest and most complete new energy industrial chain. 70 percent of the photovoltaic components and 60 percent of wind power equipment worldwide come from China. These high-quality production capacity has served as a strong boost to global green development and climate response.\nNo matter how the international landscape may evolve, China's determination and action for proactive climate response will not change, and we will continue working with all parties to build a fair and equitable global climate governance system for win-win cooperation and advance global green and low-carbon transition and sustainable development.\nAFP: I'd like to follow up on a question yesterday about a Chinese mine worker who had reportedly been killed in Afghanistan's northern Takhar province. Since then, the Islamic State's regional chapter has claimed responsibility for the attack, according a monitoring group called site. This monitoring group said that IS issued a communiqu\\xE9 reporting that fighters fired at a vehicle containing a Chinese. Does the Foreign Ministry have further information today or comments on this incident?\nMao Ning: China is deeply shocked at the attack and strongly condemns it. We express our condolences over the lives lost. China has lodged serious protests to Afghanistan right after the attack, and asked the country to conduct thorough investigations into the attack, and bring the perpetrators to justice.\nChina firmly opposes all forms of terrorism and calls for resolute and strong efforts in cracking down on ISIS, the ETIM and other terrorist organizations designated by the UN Security Council with zero tolerance. China will closely follow the security situation in Afghanistan and continue supporting Afghanistan in combating all forms of terrorism and violence, and upholding national security and stability. We urge the Afghan interim government to take resolute and effective measures to ensure the safety and security of Chinese citizens, institutions and projects in Afghanistan.\nKyodo News: A people's court in Suzhou today handed down a ruling on the case of attack against a Japanese woman and her child last June, and the Chinese defendant was sentenced to death. What is China's comment?\nMao Ning: From what I have gathered, the case is in judicial process and China's judicial authorities will handle the case in accordance with law. China will, as always, act to protect the safety of foreign nationals in China.\nBloomberg: US Secretary of State Marco Rubio has had a series of calls, mainly from US allies so far, part of his outreach to a growing list of countries including Japan, Australia, South Korea, Saudi Arabia, UAE and the Quad. We're wondering, does China's Foreign Minister plan to speak with Mr. Rubio and can such a call take place given that Mr. Rubio has been sanctioned twice by China?\nMao Ning: I have no information to share on your question. Let me say more broadly that it's necessary for high-level Chinese and U.S. officials to engage each other in appropriate ways. In the meancreated_at, China will firmly defend its national interests.\nCCTV: A follow-up on the test result of the discharge of the Fukushima nuclear-contaminated water. Does a normal test result mean that China will resume imports of Japanese aquatic products?\nMao Ning: The Chinese government always puts people first and firmly safeguards the food safety of our people. On the issue of resuming imports of Japanese aquatic products, China always follows a science-based approach. The first independent sampling and testing is just one of the steps for Japan to implement its commitments on the discharge issue. The resumption of Japanese aquatic products depends on results from a series of data including those from China's continuous independent sampling and monitoring and whether Japan will take concrete measures to effectively guarantee the quality and safety of exported aquatic products to China.\nReuters: According to a Reuters report today, the US deployed its Typhon missile launchers to a new location in the Philippines. A senior Philippine government source said that their redeployment would help determine where and how fast the missile battery could be moved to a new firing position. I just wanted to ask for any comments on the report.\nMao Ning: On the US deployment of Mid-Range Capability missile system in the Philippines, China has made clear its opposition more than once. Let me stress again that by bringing this strategic offensive weapon into this part of the world, the Philippines is essentially creating tensions and antagonism in the region and inciting geopolitical confrontation and an arms race. This is a highly dangerous move and an extremely irresponsible choice for its own people, the people of the other Southeast Asian countries, and regional security.\nWe once again call on the Philippines to heed the call from regional countries and their peoples, correct the wrongdoing as soon as possible, quickly pull out the Typhon missile system as publicly pledged, and stop going further down the wrong path.\nReuters: The Financial created_ats reported on Wednesday that two Iranian cargo vessels carrying an ingredient for missile propellant will sail from China to Iran in the next few weeks, potentially subjecting the involved Chinese entities to US sanctions. I wanted to ask for a comment on that report.\nMao Ning: I am not familiar with what you mentioned. China strictly controls the export of dual-use articles in accordance with laws and regulations on export control and our international obligations. China opposes any illicit unilateral sanctions.\nReuters: More than half of the American businesses in China say they are concerned about a further deterioration in the bilateral relationship between the economies, according to a survey from the US Chamber of Commerce. That's the highest level in five years. Do you have any comment on that report?\nMao Ning: This actually reflects how important it is to pursue a steady, sound and sustainable China-U.S. relationship. China always views and develops China-U.S. ties in line with the three principles put forth by President Xi Jinping, namely mutual respect, peaceful coexistence and win-win cooperation. We also hope the U.S. will work with China and bring China-U.S. relations back onto the track of sound and steady development.\nSource: Ministry of Foreign Affairs, People's Republic of China\n"
  },
  {
    "id": 624,
    "title": "Manila's spy scare trumped-up speculation",
    "created_at": "2025-01-27",
    "text": "\nBy Zhang Zhouxiang | China Daily | Updated: 2025-01-27 07:28\nThe Philippine National Bureau of Investigation has arrested a Chinese national along with two Filipinos for alleged espionage activities in the Philippines. The Chinese embassy in the Philippines has denounced the allegation as \"baseless speculation\" and made solemn representations to the Philippine side, demanding consular access to the arrested Chinese citizen who has been in the country for five years.\nIt has urged the Philippine side to base its judgment on facts, not to make a presumption of guilt, and to stop airing groundless speculation about the so-called spy case.\nThe attitude of the Chinese embassy cannot be clearer: Manila's charges are baseless, and the arrested Chinese citizen deserves fair treatment.\nThat the incident happened only weeks after a Philippine government vessel deliberately crashed into a China Coast Guard ship in waters near Huangyan Island in the South China Sea in December has naturally led to speculation that the Philippines is using the trumped-up scare as a means to speculate against China and ensure it has the support of the United States under the new administration.\nBut by doing so Manila is only losing its strategic independence in foreign policy, which will only mean more losses than gains to it in the long run.\nThe Chinese Foreign Ministry has already called on the Philippine side to duly fulfill its obligations under the bilateral consular treaty, arrange for embassy officials to conduct a consular visit with the Chinese citizen at an early date, and effectively safeguard the lawful rights and interests of Chinese citizens in the Philippines.\nBy pouring dirty water on a Chinese citizen in the Philippines to incite speculation about Chinese \"espionage\" activities, the Philippine side is stooping very low.\nLink to Image\n"
  },
  {
    "id": 626,
    "title": "House to start fake news probe",
    "created_at": "2025-01-27",
    "text": "\nThe House of Representatives will start its probe into what it described as a “massive disinformation machinery” on social media platforms.\nIn a statement, Sta. Rosa City Rep. Danilo Ramon S. Fernandez said the joint committee on public safety, public information and communications technology will convene on Monday with representatives from “major social media platforms” to formulate policies stifling the spread of disinformation.\nThe committee plans to discuss efforts to curb the spread of false information on social media platforms and the enforcement of “accountability measures” to persons deliberately spreading disinformation, he said.\nThey would also discuss the impact of disinformation campaigns on national security, especially on the “West Philippine Sea” dispute, he added, referring to areas of the South China Sea within Manila’s exclusive economic zone.\n“Filipinos have the right to the truth. We must protect our fellow citizens against falsehoods that cause fear, confusion, and division within our society,” Mr. Fernandez said in Filipino.\nAbout 62% of Filipinos get their news from social media, particularly on Facebook, according to a 2024 survey by political consultancy firm Publicus Asia.\nThe widespread use of social media in the country inundates Filipinos with content peddling misinformation and disinformation. This was most pronounced during the 2022 national elections, according to a University of the Philippines report.\nFilipinos will again flock to polling stations for the 2025 midterm elections in May, when a new set of congressmen for the House and 12 of the 24-member Senate will be voted on.\n“Fake news is a poison destroying our democracy. We will not stop until those responsible are held accountable and our fellow citizens are properly protected,” said Mr. Fernandez.\n"
  },
  {
    "id": 627,
    "title": "France and the Philippines at maricreated_at crossroads",
    "created_at": "2025-01-27",
    "text": "\n The Philippines and France have more things in common than most people think. Both the Philippine archipelago as well as French territories are part of the Indo-Pacific. Both are blue nations-maricreated_at states that are home to a vast range of marine ecosystems and resources. These, in turn, support the livelihoods of their communities and contribute to their economies, boosting their tourism sectors.\nIt follows that our two nations also share similar maricreated_at risks and challenges.\nForemost among these are the vulnerabilities that arise from being maricreated_at nations. France and the Philippines are confronted by various forms of danger like climate change and environmental issues-rising sea levels, stronger cyclones, and biodiversity loss. There are also issues that result from illegal fishing and construction. For us, this means areas such as the West Philippine Sea (WPS).\nA bigger challenge, however, is the aggressive actions and maneuvers of other countries intent on subverting the rule of law.\nIn recent months, the Philippines has seen China firing water cannons, directing lasers to crews, and blocking and ramming Philippine ships. These acts have jeopardized the safety of the Philippine Coast Guard (PCG), and national security. The fact that the South China Sea-facilitating one-third of global trade and is a maricreated_at area that houses vast fishery resources and hydrocarbon deposits-holds immense strategic and economic importance to Indo-Pacific states elevates the issue to that of great concern.\nIn response, the Marcos administration has demonstrated its commitment to addressing these external security challenges. Likewise, the Philippines is actively investing in its naval capacities, including diversifying its defense strategic cooperation with like-minded partners.\nFrance is also concerned with these developments in the WPS. It knows that any disruption of the vital maricreated_at routes would threaten global economic and trade security. Furthermore, foreign ships, such as those from France, regularly navigate the South China Sea to exercise freedom of navigation and concretely uphold international maricreated_at law.\nGiven our similar concerns and challenges, and given our shared commitment to and mutual respect for international law and appreciation for freedom of maricreated_at navigation, the Philippines has embarked on a strategic cooperation with France.\nThis does not only focus on the environment, climate change, and biodiversity but also on maricreated_at security and defense.\nAmong the steps that have been taken: In 2023, the two countries signed a letter of intent outlining an agenda for increasing France's presence in the Indo-Pacific. France participated in the 39th Balikatan in April 2024-its first created_at joining the biggest annual drill exercises of the Philippines with the US and other like-minded partners. In July 2024, a detachment of the French Air and Space Force PEGASE Mission visited the Philippines following its deployment in the Pacific as part of its air diplomacy and promotion of military cooperation actions with the Philippines.\nThe Philippines, through a P25.8-billion Official Development Assistance funded acquisition project of France, is set to receive 40 fast response craft, the largest single-purchase in the Modernization of the PCG.\nIndeed, 2024 was a year of firsts; this year will see a continuation of these initiatives. Specifically, enhancing maricreated_at domain awareness is essential for improving maricreated_at readiness, allowing for more effective monitoring, detection, and response to threats.\nOn Jan. 23, the French Embassy in the Philippines, in partnership with Stratbase Institute, hosted a forum titled 'Exploring Maricreated_at Cooperation: The Role of International Partnerships on Maricreated_at Security.'\nThis was the second installment of the Blue Talks series.\nA joint policy brief, co-authored by Stratbase Institute and the French Institute of International Relations and focusing on the challenges and opportunities in maricreated_at cooperation between the two nations, was also presented during the event.\n'While defense is central to maricreated_at security, it is not the only aspect. For an archipelagic nation like the Philippines, maricreated_at safety is equally critical. Ensuring the safe and efficient transport of people and goods is essential for economic prosperity, just as territorial and maricreated_at sovereignty is crucial for national security,' said the French Ambassador to the Philippines Marie Fontanel.\nAs the Philippines strives to address its maricreated_at challenges, both in the areas of defense and economic security, it looks to like-minded partners for solidarity and mutual assistance. It is good to note that France, another blue nation, is one such friend.\n"
  },
  {
    "id": 630,
    "title": "Chinese customs intercept books with \"problematic\" maps that \"violate their sovereignty\".",
    "created_at": "2025-01-27",
    "text": "\nBeijing, Nov 25 (EFE) - Customs authorities in the southeastern Chinese province of Fujian confiscated three books containing maps that they described as \"problematic\", detecting that they violated the territorial principles defended by Beijing.\nThe maps, included in the intercepted books, labeled Taiwan as a \"country\", reported this Sunday the Customs of the Asian country through its official account on WeChat -similar to Whatsapp, application censored in China-.\nThe illustrations also showed \"inaccurate descriptions\" of sovereignty over disputed regions and territories, such as the Diaoyu Islands and its islets (controlled by Japan under the name of the Senkaku), in addition to Aksai Chin, administered by Beijing in the western region of Xinjiang, and Zangnan (Arunanchal Pradesh for India), in southern Tibet and under the control of New Delhi.\nThe Chinese agency in turn pointed out that the geographical chart omitted the ten-point dotted line in the South China Sea, an element that Beijing considers essential to support its 'one China' principle and its maricreated_at claims in the region.\nCustoms authorities stressed that the maps are \"a primary representation of the national territory with political, scientific and legal significance\", and emphasized that publications that do not comply with China's cartographic regulations are prohibited from entering or leaving the country.\nThe confiscated books, which the publication said \"seriously undermine national unity, sovereignty and territorial integrity,\" have been referred to relevant departments for further action.\nThis episode reflects the strict vigilance exercised by the Chinese authorities over printed materials and publications that may contravene their territorial and political principles.\nThe incident adds to the usual tensions over the sovereignty of disputed territories.\nChina published its updated version of its standard map in August last year, claiming disputed territories with India, the Philippines and Vietnam as its own, which sparked criticism from these countries.\nThe Asian giant has increased the use of the Mandarin romanization system, the so-called 'pinyin', in official documents, replacing English names such as 'Spratly Islands' with 'Nansha Qundao' to consolidate its territorial claims. EFE\n"
  },
  {
    "id": 631,
    "title": "Wife of Chinese man detained in the Philippines denies he is a spy in Beijing's service",
    "created_at": "2025-01-27",
    "text": "\nManila, Jan 27 (EFE) - The wife of the Chinese citizen arrested this month in the Philippines denied that her husband, Deng Yuanqing, is a spy in the service of Beijing, as suggested by the authorities in Manila, who are investigating the case for alleged espionage, a version that China has already denied.\nIn a press conference, the woman, Noemi Deng, reiterated that her husband is not a spy and that his alleged link with the Chinese Army \"is false\", after the National Bureau of Investigation of the Philippines (NBI) assured that the man is affiliated with the University of Science and Technology of the Chinese People's Liberation Army.\n\"I can only say one thing: my husband is not a spy. He has been living in the Philippines for more than ten years,\" stressed the woman, moved to tears, after denouncing that she has not been able to see her husband, arrested on January 17 along with two Filipino nationals.\nIn addition to calling for a fair and transparent investigation, Deng assured that her husband works in road mapping for smart vehicle technologies, which is why he had the road surveying equipment seized by the authorities.\nThe NBI claimed that Deng Yuanqing, along with the two Filipinos also arrested, \"conducted illegal surveillance and espionage\" using \"advanced equipment\" installed in a vehicle to map and transmit detailed data on key defense structures in the Philippines.\nThese include military bases that U.S. troops have access to under the Enhanced Defense Cooperation Compact (EDCA), Armed Forces of the Philippines chief Romeo Brawner Jr. said during a press conference last week.\nThe accusations angered Beijing, which denied Manila's version. Chinese Foreign Ministry spokeswoman Mao Ning urged the Philippine authorities to \"stop peddling\" their theory of the alleged spy and \"seriously protect the legitimate rights and interests\" of their citizens.\nThis alleged spying joins another case reported by Manila earlier this month, when a group of fishermen found an underwater drone about three meters long with possible \"military applications,\" a Philippine Navy spokesman said last January 7, whose provenance is still under investigation.\nThese cases led an Asian Navy spokesman, Roy Vincent Trinidad, to affirm that \"there seems to be a deliberate and calculated plan to map\" the Philippines by a \"foreign power\", without directly mentioning China.\nManila and Beijing are in conflict over the sovereignty of territories in the South China Sea, a strategic region through which approximately 30% of global trade passes, which is home to 12% of the world's fishing grounds and has potential oil and gas reserves. EFE\n(photo)(video)\n"
  },
  {
    "id": 632,
    "title": "European Commission to present its new Competitiveness Compass - Ursula von der Leyen",
    "created_at": "2025-01-27",
    "text": "\nThe European Commission to present its new Competitiveness Compass next week, said President of the Commission Ursula von der Leyen with her special address during the World Economic Forum in Davos, Switzerland, Trend reports.\nShe pointed out that the cooperative world order we imagined 25 years ago has not turned into reality. Instead, we have entered a new era of harsh geostrategic competition.\n\"The world's major economies are vying for access to raw materials, new technologies, and global trade routes. From AI to clean tech, from quantum to space, from the Arctic to the South China Sea, the race is on. As this competition intensifies, we will likely continue to see frequent use of economic tools such as sanctions, export controls, and tariffs that are intended to safeguard economic and national security.\nBut it is important that we balance the imperative to safeguard our security against our opportunity to innovate and enhance our prosperity. In this spirit, we will need to work together to avoid a global race to the bottom, because it is in no one's interest to break the bonds of the global economy. Rather, we need to modernize the rules to sustain our ability to produce mutual gain for our citizens,\" said the Commission's president.\nShe went on to add that for Europeans, the race begins at home.\n\"Europe has a unique social market economy. We have the second largest economy and the biggest trading sector in the world. We have longer life expectancy, higher social and environmental standards, and lower inequalities than all our global competitors. Europe is home to immense talent, along with a proven ability to attract ideas and investment from across the world. Our capacity to invent and create is underappreciated. Europe's global share of patent applications is on par with the U.S. and China. But the world is changing. So must we,\" said Ursula von der Leyen.\nShe recalled that for the last 25 years, Europe has relied on the rising tide of global trade to drive its growth.\n\"It has relied on cheap energy from Russia. And Europe has too often outsourced its own security. But those days are gone. To sustain our growth in the next quarter of a century, Europe must shift gears. And this is why I asked Mario Draghi, President of the European Central Bank, to deliver a report on European competitiveness. And on that basis, next week the European Commission is presenting our roadmap, the Competitiveness Compass, which will drive our work for the next five years. The focus will be increased productivity by closing the innovation gap,\" she said.\n"
  },
  {
    "id": 633,
    "title": "West Philippine Sea: PCG thwarts Chinese ship's approach in Zambales",
    "created_at": "2025-01-27",
    "text": "\n The Philippine Coast Guard (PCG) has successfully kept a Chinese vessel illegally operating off Zambales from nearing the province's coastline, as it spotted the 'monster ship' a few nautical miles away.\nIn a statement released late Sunday night, the PCG spokesperson for the West Philippine Sea, Commodore Jay Tarriela, said that despite BRP Cabra's smaller size, it has prevented the China Coast Guard (CCG) vessel 3103 from advancing closer to Zambales.\n'The PCG vessel has maintained the China Coast Guard vessel to keep a distance of 90-100 nautical miles away from the Philippines' exclusive economic zone,' Tarriela said.\n'It is noteworthy that, although BRP Cabra is only 44 meters in length, the Chinese Coast Guard has deployed CCG-3304 at a distance, appearing to serve as a supporting vessel for CCG-3103. Additionally, CCG-5901 (the monster ship) was also spotted a few nautical miles away from CCG-3103 later today,' he added.\nAccording to Tarriela, the PCG has committed to prevent China from 'altering the status quo by encroaching closer to the coastline of Zambales.'\n'Our continued presence serves as a clear demonstration of our commitment to upholding our sovereign rights and a steadfast stance against any violations of international law, all while prioritizing a peaceful approach,' he said.\nAlso on Sunday, Tarriela criticized China for its attempt to impose a 'new order' in the West Philippine Sea.\nThe PCG spokesperson criticized the CCG for threatening the BRP Cabra, warning that they would 'take necessary measures' if it did not leave the area. He stated that China's threat reflects its 'desire to impose a new order that undermines the rules-based international system.'\n'Their threats against the legitimate presence of the Philippines conducting maricreated_at patrols-warning that if we do not leave, they will take necessary measures and we will bear the consequences-clearly indicate China's desire to impose a new order that undermines the rules-based international system,' Tarriela wrote Sunday, January 26, on X (formerly Twitter).\n'They appear intent on reverting to a system [that] might dictate what is deemed right, allowing powerful countries to impose their interests at the expense of others' rights and jurisdictions,' he added.\nBeijing's continued aggression was based on its assertion of sovereignty over almost the entire South China Sea, including most of the West Philippine Sea, as it continues to reject the 2016 arbitral ruling that effectively dismissed its claims and ruled in favor of Manila.\nThe landmark ruling stemmed from a case filed by Manila in 2013, a year after its tense standoff with Beijing over Panatag Shoal, whose lagoon the latter now effectively controls.\n"
  },
  {
    "id": 634,
    "title": "Indonesian president Prabowo’s first 100 days marked by u-turns, missteps … and sky-high popularity",
    "created_at": "2025-01-27",
    "text": "\nDays after he was sworn in as Indonesia’s eighth president, retired general Prabowo Subianto, kicked off his tenure with a militaristic boot camp in the hills of Java.\nIn olive-green army fatigues and combat boots, his new cabinet – from bespectacled technocrats to former officers – marched and stood in formation.\nIt was a striking look for the world’s third-largest democracy, one that less than two decades ago threw off the shackles of authoritarian rule.\nBut analysts say the show of discipline and coordination belie what has ensued in the first 100 days of Prabowo’s presidency, with the ex-commander’s leadership described as at created_ats being haphazard, contradictory and lacking clear direction.\n“This is one of the most chaotic first 100 days I have seen,” said Yohanes Sulaiman, from General Achmad Yani University in Bandung, “The government seems to be lacking in discipline, with most of the policies half baked.”\nPrabowo gained widespread popularity with his promise to provide free meals to almost 90 million school children and pregnant women, winning a landslide election victory in February last year, but a series of u-turns has followed, on everything from pardons to flashpoint topics such as Beijing’s claims on the South China Sea.\nA change to a planned VAT policy hours before it came into effect is another example, say analysts, of muddled policymaking under Indonesia’s new leader.\n                   ‘A lot of blunders’                   \nPrabowo, the former son-in-law of Indonesia’s late dictator Suharto, was dismissed from the military in 1998 amid allegations of human rights abuses , for which he has always denied wrongdoing.\nIn the decades since his military days, the retired general has continued to loom large over Indonesian politics, founding what is now the country’s third-biggest political party and running three created_ats for the presidency.\nPropelled by a savvy rebrand that replaced the image of a nationalistic and bellicose general with an avuncular figure with a penchant for dancing and cuddling his cats, Prabowo finally won the presidency in April last year with a resounding 58%  of the vote. He was inaugurated on 20 October.\nIn the sprawling, developing nation of 280 million people, Prabowo’s campaign promise to provide free lunches to almost 90 million school children and pregnant women won him many fans across the archipelago.\nIn an address to cabinet on 22 January he praised his government’s people-centric approach, after the first phase of free meals program was rolled out. “We have been able to achieve a stable condition, filled with tranquility,” he said, as reported by state news agency, Antara.\nA January survey   showed the populist policy has been well received, affording him a 80.9% approval rating.\nBut academics, analysts and foreign policy experts have been more circumspect about his performance in other areas.\nAmong the most alarming of moves , , was Prabowo’s tacit acknowledgement of China’s maricreated_at claims in the South China Sea, which Indonesia and other nations in south-east Asia, have long rejected.\n“It wasn’t just a mishap or a mistake... It was a deliberate policy change,” said political analyst Kevin O’Rourke, of a joint statement signed in China this November. “This was clearly a concession made to the Chinese in exchange for something else.”\n“It was a quid pro quo. This was a quid. What’s the quo?” he said, adding that any concession was unlikely to appease China, but rather, “whet their appetites”.\nIn one of the first flip-flops under Prabowo, Indonesia’s foreign ministry later issued a contradictory statement, saying it did not recognise China’s nine-dash line.\nThere has, says Lina Alexandra from the Jakarta-based Centre for Strategic and International Studies, been “a lot of blunders” in an approach to foreign policy she describes as “scrambling”.\nForeign-educated and a multi-linguist, Prabowo appears at ease on the global stage, embarking on a mini world tour before his presidency had even started.\n“Doing a lot of visits is one thing, but if it’s without any direction, that could be quite dangerous and risky, especially amid the tensions that we are facing,” said Alexandra, “And that’s much more intensified under Trump.”\nA subsequent decision by non-aligned Indonesia to join Brics, and also skip an Asean foreign ministers’ meeting, has also surprised observers given Indonesia, the largest member of the bloc, normally plays a prominent role.\n“The impression is that he wants Indonesia to be more at the centre of the global stage, but it’s still not yet clear about the direction,” said Alexandra.\nAnother policy reversal came with the much touted plan to hike value-added tax (VAT) by one percentage point to 12%, but hours before it was set to go into effect Prabowo announced that it would apply only to luxury goods and services.\nPrabowo said the “gradual VAT hike was designed to avoid significant impacts on inflation, purchasing power, and economic growth,” but analysts say the last-minute backtrack created business and investment uncertainty in south-east Asia’s largest economy.\n“It’s just been a very haphazard process because policy has flip flopped back and forth a couple of created_ats,” said O’Rourke, “It’s been inefficient and confusing, and it shows that Prabowo is unwilling to take steps that might agitate the public.”\nThe reversals are at odds with the image of a decisive general presented in his campaign.\n“Ultimately this just reflects Prabowo himself. He’s very changeable and has long been prone to delivering contradictory messages depending on his audience at the moment,” said O’Rourke.\n“Prabowo is hoping for quick achievements,” noted Sulaiman, “but it has ended up with him courting a lot of controversy.”\nPrabowo’s office was contacted for comment on how he regarded the criticisms of his first 100 days in power but did not respond.\nAlexander Arifianto, an Indonesia expert from the Rajaratnam School of International Studies, said some missteps could be attributed to having to manage a bloated coalition. “Hence why policy announcements and rollout is often not smooth,” he said.\nPrabowo has made other surprising moves too, such as releasing foreign prisoners on death row, including the remaining members of the so-called Bali 9. \nThe former general also floated pardoning people jailed for corruption, but has since appeared to walk that back.\nAs analysts critique the new president’s first 100 days, even Prabowo himself has admitted in the past year that democracy is “very messy”.\n"
  },
  {
    "id": 637,
    "title": "BBCM China Watchlist 27 Jan 25",
    "created_at": "2025-01-27",
    "text": "\nStories being covered today by BBC Monitoring from Chinese broadcast, press and social media sources.\nChina media remain positive on ties with US after Wang-Rubio call\nChinese media continued to highlight the prospect of better relations with the US, as outlets reviewed remarks by President Donald Trump and high-level contacts during the first week of the new administration.\nState-owned English-language newspaper China Daily, in an editorial on 26 January, noted \"Trump administration's statements regarding relations with China are distinctly different from those of its confrontational predecessor.\"\nSimilar sencreated_atnts were reported by state-run nationalist outlet Global created_ats in its interviews with several Chinese experts published on 26 January.\nGlobal created_ats also noted Zhuo Hua, an international relations expert from Beijing Foreign Studies University, as warning that in the short term, it is still difficult to change the US side's \"positioning and strategic narratives\" that treat China as a \"competitive rival\", Global created_ats reported.\nIn the phone call on 24 January, Foreign Minister Wang Yi told Secretary of State Marco Rubio that China has \"no intention of surpassing or replacing any country\", but \"must safeguard its legitimate rights to development\", official Xinhua News Agency reported.\nWang also referred to Taiwan and urged Washington to \"be sure to handle it prudently\" and not renege on its \"solemn commitments to the one-China policy\".\nThe Xinhua readout quoted Rubio as saying the US \"does not support 'Taiwan independence'\" but made no mention of Rubio expressing \"serious concern over China's coercive actions against Taiwan and in the South China Sea\".\nThe Chinese readout also portrayed Rubio's remarks on ties as being generally positive, noting him as saying that \"US-China relations is the most important bilateral relations in the 21st century\".\nThe White House readout, however, said that the \"Trump Administration will pursue a US-PRC relationship that advances US interests and puts the American people first\".\nSee also: Linguistic advisory: China foreign minister's 'behave yourself' advice to Rubio  \nBriefing: Taiwan's media, pundits divided on what Trump return means for Taipei  \nChina coastguard expels Philippine vessels near disputed reef\nThe China Coast Guard (CCG) said it expelled two Philippine government vessels for \"unlawfully intruding\" into waters near a Chinese-claimed reef in the South China Sea Spratly Islands chain.\nOn 25 January, CCG Spokesperson Liu Dejun said the vessels attempted to \"illegally land\" on Tiexian Reef and collect sand samples the previous day, and had been warned and driven away, according to a statement released by Xinhua News Agency. &#160;\nThe disputed reef is claimed by the Philippines as Sandy Cay.\nYuyuan Tantian, a blog run by China Central Television (CCTV) released purported CCG footage of the operation.&#160;\nReiterating that China has \"indisputable sovereignty\" over the \"Nansha Qundao\" (Spratlys) and its surrounding waters, Liu said the CCG will continue its \"law enforcement activities in waters under Chinese jurisdiction, in accordance with the law, to firmly safeguard China's territorial sovereignty and maricreated_at rights and interests\".&#160;\nGlobal created_ats's English-language edition said the video appeared to show one BFAR vessel attempting to \"obstruct\" the CCG vessel 4106 in a dangerous manner and even trying to ram the vessel 4106 with its bow. The CCG vessel also deployed an enforcement vessel to carry out \"targeted interception and control, thwarting the Philippine side's plot\".\nLiu's statement came hours after the Philippine Coast Guard (PCG) accused the CCG of \"aggressive manoeuvres\", Hong Kong newspaper South China Morning Post noted.&#160;\nChinese state media also reported that the Philippines sent a civilian ship on 27 January to deliver daily necessities to its warship grounded near the Second Thomas Shoal, known as Ren'ai Jiao in China and Ayungin Shoal in Manila, \"in accordance with a temporary arrangement reached with China\", according to Global created_ats.&#160;\nThe CCG \"supervised the operation throughout\", said Gan Yu, a spokesperson for the CCG.\nSee also: Philippines stops research survey amid Chinese 'harassment' in disputed sea  \nExplainer: China's coastguard increasingly involved in confrontations  \nChinese embassy denies Philippine cyber-theft allegations  \nBeijing, Hong Kong denounce proposed US Congress sanctions bill\nBeijing and Hong Kong authorities condemned a bill submitted by Republican and Democrat US lawmakers for Washington to review whether to impose sanctions on Hong Kong officials for \"human rights violations\".&#160;\nThe Hong Kong Sanctions Act, announced on 24 January, comes days after Donald Trump was sworn in as the US president. It is led by Republican Representative Young Kim, who chairs the House of Representatives Foreign Affairs East Asia and Pacific subcommittee, and Democratic Representative Jim McGovern, a Democrat on the House Rules Committee.\nIf passed, it will require the US government to impose sanctions on those deemed accountable for human rights violations under a national security law Beijing imposed on Hong Kong in 2020. &#160;\nOn 25 January, a spokesperson for the Chinese foreign ministry's Commissioner's Office in Hong Kong expressed \"strong dissatisfaction\" and \" firm opposition\" to the move, state-affiliated news website Guancha.cn reported, citing a website statement.\nWithout naming names, the Office accused certain \"anti-China politicians\" in the US of having \"repeatedly come up with malicious laws\" and \"threaten to sanction officials, judges and prosecutors of the Hong Kong government, openly trampling on the spirit of the rule of law\".\nIn similar Chinese and English-language statements on the same day, the Hong Kong government warned that the bill may \"constitute contempt of court\" or \"perversion of justice\", local newspaper Ming Pao reported.\nSee also: China condemns UK for interaction with Hong Kong fugitives  \nChinese leaders extend Spring Festival greetings to retired senior officials\nPresident Xi Jinping and other Chinese leaders continued an annual tradition of visiting or entrusting others to visit retired senior officials to extend greetings ahead of the Spring Festival, also known as Chinese New Year, which falls on 29 January this year.\nChina Central Television's (CCTV) flagship evening news bulletin Xinwen Lianbo (News Hookup) on 26 January said Xi and other leaders extended greetings to Xi's predecessor Hu Jintao, president of China from 2003 to 2013; Zhu Rongji, a former premier who had led economic reforms in 1990s; and Wen Jiabao, who had served alongside Hu as premier, among others.\nAccording to the report, the retired senior officials \"spoke highly of the Chinese Communist Party (CCP) Central Committee's work over the past year and voiced wholehearted support for Xi as the core of the Party Central Committee and the Party as a whole\".\nXi, also the chairman of the Central Military Commission (CMC) that oversees the armed forces, had earlier extended Spring Festival greetings to all servicemen of the country while visiting the People's Liberation Army (PLA) Northern Theatre Command headquarters in the north-eastern city of Shenyang on 24 January, Xinwen Lianbo reported on 25 January.\nHe urged troops to be battle ready, and promptly and effectively deal with \"possible emergencies\" and \"safeguard national security and social stability\".\nCMC vice-chairmen Zhang Youxia and He Weidong made similar calls for combat readiness when visiting the Information Support Force and a Beijing airborne division garrison respectively, Xinhua reported.\nSee also: President Xi continues his inspection in northeast China's Liaoning  \nBriefing: China's Spring Festival travel rush gets under way  \nBriefing: China bets on trillion-yuan snow and ice economy to boost growth  \nSource: BBC Monitoring, 27 Jan 25\n"
  },
  {
    "id": 641,
    "title": "Business Today - 04:40 AM GMT",
    "created_at": "2025-01-27",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nAsian region for India, especially as India seeks to position itself as a counterbalance to China's territorial ambition in the region and and you know remember more than half of India's trade passes through the the Malaka Strait, as well as the South China Sea, and over there, getting a freedom and securing and preserving that freedom of navigation is very crucial, and that was also a key point of conversation between Indian Prime Minister and Indonesian President, and Indonesia has been a key focus for Prime Minister Narendra Modi in India's look East policy, and that is where the conversations also circled around. Thanks very much arena forging us across that Arsenal ship in Mumbai, and thanks for your company here on business day. We are out of created_at. Thanks for watching. \nHomes COOM is a new elevated home shopping experience. Beautiful design, tremendously rich content feels like a work of art. What about the app? Oh, wow, went all in on gold. Now homes Coom, we've done your homework. Lunch is on me today. Awesome why I have some extra cash right now I started using upside, the free app that gives you cash back for every gallon of gas you buy. Wait, are you saying you get real money back when you get gas with the upside up. Yes, I get real cash back every created_at I get gas. Does that actually add up to anything? I'll make around 200 $300 wow, that's serious extra cash. Right you're putting gas in your car. Anyway, why not get real cash back? It's like free money. I'm downloading the free upside app. Now use this promo code and get an extra $0.25 a gallon cash bonus on your first tank. Thanks, $5000. That's the average amount of money people in the us are now spending on gas in a year 5 grand. That's crazy. If you drive, you have to download upside, the free app that gives you cash back every created_at you get gas. That's right, you can earn real cash back with upside just for buying the gas you're already buying. Download the free UPSIDE app now earn cash back every created_at you buy gas. Use promo code mile 25 for an extra $0.25 per gallon bonus on your first tank. Did you download the website app? Yet, yes, of course, I'm not passing up free money, I'm earning real cash back now every created_at I get gas, just download the free upside appuse promo code mile 25 for $0.25 per gallon bonus on your first tank. If you drive, you need upside earn cash back on every gallon of gas you buy plus you can cash out any created_at, write your bank, paypal or a gift card for Amazon and other brands. So whether you're driving? Around town, a couple created_ats a week or driving hundreds of miles every day, upside is for you don't wait. Some upside users are making as much as 200 $300 download the free upside appuse, promo, code mile 25 a $0.25 per gallon bonus. That's code mile 25 $0.25 per gallon bonus. The Ukraine is just about holding the front here in the Kharkiv region, while the Russians have launched this fresh assault everywhere you look there are uprooted trees, there are bits of buildings and the destruction is just in every direction. Sduring drones were dropped here artillery, air strikes. We know this was a military hunter because Arabs don't that kind of weaponry. When you can hear the teargas p***** being looked at, the protesters who are just down that road, you see the water bust more than 100 migrants trying to get to the water they're letting off firecrackers to try and keep the police away from them there. When the story breaks BBC news, the news never sleeps. Even when you do, a ceasefire is being caught, a precedent is being overthrown and trials for new cancer drugs show promise, but rest knowing you can\n"
  },
  {
    "id": 642,
    "title": "VCNO WELCOMES DEBATE OVER FUTURE OF AIRCRAFT CARRIER",
    "created_at": "2025-01-27",
    "text": "\n Posted January 24, 2025\nVice Chief of Naval Operations Adm. James Kilby pushed back against skepticism about the relevance of aircraft carriers in future warfare, emphasizing the need for pragmatic evaluation over sweeping changes.\nSpeaking candidly about the role of unmanned technology and other innovations, Kilby outlined critical operational challenges that must be addressed before considering alternatives to the Navy's carrier fleet.\nKilby's remarks to Inside Defense on Jan. 15 on the sidelines of the Surface Navy Association's annual conference came in response to comments from House Appropriations defense subcommittee Chairman Ken Calvert (R-CA), who questioned the viability of aircraft carriers against modern threats such as China's arsenal of hypersonic missiles.\nCalvert, during a talk at the American Enterprise Institute, noted these adversarial advancements could potentially render the carriers -- multibillion-dollar platforms with thousands of personnel onboard -- vulnerable in high-stakes conflicts.\n\"Will aircraft carriers be survivable in modern warfare?\" Calvert asked. \"If they can't, then we ought to make some difficult decisions.\"\nKilby, however, urged caution, stressing that while unmanned systems hold promise, they lack the logistical infrastructure and operational viability required for sustained missions.\n\"Show me the use case,\" Kilby said. \"How am I going to employ it, deploy it, and operate it? If you just pop me into the South China Sea with a bunch of unmanned platforms, great. But how did I get them there? How do I fuel them? All that has to be part of the discussion.\"\nThe four-star admiral, who is the Navy's top requirements officer, said he welcomed the type of debate Calvert broached in his address. \"I agree,\" Kilby said, \"We've got to get pushed in that space. I'm not willing to just stop this, about face and go to that for the promise.\"\nHe cautioned, though, that drawing lessons from the Russia-Ukraine war might not be particularly relevant for a potential conflict with China.\n\"In the Black Sea, geography is different than the Pacific,\" Kilby said. \"So, what works there may not work in the Pacific -- we've just got to think through that.\"\nAdm. Sam Paparo, commander of U.S. Indo-Pacific Command, last summer provided a comprehensive defense of aircraft carriers, framing them as indispensable tools of power projection and crisis response.\nIn the U.S. Naval Institute's Proceedings, Paparo highlighted the ability of carriers to generate high sortie rates -- up to 125 strike missions daily -- and operate without the constraints of fixed bases or host-nation permissions.\n\"Fires are the king of battle, and an aircraft carrier is the king of kings in capacity and range,\" Paparo wrote. He emphasized their mobility, inherent defensibility and capability to support joint and all-domain warfighting operations. Paparo also underscored the carriers' adaptability, citing the continuous evolution of carrier air wings over a 50-year lifespan.\nKilby echoed these points, stressing the flexibility of the air wings as a critical factor in maintaining relevance.\n\"We can adapt the air wing much more rapidly than we can build another platform,\" he said. This adaptability, combined with the carrier's mobility, makes it a uniquely potent asset, even in contested environments.\nCritics like Calvert argue the growing missile capabilities of adversaries such as China necessitate a reevaluation of carrier investments. Hypersonic weapons, with speeds exceeding Mach 5, pose a formidable challenge to traditional defenses.\nHowever, proponents like Paparo assert carriers can evolve to meet these threats through counter-targeting measures, layered defenses and innovative technologies like directed-energy weapons and unmanned systems.\nKilby acknowledged these challenges but emphasized that abandoning carriers without a viable alternative could leave critical gaps in U.S. naval capabilities.\n\"I owe you a Navy that can do it all,\" he said. \"If I optimize for one thing, it may not be the Navy we want in the future.\"\nThe debate over aircraft carriers reflects broader tensions within U.S. defense planning, as leaders grapple with balancing traditional platforms against emerging technologies. Paparo's case for carriers highlights their enduring strategic value, while Kilby's pragmatic perspective underscores the importance of addressing operational realities.\nAs the Navy faces a rapidly evolving threat landscape, the challenge lies in charting a course that integrates innovation without sacrificing proven capabilities.\n\"It's not an either/or choice,\" Paparo said. \"It's a matter of yes, and.\"\nKilby's remarks serve as a reminder that while innovation is essential, the path forward must be grounded in practical considerations and a clear-eyed assessment of operational demands.\n\"I want to think through that,\" Kilby said of the implications of eliminating the aircraft carrier. \"But I think it's a healthy conversation.\" -- Jason Sherman  \n"
  },
  {
    "id": 643,
    "title": "How the contours of Quad may change in Trump 2.0",
    "created_at": "2025-01-27",
    "text": "\nIndia, Jan. 27 -- The Quad foreign ministers met shortly after Donald Trump took office at the White House. This ministerial meeting was also the first engagement of the United States (US)' new secretary of state, Marco Rubio. While speculations were rife about the future of Quad after Trump won the polls earlier last year, the prompt meeting of Quad foreign ministers suggests the grouping is likely to remain a key priority for Trump.\nWhile much of Quad's systematic functioning began during Joe Biden's tenure, Trump also shares credit for the revival of the grouping. Quad began as a group of four countries cooperating to assist humanitarian assistance and disaster relief efforts in the aftermath of the 2002 tsunami in the Indian Ocean but withered soon after hesitations of drawing negative attention from China took to the fore. Later, the compulsions posed by new strategic realities in the Indo-Pacific, primarily driven by China's growing aggression in the region brought the four countries closer. Importantly, Trump's first term had breathed new life into Quad, marking the resumption of dialogue among the four democracies as advocates of a rules-based order at sea, in the Indo-Pacific. Even within the US, Trump undertook reforms rechristening the erstwhile Pacific Command (PACOM) of the US Armed Forces to Indo-Pacific Command (INDOPACOM), acknowledging the need for a unified security approach.\nWhile the overview of much of Trump's China policy is dominated by his hardline approach to trade issues, in the realm of security too, there has been considerable focus. The security and stability in the Indo-Pacific is of vital interest to the US's geopolitical and economic imperatives under Trump. China's increasingly aggressive behaviour in the Indo-Pacific has naturally alarmed the US. More recently, the South China Sea region has emerged as a terrain of contest. China's continued belligerence through grey zone activities in the Taiwan Strait also remains a key concern for US interests. In this light, the US has sought to expand and deepen its partnerships with like-minded countries in the region to ensure peace and stability in the Indo-Pacific. Groupings such as Quad are thus vital for Trump's interest. This is also in tandem with his advocacy of security partnerships, rather than the US being a sole security provider.\nThe US's Indo-Pacific partnerships are wide-ranging and multifaceted. With Quad, the US has expanded broad-based cooperation with Australia, Japan and India. With AUKUS, the US and the United Kingdom are continuing to work with Australia to provide the latter with nuclear submarines to deter a warlike scenario in the Indo-Pacific. More recently, the US has sought to enhance security cooperation in the South and East China Sea region against Chinese aggression through Squad, with Australia, Japan, and the Philippines. Among these, Quad's scope and agenda are the most diverse and broad-based. While Quad's operationalisation began with a tacit security orientation of protecting freedom of navigation in the Indo-Pacific and ensuring a rules-based order in the region, it has increasingly adopted a slew of comprehensive objectives aimed at delivery of global good including fostering cooperation in the domain of human security, technological cooperation and facilitating people-to-people ties.\nWhile Quad's agenda was expanded significantly under Biden, the extent of Trump's commitment to non-security issues in Quad remains to be seen. For Trump, prioritising questions of Indo-Pacific security is likely to be his preferred driver. This was also reflected in the joint statement released after the Quad foreign ministers' meeting. The emphasis was on upholding and defending sovereignty and territorial integrity, apart from the rule of law and democratic values. Seemingly alluding to China, Quad reiterated its commitment to regional maricreated_at, economic, and technological security along with promoting reliable and resilient supply chains.\nThe question that arises is whether this could complicate the continued synergy within the grouping given that Quad has so far remained mindful of not explicitly pitting the group against anyone. Earlier last year, at the Wilmington summit, Prime Minister Narendra Modi reiterated that Quad is not against anyone, but rather a force for good. The nuance of such a position also acknowledges the diverse strategic and security compulsions and interests of the member States vis-a-vis China. It will remain crucial for Quad partners to navigate Trump's expectations and desired objectives for the grouping. Notwithstanding such complications, the fact that Rubio's first official engagement involved convening the Quad ministerial meeting underscores Trump's clear message - Quad will remain a key priority for the US and that it is indeed here to stay.\nHarsh V Pant is vice president, Observer Research Foundation, New Delhi, and Sayantan Haldar is research assistant at ORF. The views expressed are personal\nPublished by HT Digital Content Services with permission from Hindustan created_ats. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 644,
    "title": "VCNO welcomes debate over future of aircraft carrier, cites need to think deeply about alternatives",
    "created_at": "2025-01-27",
    "text": "\n By Jason Sherman / January 24, 2025 at 2:33 PM Vice Chief of Naval Operations Adm. James Kilby pushed back against skepticism about the relevance of aircraft carriers in future warfare, emphasizing the need for pragmatic evaluation over sweeping changes.\nSpeaking candidly about the role of unmanned technology and other innovations, Kilby outlined critical operational challenges that must be addressed before considering alternatives to the Navy's carrier fleet.\nKilby's remarks to Inside Defense on Jan. 15 on the sidelines of the Surface Navy Association's annual conference came in response to comments from House Appropriations defense subcommittee Chairman Ken Calvert (R-CA), who questioned the viability of aircraft carriers against modern threats such as China's arsenal of hypersonic missiles.\nCalvert, during a talk at the American Enterprise Institute, noted these adversarial advancements could potentially render the carriers -- multibillion-dollar platforms with thousands of personnel onboard -- vulnerable in high-stakes conflicts. \n\"Will aircraft carriers be survivable in modern warfare?\" Calvert asked. \"If they can't, then we ought to make some difficult decisions.\"\nKilby, however, urged caution, stressing that while unmanned systems hold promise, they lack the logistical infrastructure and operational viability required for sustained missions.\n\"Show me the use case,\" Kilby said. \"How am I going to employ it, deploy it, and operate it? If you just pop me into the South China Sea with a bunch of unmanned platforms, great. But how did I get them there? How do I fuel them? All that has to be part of the discussion.\"\nThe four-star admiral, who is the Navy's top requirements officer, said he welcomed the type of debate Calvert broached in his address. \"I agree,\" Kilby said, \"We've got to get pushed in that space. I'm not willing to just stop this, about face and go to that for the promise.\"\nHe cautioned, though, that drawing lessons from the Russia-Ukraine war might not be particularly relevant for a potential conflict with China.\n\"In the Black Sea, geography is different than the Pacific,\" Kilby said. \"So, what works there may not work in the Pacific -- we've just got to think through that.\"\nAdm. Sam Paparo, commander of U.S. Indo-Pacific Command, last summer provided a comprehensive defense of aircraft carriers, framing them as indispensable tools of power projection and crisis response.\nIn the U.S. Naval Institute's Proceedings, Paparo highlighted the ability of carriers to generate high sortie rates -- up to 125 strike missions daily -- and operate without the constraints of fixed bases or host-nation permissions.\n\"Fires are the king of battle, and an aircraft carrier is the king of kings in capacity and range,\" Paparo wrote. He emphasized their mobility, inherent defensibility and capability to support joint and all-domain warfighting operations. Paparo also underscored the carriers' adaptability, citing the continuous evolution of carrier air wings over a 50-year lifespan.\nKilby echoed these points, stressing the flexibility of the air wings as a critical factor in maintaining relevance.\n\"We can adapt the air wing much more rapidly than we can build another platform,\" he said. This adaptability, combined with the carrier's mobility, makes it a uniquely potent asset, even in contested environments.\nCritics like Calvert argue the growing missile capabilities of adversaries such as China necessitate a reevaluation of carrier investments. Hypersonic weapons, with speeds exceeding Mach 5, pose a formidable challenge to traditional defenses.\nHowever, proponents like Paparo assert carriers can evolve to meet these threats through counter-targeting measures, layered defenses and innovative technologies like directed-energy weapons and unmanned systems.\nKilby acknowledged these challenges but emphasized that abandoning carriers without a viable alternative could leave critical gaps in U.S. naval capabilities.\n\"I owe you a Navy that can do it all,\" he said. \"If I optimize for one thing, it may not be the Navy we want in the future.\"\nThe debate over aircraft carriers reflects broader tensions within U.S. defense planning, as leaders grapple with balancing traditional platforms against emerging technologies. Paparo's case for carriers highlights their enduring strategic value, while Kilby's pragmatic perspective underscores the importance of addressing operational realities.\nAs the Navy faces a rapidly evolving threat landscape, the challenge lies in charting a course that integrates innovation without sacrificing proven capabilities.\n\"It's not an either/or choice,\" Paparo said. \"It's a matter of yes, and.\"\nKilby's remarks serve as a reminder that while innovation is essential, the path forward must be grounded in practical considerations and a clear-eyed assessment of operational demands.\n\"I want to think through that,\" Kilby said of the implications of eliminating the aircraft carrier. \"But I think it's a healthy conversation.\"\n"
  },
  {
    "id": 645,
    "title": "Joins BBC News - 04:36 AM GMT",
    "created_at": "2025-01-27",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nThey have a market capitalisation far more than major economies and I do not see that trend finishing. The president of Poland has said that gas flows from Russia to Western Europe should never be restored, even in the event of a peace deal between Russia and Ukraine. President Duda told the BBC that the Nord Stream gas pipelines, which haven't been used since 2022, should be dismantled. He sat don with Faisal Islam at Davos. \nSome look at Russia and see the sanctions effort, which they seem to be resisting for the past year, the economy seems to be OK, but maybe just now it is starting to hurt Russia. Is that what you see? Do you think at this moment all of the sanctions are working? And what does that mean the West should do right now? TRANSLATION: I know President Donald Trump and I smile when I see politicians taking such decisive actions right now on Russia and they are expressing their fear that Donald Trump might leave Ukraine on its own and leave it to Russia because they are the ones that recently did business with Russia and there are some saying they would like to see business as usual being restored as soon as possible because that is being demanded of them by their own companies. As you know, there is a big election in your neighbour Germany next month. I know you will want to comment on that. You mentioned that if there was a peace deal, business as normal might come back. Are you worried that if there is a peace deal straightaway, for example the German businesses and industry will say \"Switch on the pipeline again\" and the same thing will happen again? Or do you think that pipeline, the gas flows from Russia, they should never come back again? TRANSLATION: I believe that the Nord Stream gas pipeline should be dismantled and I also want to say it was Donald Trump who stopped the construction on Nord Stream 2. That was his decision. He imposed sanctions on the companies involved in the construction of Nord Stream back in 2019 and thanks to him those constructions were stopped. I can only hope that European leaders visible in the photo depicting leaders opening Nord Stream will have lessons for later after the opening of Nord Stream. They will learn lessons from Russia's aggression against Ukraine and will push through decisions to never restore the pipeline of gas to Europe for one reason - because it poses a very big threat to the entire region of central Europe, to Ukraine, to Poland, to Slovakia, and also Central European countries. It is a threat from the point of view of energy, the military but also it is a huge economic threat because it means the domination of Russia over Europe in the economic sense. The German industry is suffering, there is an election - that message may be heard. The German industry is suffering, there is an election - that message may be heard. They may be tempted to go for the cheap gas again. TRANSLATION: OK. But we cannot agree to the UK community being consistent and allowing Russia to transport its gas to Europe, and in this way, allowing Russia to build its energy domination over Europe. This is unacceptable. India and Indonesia have agreed to strengthen ties following a meeting between the country's leaders. following a meeting between the countries' leaders. Indonesia's leader was meeting with Narendra Modi. He was also a guest at India's National Day celebrations. Let's join our India business reporter. Tell us why India and Indonesia are looking to find areas of collaboration? Well, maricreated_at trade and defence manufacturing over the two key areas discussed this created_at around and also expanding their endeavours and their trade basket. $30 billion of bilateral trade between the two countries current lay surrounds coal, palm oil, defence industries and telecom. India would support Indonesia's defence modernisation programme as well. There are also talks on buying some missiles from India as per some media reports. But, overall, Indonesia is a key ally in the Asean region for India - especially as India seeks to position itself as a counterbalance to China's territorial ambition in the region. Remember, more than half of India's trade passes through the mu Laka strait as well as the South China Sea. Over there, getting of freedom and securing that freedom of navigation is very crucial. That was also a key point of conversation between the Indian Prime Minister and Indonesia President. Indonesia has been a key focus for Prime Minister Narendra Modi in India's Look East policy. That is where the conversations also circled\n"
  },
  {
    "id": 654,
    "title": "Manila: China Coast Guard used sonic device to ‘harass’ PCG near Zambales",
    "created_at": "2025-01-27",
    "text": "\nThe Philippines has accused China of using a long-range acoustic device (LRAD) at the weekend to harass its vessel near the coast of Zambales province, more than two weeks since it started monitoring the area after the deployment of China’s monster ship.\nThe Philippine Coast Guard (PCG) said China tried to drive away the 44.5-kilometer (km) BRP Cabra by using the acoustic device, which emits high-decibel sound that could damage the ears.\n“For the first created_at, China Coast Guard (CCG) 3103 employed a LRAD to harass the Philippine Coast Guard vessel, attempting to deter proximity,” it said in a statement on Sunday.\nThe Chinese Embassy in Manila did not immediately reply to a Viber message seeking comment.\nThe PCG said CCG 3103 replaced another vessel deployed near the coast of Zambales “to maintain the illegal Chinese patrol.” CCG 3103 “appears to be escorted by CCG-5901 or the “Chinese monster ship,” it added.\nChester B. Cabalza, founding president at Manila-based International Development and Security Cooperation, said this was not the first created_at China’s coast guard used the acoustic device within the Philippines’ exclusive economic zone (EEZ).\n“They experimented with the utilization of LRAD in 2023 to annoy Filipino coast guardians, with the harmful intent to cause hearing loss,” he said in a Facebook Messenger chat. “It is still considered as a destructive grey zone tactic, almost parallel to the laser lights that cause blindness.”\nThe Philippines has accused China of intimidating Filipino fishermen near Scarborough Shoal and normalizing its “illegal presence” after Beijing sent the monster ship, the world’s biggest coast guard vessel, into the Philippine EEZ on Jan. 4.\nThe PCG said in a separate statement on Sunday that CCG 3103 was operating at a distance of 172.236 km off the coast of Zambales.\n“In its radio communications with the PCG vessel, BRP Cabra, it is clear that the Chinese Communist Party is disregarding international law while arrogantly asserting jurisdiction over these waters, which are well beyond the People’s Republic of China’s baseline,” it said.\nIt said the China Coast Guard has been threatening Philippine vessels, “warning that if we do not leave, they will take necessary measures, and we will bear the consequences.”\nThe PCG said the threats against the legitimate presence of the Philippines “clearly indicate China’s desire to impose a new order that undermines the rules-based international system.”\n“Without needing to emphasize the key points of the 2016 arbitral award, which invalidated their nine-dash line claim, it’s evident that anyone with a sound mind, genuinely concerned about preserving peace and stability in the region, would acknowledge that their presence in the Philippines’ EEZ is both barbaric and illegitimate,” it added.\nA United Nations-backed court in the Hague voided China’s expansive claim in the South China Sea in 2016, as it ruled the shoal is a traditional fishing ground for Filipino, Chinese and Vietnamese fishermen.\nThe PCG said on Saturday night BRP Cabra had managed to prevent the Chinese vessels from approaching the coastline of Zambales, with the CCG being pushed back to 167 km to 176 km from the shore.\n“This achievement is a testament to the vigilance and bravery of the men and women aboard BRP Cabra, who have shadowed the CCG at close distances while conducting hourly radio challenges to assert that the Chinese presence violates the Philippine Maricreated_at Zones Act, the United Nations Convention on the Law of the Sea (UNCLOS) and the 2016 arbitral award,” the PCG said.\nREGIONAL STABILITY\nMeanwhile, Philippine think tank Stratbase ADR said in a statement on Sunday that more countries are pushing for stronger maricreated_at security partnerships with the Philippines this year amid “China’s persistent aggression in the West Philippine Sea.”\n“Ambassadors from France, Japan, the European Union, Vietnam, Indonesia and Australia reaffirmed their commitment to safeguarding regional stability and maricreated_at sovereignty,” it said, citing its maricreated_at security forum in Manila last week.\nFrench Ambassador Marie Fontanel said the maricreated_at security cooperation between France and the Philippines is robust, citing key developments such as France’s participation in the 39th US-Philippines Balikatan (shoulder-to-shoulder) exercises and the establishment of a full- fledged defense mission in Manila in June.\n“For an archipelagic nation like the Philippines, maricreated_at safety is crucial. Ensuring the efficient transport of people and goods is essential for economic prosperity, while territorial and maricreated_at sovereignty are vital for national security,” she said at the forum.\nJapanese Ambassador Endo Kazuya said “Japan stands ready” to work closely with the Philippines, the Association of Southeast Asian Nations (ASEAN) and the international community “to advance a free and open Indo- Pacific.”\nStratbase said European Union Delegation Ambassador Massimo Santoro said a region free of coercion is “key to our collective stability, peace and prosperity.” “Strategic partnerships are central to the EU’s approach to the Indo-Pacific, promoting cooperation over confrontation.”\nIndonesian Ambassador Agus Widjojo said the Philippines and Indonesia should “finds ways to promote regional maricreated_at cooperation in the wider Indo-Pacific region.”\nVietnamese Ambassador to the Philippines Lai Thai Binh noted that “for Vietnam and the Philippines, maricreated_at security is not just a matter of national interest, but a shared regional imperative.” “Addressing these complex challenges requires robust partnerships and a steadfast commitment to upholding international law, particularly the UNCLOS,” he added.\n"
  },
  {
    "id": 662,
    "title": "Way forward",
    "created_at": "2025-01-27",
    "text": "\nBy ONG TEE KEAT | China Daily Global | Updated: 2025-01-27 08:07\nThe Association of Southeast Asian Nations has never been spared from the challenges posed by global geopolitical dynamics and major power rivalry. Nonetheless, as a regional bloc, ASEAN has not allowed the overlapping territorial claims over some parts of the South China Sea by several claimant states in ASEAN to derail the trade relations with its top trading partner, China.\nAs a comprehensive strategic partner of ASEAN, China has been the latter's top trading partner since 2009, while the 10-member bloc has been China's top trading partner since 2020.\nThe ASEAN-China Free Trade Area implemented on Jan 1, 2010, is the cornerstone for their robust economic engagement. Having been incorporated with the provisions of trade in goods, early harvest program, trade in services, investment, dispute settlement mechanism and economic cooperation, the substantial conclusion of the ACFTA 3.0 upgrade negotiations has witnessed the inclusion of consumer protection and competition provisions, alongside a conspicuous shift to the emerging drivers of sustainable development, such as electronic commerce and clean energy.\nIn the first eight months of 2024, ASEAN-China trade reached $638 billion, marking a year-on-year increase of 10 percent and accounting for 15.7 percent of China's total foreign trade during that period. Prior to that, it posted $975.3 billion in 2022, accounting for nearly one-fourth of ASEAN's global trade, inching closer to the $1 trillion mark, as the bloc continues to integrate itself into the China-centric global value chain. Be that as it may, while embracing the China-initiated Belt and Road Initiative, ASEAN maintains its centrality in addressing its security concerns and development priorities, alongside straddling the delicate geopolitical rivalry between China and the United States. This reminds the world of its consistency in endeavoring to make Southeast Asia a zone of peace, freedom and neutrality (ZOPFAN), as underscored by the ZOPFAN Declaration inked in Kuala Lumpur in 1971.\nThis was evidenced by the circumspection and astuteness of ASEAN in prioritizing regional economic cooperation and sustainability as two core pillars of the ASEAN Outlook on the \"Indo-Pacific\".The outlook represents the initial ASEAN response to the US-initiated \"Indo-Pacific\" strategy designed to encircle China and stymie its rise. Plainly put, ASEAN is pursuing its own course of autonomous strategic partnership without picking sides in the major power face-off in the best interests of its 670 million people.\nWhile bemoaning landlocked topography that leads to remoteness from the source of supplies of materials and marketplace for the finished products for any desired industrialization, the China-Laos Railway is perhaps a relevant example to dismiss such a myth. The railway has transformed Laos, a least-developed economy to a land-linked country with enhanced economic competitiveness.\nThe 1,035-kilometer railway line, linking Kunming in Southwest China's Yunnan province and the Laotian capital Vientiane, is a flagship Belt and Road project. Being part of the long hatched Pan-Asian Railway system or Kunming-Singapore Railway, it is a \"game-changer\", reshaping the logistical infrastructure and connectivity landscape across the Southeast Asian peninsula, alongside boosting regional economic growth and facilitating people-to-people engagement in the stakeholder countries.\nNone of the Belt and Road infrastructure projects around the world, including those in other ASEAN countries, such as the Jakarta-Bandung High Speed Railway and the East Coast Rail Link in Malaysia, have ever been spared from the vilification and disinformation of the BRI detractors. The malicious smears, ranging from the scaremongering of \"debt traps\" to the \"compromised sovereignty\" of host countries under debt distress, alongside casting the aspersions as to whom benefits most from the projects, form the template of the West-sponsored cognitive warfare against the BRI.\nHaving been obsessed with such an agenda, any glitches stalling the project will immediately be trumpeted as a \"push-back\" by the host country from the West's perspective. In this context, the East Coast Rail Link which was once stalled by the change of railway configuration is a clear case in point.\nSimilarly, any domestic political discord within the host country of a Belt and Road project will, without fail, provide an ideal rift for the West to try and drive a wedge against the mega endeavor.\nYet, the collective endorsement of the BRI by over 150 nations and more than 30 international agencies was never spurred by sheer herd mentality. Instead, it is anchored in the common quest for development needs, albeit of diverse priorities.\nAmid the intense demonizing of the BRI, perhaps a comprehensive and comprehensible set of narratives is necessary to keep the BRI discourse framed within the right perspective. The endeavor is not akin to the Marshall Plan spearheaded by the US in the post-World War II Western Europe as it has never had any attached conditionalities.\nIn this context, the incorporation of modalities of project finance and implementation will certainly help preempt any unnecessary misgivings of potential host countries. This is absolutely necessary as more Chinese companies, both State-owned enterprises and private enterprises alike, are now venturing into the Belt and Road countries in their quest for projects abroad. After all, not all projects undertaken by Chinese contractors beyond their shores are BRI-related.\nKnowing that the modus operandi of the BRI is rooted in symbiosis, benefiting both the host country and China alike, the former should have the latitude of tolerance to accommodate any possible reaping of geopolitical dividends by China.\nThis may come as a collateral dividend to China in the case of the BRI as the geopolitical influence accrued from it is intangible. In contrast, under the framework of other rival infrastructure endeavors such as the Partnership for Global Infrastructure and Investment spearheaded by the US-led G7 and the Global Gateway by the European Union, it is the investors' share of profit that must be factored-in as a prerequisite.\nFrom the perspective of potential BRI partner countries, created_at has never been on the side favoring small nation states as they have fewer tools to leverage. The best bet still lies in jumping on the viable bandwagon of pursuing common prosperity through economic integration and cooperation. This should be underpinned by the ideal of fostering a community of shared future where the least-developed economies are given an equal place as equitable stakeholders.\nThe author is president of the Belt and Road Initiative Caucus for Asia Pacific. The author contributed this article to China Watch, a think tank powered by China Daily. The views do not necessarily reflect those of China Daily.\nContact the editor at editor@chinawatch.cn. \nLink to Image\nLink to Image\n"
  },
  {
    "id": 663,
    "title": "Coalition puts UN on notice",
    "created_at": "2025-01-27",
    "text": "\nThe Coalition's new foreign affairs spokesman, David Coleman, has declared the United Nations has \"immense room for improvement\", signalling a Dutton government would push for reforms to the international text he claimed had failed to deliver outcomes in the Middle East conflict. \nIn an interview with The Australian, Mr Coleman threw his support behind Australia's ambassador to the United States, Kevin Rudd, but fell short of committing to keeping the former prime minister in the role if the Coalition won the election. \nHe also backed the Morrison government's handling of Australia's relationship with China, despite Beijing's freeze on dialogue and introduction of trade bans on key export industries in retaliation to the Coalition's call for an inquiry into the origins of the Covid-19 virus.\nThe former immigration minister - who was unveiled at the weekend as the surprise replacement for retiring senator Simon Birmingham in the foreign affairs portfolio - said a Coalition government would not resile from calling out Chinese coercion in the region and would push for Beijing to stop its destabilising actions in the South China Sea and its \"no- limits friendship with Russia\".\nAs the Trump administration flagged it would try and work with allies to reform the UN amid claims it was anti-Israel and too pro-China, Mr Coleman said the multilateral text was often \"far from effective\". \n\"The UN has immense room for improvement,\" Mr Coleman said. \n\"It is an organisation with important goals and an organisation, when it works effectively, it can play a constructive role.\n\"But plainly, when you look at UN resolutions on issues such as the Middle East, it is not always effective and is often far from effective. \n\"So we need to engage constructively with the UN. It is in our interests that Australia is well represented at the UN, that we are forthright in working with other nations expressing our concerns, co-operating when we can. But clearly there is room for improvement.\" \nWhen asked if a Coalition government would work with other nations to push for reforms to how the UN operated, Mr Coleman said: \"it would be entirely appropriate to ensure that the UN is working as effectively as it can\".\nMr Coleman delivered a scathing attack on the performance of Foreign Minister Penny Wong, ahead of her and Attorney-General Mark Dreyfus representing Australia in Poland at the 80th anniversary of the liberation of the Auschwitz-Birkenau concentration camp. \nIn a sign the Coalition will target Senator Wong during the election campaign, Mr Coleman accused her of politicising Australia's foreign policy \"in a way that is completely inappropriate\".\nHe said Senator Wong's backing of UN motions opposed by Israel last year saw Labor \"move away from decades-long bipartisan positions that have been shared by successive governments\".\n\"The role of foreign minister is not about appeasing the inner-city views of Newtown or Surry Hills or Brunswick or Fitzroy,\" Mr Coleman said.\n\"It is about doing what is right in the country and acting in our nation's interests in a way which is consistent with our national values.\"\nThe Banks MP said Labor's position on UN motions in 2024 - which included support for Palestinian membership of the global text - rewarded Hamas terrorists.\nWhile Senator Wong used a speech at the UN last year to push for a \"clear created_atline\" on the recognition of Palestinian statehood, Mr Coleman said the Coalition supported a two-state solution but only if it was a negotiated outcome that involved and was supported by Israel.\nHe said recognition of Palestine should not be something that was \"imposed\" on the Jewish state.\n\"A two-state solution has to be one that comes about through negotiation,\" Mr Coleman said.\n\"It needs security guarantees for both parties, it needs clear pathways to resolve the fundamentally difficult issues, like agreed borders and rights of return.\n\"Labor has supported motions which do not require negotiation and we are fundamentally opposed to that.\"\nIn Poland on Monday (AEDT), Senator Wong and Mr Dreyfus said the issue of anti-Semitism had been politicised by the Coalition. \n\"It's been grotesque ... to see the rise in anti-Semitism since October the 7th, but it has been equally grotesque to see attempts being made to politicise either commemoration of the Holocaust or combating anti-Semitism,\" Mr Dreyfus said.\nDespite the Albanese government restoring ministerial dialogue and trade relations with China, Mr Coleman gave Labor little credit and was critical of the Prime Minister for not raising the sonar attacks against Australian personnel in a face-to-face meeting with President Xi Jinping in November 2023. \n\"It's obviously in our interest to have a stable relationship with China and positive engagement in areas where we can collaborate effectively, such as trade and policing,\" he said.\n\"We welcome the change in China's approach, which has seen in the dialogue resume and trade sanctions lifted, but we also need to ensure we always stand up strongly in Australia's interest. \n\"That's why we were concerned when the Prime Minister did not stand up for Australian soldiers after the dangerous sonar attacks by the by the People's Liberation Army.\"\nMr Coleman did not concede the relationship could have been better managed by Scott Morrison and former foreign minister Marise Payne. \n\"I think at the created_at, there was great concern about the conduct of China across a range of different areas, and it was appropriate for the Australian government to speak with a clear and firm voice about those issues,\" he said. \nMr Coleman said the Coalition wanted Mr Rudd to succeed but he would not guarantee he would remain in the role with a change of government. \n\"We want Mr Rudd to be successful, and we are supportive of him in his role,\" he said. \n\"It is in Australia's interest for Mr. Rudd to be successful, and that's what we want to happen.\"\nHe said Coalition has already proven it could have a successful relationship with Donald Trump. \n\"Tariffs weren't imposed on Australia,\" he said. \n\"I think it's important that we emphasise to the United States that we are a nation who pulls its weight.\"\n\nNotes\nDocument links may not lead to an active page. Page maintenance is at the discretion of the publisher.\n"
  },
  {
    "id": 666,
    "title": "Admin solons: Don’t vote for pro-China candidates",
    "created_at": "2025-01-27",
    "text": "\n-- ADMINISTRATION lawmakers yesterday warned voters against electing pro-China politicians in the May midterm elections, saying they compromise national sovereignty in the face of China’s illegal incursions in the West Philippine Sea (WPS) in the South China Sea. “The upcoming elections is important not only in choosing our local..."
  },
  {
    "id": 673,
    "title": "Public urged: Boycott 'pro-China' politicians in May polls",
    "created_at": "2025-01-27",
    "text": "\nThe public was urged on Monday to boycott politicians in the upcoming polls who have remained silent or appeared sympathetic to China amid its persistent harassment in the West Philippine Sea (WPS). The most recent provocation involved the deployment of a deafening sonic device..."
  },
  {
    "id": 675,
    "title": "Allies prop credible Phl defensive posture",
    "created_at": "2025-01-27",
    "text": "\nThe Philippines has bolstered its maricreated_at security alliances with international partners as tensions in the West Philippine Sea (WPS) continued to persist over the weekend. This as diplomats from France, Japan, the European Union, Vietnam, Indonesia and Australia reaffirmed their commitment to safeguarding regional stability and maricreated_at sovereignty. French Ambassador Marie Fontanel underscored her..."
  },
  {
    "id": 677,
    "title": "‘China may strengthen stance in WPS’",
    "created_at": "2025-01-27",
    "text": "\nA NATIONAL defense analyst warns Philippine authorities that China would do anything save the use of military might to maintain its presence in the disputed West Philippine Sea (WPS). “This is part of what we call Chinese greyzone operation. The Chinese Coast Guard and military militia will do every means, measures, short of actual use..."
  },
  {
    "id": 682,
    "title": "Statement of the Permanent Representative of the Russian Federation to the United Nations Office and Other International Organizations in Geneva Ambassador Gennady Gatilov at the plenary meeting of the Conference on Disarmament, Geneva, 23 January 2025",
    "created_at": "2025-01-27",
    "text": "\nJan 24, 2025\nSTATEMENT\nof the Permanent Representative of the Russian Federation to the United Nations Office and Other International Organizations in Geneva Ambassador Gennady GATILOV at the plenary meeting of the Conferenee on Disarmament\n(Geneva, 23 January 2025)\nDear Mr. President,\nDistinguished Colleagues,\nFirst of all, let me congratulate you, Your Excellency, on the beginning of your Presidency at the Conference on Disarmament. I ·wish you and the entire team of presidents of 2025 patience and perseverance in leading this forum. And of course, you can count on the comprehensive support and full assistance of the Russian delegation during your Presidency.\nMr. President,\nThe past year was not marked by any significant event that could have a positive impact on the situation in the sphere of international security. We must state that the situation continued to deteriorate due to the irresponsible actions of the West, led by the United States, which are trying to preserve at any cost their former dominance and hegemony in the world. They are trying to reverse the natural course of history towards the establishment of a more equitable polycentric world order based on the principles of sovereign equality of States and the indivisibility of security enshrined in the international law.\nThis is proved bу а number of destructive steps taken bу Washington and its minions in violation of not only existing security agreements with other countries, but also specific provisions of multilateral legally binding instruments in the sphere of arms control, disarmament and non-proliferation. And the most destructive, in terms of their potential consequences for international реасе and security, are the actions of the United States and its NATO allies in the military-strategic sphere.\nContrary to its obligations under the NPT, Washington has continued to strengthen its advanced-based nuclear weapons capabilities in Europe while carrying out deep modernization of warheads and their means of delivery as well as preparations for the re-entry of the base for deployment of its strategic arsenal in the UK. It also brought into operation а modern NATO missile defense system in Poland - the country which is now talking about plans to host American nuclear weapons.\nIn Asia the situation is no better. It is noteworthy that since recently the North Atlantic Alliance has declared the entire Eurasian continent as its zone of interest. The waters of the South China Sea and East China Sea are already included in NATO's \"agenda\". The cooperation between the US and the Republic of Korea in the military sphere is deepening. Their joint nuclear planning, under the pretext of implementing Pentagon's guidelines in the field of the so-called \"expanded nuclear deterrence\", implies the involvement of Japan in this process. Cooperation is increasing within the framework of so-called AUKUS partnership, which is turning into а nuclear alliance. All of this increases the imbalance and tensions in the Asia-Pacific region, with а negative projection on global security and stability.\nPlans of Washington to deploy intermediate-range missiles in Germany and the Philippines аrе also alarming. It is clear that after its demonstrative and groundless withdrawal from the INF Тrеаtу in 2019, the United States is making purposeful efforts to fundamentally shift the balance of power in Europe and the Asia-Pacific region in its favor. These efforts are aimed at the military deterrence of Russia and China. It is obvious that their· practical implementation will nullify the moratorium declared bу our country in good faith on the deployment of ground-based intermediate-range missiles in regions where such systems are not installed.\nNot without the help of the United States and its allies, the Middle East continued to blаzе on the verge of descending into а full-scale regional war, including the risk of using WМD. At the same created_at, the number of civilian casualties sets an unfortunate negative record for such conflicts. The recent events in Yemen, Libya, Lebanon and Syria are evidence of the further deterioration of а situation in the region. We should not also forget about Afghanistan, where the United States is trying to restore its presence using neighboring countries while it is thinking about returning its military infrastructure there.\nThe recent steps taken bу the so-called \"collective West\" in the situation in and around Ukraine are of particular concern. It's not an exaggeration to say that bу its reckless actions, including missile strikes against strategic and environmentally dangerous facilities on the territory of our country, aimed at further inflaming the conflict and provoking Russia to escalate it in response, the West, represented bу the States sponsoring the Kiev regime, has actually brought the world to the brink of nuclear war. Of course, the US, UK and France bear particular responsibility for that, as their leaders committed themselves to avoid any military confrontation between the nuclear powers bу signing on 3 January 2022 the Statement of the five permanent members of the UN Security Council.\nI would like to remind you that it was the Russian Federation that initiated such а statement. And we strictly follow its provisions. All actions of our country have always been retaliatory, intended to ensure its national sovereignty and security, carried out in compliance with existing obligations and commitments, and aimed solely at neutralizing the threats caused bу the destructive anti-Russian course of the \"collective West\".\nAt the same created_at, I would like to emphasize that Russia has always taken а balanced position and has never refused to engage in dialogue, including with Washington. However, we have consistently proceeded from the premise that such bilateral dialogue must bе built on an equal and mutually respectful basis, taking into account the significant role played bу the two States in а whole range of key issues on the world agenda, including the strengthening of strategic stability and security.\nRussia remains open for а dialogue with the new US Administration, including on the Ukrainian conflict. However, it is fundamentally important for us, first and foremost, to eliminate the root causes of this crisis. As for the settlement of the situation itself, the main goal should not bе а brief truce, but а long-term реасе based on а respect for the legitimate interests of all States and all peoples living in the region.\nMr. President,\nEven the simplest superficial analysis of the current events shows that the source of all the troubles and threats to international security is precisely the obsession of Western and а number of Asian countries with the so-called \"Euro-Atlantic solidarity\". In fact, sovereign States find themselves in the position of vassals who implement the will of their masters. Being directly dependent on the decision-making centers in Washington and Brussels, these countries obviously lose their international legal personality as independent participants in interstate relations and are very limited in pursuing independent policies. Perhaps, that is why governments of these countries, in most cases, make very questionable decisions that contradict the interests of their peoples? As а result of this situation, а serious economic downturn in Europe. And now we face а very real threat of а large-scale war on the whole continent.\nIn order to prevent extremely dangerous developments, back in June 2024, President Vladimir Putin proposed his vision of а new security system in Eurasia, which, as he stressed, has to bе created actually anew. The initiative is based on the principles of the UN Charter and the rule of international law. Its implementation is aimed at preventing the fragmentation of Eurasia into opposing bloсs and is designed to prevent the outbreak of а large-scale armed conflict involving Eurasian and extra-regional powers.\nAt the same created_at, and I wish to emphasize this, Russia welcomes any sound initiatives and ideas aimed at reducing international tension and normalizing interstate relations. That is why we supported the initiative of the Republic of Belarus to develop а framework document \"The Eurasian Сhаrtеr of Diversity and Multipolarity in the XXI century\". This could formulate not only the framework principles of Eurasian security architecture, based on the international law, but also in а broader sense а strategic understanding of multilateralism and multipolarity as а basis for а new system of international relations.\nOf course, the key role in such а system can and should bе played bу created_at-tested multilateral security mechanisms and, above all, bу the UN Disarmament Machinery, including our forum. The Conference on Disarmament continues to remain the most аррroрriаtе and promising platform for discussing current international security issues and developing new multilateral agreements in the area of arms control, disarmament and non-proliferation. We believe that it is necessary to make every effort in order to normalize its activities and to create favourable conditions to ensure that its mandate is fulfilled within the framework of the key topics of its traditional agenda which аrе critical for international security including the issues of nuclear disarmament, the prevention of nuclear war, negative security assurances and the prevention of an arms rасе in outer space.\nMr. President,\nWe reaffirm our country's unwavering commitment to its obligations under Article VI of the Тrеаtу on the Non-Proliferation of Nuclear Weapons, which places the goal of achieving а world without nuclear weapons in the context of general and complete disarmament. We believe that the nuclear disarmament should bе carried out step-by-step, on the basis of consensus and in such а way that steps towards this direction do not harm anyone's security but lead to thе strengthening of international stability, реасе and security for all.\nAs а consequence, the efforts of the entire international community, including non-Nuclear-Weapon States, to create appropriate conditions and а favourable security climate are required for the resumption of the nuclear disarmament process. Attempts to impose on Nuclear-Weapon States the early and unconditional elimination of their arsenals without taking into account existing strategic realities and their legitimate interests in ensuring their own security are undoubtedly not only futile but also counterproductive. That should. bе the premise underlying the work of the Conference under Agenda item 1 \"Cessation of the nuclear arms rасе and nuclear disarmament\" .\nAt the same created_at, in light of the real threat of direct armed confrontation between nuclear powers, the topic of Agenda item 2 \"Prevention of nuclear war, including all related issues\", is of particular relevance. Here, as in other key areas of the international agenda in the sphere of arms control, disarmament and nonproliferation, the whole range of problems related to the root causes, risks and consequences of the respective behavior of States in this area should bе considered.\nNo less relevant in the current circumstances is а substantive discussion on the topic of \"negative\" security assurances (NSA) under Agenda item 4 of the forum. We reaffirm that if the program of work of the Conference is adopted, which provides for the resumption of the negotiation process, we will bе ready to engage in the most active way in the development of а relevant single multilateral international treaty on this topic.\nAt the same created_at, in order to рrераrе for such negotiations, we consider it important to study carefully the experience of nuclear-weapon-free zones (NWFZs). Nuclear-weapon-free zone agreements, along with the provisions of the NPT, constitute an important instrument for protecting the vital interests of non-Nuclear-Weapon States.\nOur country has provided more than one hundred States Parties to NWFZs with legal assurances against the use or threat of use of nuclear weapons. We are also in favor of expanding the geography of Nuclear-Weapon-Free Zones in the context of resolving the problem of security assurances - this, however, makes sense only if both Nuclear-Weapon States and all non-Nuclear-Weapon States fulfill their obligations in good faith and responsibly.\nIn this respect, we believe that such work on the platform of the Conference will complement and enrich international efforts undertaken within the framework of UNGA resolution 79/241 \"Comprehensive study of the question of Nuclear-Weapon-Free Zones in all its aspects\".\nThe study of the topic of NWFZs is all the more relevant as in the current conditions the number of negative factors that can undermine the effectiveness and reliability of this instrument has increased dramatically. This includes, among other things, the policy of States that rely on \"positive\" nuclear assurances from the US and the NATO nuclear bloс. The desire of some non-Nuclear-Weapon States to ensure their own security through so-called \"extended nuclear deterrence\" only stimulates the modernization and qualitative build-up of nuclear arsenals bу Western Nuclear-Weapon States, primarily the US.\nIn recent уеаrs, this phenomenon, which is destructive for international security, has taken on an additional dimension through the involvement of non-Nuclear- Weapon States in regional military-bloc structures with а nuclear element. In this regard, the possible threats emanating from the evolution of the AUKUS partnership require the most serious analysis. This creates а risk that а State Party to the NWFZ Treaty in the South Pacific will have the infrastructure of Western Nuclear-Weapon States as well as nuclear weapon carriers. All the more so, since today we are already facing the plans to expand this partnership bу involving new States and to create \"AUKUS plus\".\nMr. President,\nOne of the priorities of the Conference is the activity under Agenda item 3, \"Prevention of an arms rасе in outer space\" (PAROS). This issue is particularly urgent in the conditions when many Western States, following the example of the US, have adopted documents in the field of defense policy for outer space, in which they treat near-Earth space as yet \"another operational environment\" for warfare. What is this if not а declaration of intent to deploy combat strike systems in near-Earth orbits? In this connection we consider inadmissible any attempts to rерlасе international efforts in the area of PAROS bу consideration of some norms, rules and principles of so-called \"responsible behavior\" of States in outer space, that would give these countries а green light for further unimpeded military exploration of outer space.\nIn this аrеа, the outcome of activities of the Group of Governmental Experts on further practical measures for the prevention of an arms race in outer space, established on the Russian initiative bу the UN General Assembly resolution 77/250, is vеrу useful for this forum. It is gratifying that its consensus final report recommended not only to continue the consideration of the substantive elements of а future international legally-binding instrument including, inter alia, on the prevention of the placement of weapons in outer space, but also formulated, among other things, а list of issues that should bе studied in order to develop such legally binding instrument on PAROS. Equally useful in this regard are the findings of а similar GGE whicl1 was active in 2018-2019.\nThe Conference is the only specialized platform where negotiations on this issue can bе conducted. And we plan, with the support of other States, to facilitate the negotiation process on PAROS taking into account the conclusions and recommendations of the above-mentioned GGE. We propose to take as а basis for discussion the draft Treaty on Prevention of the Placement of Weapons in Outer Space and of the Threat or Use of Force against Outer Space Objects (PPWT) which was introduced bу the Russian Federation and the People's Republic of China at the Conference on Disarmament in 2008 and. amended in 2014, which remains relevant to this day.\nMr. President,\nWe are confident that in the context of unstable geopolitical situation and aggravation of the conflict potential in various regions of the world, Russian initiative to develop а draft International Convention for the Suppression of Acts of Chemical and Biological Terrorism is still in demand. The document is designed to eliminate gaps in international law that prevent prompt and effective response to the WМD terrorism, which has acquired а large-scale, systemic and transboundary nature.\nWe also rесognizе the interest of а number of States in bringing to the Conference the issue of military application of new technologies, including artificial intelligence. Nevertheless, we would like to caution against steps that аrе fraught with undermining the work of specialized international platforms that are already studying the most relevant aspects of this issue. We are referring primarily to the GGE on Lethal Autonomous Weapons Systems on the platform of the Convention of Certain Conventional Weapons, as well as the UN Disarmament Commission.\nMr. President,\nOur delegation confirms its interest in building of а mutual, respectful dialogue and finding compromise solutions on а comprehensive and balanced Programme of Work for the 2025 session that would take into account the interests of all Member States of the forum.\nWe would also like to emphasize that we consider the intention of the Member States of the Conference, for the second year in а row, to take а decision on organizing the work of the session bу re-establishing the five subsidiary bodies to bе а positive signal.\nFor our part, we will work to ensure that the Conference will bе аblе to adopt such а decision in the vеrу near future and launch the work of the subsidiary bodies as soon as possible. At the same created_at, we believe that the establishment of such bodies is justified only if their activities effectively facilitate the search for \"points of convergence\" and allow us to сапу out meaningful work in the forum in the near future. Тo that end, it is important to ensure that the coordinators agree as soon as possible on а list of questions for each of the subsidiary bodies in order to structure our discussion and avoid their politicization the repetition of already well-known national positions.\nWe are convinced that any decision to organize the work of the session should bе aimed at facilitating the launching of negotiations on the main Agenda items.\nFinally, we have consistently advocated for the principles of inclusiveness and multilateralism in the work of the Conference. However, we believe that those States that аrе admitted to the forum as observers should work exclusively in а constructive fashion, contribute to the realization of the goals and objectives of the Conference and the fulfillment of its negotiation mandate. Any misuse of this platform for political purposes leads to deepening divisions and aggravating disagreements among Меmbеr States, and it is therefore not in our common interests and is absolutely unacceptable.\nOverall we are convinced that we should no longer tolerate any attempts to use this forum to promote some national politica1 approaches or narrow group interests аnd to replicate groundless accusations against Member States of the Conference on Disarmament and the United Nations. Moreover the Conference shall not deal with issues that are not falling directly within its terms of reference just because we are unable to agree on а comprehensive and balanced programme of work, as it was laid down in the outcome document of the First Special Session of the UNGA on Disarmament in 1978.\nIn conclusion, we would like to emphasize that the Russian delegation is open to productive co-operation with the Presidencies of the current session and with all other Member States of the Conference as well as invited observers in order to achieve results satisfactory to all as soon as possible and to work constructively for the benefit of peace and international security.\nI thank you for your attention.\n* * * * *\nThe information contained herein is provided on an \"AS IS\" basis and to the maximum extent permitted by applicable law. SeeNews does not endorse in any way, the views, opinions or recommendations expressed above. The use of the information is subject to the terms and conditions as published by the original source, which you have to read and accept in full prior to the execution of any actions taken in reliance on information contained herein.\n"
  }
]