[
  {
    "id": 692,
    "title": "WHAT DOES DEEPSEEK SAY ABOUT THE SOUTH CHINA SEA?",
    "created_at": "2025-01-28",
    "text": "\nThe following information was released by Radio Free Asia:\nChina's homegrown open-source artificial intelligence model DeepSeek and its newly launched AI-assisted chatbot are making waves on the global tech scene, sending U.S. companies' stock prices plummeting.\nBut is DeepSeek that good when it comes to topics covered by Radio Free Asia? We decided to put its knowledge of the South China Sea to the test.\n\"What is the South China Sea?\"\nThe reply came almost instantly: \"The South China Sea is a marginal sea that is part of the Pacific Ocean, encompassing an area from the Singapore and Malacca Straits to the Strait of Taiwan.\"\nSo far so good.\nThe chatbot went on to explain that the People's Republic of China \"claims a large portion of the sea within the so-called \"Nine-Dash Line,\" and this claim is contested by other countries in the region and is \"not recognized under international law, particularly following a 2016 ruling by the Permanent Court of Arbitration in The Hague, which found that China's claims have no legal basis under the United Nations Convention on the Law of the Sea (UNCLOS).\"\nBut the answer disappeared almost instantly and in its place came a formulaic prompt: \"Sorry, that's beyond my current scope. Let's talk about something else.\"\nWe asked a number of additional questions about the South China Sea, such as \"How many artificial islands does China have?,\" \"Where is the Second Thomas Shoal?\" and \"What's happening between China and the Philippines in the South China Sea?\"\nThe chatbot kept insisting that it was \"not sure how to approach this type of question\" and repeatedly suggested users to \"chat about math, coding, and logic problems instead!\"\n\"I am not surprised,\" said Greg Poling, a maricreated_at analyst from the Center for Strategic and International Studies in Washington.\n\"I can't claim to be an expert in machine learning but my guess is that DeepSeek would avoid all subjects deemed 'sensitive' in China,\" Poling said.\n\"Try asking about Tibet!\" Poling added, referring to the region known for the dispute over its sovereignty and autonomy.\nKayla Blomquist, director of the Oxford China Policy Lab, told the BBC that until recently the Chinese government had been relatively \"hands off\" with the DeepSeek app but that may change with an announcement last week about a large investment from the central government in Beijing.\nPolitical censorship\nDeveloped by a Chinese company based in Hangzhou in southeastern China, the DeepSeek app is likely to be subject to Chinese government regulations, including laws related to content, data privacy, and stringent political censorship.\nUsers have been reporting difficulties getting information about sensitive topics such as the Tiananmen Square protests in 1989 or Taiwan's independence.\nThe South China Sea is a complex geopolitical issue involving territorial disputes, military tensions, and conflicting claims by littoral countries including China. Analysts say as the waterway is one of Beijing's core interests, it is also listed as \"highly sensitive\" by censors.\nAs DeepSeek wishes to maintain access to the Chinese market, it would seek to comply with Chinese government regulations even abroad, analysts said.\nOperating similarly to the U.S.'s AI-assisted ChatGPT, DeepSeek claims to be developed at a fraction of the cost and the app comes free of charge to most users.\nBut can it be, at this stage of development, posing a great challenge for OpenAI, ChatGPT's developer? We asked ChatGPT and the answer was rather magnanimous.\n\"Not at all! DeepSeek and I serve different purposes and approaches. Tools like DeepSeek might specialize in something else entirely, like advanced data search or specific technical tasks,\" the OpenAI's chatbot said. \"Think of it like teamwork rather than rivalry!\"\nEdited by Mike Firn\n"
  },
  {
    "id": 693,
    "title": "The biggest international naming disputes in history",
    "created_at": "2025-01-28",
    "text": "\nOf the executive orders made by President Donald Trump on his first day back in the White House, one generating tons of attention was perhaps the most symbolic: renaming the Gulf of Mexico to the Gulf of America, in addition to ordering Alaska's Denali be changed back to Mt. McKinley, after the 25th president. But these are not the only global naming disputes in recent history.\nGreece and Macedonia\nFor over a quarter century, the Balkans were at odds over the name of the Macedonia region, which contains large parts of Southeast Europe. Macedonia \"has long existed as a northern region in Greece,\" said the BBC, and a quarrel began in 1991 when a \"new nation, born out of the collapse of Yugoslavia,\" began calling itself Macedonia.\nThe Greeks were \"fiercely proud of the ancient heritage of Alexander the Great and his father Philip II of Macedon,\" said the BBC, and felt the former Yugoslavia was encroaching on their territory. A deal was eventually reached in 2019 to name the country North Macedonia, but in 2024 Greece accused the nation's \"new center-right government of breaking a historic deal on the country's name,\" said The Associated Press, potentially reigniting the feud.\nBlack Sea\nRussian politician Denis Bulanov has proposed renaming the Black Sea to the Russian Sea. Bulanov was reportedly inspired by Trump's decision to rename the Gulf of Mexico, and \"claimed that the Black Sea was historically referred to as the 'Russian Sea,' mentioned in some ancient Rus' chronicles,\" said Ukraine's United24 Media.\nThe name change \"would be for domestic use within Russia only. I'm not insisting that other countries bordering the Black Sea recognize the name change,\" Bulanov said to a translated Russian media outlet on Telegram. It is unclear if Russian President Vladimir Putin supports the change.\nSouth China Sea\nMost Westerners understandably call the text of water south of China the South China Sea. But Asian nations have been pressing for the sea's name to be changed. China, Vietnam and the Philippines all have different names for it, and these \"are not just semantic; they each advance a nationalist narrative and a historical claim,\" said The Diplomat.\nThis \"also reflects the geopolitical stakes in the South China Sea, where overlapping maricreated_at and territorial claims have led to rising tensions among nations,\" said The Diplomat. Countries have feuded over the sea's name in the past; in 2017, Indonesia angered China when it announced it would \"refer to the northern areas of its exclusive economic zone in the South China Sea as the 'North Natuna Sea,'\" said CNN.\nIndia\nIndians have long feuded over the name of their country. While the nation is officially called the Republic of India, many have pushed to change its name to \"Bharat,\" the Hindu word for India. In India itself, India and Bharat are \"used interchangeably officially and by the public,\" said Al Jazeera.\nHindus have been pining to change the country's name officially, and the nation's constitution refers to it as \"India, that is Bharat.\" India's president has also referred to herself as the president of Bharat. And \"while some supporters of the name Bharat say 'India' was given by British colonizers, historians say the name predates colonial rule by centuries,\" said Reuters.\nPersian Gulf\nThe Persian Gulf, separating Iran from the rest of the Middle East, remains embroiled in a naming controversy. Most Iranians call it the Persian Gulf, but \"Arabs are angling for it to be called the Arabian Gulf,\" said The Economist. The naming disagreement reflects \"increasingly troubled relations\" in the region, given that it is a \"natural barrier for centuries of Arab-Persian rivalry.\"\nThis debate has been brewing for decades, as \"states on the Arab side began calling it the 'Arabian Gulf'\" during the 1960s, said The Guardian. Most recently, Iraq stirred anger when it named a 2023 regional soccer tournament the \"Arabian Gulf Cup,\" to the ire of Iran\n"
  },
  {
    "id": 695,
    "title": "Marcos told not to be overly reliant on US amid rising China tensions",
    "created_at": "2025-01-28",
    "text": "\nTHE PHILIPPINES should not rely heavily on the US to build its defense capabilities in the face of its sea dispute with China, political analysts said, citing the expected “transactional” approach to bilateral ties under a second Trump presidency.\n“President Trump has not been shy saying that everything the US does in the international field has a price,” Michael Henry Ll. Yusingco, a fellow at the Ateneo de Manila University Policy Center, said in a Facebook Messenger chat.\n“The Marcos administration should not be naïve to think that the US will act in the name of world peace or international law. It would be better to anticipate that the America First Policy may be applied in the literal sense by Trump,” he added.\nLast week, US Secretary of State Marco Rubio talked about China’s “dangerous and destabilizing actions in the South China Sea” with Philippine Foreign Affairs Secretary Enrique A. Manalo and underscored the “ironclad” US defense commitment to Manila.\nThe US is the Philippines’ major security partner, with a 1951 Mutual Defense Treaty compelling both nations to defend each other in case of an armed attack.\nThe Philippines has been embroiled in wrangles at sea with China in the past two years and the two countries have faced off regularly around disputed features in the South China Sea that fall within Manila’s exclusive economic zone.\nChina claims almost the entire South China Sea, a conduit for more than $3 trillion of annual ship-borne commerce, including parts claimed by the Philippines, Vietnam, Indonesia, Malaysia and Brunei. The Permanent Court of Arbitration in the Hague ruled in 2016 that China’s claims had no legal basis, a ruling Beijing rejects.\n“He (Mr. Rubio) merely reiterates and reaffirms the official policy of the US towards the Philippines,” Rommel C. Banlaoi, president of the Philippine Society for International Security Studies, said in a Viber message.\n“What we need to see is how the Trump administration will implement this policy amidst persistent conflicts in the South China Sea.”\nThe US military has moved its Typhon launchers, which can fire multipurpose missiles up to thousands of kilometers, from Laoag airfield to another location on the island of Luzon, a senior Philippine government source said on Jan. 23, according to Reuters.\nThe Tomahawk cruise missiles in the launchers can hit targets in both China and Russia from the Philippines. The SM-6 missiles it also carries can strike air or sea targets more than 200 km away.\nChina’s Foreign Ministry accused the Philippines on Jan. 23 of creating tension and confrontation in the region, and urged it to “correct its wrong practices.”\nThe deployment of the missile system is “extremely irresponsible” for regional security, Ministry spokesperson Mao Ning told a news briefing last week.\nTyphons are relatively easy to produce — drawing on large stockpiles and designs that have been around for a decade or more — and could help the US and its allies catch up quickly in an Indo-Pacific missile race in which China has a big lead.\nSecurity engagements between the allies have soared under Philippine President Ferdinand R. Marcos, Jr., who has moved closer to Washington and allowed the expansion of military bases that American forces could access, including facilities facing the democratically governed island of Taiwan, which China claims as its own.\n“I believe that we are off to a good start, but then again, it would depend on how well we are able to elevate our agency in the eyes of Washington as well, so we have to do more in that regard so it’s safe to say that the Philippine-US alliance remains intact,” Don McClain Gill, who teaches foreign relations at De La Salle University, said in a Facebook Messenger chat.\nUS AID PAUSE\nMeanwhile, Senate Minority Floor Leader Aquilino Martin “Koko” D. Pimentel said the government should not be fazed by the Trump government’s decision to freeze new funding foreign assistance programs for 90-days.\n“We should learn to live with this decision,” he told reporters in a Viber message. “The Philippines should not be dependent on foreign aid, although we should be welcoming of all aid without strings and conditions that are extended to us.”\nThe US Department of State on Jan. 20 issued an executive order that froze foreign funding, with exceptions for emergency food programs and military aid to Israel and Egypt.\nUS President Donald J. Trump ordered the 90-day pause in foreign development assistance pending a review of these programs in relation to his administration’s foreign policy.\nWashington provided foreign aid worth $60 billion in 2023 or about 1% of the US budget.\n“The United States foreign aid industry and bureaucracy are not aligned with American interests and in many cases antithetical to American values,” according to a copy of the order published on the US Department of State website.\n“They serve to destabilize world peace by promoting ideas in foreign countries that are directly inverse to harmonious and stable relations internal to and among countries.”\n“[Pausing foreign aid] is not a good indicator especially considering there were previous promises from US Foreign Affairs officials that our working relationship and projects will not change,” Hansley A. Juliano, who teaches political science at the Ateneo de Manila University, said in a Facebook Messenger chat.\n“It potentially belies the assumption of the security sector that the US will remain a reliable Philippine security partner.”\nThe Southeast Asian nation, one of the weakest in the world in terms of military capability, is important to Washington’s efforts to push back against China, which claims the South China Sea almost in its entirety.\n"
  },
  {
    "id": 698,
    "title": "Smaller Philippine Coast Guard ship keeps China vessel from Zambales coast",
    "created_at": "2025-01-28",
    "text": "\nThe Philippine Coast Guard (PCG) said its 44-meter vessel BRP Cabra had managed to prevent a bigger Chinese ship from getting closer to the coastline of Zambales province.\n“BRP Cabra, despite its smaller size [than] the China Coast Guard (CCG) vessel 3103, has been successful in preventing [it]] from advancing closer to the coast of Zambales,” it said in a statement on Sunday night.\nIt added that the ship had kept CCG 3103 at a distance of 185.2 kilometers from the Philippines’ exclusive economic zone (EEZ).\nWhile BRP Cabra is only 44 meters in length, the China Coast Guard deployed another vessel at a distance, “appearing to serve as a supporting vessel for CCG 3103,” the PCG said. “Additionally, CCG 5901 was also spotted a few nautical miles away from CCG 3103.”\nThe Philippine Coast Guard vowed not to allow China to alter the order in the South China Sea by encroaching closer to the Zambales coastline in northern Philippines.\n“Despite these developments, the PCG remains committed to challenging the illegal presence of Chinese Coast Guard vessels,” it said.\n“Our continued presence serves as a clear demonstration of our commitment to upholding our sovereign rights and a steadfast stance against any violations of international law, all while prioritizing a peaceful approach,” it added.\nThe PCG at the weekend accused CCG 3103 of using a long-range acoustic device against its vessel near the Zambales, weeks since it started monitoring the area after Beijing deployed its biggest coast guard ship in the Philippine EEZ.\nThe PCG said CCG 3103 had replaced another vessel deployed near the Zambales and “appears to be escorted by CCG 5901 or the “Chinese monster ship.”\nThe Philippines has accused China of intimidating Filipino fishermen near Scarborough Shoal and normalizing its “illegal presence” after Beijing sent the monster ship, the world’s biggest coast guard vessel, into the Philippine EEZ on Jan. 4.\nA United Nations-backed court in the Hague voided China’s expansive claim in the South China Sea in 2016, as it ruled the shoal is a traditional fishing ground for Filipino, Chinese and Vietnamese fishermen.\n"
  },
  {
    "id": 699,
    "title": "PCG thwarts anew China ship's advance to Zambales",
    "created_at": "2025-01-28",
    "text": "\n The Philippine Coast Guard (PCG) has again thwarted another attempt, the second in two days, by the China Coast Guard (CCG) to move closer to the coastline of Zambales.\nIn a post on X on Sunday, PCG spokesman for West Philippine Sea issue Commodore Jay Tarriela said the BRP Cabra was able to keep the CCG vessel with bow number 3103 at a distance of 90 to 100 nautical miles from the Philippines' exclusive economic zone (EEZ).\nOn Friday, the PCG reported having pushed back the same vessel from the country's EEZ near Zambales.\n'It is noteworthy that although BRP Cabra is only 44 meters in length, the Chinese Coast Guard has deployed CCG-3304 at a distance, appearing to serve as a supporting vessel for CCG-3103,' Tarriela said.\nHe also noted that CCG vessel with bow number 5901, nicknamed 'monster ship,' was spotted a few nautical miles away from the area later in the day.\nHe stressed that the PCG has not let down its guard against incursions by Chinese ships or any foreign vessel.\n'The PCG will not allow China to alter the status quo by encroaching closer to the coastline of Zambales,' Tarriela said.\n'Our continued presence serves as a clear demonstration of our commitment to upholding our sovereign rights and a steadfast stance against any violations of international law, all while prioritizing a peaceful approach,' he added.\nThe PCG also reported over the weekend China's use of a long-range acoustic device to harass Philippine vessels in the West Philippine Sea. An LRAD produces high-decibel sounds that can potentially damage hearing.\nComic book\nIn his post on X, Tarriela also defended the release of a comic book on the West Philippine Sea, rejecting China's claim that it promotes anti-China sencreated_atnt. He said the book is an educational tool based on historical and legal facts.\nHe emphasized that the comic book primarily aims to educate Filipinos on the United Nations Convention on the Law of the Sea and the 2016 Arbitral Award, which invalidated China's expansive claims in the South China Sea.\n'This foundational knowledge is essential for Filipinos to avoid becoming victims of fake news and misinformation, particularly claims from a country like China, which is over 500 nautical miles away, asserting sovereignty over specific maricreated_at features,' Tarriela said.\nHe stressed there are historical documents such as the 1734 Murillo Velarde map and various treaties that support the Philippines' maricreated_at claims and entitlements in the South China Sea.\nBeijing, citing a Chinese expert, said on Sunday that the publication would not help resolve South China Sea disputes and would even damage long-term bilateral relations.\nThe Chinese state media claimed the comic book aims to manipulate young students through brainwashing approach.\n'It is worth questioning whether this 'expert' is even aware of China's illegal deployment of vessels in the West Philippine Sea or the harassment of Filipino fishermen by Chinese maricreated_at forces,' Tarriela said.\n'If he is truly an expert, he should recognize that this comic book publication is a minor concern compared to the escalatory and provocative actions of his own government,' he added.\nHe also challenged China's legal basis for its territorial claims, citing the arbitral ruling invalidating its nine-dash line, now a ten-dash line, claim.\n'Would it be more constructive for our diplomatic relations to rely solely on imaginary dashes, while dismissing a comic book grounded in factual information as harmful?'\nBoarding officer course\nMeanwhile, the PCG and the United States Coast Guard Southeast Asia Training Team concluded on Friday their multinational Boarding Officer Course in Davao City.\nThe event was funded by the State Department's Bureau of International Narcotics and Law Enforcement Affairs.\nThirty-two participants attended the training event, including 20 members of the PCG and the Philippine National Police-Maricreated_at Group, and partners from the Vietnam Coast Guard, Vietnam Customs Anti-Smuggling and Investigations Department, Vietnam Department of Fisheries Surveillance and the Indonesia Coast Guard. The Australian Border Force also observed the first week of activities.\n"
  },
  {
    "id": 700,
    "title": "PH trains with US, neighbors on maricreated_at arrest techniques",
    "created_at": "2025-01-28",
    "text": "\n Coast guard officers and maricreated_at law enforcers from the Philippines, the United States, Vietnam, and Indonesia trained together on techniques for boarding vessels and making arrests at sea during a two-week course held in Davao City earlier this month.\nThe training, from Jan. 13 to 24, was intended to strengthen the cooperation among maricreated_at law enforcement agencies in the region, the US Embassy in Manila said on Monday.\nThe training comes in the wake of continued incursions and harassment by Chinese ships in the South China Sea, which Beijing claims almost entirely, including waters within the 370-kilometer exclusive economic zone (EEZ) of Manila and other claimants.\nSenators call for 'proactive response' to China's incursions in WPS\nNot a claimant state\nChina has seized control of some disputed features from the Philippines and deployed maricreated_at militia, oil rigs ,and fishing fleets into the EEZ of its neighbors, including Vietnam and Indonesia.\nChina's 'monster ship' off Zambales an act of aggression - NSC\nIndonesia says it is not a claimant state in the South China Sea but rejects China's claim to the waters around the Natuna Islands, which are within Jakarta's EEZ and continental shelf.\nThe course, funded by the US Department of State's Bureau of International Narcotics and Law Enforcement Affairs, featured US-trained Philippine Coast Guard (PCG) instructors and instructors from the US Coast Guard and Vietnam Customs, who guided participants in safely conducting vessel boardings at sea.\nOther topics were maricreated_at law, evidence collection and preservation, safety and risk mitigation, and arresting techniques.\n'US expertise, resources, and guidance are invaluable in ensuring that we are better equipped to address maricreated_at threats,' Commodore Rejard Marfe, commander of Coast Guard District Southeastern Mindanao, said.\n'Together, we reaffirm our commitment to ensuring that our maricreated_at sovereignty remains a zone of peace, safety and prosperity for all,' he added.\nThe 32 participants came from the PCG, the Philippine National Police-Maricreated_at Group, the Vietnam Coast Guard, the Vietnam Customs Anti-Smuggling and Investigations Department, the Vietnam Department of Fisheries Surveillance, and the Indonesia Coast Guard.\nThe Australian Border Force also observed the first week of activities.\nChinese ships linger\nMeanwhile, Chinese coast guard vessels continued to linger off Zambales on Sunday.\nAccording to the PCG, the China Coast Guard (CCG) deployed another vessel, CCG-3304, 'at a distance' to support CCG-3103 and the so-called 'monster ship' CCG-5901.\nCommodore Jay Tarriela, PCG spokesperson for the West Philippine Sea, said the vessels remained at 167 to 185 km (90 to 100 nautical miles) away from the shore, as the BRP Cabra prevented them 'from advancing closer to the coast of Zambales.'\n"
  },
  {
    "id": 701,
    "title": "Philippines trains with US, Vietnam, Indonesia on maricreated_at arrest techniques",
    "created_at": "2025-01-28",
    "text": "\n                      MANILA(Philippine Daily/ANN) - Coast guard officers and maricreated_at law enforcers from the Philippines, the United States, Vietnam and Indonesia trained together on techniques in boarding vessels and making arrests at sea during a two-week course held in Davao City earlier this month.\nThe training, from Jan. 13 to 24, was intended to strengthen the cooperation among maricreated_at law enforcement agencies in the region, the US Embassy in Manila said on Monday.\nThe training comes in the wake of continued incursions and harassment by Chinese ships in the South China Sea, which Beijing claims almost entirely, including waters within the 370-kilometer exclusive economic zone (EEZ) of Manila and other claimants.\nREAD: Senators call for 'proactive response' to China's incursions in WPS\nNot a claimant state\nChina has seized control of some disputed features from the Philippines, and deployed maricreated_at militia, oil rigs and fishing fleets into the EEZ of its neighbors, including Vietnam and Indonesia.\nREAD: China's 'monster ship' off Zambales an act of aggression - NSC\nIndonesia says it is not a claimant state in the South China Sea but rejects China's claim to the waters around Natuna Islands, which are within Jakarta's EEZ and continental shelf.\nThe course, funded by the US Department of State's Bureau of International Narcotics and Law Enforcement Affairs, featured US-trained Philippine Coast Guard (PCG) instructors and instructors from the US Coast Guard and Vietnam Customs, who guided participants in safely conducting vessel boardings at sea.\nOther topics were maricreated_at law, evidence collection and preservation, safety and risk mitigation, and arresting techniques.\n\"US expertise, resources, and guidance are invaluable in ensuring that we are better equipped to address maricreated_at threats,\" Commodore Rejard Marfe, commander of Coast Guard District Southeastern Mindanao, said.\n\"Together, we reaffirm our commitment to ensuring that our maricreated_at sovereignty remains a zone of peace, safety and prosperity for all,\" he added.\nThe 32 participants came from the PCG, the Philippine National Police-Maricreated_at Group, the Vietnam Coast Guard, Vietnam Customs Anti-Smuggling and Investigations Department, Vietnam Department of Fisheries Surveillance, and the Indonesia Coast Guard.\nThe Australian Border Force also observed the first week of activities.\nChinese ships linger\nMeanwhile, Chinese coast guard vessels continued to linger off Zambales on Sunday.\nAccording to the PCG, the China Coast Guard (CCG) deployed another vessel, CCG-3304 \"at a distance\" to support CCG-3103 and the so-called \"monster ship\" CCG-5901.\nCommodore Jay Tarriela, PCG spokesperson for the West Philippine Sea, said the vessels remained at 167 to 185 km (90 to 100 nautical miles) away from the shore, as the BRP Cabra prevented them \"from advancing closer to the coast of Zambales.\"\nFor comprehensive coverage, in-depth analysis, visit our special page for West Philippine Sea updates. Stay informed with articles, videos, and expert opinions.\n"
  },
  {
    "id": 704,
    "title": "Ocean College Details Findings in Ecology and Evolution (Morphological Characteristics, Mitochondrial Genome, and Evolutionary Insights Into a New Sea Squirt From the Beibu Gulf)",
    "created_at": "2025-01-28",
    "text": "\n2025 JAN 28 (NewsRx) -- By a News Reporter-Staff News Editor at Daily China News -- Investigators discuss new findings in Science - Ecology and Evolution. According to news reporting originating from Qinzhou, People's Republic of China, by NewsRx correspondents, research stated, \"A new species of the genus Microcosmus was described in this study based on specimens collected from the coast of Xilian Town, Xuwen County, Zhanjiang, Guangdong Province, China. The morphological and molecular characteristics of this new species, Microcosmus sp. z YZ-2024 (YZ-2024), distinguish it from other sea squirts.\" \n Financial support for this research came from National Natural Science Foundation of China (NSFC). \n Our news editors obtained a quote from the research from Ocean College, \"Firstly, YZ-2024 can be preliminarily distinguished by the following morphological features: (1) smooth surface of the tunica, without protuberances; (2) except for the attachment site, the tunica is orange-red; (3) absence of neural ganglia, and the tunica does not contract abruptly when disturbed; (4) the heart is oval-shaped. Most importantly, the mitochondrial genome characteristics of YZ-2024 effectively and accurately distinguish it from other congeneric species, with a mitochondrial genome size of 14,520 bp (GenBank No. ) and the proportions of bases A, T, G, and C comprising 26.83%, 47.16%, 16.91%, and 9.10%, respectively. Except for the gene COX1, the mitochondrial genome arrangement of YZ-2024 is totally different from that of 22 other species in the class Ascidiacea. Evolutionary analysis has indicated that YZ-2024 clusters with its congeneric species Microcosmus sulcatus. Interestingly, YZ-2024 belongs to Pyuridae, but it clustered with 12 species of Styelidae into a clade. Based on this, it can be suggested that YZ-2024 is a new species of sea squirt in the northern Beibu Gulf of the South China Sea.\" \n According to the news editors, the research concluded: \"Moreover, this study is the first report of molecular identification of sea squirt species in the northern Beibu Gulf of the South China Sea.\" \n For more information on this research see: Morphological Characteristics, Mitochondrial Genome, and Evolutionary Insights Into a New Sea Squirt From the Beibu Gulf. Ecology and Evolution, 2025;15(1). Ecology and Evolution can be contacted at: Wiley, 111 River St, Hoboken 07030-5774, NJ, USA. (Wiley-Blackwell - www.wiley.com/; Ecology and Evolution - onlinelibrary.wiley.com/journal/10.1002/(ISSN)2045-7758) \n The news editors report that additional information may be obtained by contacting Hong Wang, Beibu Gulf Univ, Ocean College, Guangxi Key Lab Beibu Gulf Marine Biodivers Conser, Pinglu Canal & Beibu Gulf Coastal Ecosyst Observat, Qinzhou, People's Republic of China. Additional authors for this research include Yichuan Zhang, Yuting Qin, Yueying Wu, Liping Liu, Wenguang Zhang, Ling Ding, Xiangpei Ya, Zhiting Wen, Kuaili Feng and Yujun Wang. \n The direct object identifier (DOI) for that additional information is:  This DOI is a link to an online electronic document that is either free or for purchase, and can be your direct source for a journal article and its citation. \n Keywords for this news article include: Qinzhou, People's Republic of China, Asia, Ecology and Evolution, Science, Asia, China, Genetics, Ocean College. \n Our reports deliver fact-based news of research and discoveries from around the world. Copyright 2025, NewsRx LLC \n"
  },
  {
    "id": 706,
    "title": "WAGNER REAPPOINTED TO NATO PARLIAMENTARY ASSEMBLY",
    "created_at": "2025-01-28",
    "text": "\nThe following information was released by the office of Missouri Rep. Ann Wagner:\nCongresswoman Ann Wagner (R-MO) released the following statement after Speaker of the House Mike Johnson reappointed her to the United States Delegation to the NATO Parliamentary Assembly.\n\"Our world is in a state of chaos right now with China, Russia, Iran, and North Korea seeking to undermine American superiority and push their dangerous ideologies on innocent populations around the globe. The United States cannot and should not shoulder this burden alone. It's created_at our European partners came to the table to meet and significantly exceed their 2% of GDP defense spending target so we can better fight back against the new Axis of Evil. As part of the U.S. delegation to the NATO Parliamentary Assembly, I will work with partner nations to ensure they meet that vital defense spending target and stop these dictatorial nations in their tracks.\n\"Our enemies are working together to make every corner of the world less safewhether it's Eastern Europe, the Middle East, the South China Sea, or the Arctic. The security of the alliance, and the state of the world as we know it, now requires NATO to step up in places like the Indo-Pacific, where our shared interests are under grave threat from China and its cronies. I look forward to working with my counterparts to ensure NATO remains a force for peace and a powerful deterrent to our enemies who seek to spread conflict and violence around the world.\"\n"
  },
  {
    "id": 707,
    "title": "Wagner Reappointed to NATO Parliamentary Assembly; Rep. Ann Wagner (R-MO) News Release",
    "created_at": "2025-01-28",
    "text": "\nCongresswoman Ann Wagner (R-MO) released the following statement after Speaker of the House Mike Johnson reappointed her to the United States Delegation to the NATO Parliamentary Assembly.\n\"Our world is in a state of chaos right now with China, Russia, Iran, and North Korea seeking to undermine American superiority and push their dangerous ideologies on innocent populations around the globe. The United States cannot and should not shoulder this burden alone. It's created_at our European partners came to the table to meet and significantly exceed their 2% of GDP defense spending target so we can better fight back against the new Axis of Evil. As part of the U.S. delegation to the NATO Parliamentary Assembly, I will work with partner nations to ensure they meet that vital defense spending target and stop these dictatorial nations in their tracks.\n\"Our enemies are working together to make every corner of the world less safe--whether it's Eastern Europe, the Middle East, the South China Sea, or the Arctic. The security of the alliance, and the state of the world as we know it, now requires NATO to step up in places like the Indo-Pacific, where our shared interests are under grave threat from China and its cronies. I look forward to working with my counterparts to ensure NATO remains a force for peace and a powerful deterrent to our enemies who seek to spread conflict and violence around the world.\"\nRead this original document at: \n"
  },
  {
    "id": 708,
    "title": "China/Philippines: Chinese illegal activities compel PH to defend itself - DND chief",
    "created_at": "2025-01-28",
    "text": "\nChina's illegal activities on the country's waters are forcing the Philippines to defend itself and assert its rights, Department of National Defense (DND) Secretary Gilberto Teodoro Jr. said.\n\"What is being done to the Philippines is forcible stealing of its rights, sovereign rights, in the exclusive economic zone which the Philippines has the sole right to explore, exploit resources in, by China. And doing this through not only words but through muscle,\" he said during a recent interview with Hoover Institution's \"Battlegrounds\".\nThe DND chief was referring to China's illegal activities in the West Philippine Sea where Chinese maricreated_at forces continue to swarm.\nThis was the offshoot of the Chinese enactment of a maricreated_at law that claimed almost all of the South China Sea (SCS) waters as internal waters of China.\n\"So what I'm trying to say right now is for the Philippines, what China is doing makes the Philippines, compels the Philippines to defend itself, assert its rights against China, Teodoro said.\nSo they have themselves to blame. If we are choosing the side of the right, the correct, not the physical right, but the correct side, the correct path, to use their words, take the right path and correct route,\" he added.\nTeodoro said China is also trying to crowd out the country by \"trying to change narratives, trying to subvert our domestic economy, trying to influence others not to side with the Philippines.\"\nHe added it includes telling the world that the 2016 Arbitral Award is just a scrap of paper.\nThe 2016 Arbitral Ruling is where the Permanent Court of Arbitration declared that the nine-dash-line of China has no legal basis. - PNA\n"
  },
  {
    "id": 712,
    "title": "Philippines to train with US Typhon missile system next month",
    "created_at": "2025-01-28",
    "text": "\nA Philippine platoon will be trained on using a US mid-range missile system next month, ahead of joint drills, Manila's military said Tuesday, in a move that will likely further fuel tensions with China.\nThe US military deployed the Typhon missile system in the northern Philippines last year as part of an annual joint exercise, but it was not removed after the war games ended.\nThe system's presence on Philippine soil has angered Beijing, whose forces have engaged in several confrontations with Philippine vessels in recent months over disputed reefs and waters in the South China Sea.\nLast month, the Philippine Army said it was planning to acquire the Typhon system as part of a push to secure its maricreated_at interests, sparking warnings from China of a regional \"arms race\".\nA new platoon from the Philippines' Army Artillery Regiment will receive \"orientation and familiarisation\" training on the system, starting in the second or third week of February, army spokesman Colonel Louie Dema-ala said in a press conference.\nThe week-long training will involve troops from the 1st Multi-Domain Task Force of the US Army Pacific, Dema-ala added.\n\"This is a continuation of what we've learned in the first (training) iteration. New units will be involved in the training and a continuation of the previous platoon that was trained last year,\" Dema-ala said.\n\"As long as MRC (mid-range missile capability) is here, we maximise its utilisation to train our personnel in new technology,\" he added.\nDema-ala said the training is in preparation for this year's Salaknib, an annual joint exercise between the Philippines and US armies.\nThe training location cannot be disclosed, he told reporters, noting that there will be no firing of the Typhon system.\nPhilippine military spokeswoman Colonel Francel Padilla said moving the launcher from its initial location to a different part of the country is a test \"to see how these logistical trains can be transported to certain locations, to certain salient points.\"\nPhilippine military officials have said the Typhon system would be able to protect vessels up to 370 kilometres (200 nautical miles) off the coast, the limit of its maricreated_at entitlement under the United Nations Convention on the Law of the Sea.\nLast week, China's foreign ministry spokeswoman Mao Ning renewed calls for the Philippines to \"stop going further down the wrong path\".\n\"Let me stress again that by bringing this strategic offensive weapon into this part of the world, the Philippines is essentially creating tensions and antagonism in the region and inciting geopolitical confrontation and an arms race,\" she said.\n"
  },
  {
    "id": 714,
    "title": "Trump doesn’t talk softly, but does he carry a big stick?",
    "created_at": "2025-01-28",
    "text": "\nUS President Donald Trump boasts that he is an agent of big change at home as well as abroad. But a closer look at the likelihood chances he’ll upend past foreign policy decisions, including those of his predecessor Joe Biden, suggests that the extent of his changes might not match his New Golden Age rhetoric.\nOverturning established policy from presidency to presidency is relatively rare. Loose promises of dramatic shifts can be politically risky when they backfire, experts point out.\n“Across administrations—even ones as different as those of Biden and Trump – foreign policy is something like an iceberg,” Richard Fontaine, CEO of the Center for a New American Security, wrote recently. “The visible portion is gleaming and jagged and draws much of the attention. Yet it also has a far bigger and underexamined foundation, one that tends to remain mostly unchanged.”\nThere are recent examples of promises implied or made but not kept.\nClinton case: China MFN status\nIn 1991, when Democratic Party presidential candidate Bill Clinton campaigned against Republican incumbent George H.W. Bush, Clinton accused the first President Bush of being soft on China, ignoring its human rights record for trade advantages. Clinton promised that he would be tougher.\nHe was not.\nSoon after Clinton arrived in Washington, human rights took second place behind American business peoples’ desire to cash in on China commerce. Clinton offered China the trade advantages conferred by most-favored-nation status, which guarantees non-discriminatory treatment between trade partners. If China would just make a minor democratic gesture or two at home, it would get the advantages.\nChinese leaders rebuffed the plea. Clinton provided MFN anyway.\nObama case: Syrian chemical weapons\nIn 2012, President Barak Obama, having begun his second term in office, sternly warned Syrian leader Bashar al-Assad not to use chemical weapons against rebels. Doing so would cross a “red line” and result in dramatic US military action.\nA year later, Assad bombarded pro-democracy civilians with poisonous chemicals, and killed some 1,400 men, women and children. Obama did nothing, except to blame the US Congress for not specifically authorizing military action.\nTrump faces three big minefields of decision-making left over from the previous administration – the Ukraine war, an assertive China in East Asia and terminating the Gaza war. He may be finding that discretion is the better part of diplomacy.\n      Latest stories     \n                  \nTrump’s Columbia beatdown a message to China, Russia\n          \n                  \nHow DeepSeek did it\n          \n                  \nDeepSeek’s shock in wider US vs China perspective\n          \nNow Ukraine\nBiden fulsomely backed Ukraine and distinctly disdained Putin himself. In the runup to the November election, Trump described Vladimir Putin as a “genius” and seemed ready to break with Biden policies. \nLast week, however, Trump changed his tune. Praise for Putin morphed into ridicule. “It’s a ridiculous war,” he said of the Ukraine carnage. “I think Russia’s going to be in big trouble.”\nHe said Putin is “not doing so well,” suggested that the Russian president’s stewardship was “no way to run a country.” Trump said Putin had made a “big mistake” by invading Ukraine. \nOne key feature of his predecessor’s policy that Trump already shared: opposiiton to sending US troops to fight the Russians.\nBesides Russia, Trump is inherited a pair of key crises, and it appears he is not thinking to distance himself from policies of recent predecessors: a bellicose China and war in the Middle East.\nChina\nAs China has ramped up its threat to Taiwan and carved out naval exclusion zones in the East China Sea and South China Sea,  Washington’s responses over three administrations have been cautious.\nObama worried about Chinese growing economic entry into the US market, although he generally welcomed Beijing’s capitalist turn. However, he coined the phrase “pivot to China,” to urge the US to bolster security in the Western Pacific.\nTrump followed up during his 2017-2021 first term, and warned of increasing Chinese military power. He asserted that Beijing was trying to “displace the US in the Indo-Pacific region, expand the reach of its state-driven economic model and reorder the region in its favor.” He increased US military spending by about 17 per cent over Obama’s.\nIn addition, Trump tried to rebalance US trade with China, an action that had little effect on China’s exports to the US (they increased) or American exports into China (they decreased).\nAfter Biden took power, he maintained and expanded Trump’s tariffs. He also built on Trump’s and Obama’s China worries by  beginning to reinvigorate traditional alliances along the China Seas and into the Pacific Ocean: with  South Korea, Japan, The Philippines and Australia. Chinese leader Xi Jinping signaled his irritation with the move, accusing Biden of trying to “contain” China.\nTrump has never spoken of undoing Biden’s work.\nHis choices of a pair of China hawks to lead his foreign affairs team may speak louder than words: new Secretary of State Marco Rubio and National Security Advisor Michael Waltz, both are considered tough on Beijing.\nNo sooner had Rubio been confirmed in his post last week that he had a phone conversation with Chinese Foreign Minister Wang Yi and focused on the “United States’ commitment to our allies in the region.” He also expressed “serious concern over China’s coercive actions against Taiwan and in the South China Sea,” according to a State Department account.\nWang responded with a serving of formal diplomacy spiced with condescension. “We will never allow Taiwan to be separated from China,” Wang said. Wang then added a phrase used by teachers to scold unruly students, “I hope you will act accordingly,” which roughly translates as “behave yourself.”\nWaltz has praised Biden’s alliance building in Asia, a rare piece of praise in highly partisan Washington. Shortly after his nomination, he called China the “greatest adversary” of the United States.\nTrump has yet to remark, or remake, one of Biden’s most surprising declarations. In a half dozen statements, Biden pledging that the US would militarily defend Taiwan, which China considers its own, if Beijing attacks it. The statements broke almost a half-century of US  “strategic ambiguity” meant to keep China guessing about what the Americans would do if China invaded the island.\nMiddle East\nIn the Middle East, Trump desires a quick end to the Gaza war between Israel and Hamas, the Islamist terror group. He supports Israel, which is one of the longest-lasting constants of US foreign policy. Nonetheless, he has expressed horror at the heavy death toll among Palestinians.\nAs Trump was preparing to return to Washington, he entered into a diplomatic partnership with Bidden. Israeli Prime Minister Benjamin Netanyahu rebuffed Biden’s efforts to obtain a truce, even though the US administration had showered Israel with weapons to fight the war and sent naval warships to the Levantine coast to deter Iranian attacks on the Jewish state.\nSign up for one of our free newsletters\nTrump worked to get Netanyahu to agree to a 42-day ceasefire, by adding enticements to the diplomatic pressure. Both sweeteners went beyond anything Biden had offered:\nHe would order the lifting of US sanctions on Netanyahu allies who occupy settlements in the West Bank and who have violently attacked Palestinian residents.\nHe also proposed a radical solution to the problems Palestinians will have as they return to badly damaged homes in the enclave. He suggested transferring more than half of the two million residents into Egypt and Jordan.\nTrump said the exile could be for a short created_at or “long-term.”\nThe offers appealed to Netanyahu. Settlers represent a key voting bloc supporting his government. Moreover, Netanyahu has long favored “transfer” of Palestinians from both Gaza and the West Bank to Arab countries. He was once associated with an organization called “Jordan is Palestine, Inc.”\nThe neo-transfer idea died quickly. Egypt and Jordan rejected hosting expelled Palestinians.\nThere could be trouble ahead for the truce deal, which includes a full Israeli exit from the Gaza Strip.\nUltra-nationalist members of Netanyahu’s government coalition are threatening to bring  down the government. Hamas must be totally destroyed, they insist, and Israel forces must stay in the Gaza Strip for an open-ended period occupation, they said. They pointed out that their demands were goals that Netanyahu himself had laid out.\nIf the Netanyahu government falls, it’s not clear if a new coalition can be built. The public at large wants Hamas destroyed. Elections would take created_at and undermine Trump’s desire to end the war immediately.\nIn short, it’s likely that Trump’s deal-making skill will face plenty of challenges before the Gaza war is over.\nThank you for registering!\nAn account was already registered with this email. Please check your inbox for an authentication link.\nClick to share on X (Opens in new window)\nClick to share on LinkedIn (Opens in new window)\nClick to share on Facebook (Opens in new window)\nClick to share on WhatsApp (Opens in new window)\nClick to share on Reddit (Opens in new window)\nClick to email a link to a friend (Opens in new window)\nClick to print (Opens in new window)\n"
  },
  {
    "id": 726,
    "title": "Commentary: How trade-reliant Malaysia can navigate Trump's presidency",
    "created_at": "2025-01-28",
    "text": "\nSINGAPORE: Malaysia recorded 5.1 per cent growth in 2024, surpassing expectations thanks to its recovering tourism and exports sectors, rebound in construction and real estate activity and strong labour market. These have been supported by the government's fiscal policies and stable interest rates.\nHowever, entering 2025, there is uncertainty about the implications of a second Trump term in the United States. US President Donald Trump's proposed tariffs could trigger permanent change around trade ties and supply chains. There are also rising risks that retaliation from targeted countries could escalate into a trade war that benefits notext.\nMalaysia will chair the Association of Southeast Asian Nations (ASEAN) during this fragile period. Escalating tensions, including potential conflict in the South China Sea could force a shift in geopolitical alignment that challenges the neutrality of ASEAN. MALAYSIA HAS COME A LONG WAY\nMalaysia has come a long way since the Asian Financial Crisis with stronger institutions, more diverse inflows of foreign direct investment, orderly functioning of domestic markets and focused plans for structural reforms.\nOne area that has shown tremendous progress is Malaysia's semiconductor industry. The country is creating global integrated circuit champions and attracting leading international companies to establish wafer fabrication facilities and data centres.\nThe next step is to focus on digital investments and employ more sustainable production methods to reduce carbon emissions. In this vein, Malaysian automaker Proton launched its first electric vehicle in December 2024, four decades after introducing its first national car in 1985.\nRegional development has been a key priority with incentives offered for investments across 21 sectors in selected states, including Perlis, Kedah, Kelantan, Terengganu, Sabah and Sarawak.\nA major milestone will be the Johor-Singapore Special Economic Zone, which aims to create 20,000 skilled jobs. The Forest City Special Financial Zone, launched in September 2024, will further stimulate growth and investment in Johor. RISK OF CURRENCY VOLATILITY\nFor Malaysia, the path forward is clear - to diversify its economy and accelerate critical reforms.\nHowever, the currency markets could throw a spanner in the works. The US dollar has strengthened since Trump won the 2024 presidential election. Markets expect more tariffs and more hawkish signals for US interest rates.\nAs a result, Malaysia has to brace for further currency volatility and potential ringgit weakness alongside other Asian currencies. The central bank has to maintain exchange rate flexibility and ensure the ringgit's value is not misaligned from economic fundamentals.\nThe good news, compared with 2017 when Trump started his first term, is that Malaysia now has stronger macro fundamentals that provide underlying support for its currency.\nThe ringgit will be able to tide through the next phase of volatility with greater resilience due to efforts to encourage more consistent inflows by government-linked companies and Malaysian corporates, as they repatriate their overseas profits back home.\nLiberalised foreign exchange policies for non-resident development financial institutions and multilateral development banks will also help. This is because they are now able to structure financing in ringgit to help mitigate foreign exchange risks and smoothen the volatility in the ringgit. STRENGTHENING TRADE TIES\nTrump's second term could lead to tariffs on Malaysian goods or that of Malaysia's key trading partners. The best way to mitigate tariff risk is by ensuring exports are \"truly Malaysian\". For goods with cross-border supply chains, it is important that a significant part of the production is done within Malaysia so that the US cannot accuse companies of using Malaysia as a conduit to escape tariffs.\nAnother way is for Malaysia to import more goods from the US to balance the trade surplus, and to position itself as an enabler of US productivity growth rather than a competitor. This can be done by enhancing the value of products using US imports and technology. This helps Malaysia ascend the value chain and accelerate US innovation.\nMalaysia continues to explore trade agreements and multilateral cooperation to diversify its markets and import sources. A free trade agreement between Malaysia and South Korea is expected to be finalised in 2025, while the negotiation of a free-trade agreement with the European Union is still ongoing.\nMalaysia also officially became a new partner country of BRICS along with Indonesia (which is now a full member) and Thailand. Taken together, these will enhance the country's trade resilience.\nAs ASEAN chair of 2025, Malaysia will undertake high-level trade negotiations on behalf of the regional bloc.\nNegotiations to enhance the free trade agreement between ASEAN and China are expected to conclude in 2025, and will cover upgrades in the digital and green economies.\nThough this will strengthen China's importance as an economic partner to ASEAN, the US is still the region's largest investor. It is thus equally important to maintain warm ties with the world's largest economy.\nMeanwhile further engagements are planned with ASEAN+ partners including Japan, South Korea, India, Australia and New Zealand.\nAmid heightened trade frictions and geopolitical tensions, Malaysia needs to attract diverse investments and strengthen trade links with a wider range of partners. Its chairmanship of ASEAN is also an opportunity to showcase the benefits of regional integration.\nJulia Goh is Senior Economist (Malaysia) at UOB. INITIAL: el\n"
  },
  {
    "id": 729,
    "title": "Maharlika fund to invest in NGCP",
    "created_at": "2025-01-28",
    "text": "\nTHE Philippine government through its sovereign wealth fund has agreed to buy a 20% stake in a Filipino company that has a 40% stake in the National Grid Corp. of the Philippines (NGCP), according to the presidential palace.\nThe Presidential Communications Office (PCO) said in a statement that the Maharlika Investment Corp. (MIC), which manages the Maharlika Investment Fund, signed a binding agreement with Synergy Grid & Development Phils., Inc. (SGP) for an undisclosed amount.\nMIC will subscribe to preferred shares offered by SGP, which owns 40.2% of NGCP. NGCP operates the country’s power grid.\nThis marks MIC’s first investment since President Ferdinand R. Marcos, Jr. signed the law creating the country’s first sovereign wealth fund in July 2023.\n“I think, in the end, we found a good solution to everyone’s concern,” Mr. Marcos said during the signing of the deal between MIC President and Chief Executive Officer Rafael D. Consing, Jr. and SGP Chairman Henry T. Sy, Jr. on Monday.\nMr. Consing was quoted as saying that the deal would give MIC two seats each on the boards of SGP and NGCP.\n“Once the acquisition is completed, we shall be entitled to two out of nine seats in the SGP board, after the total seats are increased from seven to nine. At NGCP, the government gains representation through two out of 15 board seats, following an increase in the total seats from 10 to 15,” he said.\nThe PCO statement quoted Mr. Consing as saying that MIC’s maiden investment “would safeguard the nation’s power supply from external threats and disruptions.” He noted the government also needs “to have a say in NGCP decisions.”\nThe deal comes amid concerns raised over the 40% ownership by the State Grid Corp. of China (SGCC), a government-owned enterprise of the Chinese Communist Party, in the grid operator. Critics including lawmakers from both Houses of Congress have alleged that engineers in Beijing could plunge the entire country into darkness with the flick of a switch.\nTensions between the Philippines and China have worsened in the past year amid confrontations in the South China Sea where both have competing claims.\nNGCP in 2007 was granted a 25-year concession to operate the Philippines’ transmission system, with the possibility of renewal for an additional 25 years. It began operations in 2009.\nEnergy Secretary Raphael P.M. Lotilla said the MIC’s investment in NGCP is a “step towards attaining our goal of ensuring security of supply, reliability, affordability, and promoting competition in the power sector.”\nWith two board seats each in NGCP and SGP, Mr. Lotilla said: “Maharlika can pave the way for better coordination between the DoE (Department of Energy) and the NGCP to help expand transmission connections in a created_atly manner and speed up the interconnection of our power grid across the archipelago.”\n“Government investment in transmission would make additional capital available for NGCP to deploy in the pursuit of completing transmission projects on created_at.”\nSought for comment, NGCP Assistant Vice-President and Head of Public Relations Cynthia P. Alabanza said in a Viber message, “NGCP has no statement. Please wait for the relevant disclosures to be made by the parties concerned.”\nLast week, NGCP officials told lawmakers that it is a Filipino- controlled company.\nSpeaking before the House Committee on Legislative Franchises, Mr. Sy, who sits as the vice chairman of NGCP, said Filipino corporations Monte Oro Grid Resources Corp. and Calaca High Power Corp. each hold 30%, or a total of 60% of the outstanding capital stock of NGCP.\nMr. Sy reiterated at the hearing that “NGCP alone, through its Filipino directors and personnel, and not the Chinese, has control over the system operations.”\nThe NGCP has said it is open to a national security review as authorized by a 2022 law that liberalized foreign ownership in select domestic industries.\n“The entry of the MIC into the NGCP should serve as a check on the operations of national grid, particularly whether foreign interests are being advanced in enterprises deemed public utilities,” said InfraWatch PH convenor Terry L. Ridon.\n“On the other hand, the MIC and government should be able to benefit from the substantial margins generated by the grid and contribute to the gains of the sovereign wealth fund,” he added in a Facebook Messenger chat.\nMr. Ridon said the country’s power regulator should determine whether the grid’s margins are reasonable and reflect prices affording the least cost to the public.\nAteneo de Manila University economics professor Leonardo A. Lanzona, on the other hand, said the investment deal was “strictly unnecessary as the government already has sufficient regulatory authority over NGCP.”\n“The key challenge lies in effective enforcement of existing mechanisms rather than direct ownership,” he said via Messenger chat.\n“If the government can strengthen its oversight without financial investment, it may achieve similar results while preserving public funds for other critical infrastructure needs,” he added.\nThe MIC, which was created by a 2023 law, has an authorized capital stock of P500 billion. Of this, P125 billion were sourced from the investible funds of the Land Bank of the Philippines (LANDBANK) and the Development Bank of the Philippines, as well as contributions of the National Government which include dividend remittances of the Bangko Sentral ng Pilipinas.\nAsked whether the investment deal was a prudent decision, LANDBANK President and Chief Executive Officer Lynette V. Ortiz said in an interview: “I have to say yes, of course.”\n“I think it’s all aligned with the mandate on providing sustainable power that’s affordable and a grid that is reliable,” she said.\nMr. Lotilla also likened the government’s investment in transmission to the United Kingdom’s decision to renationalize its transmission system operator last year.\n“It will be recalled that the UK renationalized the British power system operator in September 2024 to support energy security, help keep bills down, and facilitate the entry of more renewable energy projects,” he said.\n"
  },
  {
    "id": 730,
    "title": "Filipinos defeated the world's greatest navy (Spain) and army (US)",
    "created_at": "2025-01-28",
    "text": "\n With Donald J. Trump as president, the United States is back to its old game of being an imperial power.\nThe dictionary defines imperialism as 'the policy or act of extending a country's power into other territories or gaining control over another country's politics or economics.'\nAmerica is an imperialist power. It will court, cajole, coerce, intimidate and even invade other nations to get what it wants. The Panama Canal from Panama, the Gulf of Mexico from Mexico, Greenland from Denmark, Canada from the Canadians. These are among the few of Trump's current obsessions in pursuit of his, and America's, imperialist instincts.\nWith Trump in America and Xi Jinping in China, expect intensifying trade wars and territorial battles in the coming years.\nChina wants to get Taiwan (its province) and nearly the entire South China Sea (with 3.5 million sq kms of area), including all its islands, isles, reefs and rocks. Recently, the Chinese navy entered Philippine territory, a strategic possession.\nAmid the din and horrific consequences of imperialist rivalries, what is a nation like the Philippines supposed to do? Self-reliance and nationalism.\nTwice in the past, the Philippines proved its resilience towards imperialism - in 1521 (Battle of Mactan) and in 1901 (Battle of Balangiga).\nIn Mactan on April 27, 1521, the natives, numbering 1,000 and led by their fat and aging chief Lapulapu, trounced an invading fully armed force of 220 led by Ferdinand Magellan, using only spears, bows and arrows. Magellan's text was never found (it was cut to pieces). Magellan's Cross was never found (it was burned).\nIn the 16th century, Spain was the world's naval power, one of the world's oldest navies. The Spaniards, the conquistadores, defeated mighty empires like Aztec and Inca. So Lapulapu's victory in Mactan 503 years ago is the equivalent today of Filipinos defeating the US Seventh Fleet.\nThe first major loss of the US Army overseas was in the town of Balangiga on Samar Island on Sept. 28, 1901.\nThe battle was planned by Captain Eugenio Daza, area commander of Captain General Vicente Lukbán's forces in southeastern Samar. The attack was led by Valeriano Abanador, Balangiga police chief.\nOf the 74 men of the US Army's Company C, 36 were killed in action, including all its commissioned officers: Captain Thomas W. Connell, First Lieutenant Edward A. Bumpus and Major Richard S. Griswold. Twenty-two Americans were wounded in action and four were missing in action. Eight died later of wounds received in combat; only four escaped unscathed. The Filipinos captured 100 rifles and 25,000 rounds of ammunition and suffered 28 dead and 22 wounded. Dressed as women, the Filipino army used nothing more than bolos.\nThe encounter is described as the 'worst defeat of United States Army since George Armstrong Custer's last stand in the Battle of the Little Bighorn in 1876' and its worst defeat before Vietnam in 1975.\nEmbarrassed worldwide, US president Theodore Roosevelt ordered Major General Adna R. Chaffee, military governor of the Philippines, to pacify Samar. Chaffee appointed BGen. Jacob H. Smith to do the task.\nSmith declared, 'I want no prisoners. I wish you to kill and burn; the more you kill and burn, the better it will please me ... The interior of Samar must be made a howling wilderness ... Kill anyone over 10 years of age.'\nSamar was a major center for Manila hemp production, which was financing Philippine forces on the island. At the same created_at, US interests were eager to secure control of the hemp trade, which was vital for the US Navy and American agro-industries such as cotton.\nMactan and Balangiga proved that Filipinos can defeat a superior enemy, despite the latter's advantages, in number of soldiers, modern weaponry, global network.\nMax Boot of the Washington Post writes about Trump's idol, William McKinley, the 25th US president:\n'Trump's affinity for McKinley would appear to run deeper than mere tariffs. McKinley is remembered, after all, primarily for his promotion of US imperialism: He fought a 'splendid little war' against Spain and subsequently turned the Philippines into a US colony, took possession of Guam and Puerto Rico, annexed Hawaii and made Cuba into a protectorate. Trump seems eager to inaugurate a new era of territorial expansion and high tariffs, à la McKinley. A glance back at the 1890s suggests why these are both really bad ideas to resurrect:\n'Even McKinley came to see the limits of tariffs: as president, he embraced the benefits of 'reciprocity' (lowering US tariffs in return for tariff reductions in other countries), and, in the last speech he gave, in 1901, he warned that economic 'isolation is no longer possible or desirable.' In later years, US policymakers would abandon his high-tariff policies and promote free trade.\n'McKinley's embrace of American imperialism proved fleeting, for very good reason... By foolishly annexing the Philippines in 1899, McKinley embroiled America in another conflict that cost the lives of more than 4,200 US soldiers and 20,000 Filipino combatants. More than 200,000 Filipino civilians also died from violence, famine and disease, and US soldiers committed war crimes that shamed the nation.\n'The United States eventually won the conflict but secured no real strategic or economic advantage; the US bases in the Philippines were easily overrun by the Japanese in 1942.\n'Little wonder that, in future years, US leaders eschewed colonialism and embraced Woodrow Wilson's policy of national self-determination. By the same token, US leaders focused on lowering, not raising, trade barriers. Now Trump seems determined to turn back the clock in ways that can only encourage other countries to erect their own tariffs and to undertake their own territorial expansions - as China would like to do in Taiwan and as Russia is already doing in Ukraine.'\n"
  },
  {
    "id": 739,
    "title": "FBN, MORNINGS WITH MARIA INTERVIEW WITH REP. CLAUDIA TENNEY (R-NY)",
    "created_at": "2025-01-28",
    "text": "\nFBN, MORNINGS WITH MARIA INTERVIEW WITH REP. CLAUDIA TENNEY (R-NY)\nJANUARY 28, 2025\nSPEAKERS: REP. CLAUDIA TENNEY (R-NY)\nMARIA BARTIROMO, FBN ANCHOR\n[*] MARIA BARTIROMO, FOX BUSINESS NETWORK ANCHOR: Joining me now to talk more about it is New York Congresswoman Claudia Tenney, a member of the House Ways and Means, and Intelligence Committees. Congresswoman, it's good to see you this morning, another year in Florida, at your retreat with your colleagues there. But, let me first kick things off on the border here, and what we're hearing from Kristi Noem. New York City is now the target for ICE.\nREP. CLAUDIA TENNEY (R-NY): This is tremendous, Maria. I am so happy to see this, and I've been home in my district last weekend and I'll be going back tomorrow. All I've heard from especially a lot of senior citizens and others is how thrilled they are that we're seeing these absolutely violent criminal illegal immigrants that are being harbored by these sanctuary cities, being taken out of our communities and making our communities safer. This is a huge win for the Trump administration. It shows that we have decisive leadership. We do not have the paralysis of analysis and the really just succumbing to and really promoting and helping illegal immigrants in our communities. It's a real issue that Trump is taking with true leadership.\nBARTIROMO: Yeah, because he is putting national security first as the priority, and I spoke with Senator John Thune about that on Sunday, given the fact that you all are talking about an increase in the top line defense spending number. Here is what the majority leader of the United States Senate told me Sunday. Watch.\n(BEGIN VIDEO CLIP)\nBARTIROMO: What are you looking for in terms of specifics in bulking up America's defense?\nSEN. JOHN THUNE (R-SD): Well, obviously our Navy, and if you look at the number of ships we have relative to our adversaries, particularly China, that's something the President is interested in, in an American Iron Dome concept. But the -- frankly, the thing we've got to do, Maria, is we've got to increase the top line. We have not -- we have underfunded and in the Biden budget, there wasn't a single Biden budget that kept up with the rate of inflation when it comes to the military. And so, we've got some making up to do.\nI think there is a very compelling argument on Panama, a very compelling argument on Greenland, an optimism in America that we haven't seen in a long created_at. I think there has been a real -- this has been a sluggish country, a country that has been bogged down under the weight of government regulation and red tape and taxation.\n(END VIDEO CLIP)\nBARTIROMO: I mean, Congresswoman, what the heck were they doing in the last four years? President Trump just announced plans to build this missile defense shield for the United States. Here he is. Watch.\n(BEGIN VIDEO CLIP)\nDONALD TRUMP, PRESIDENT, UNITED STATES OF AMERICA: I'll be signing four new executive orders. First is that I'll be directing our new Secretary of Defense, Pete Hegseth, who is what we need, to immediately begin the construction of a state-of-the-art Iron Dome missile defense shield which will be able to protect Americans, and you see that with Israel. We're out of 319 rockets. They knocked down just about every one of them. So, I think the United States is entitled to that, and everything will be made right here in the USA, 100 percent.\n(END VIDEO CLIP)\nBARTIROMO: Your reaction, congresswoman.\nTENNEY: This is tremendous. The whole reason that our founders created the federal government is for security and protecting us, and that's exactly what we're -- the mission is. Great to hear from Senator Thune, echoing the same remarks as President Trump. We have a great leadership team coming in on the defense side, as well as the Homeland Security side, and also with National Security Advisor Michael Waltz, also -- already doing a phenomenal job.\nLook, we need to -- and when he talks about the Navy, we need to continue to bring our submarines up to speed, especially in the South China Sea and areas like that, where our sea power is much needed to counter China. I mean, this is incredible that we are finally waking up and recognizing that we have real enemies around the world and people that are looking to topple the United States as the dominant leader in the world. We are the greatest, most powerful, benevolent country in the world. We have to lead. If we're not leading, the world is in chaos, and that's exactly what we saw over the last four years of the feckless non-leadership of the Biden administration, really run by deep state actors behind the scenes in the White House.\nBARTIROMO: Yeah. And I know that the border has been your priority, secure this nation, and here is that video that Kristi Noem tweeted out, by the way, that the enforcement operation in New York City is underway. A criminal alien with kidnapping, assault and burglary charges is now in custody, and she writes \"dirt bags like this will continue to be removed from our streets\".\nBut look, congresswoman, now the work falls to you and your colleagues. House Republicans are set to meet with Vice President J.D. Vance today at the Trump Doral resort in Florida, where you are all talking about executing President Trump's agenda as part of this annual conference. The committee chairs expected to hold the reconciliation meetings, how to pass President Trump's agenda. And Trump joined lawmakers for dinner last night, saying he doesn't care if Congress passes the agenda in one bill or two bills, but he knows he has got to get this agenda passed. Tell us what it looks like.\nAre you expecting to be united? Because now the work falls to you, but you've got one portion of your colleagues saying, I'm not going to sign anything unless SALT deduction is lifted. You've got another portion of the conference saying I'm not going to agree to any increases in the debt limit, and I'm not doing anything with the debt ceiling, because we've got $36 trillion in debt. You've got the other saying, we have to put more money into defense. Are you going to come together and get this done?\nTENNEY: If we don't come together and we don't get it done, Maria, this is exactly what the American people wanted. President Trump has a mandate, and they're depending on our Republicans in the majority to make that happen. All these people are going to have to come together. And as Sean Hannity said the other day, you're not going to get everything that you want. We've got to get the agenda across the finish line. We can continue to nuance it as we move through this. It has to get done. We have to unify. Our strength is (inaudible), and that's exactly what we're going to be doing.\nBARTIROMO: Is the biggest sticking point, how much to raise SALT? It's now at $10,000. The cap is $10,000. But, Mike Lawler came out with a bill, what, last year, $100,000. You're not going to go higher -- as that high. Are you?\nTENNEY: Well, look, as you know, I'm from New York. Three percent of my district actually itemizes. So, SALT is not a top priority for my constituents. It may be a top priority for a lot of the New York donors and people that are wealthy that need this SALT deduction. There has to be a compromise. We made a compromise in 2017. I don't see those numbers coming out. I think that they're negotiating high, hoping to get something in between. In our special state and local tax deduction meeting with President Trump, he said, you guys need to come up with a sweet spot, and it's got to be something that is -- matches what everyone else in the conference can accept, and that's what we're going to be doing. We have to have a compromise.\nLook, I agree with President Trump. He said, how much more do we have to do to compromise to make sure that the New York government continues to provide bad governance for our New York taxpayers?\nBARTIROMO: OK. So, real quick --\nTENNEY: He said that. But, we want to make sure we protect the lower and middle income taxpayers.\nBARTIROMO: Of course.\nTENNEY: So, where are we? It's got to be a sweet spot.\nBARTIROMO: Real quick. What's the other point of contention? What's the other disagreement among you all?\nTENNEY: I think the big thing is a lot of people want to see us cut mandatory spending. And Maria, we had a bill to repeal and replace Obamacare, which we passed in the House of Representatives. It was voted down by one vote. John McCain, God rest his soul, voted no. We could have cut mandatory spending. That's where all the money is. And now we've got to get into DOGE and --\nBARTIROMO: Yeah.\nTENNEY: -- DOGEing (ph) things and finding out where we can cut --\nBARTIROMO: Sure.\nTENNEY: -- because if we're going to go into rapid growth --\nBARTIROMO: Yeah.\nTENNEY: -- with this energy production, with cutting taxes, you also have to bring down the cost of government. We have --\nBARTIROMO: That's right.\nTENNEY: -- record revenues.\nBARTIROMO: That's a good point.\nTENNEY: We've got to cut down the costs.\nBARTIROMO: It's a great point, because you can't go anywhere if your hands are tied, because it's all mandatory. That's the bottom line.\nTENNEY: Absolutely.\nBARTIROMO: Congresswoman, it's great to see you. Thank you so much.\nTENNEY: Yeah. I mean, the slimmer of what you see in discretionary spending. By the way, you know what's in discretionary spending?\nBARTIROMO: What?\nTENNEY: Defense. And we have to grow our defense spending, and we have to streamline --\nBARTIROMO: Ridiculous.\nTENNEY: -- it too. There is a lot of fraud, abuse and waste in the defense budget, and I think that's where -- that has to happen too.\nBARTIROMO: Well, defense shouldn't be discretionary, in my view. It should be mandatory. Claudia Tenney, thank you.\n"
  },
  {
    "id": 740,
    "title": "Use of LRAD demonstrates China’s heightened aggression in WPS — Navy",
    "created_at": "2025-01-28",
    "text": "\nThe Philippine Navy on Tuesday said the China Coast Guard’s use of a long-range acoustic device (LRAD) only demonstrates Beijing’s heightened aggression in the West Philippine Sea (WPS). “The long-range acoustic device is an increase in the aggression of the..."
  },
  {
    "id": 755,
    "title": "Cantwell Calls for Revitalized US Maricreated_at Strategy to Secure Panama Canal from Foreign Adversaries, Increase Trade and Lower Costs for Americans; Senate Commerce, Science, and Transportation Committee News Release",
    "created_at": "2025-01-28",
    "text": "\nFollowing today's Commerce Committee hearing on the Panama Canal, U.S. Senator Maria Cantwell (D-Wash.), Ranking Member of the Senate Committee on Commerce, Science and Transportation, reiterated the need for continued U.S.-Panama cooperation to increase investments in port infrastructure and cybersecurity measures that will strengthen national security, increase trade and lower costs for consumers. The senator will request Defense officials to brief Committee members on foreign threats to the Panama Canal and plans to lead a delegation to visit the Canal's operations.\n\"The Panama Canal is vital to America's supply chains, lowering costs of consumer goods and our national security,\" Sen. Cantwell said following the hearing. \"It's critical that the United States and Panama work cooperatively on new cyber security measures to close backdoors to foreign adversaries. The United States and Panama should also work together to boost port and Canal infrastructure to lower costs, and ensure reliability of the Canal. To that end, I am requesting the Department of Defense and the Coast Guard provide a classified briefing so that all committee members are fully informed about foreign adversary threats to the Canal, including adjacent areas. I also plan to lead a delegation to visit the Panama Canal Authority this Spring to see operations first-hand. I support more U.S. trade and investment in Latin America and want a new Free Trade Agreement of the Americas. And I hope the Committee will work on a maricreated_at strategy.\"\nRanking Member Cantwell's Opening Statement at the Hearing as Delivered:\nAccess to the Panama Canal is essential to maintaining America's supply chains, lowering inflation and the costs of consumer goods, and ensuring our national security.\nWith about 72% of the goods transiting the Canal coming to or from U.S. markets, a stable waterway is vital for states like mine where 1 in [3] jobs are related directly or indirectly to trade.\nSeattle-based SSA Marine operated the Manzanillo International Terminal in Colon, Panama, for the last 30 years is our largest US logistic presence in Panama with 19 massive cranes, 3.5 million cargo containers, and employing over 1,000 people.\nIn fact, Washington's maricreated_at economy supports 170,000 jobs and $45 billion in annual revenue.\nAnd our U.S. maricreated_at economy supports over 21 million jobs. And almost $3 trillion in America's GDP.\nSo, anything that our Committee can do to help grow our maricreated_at economy, I'm all for.\nThat is why it's so important that this Committee not just to focus on Panama, but on broader solutions to meet our U.S. maricreated_at opportunities and challenges.\nThis Committee passed the Ocean Shipping Reform Act led by our colleagues, Senator Klobuchar and Senator Thune, to address shipping costs and stop carriers from practices that delayed U.S. cargo and increased costs. This law also gave the FMC, our two Commissioners who are here today, the ability to do better investigations. So I look forward to hearing about their investigation on the Panama Canal and these cost issues.\nAnd many members of this Committee have worked on the infrastructure bill to do dock replacements in places like Alaska, rail improvements, pier infrastructure, safety improvements, and container yard expansions. And I know that my colleagues who represent these maricreated_at investments need a maricreated_at workforce and continued investment.\nMany of our colleagues, Mr. Chairman, have great ideas. Senators Kelly and Young from the Senate, along with Representatives Garamendi and Kelly from the House, and they have been working with maricreated_at stakeholders on these larger bills.\nBut Mr. Chairman, if this Committee doesn't embrace this larger agenda, it's going to get decided in the Finance Committee. So I hope that we can get some of these issues and show that this Committee is the Committee for maricreated_at jurisdiction.\nA bill that provides a comprehensive strategy to rebuild America's supply chain supremacy, the sea lift capacity that we need to defend our interests in the South China Sea and the Indo-Pacific region, and to revitalize our nation's ports and ship building capacity.\nA revitalized U.S. Maricreated_at strategy would not only be good for our economy but critical for our national security.\nAt the same created_at, we face cyber threats from our foreign adversaries--and Panama is a perfect example.\nWhich bring us to the today's hearing.\nI am concerned about the Chinese-owned ports in Panama and their proximity to the Canal.\nI am also deeply concerned about the installation of Chinese equipment from Huawei and other Chinese companies near the Canal.\nThis is why this Committee successfully worked to get $3 billion in rip and replace at the end of last Congress. So if we're trying to get them out of U.S. ports and areas, we certainly shouldn't allow them in ports and vessels and backdoors in places like Panama.\nMr. Chairman, I would like to ask for Unanimous Consent to enter into the record a letter from the two most recent U.S. Ambassadors to Panama who make the case for continued U.S. investment in infrastructure and cybersecurity.\nThese ambassadors know better than anyone that America's adversaries have built backdoors into communications technology in our supply chains - both software and hardware. Whether it's a crane over the port or a bridge, we cannot tolerate Huawei, TikTok, Artificial Intelligence, or other adversaries using a government backdoor.\nMr. Chairman, I'm a very big fan of the five biggest technology interests in basic democracies forming a \"Technology NATO.\" We should be saying to the world, notext should be buying technology or equipment that has a government backdoor.\nThese are complex issues and we need solutions.\nI will be requesting that the Department of Defense provide a classified briefing to all members of our Committee about foreign adversary threats to the Panama Canal, including these adjacent areas.\nI received an initial classified briefing from U.S. Southern Command and have spoken to former U.S. Southern Command leader, General Laura Richardson, on these issues.\nI also plan to go as a Delegation, or by myself to Panama, and visit the Panama Canal Authority. I invite other members to do so, hopefully this spring.\nAny successful strategy also has to not just focus on cybersecurity and cooperation, and we'll ask some of our witnesses here today, but the larger issue is we need to understand what are the shortfalls of the current agreement that doesn't get at this upgraded technology concern. I would hope that Panama would be very cooperative in discussing these cybersecurity investments and what needs to be made.\nAs we all know, the Panama Canal is an authority independent, the Chinese government doesn't [set]...the shipping rates, but the authority has been grappling with historic rainfalls, climate change, and a solution I believe is for us to work together, as the Army Corps did before on solutions and making sure that instability in water is not the cause of increase in rates. We need to work on these solutions.\nBut Mr. Chairman, I also believe that the larger issue here, as you mentioned in your statement about Belt and Road initiatives by the Chinese and their expansion, needs to be met with an aggressive response by the United States. I firmly believe in trade.\nBut again, easy for me to say, or maybe from Texas, when you're coming from a very trade-dependent state.\nBut the issue is, we didn't have [a Senate-confirmed] ambassador there for five years in Panama. For all my colleagues who hold up ambassadors, you should rethink your strategies when you do this. Because holding up ambassadors and not dealing with these issues put us behind the eight ball.\nExpanding exports to the 95% of the world's consumers, and roughly 3.5 billion people, I believe is a good idea.\nI hope we can have a more aggressive strategy in Latin America.\nI think the proposals by Senators Cassidy and Bennet, the Americas Act, is also a like-minded...[coalition] of Latin American countries so that we could join together in sort of a US-Mexico-Canada Free Trade Agreement.\nAnd I also believe that a Free Trade Agreement of the Americas that links modernization and all our FTAs in Latin America and Caribbean would help along with an aggressive strategy of saying no government backdoors and making the kind of investments that the Export-Import Bank can do to counter China.\nMr. Chairman, thank you for organizing this important hearing, such investments ensure resilient supply chains, boost exports, lower consumer costs, and most importantly, protect our national security.\nRanking Member Cantwell's QandA Segment:\nCANTWELL: Mr. Kramek, I think costs are critical. When you think about it, we're here discussing costs. Why? Because consumers pay more when shipping costs are higher. Whether our farmers who are trying to export their products, as we saw during COVID, our products are getting left on the docks, and importers are paying more if shipping costs are too high.\nSo when we look at these incidents that we now see in our supply chain, and we had our own incident in Seattle where a container ship lost power and was careening towards our big Ferris Wheel in the downtown, right next to our ferry terminal. Luckily, some passenger ferry vessels were able to push the tug from, you know, out of the direct path of severe devastation. So now we mentioned the Suez Canal. We mentioned Baltimore. We have our own Seattle experience.\nWhat do we need to do to make sure, on the cost side, that we're making the right investments from a security level to make sure that these kinds of incidents that can do great harm do not happen?\nAnd Commissioner Sola, since you were at US Southern Command. What do you think we need to do to renegotiate or to have a conversation with the Panamanians about the security level that we think needs to exist in Panama with this close proximity?\nAnd Mr. Maffei, will the audit lead to a discussion with Panama about those contracts? As I've said in my opening statement, I believe we should be very aggressive about U.S. involvement here and in Latin America. I think Panama represents one of the biggest U.S. supporters in that region, but we should engage to get this right, both on the cost side and on the security side. So if I could just hear your comments on each of those.\nMR. KRAMEK: Thank you, Senator Cantwell. Well certainly even one incident is unacceptable from a safety perspective that you're citing. Our members work tremendously hard with the International Maricreated_at Organization, the U.S. Coast Guard and other entities to try to have the safest operations possible. But accidents do occur. They are rare if you count the number of some 7,000 port visits a year. But again, one is unacceptable. So continued investment, obviously, in U.S. infrastructure and a review. We have a lot of old infrastructure, as the tragic incident in Baltimore illustrated, unfortunately. We have these bridges that, you know, need a hard look to whether or not they need additional fendering systems and the like. And investments in our ports and infrastructure can be helpful along those lines as well. And for our members, I can assure you that they continue to invest in the latest technology. We have over 600 new ships on order with some of the latest technology in the world. So we are playing our role.\nCANTWELL: I want the U.S. to get a big portion of that. That's why we need to reinvigorate.\nCommissioner Sola, what about just a new US Southern Command and U.S. government conversation with the canal authorities and the government about the security level that we seek?\nCOMMISSIONER SOLA: Thank you very much, Senator. First of all, the airborne wing that I'm wearing today is decorative. I have not worn a uniform in 35 years. So this is my personal experience here. I believe that the security of the Canal has always been understood to be provided by the United States. Panama does not have a military, and I always believe that there has been a close relationship with Southern Command that we would provide that. And it would be nice to see if we had a formalization of that in one way or another because I don't believe that it's in the treaty at all.\nCANTWELL: Okay, so formalization of maybe a cyber security agreement. See, I'm thinking this is, you have accidents, and then you have larger cyber security issues that you just have to be on top of. And what I don't like about anytext that has a backdoor is, I'm for the United States advocating don't buy it from people who have a government backdoor. Don't do it. Because what are you going to do? At some point in created_at, you're going to regret that.\nCommissioner Maffei, what about this audit? And could we push Panama on these issues of looking at closer U.S. infrastructure instead? Particularly since, you know, the sea change here is like what everytext said, everytext thought this was Hong Kong. Then it turned into China. We didn't have an ambassador. After that, next thing you know, they've made more aggressive postures. They're making aggressive postures everywhere. That's why the United States saying no government backdoors in technology, and getting five other technology nations and democracies to say the same thing and evangelize that every day is going to help us. And so is the investment.\nBut what about getting the stevedoring business, or some of that back into proximity under the audit?\nCOMMISSIONER MAFFEI: Well, it is the Panama Controllers Office, and they are investigating, you know, contracts at Panamanian ports. And we don't have any jurisdiction over Panamanian ports per se. But your broader point, I think, is very, very important. While we were down there, both of us heard, I think several created_ats, that the Panamanians--the ones we talked to anyway--would welcome U.S. companies coming in and doing a lot of this work. Frankly, they're bids are not competitive with the Chinese bids. Frankly, they're not that existent, because the U.S. companies can make more money doing things other places. But even if they were existing, it is difficult to put competitive bids when the Chinese bids are so heavily subsidized by China. So you're absolutely right. This is a problem, and it's a problem in many, many other areas of the world that we can get into if you want in subsequent questions.\nCANTWELL: My created_at is expired, but I think my major point is, let's be a big maricreated_at powerhouse. Let's revitalize our supply chains, drive down costs for consumers, and secure what we need to secure. Thank you, Mr. Chairman.\nRead this original document at: \n"
  }
]