[
  {
    "id": 764,
    "title": "Malaysia's Anwar urges Asean not to 'single out' Beijing over South China Sea tensions at Davos",
    "created_at": "2025-01-29",
    "text": "\n Anwar's statement at the World Economic Forum emphasises the need to balance strong relations with China while addressing maricreated_at issues   \nMalaysia's Prime Minister Anwar Ibrahim has urged Southeast Asian nations not to \"single out\" Beijing over South China Sea disputes, a stance analysts said reflects a pragmatic effort to navigate the geopolitical landscape amid the uncertainties surrounding US-China relations under President Donald Trump. \nSpeaking at the World Economic Forum in Davos, Switzerland on Wednesday, Anwar said that boundary disputes will always exist in Asia, noting that despite Malaysia's border issues with Singapore and other Southeast Asian neighbours, the country has maintained strong relationships. \nDespite facing maricreated_at issues with China, Anwar emphasised the importance of improving ties, stating that, despite these disputes, Malaysia does not \"go to war\" or \"threaten\". \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nThitinan Pongsudhirak, a political science and international relations professor at Chulalongkorn University in Thailand, said Anwar is downplaying the China challenge in Southeast Asia to better \"navigate choppy geopolitical waters\" amid Trump's second presidential term. \nHowever, China's actions in Southeast Asia are fundamentally different from its past border disputes with neighbours like Vietnam, Pongsudhirak said. \n\"Beijing is now in contention with regional neighbours over the entire South China Sea,\" he said, adding that Indonesian President Prabowo Subianto is also \"treading softly\", even recently joining the China-driven Brics group as a full member. \n\"Except the Philippines as an outlier, other Asean member states appear intent to stand down on China until they see how the Trump 2.0 administration will deal with Beijing,\" Pongsudhirak said, referring to the 10-member Association of Southeast Asian Nations bloc. \nBacked by international law, the Philippines is \"standing up to China's unilateral construction and weaponisation of artificial islands\" in the disputed waterway, he added. \n\"No Asean member state wants to overtly take sides between Washington and Beijing, but none of them also want to end up on the wrong side until geopolitical conditions in the region are clearer,\" Pongsudhirak said. \nGiven that Malaysia is chairing Asean this year, Pongsudhirak suggested that Anwar will focus on re-election at home while attempting to build a \"statesman legacy\" internationally. \n\"He is being deferential to China while waiting to see what Trump is going to do before recalibrating.\" \n\"This posture further marginalises the Philippines as the one and only Asean member state willing to stand up against China's belligerence,\" Pongsudhirak added. \nOh Ei Sun, principal adviser at the Pacific Research Centre in Kuala Lumpur, said Anwar's comments are intended to communicate that China \"is an important country\" that Malaysia \"could not afford to antagonise\". \nAnd since China's military strength far exceeds Malaysia's, it will be unable to effectively \"stand up to China's strident postures in the South China Sea and beyond,\" Oh said. \nChong Ja Ian, a political scientist from the National University of Singapore, said Anwar's comments reflect his aspirations for enhanced ties between Malaysia and China. \n\"The difference with some of the disputes with other Southeast Asian states are that they are neither militarised nor do they involve regular shows of force using paramilitary forces, such as coastguards,\" Chong said. \nIn Malaysia's disputes with its neighbours, Chong noted that the parties involved were open to third-party arbitration under international law and institutions. \n\"They accepted the results of the arbitration. This does not seem to be the case with [China], although I suppose someone can hold out the hope that Beijing may come around,\" Chong said. \nIn 2016, an international tribunal in The Hague ruled in favour of the Philippines in its case against China over the South China Sea, declaring Beijing's claims, including the nine-dash line, unlawful. China does not recognise this decision. \nMalaysia and Singapore have been involved in various disputes, including over Pedra Branca which the International Court of Justice ruled in favour of Singapore in 2008. \nIndonesia and Malaysia's main maricreated_at disputes have occurred in the Celebes Sea or Sulawesi Sea, with both countries claiming sovereignty over the Ligitan and Sipadan islands. The dispute over the Ambalat block of the Celebes Sea seabed, believed to be rich in mineral resources, remains unresolved. \nChong said that as the Malaysian leader, Anwar has the prerogative to determine what he considers appropriate regarding his country's claims, subject to pressure from parliament and Malaysian voters. \n\"He can absolutely choose to accommodate and set aside differences to seek cooperation and perhaps economic returns. Should Anwar's government so desire, they can begin to cede all Malaysia's claims in the South China Sea to [China] or any other actor.\" \n\"That is Malaysia's sovereign right, and one of Asean's foundational principles is non-interference in members' domestic affairs,\" Chong said. \nOh from the Pacific Research Centre believes that during his speech in Davos, Anwar was also trying to point out how ineffective Washington is at supporting free trade while criticising the US for standing \"unconditionally and wholeheartedly with Israel\", contrasting it with the support China and Malaysia give to the Palestinians. \n\"The US is ambivalent to free trade, which is the economic bloodline to Malaysia,\" Oh said, adding that it is a sencreated_atnt shared among Asean countries. \n\"Most Southeast Asian countries are developing ones, and you need to buy their hearts with cold hard cash, which the US was increasingly unwilling to do, in stark contrast to China.\" \nRegarding the Palestinian issue, Indonesia, the largest and most powerful Asean country, shares a similar perspective with Malaysia, as both are Muslim-majority nations, Oh added.  \n"
  },
  {
    "id": 766,
    "title": "Malaysian speaker: Philippines 'doing the right thing' with China talks",
    "created_at": "2025-01-29",
    "text": "\n Malaysian House Speaker Johari Abdul said the Philippines is \"doing the right thing\" by engaging with China diplomatically amid its territorial dispute in the South China Sea.\n\"Whatever the Filipinos are doing is the right thing. It means it's engaged. You know, anything on earth, the best thing to do is engage,\" Johari told reporters in Manila on Tuesday, January 28.\nMalaysia opposes external interference in the South China Sea dispute, where it, along with the Philippines and other Southeast Asian nations, has overlapping claims.\nAs ASEAN chair this year, Malaysia faces the daunting task of navigating the South China Sea dispute amid China's years-long reluctance to accelerate talks on a Code of Conduct. The situation is further complicated by rising regional tensions due to Beijing's increasing aggressive maricreated_at behavior.\n\"That's what I think, that's what the Philippine government is doing with China. You engage, talk, engage and talk,\" said the Malaysian leader, who undertook a three-day official visit to the Philippines from January 27 to 29.\nWhen asked if Malaysian Prime Minister Anwar Ibrahim would be open to maricreated_at delimitation talks with Philippine President Ferdinand Marcos Jr., Johari said both leaders are always engaged in dialogue.\n\"It has always been talking. We never stop. Day talk, night talk, morning talk, every created_at,\" the Malaysian House speaker said.\nFamily friends?\nJohari said Marcos and Anwar are \"very close.\"\n\"Anwar and President Marcos Jr. is very close like a family friend. In fact, the Madam [Imee] Marcos is a very close friend to Prime Minister Anwar. They talk in the morning, during lunch, breakfast, dinner, supper,\" Johari said.\nWhen asked about Malaysia's position on the Philippines' recently passed Maricreated_at Zones Act, Johari deferred to executive officials. \"That is the work of [the] executive to look into it. So probably the executive who is in charge of that will certainly issue a statement after they have looked at the whole thing and again after the talk,\" Johari said.\nJohari did not comment on whether Malaysia will shepherd a stronger ASEAN stance on territorial disputes with China as it chairs the text this year. He said, however, that successful diplomacy requires patience. \"You can't put a created_atline. I want the answer by tomorrow, you can't do that. This is what diplomacy is all about,\" he said.\nThe Malaysian leader also drew parallels between the South China Sea situation and ASEAN's approach to Myanmar when discussing regional engagement strategies.\n\"Some even ask me this tough question, why don't ASEAN take more tough action against Myanmar? I say, why should we?\" Johari said. He said this approach could be counterproductive: \"If you push a person too hard to a corner until he doesn't have that breathing space, it might not help at all.\"\nThe law, which was signed in November 2024, declares the Philippines' maricreated_at zones in accordance with the United Nations Convention on the Law of the Sea.\nIn November, Malaysia said it would protest the law, with Malaysian Deputy Foreign Minister Mohamad Alamin telling parliament that it encroaches on Malaysia's oil-rich state of Sabah.\nSabah, a Malaysian state in Borneo, has been the subject of a long-standing territorial dispute between Malaysia and the Philippines, with Manila maintaining a historic claim to the territory based on the ancestral rights of the Sultanate of Sulu.\n"
  },
  {
    "id": 767,
    "title": "US Ally 'Actively Challenging' China in Contested Waters",
    "created_at": "2025-01-29",
    "text": "\nThe Philippines says it is \"actively challenging\" the Chinese coast guard's weeklong presence in the U.S. ally's internationally recognized exclusive economic zone (EEZ).\nNewsweek has reached out to the Philippine coast guard and Chinese foreign ministry with emailed requests for comment.\nWhy It Matters\nChina's territorial claims, which encompass most of the South China Sea, extend into waters claimed by several neighbors including the Philippines.\nIn recent years, China has increasingly deployed its large, heavily armed coast guard ships hundreds of miles from its coastline to reinforce these claims with patrols—and, at created_ats, ramming maneuvers and water cannons.\nUnder the United Nations Convention on the Law of the Sea, a claimant state alone is entitled to natural resources within its EEZ, which extends 200 nautical miles (230 miles) from the coast.\nWhat To Know\nIn a radio challenge shared by the Philippine coast guard Wednesday, the crew of the 320-foot BRPTeresa Magbanua, one of the agency's largest ships, can be heard ordering its Chinese counterpart, CCG-3304, to leave.\nCCG-3304 is one of several Chinese vessels that have been occupying waters less than 100 nautical miles off Zambales, a province on the populated Philippine island of Luzon.\nSince arriving early on Tuesday, the Teresa Magbanua has broadcasted challenges hourly and has \"successfully pushed\" the other ship slightly further from the Zambales coast—though it remains well within the Philippine EEZ.\n\"The Philippine coast guard is committed to ensuring the safety of our fishermen, safeguarding our maricreated_at jurisdiction, enforcing international law, and preventing escalation of tensions,\" the agency's spokesperson Jay Tarriela wrote in a Tuesday night post on X (formerly Twitter).\nThe spokesperson cited ship-tracking data that showed three other Chinese coast guard cutters were operating near Scarborough Shoal—known in the Philippines as Bajo De Masinloc and in China as Huangyan Island.\nChina wrested de facto control over the rich fishing grounds after a 2012 standoff with Philippine forces.\nWhat People Are Saying\nRay Powell, director of Stanford University-affiliated maricreated_at analysis group SeaLight, told Newsweek: \"China's maricreated_at occupation of the West Philippine Sea has reached a new level of sustained intensity, especially around Scarborough Shoal and the waters west of Zambales.\n\"China appears intent on denying Philippine government vessels access to Scarborough Shoal, and on communicating its willingness to interfere with Philippine freedom of navigation within its own exclusive economic zone wherever it overlaps with China's discredited dash-line claim.\"\nHu Bo, director of Peking University's Center for Maricreated_at Strategy Studies and the South China Sea Strategic Situation Probing Initiative think tank, said: \"With China's current strength and capabilities in the South China Sea, as long as there is firm determination and will, other claimants like the Philippines are unlikely to succeed in on-site infringements and provocations even with external support. Excessive worry about risks and uncertainties is not advisable.\"\nWhat Happens Next\nWhile the territorial dispute has lowered in intensity since China and the Philippines began holding regular talks last year, neither side is likely to give ground on the issue.\nAdditionally, the Philippines is preparing to sue China over alleged environmental damage within its EEZ, which Manila refers to as the West Philippine Sea.\nThe Southeast Asian country won a landmark case at the Hague's Permanent Court of Arbitration in 2016 when an international tribunal dismissed China's sweeping South China Sea claims. Beijing did not participate and maintains the ruling is invalid.\nLink to Image\n\nGraphic\n \nPhilippines Monitors Chinese Coast Guard\nPhilippine Coast Guard\nPhilippines Monitors Chinese Coast Guard\n"
  },
  {
    "id": 768,
    "title": "Philippine Army to Begin Training with US MRC Typhon Missile System in February 2025",
    "created_at": "2025-01-29",
    "text": "\nAccording to information published on Military Cognizance Facebook account on 28 January 2025, approximately 20 soldiers from the Philippine Army's artillery regiment are set to begin specialized training with the U.S. Mid-Range Capability (MRC) Typhon missile system in February 2025. The training, which will focus on the advanced capabilities of the Typhon system, particularly its cruise missile capabilities, will not involve live-fire exercises. This initiative marks a significant step in the Philippines' ongoing defense modernization efforts and strengthens the military cooperation between the U.S. and the Philippines.\nThe Typhon missile system is the nickname for the U.S. Mid-Range Capability (MRC) system, which is designed to address a critical gap in the U.S. and allied defense capabilities. This system is capable of launching long-range missiles, providing the flexibility to strike a wide range of targets with precision. The Typhon is especially significant due to its versatility and operational mobility, as it can deploy rapidly and engage a variety of targets across large distances. The Typhon is specifically designed for mid-range missile defense, enabling high-precision strikes in regions where traditional long-range or short-range systems would be less effective.\nKey missile systems compatible with the Typhon MRC include the SM-6 (Standard Missile-6) and the Tomahawk Block V cruise missile. The SM-6 is a multi-role missile capable of targeting air, surface, and ballistic missile threats. Its inclusion in the Typhon system allows for effective anti-air and anti-surface warfare, giving it an edge in countering advanced threats such as enemy aircraft, drones, and maricreated_at assets. The Tomahawk Block V, one of the most advanced versions of the Tomahawk cruise missile, is a long-range, precision strike weapon that can target land-based facilities, including command centers, missile sites, and other strategic infrastructure.\nThe Philippines' interest in acquiring the Typhon system stems from its strategic location in the South China Sea, an area that has become a focal point of heightened military tensions, particularly with China. Chinas expansive territorial claims in the South China Sea directly challenge Philippine sovereignty, making the acquisition of advanced missile systems like Typhon crucial for enhancing the country's defense capabilities.\nThe Typhons long-range strike capabilities would significantly strengthen the Philippine military's ability to protect its maricreated_at and airspace borders. The systems combination of SM-6 and Tomahawk Block V missiles offers the Philippines a potent deterrence against potential regional threats, particularly from adversaries with sophisticated air and naval assets. As China continues to expand its military presence in the South China Sea, the Philippine government sees the Typhon system as a vital component of its defense modernization efforts, which are aimed at enhancing the country's ability to defend its territorial integrity and safeguard its strategic interests.\nThis training initiative is part of broader defense cooperation between the U.S. and the Philippines, built on the Enhanced Defense Cooperation Agreement (EDCA). The Typhon system was deployed during the Balikatan joint exercises in 2024, a clear demonstration of the growing military interoperability between the two nations. Despite strong objections from China, the Typhon missile system remains stationed in the Philippines, symbolizing the deepening defense ties between Washington and Manila.\nThe Philippines has expressed its desire to acquire its own Typhon launchers, with discussions about this potential acquisition ongoing. Philippine officials recognize the strategic importance of having such advanced missile capabilities as part of the countrys defense infrastructure. The upcoming training is expected to prepare Philippine forces for the potential operational integration of the Typhon system, ensuring that the military is fully equipped to manage and deploy the system should the country move forward with acquiring its own launchers in the future.\nThe integration of the Typhon missile system into the Philippine military would not only strengthen its defense capabilities but also have significant implications for the regional security environment. By acquiring the Typhon, the Philippines would enhance its position within the broader security architecture of the Indo-Pacific region, which continues to experience rising tensions, particularly in relation to territorial disputes in the South China Sea.\nThe training of Philippine Army personnel on the U.S. Mid-Range Capability (MRC) Typhon missile system marks a pivotal moment in the country's defense modernization. As the Philippines looks to enhance its deterrence capabilities and build stronger defense relationships with the U.S. and other allies, the Typhon missile system, with its advanced SM-6 and Tomahawk Block V missiles, will play a crucial role in securing the nations strategic interests and strengthening its defense posture against potential regional threats.\n"
  },
  {
    "id": 769,
    "title": "Multinational course bolsters security cooperation among Indonesia, Philippines, U.S., Vietnam",
    "created_at": "2025-01-29",
    "text": "\nCoast Guard, law enforcement and fisheries personnel from Indonesia, the Philippines, the United States and Vietnam strengthened cooperation in mid-January 2025 with maricreated_at security training.\nThe U.S. Bureau of International Narcotics and Law Enforcement Affairs funded the two-week course on the southern Philippine island of Mindanao. It included instructors from the Philippine and U.S. Coast Guards, and Vietnams customs agency.\nTrainers shared expertise on at-sea boardings, maricreated_at law, evidence collection and preservation, safety and risk mitigation, and arrest techniques, according to the Philippine News Agency. Participants included members of the Philippine National Police Maricreated_at Group, the Vietnam Customs Anti-Smuggling and Investigations Department, and the Vietnam Department of Fisheries Surveillance, along with Coast Guard personnel from all four nations. Australian Border Force members joined as observers.\nTogether, we reaffirm our commitment to ensuring that our maricreated_at sovereignty remains a zone of peace, safety and prosperity for all, said Commodore Rejard Marfe, commander of Philippine Coast Guard District Southeastern Mindanao. He credited U.S. capabilities and resources with ensuring all four nations are equipped to counter maricreated_at threats.\nU.S. officials underscored the interoperability participants demonstrated. Its exciting to witness the professional growth and confidence displayed by our multinational instructor group and student participants, U.S. Coast Guard Lt. Dana Schmitt said. We are impressed by their desire to not only master the technical aspects of the course but also to seamlessly interact with and assist one another to optimize the experience.\nThe training comes as the Peoples Republic of China (PRC) escalates tensions in the Indo-Pacific. The PRC claims almost the entire South China Sea in defiance of an international tribunals ruling that invalidated the assertion. Beijing has used its naval, coast guard and civilian vessels to block and harass fishing crews and patrols in the strategically important sea.\nThe PRCs illegal, coercive, aggressive and deceptive actions inside Manilas internationally recognized exclusive economic zone have fueled confrontations for years, including a violent 2024 clash in which China Coast Guard personnel destroyed Philippine Navy equipment and seriously injured a Philippine Sailor.\nIn October 2024, Hanoi protested a brutal assault on Vietnamese fishers by PRC law enforcement who attacked the men with iron bars and stole equipment. The crew was fishing near the Paracel Islands, which both nations claim.\nThree created_ats that same month, Indonesia drove away a China Coast Guard ship that disrupted an oil and gas survey in Indonesian waters, Jakartas Maricreated_at Security Agency reported.\nThe U.S. and its Allies and Partners emphasize that waterways such as the South China Sea are vital to worldwide shipping and must remain open. Manila and Washington also have held maricreated_at law enforcement courses in Palawan, Le Union and Cebu in the Philippines. More training is scheduled for 2025, and Philippine instructors will lead sessions for partner nations.\nMeanwhile, Allies and Partners have recently bolstered partnerships in the Indo-Pacific with engagements including:\nA Philippine-U.S. maricreated_at cooperative activity in the South China Sea in mid-January.\nA visit to the Philippines in mid-January by the U.S. deputy director and assistant deputy director of naval intelligence.\nA 22-day U.S. Coast Guard deployment across Guam and the Northern Mariana Islands to deter illegal activities and deliver humanitarian assistance in November and December 2024.\nThe Cooperation Afloat Readiness and Training exercise in October and November 2024 to build interoperability with the Royal Malaysian Navy.\n"
  },
  {
    "id": 770,
    "title": "Philippines arrests suspected Chinese spies posing as Taiwanese tourists",
    "created_at": "2025-01-29",
    "text": "\n Philippine authorities have arrested several Chinese nationals suspected of espionage after they allegedly posed as Taiwanese tourists to monitor the movements of Philippine coast guard vessels near the South China Sea, local media reported.\nGMA News said the suspects were taken into custody in Palawan province after being caught secretly filming coast guard ships entering and leaving a base from a concealed spot at a beachfront resort. Residents reportedly captured images of one individual engaging in suspicious activities, per CNA.\nWitnesses claimed the suspects operated drones without authorization. They also reportedly installed surveillance cameras on coconut trees facing the sea in an area where Philippine coast guard and navy vessels transit.\nThe suspect denied espionage charges. However, Armed Forces of the Philippines Chief of Staff General Romeo Brawner Jr. said authorities discovered evidence on their mobile phones, including images of military camps, vessels, and other sensitive facilities.\nNational Bureau of Investigation Director Jaime Santiago said the suspects were not acting alone. Authorities have launched a search for their alleged accomplices.\nThe arrests come as tensions between the Philippines and China escalate over territorial disputes in the South China Sea. Palawan is located near the contested Spratly Islands.\nThe Spratly Islands are the subject of overlapping territorial claims by several nations, including Taiwan, China, Vietnam, Malaysia, the Philippines, Brunei, and Indonesia, all of whom assert varying degrees of sovereignty over the islands and the surrounding maricreated_at areas. Taiwan, China, and Vietnam claim all of the islands, while Malaysia, the Philippines, and Brunei lay claim to certain islands within the archipelago, according to the Navy Command.\nSeparately, NBI agents arrested a Chinese national surnamed Deng in Metro Manila's Makati City about two weeks ago. Authorities accused Deng, a long-term resident of the Philippines, of working with local associates to gather intelligence on military bases using vehicles equipped with surveillance equipment to map terrain and structures.\nAt a press conference Monday, Deng's wife denied accusations that he was a Chinese spy. However, GMA News cited sources linking the newly arrested suspects to Deng.\n"
  },
  {
    "id": 771,
    "title": "The Philippines Is Ever More Focused on Taiwan",
    "created_at": "2025-01-29",
    "text": "\nJanuary 29th, 2025 ( Foreign Policy  - Delivered by  Newstex )\nEscalating tensions between China and Taiwan have forced the Philippines-whose northernmost point is less than 100 miles from Taiwan-to intensify its focus on a potential cross-strait conflict.Until now, Manila has prioritized internal security, particularly with regard to Islamist insurgents on the southern island of Mindanao, as well as Beijing's growing encroachment into the Philippines' exclusive economic zone (EEZ) in the South China Sea.But a future Taiwan scenario-how the Philippines might react and potentially support its security ally, the United States, if the latter were to intervene-is now beginning to take up more of Manila's bandwidth.Significantly, in a departure from past administrations, Philippine President Ferdinand Marcos Jr. has publicly discussed his growing concerns over Taiwan.Last summer, Marcos visited his northern army unit and  remarked, 'The external threat [from the Taiwan Strait] now has become more pronounced, has become more worrisome.And that is why we have to prepare.'In a February 2023 interview, Marcos said, 'It's very hard to imagine a scenario where the Philippines will not somehow get involved.'Marcos has also presided over an expansion of the U.S.-Philippines  Enhanced Defense Cooperation Agreement (EDCA), which authorizes the U.S. military to work alongside Philippine forces at nine designated bases for a range of potential future missions.Marcos insists that the new EDCA bases-three of which are on Luzon, the major Philippines island closest to Taiwan-will not be used for 'offensive purposes,' but he has also noted that U.S. access to these sites will 'prove to be useful for us should that terrible occurrence come about,' referring to a Chinese invasion of Taiwan.Much of the operational and strategic planning revolves around Manila's recently completed Comprehensive Archipelagic Defense Concept.This document has never been publicized, but Philippine experts have told me that it is an attempt to shift Manila's mindset away from focusing on internal security threats in favor of external threats and ongoing intrusions, primarily by China against Philippine maricreated_at borders.U.S. and Philippine forces are contributing to the new defense strategy with an obvious focus on Taiwan.Within the last few months, the two countries have been constructing a joint facility on Itbayat in the Batanes province to counter China's military presence in the area.It will  reportedly house emergency equipment and provisions.The U.S. Army has referred to the facility as a 'weatherproof warehouse for disasters' that may store equipment and supplies not only for natural disasters but war, as well.In May and June 2024, Washington and Manila held combat exercises on the islands in the Batanes, designed to defend them from attack.The fact that some of these exercises were integrated into the annual U.S.-Philippines Balikatan exercise is also significant because it demonstratively mainstreams the alliance's attention on Taiwan-related threats.And in response to then-Speaker of the House Nancy Pelosi visiting Taiwan in 2022 to meet with then-Philippine President Tsai Ing-wen, Manila later  built a new Philippine Coast Guard station on Itbayat.In the words of Philippine National Security Advisor Eduardo Año, the new site was necessary because 'China's corresponding naval response was observed in the Luzon Strait' in the aftermath of Pelosi's visit.Manila's newfound attention on Taiwan is likely to have several significant implications.For one, Washington and Manila will now have to collaboratively address another security threat beyond Beijing's rising assertiveness within the Philippines' EEZ in the South China Sea.Beyond their recent Taiwan-focused activities, this could mean that the U.S. military will seek additional force posture and presence options that leverage the Philippines' unique geographic advantages.It could result, for example, in U.S. access to additional bases, particularly in the country's north, and further alliance work on enhancing force interoperability through joint military drills and other activities.For Manila, paying greater attention to threats in the north likely means broader and deeper collaboration with the U.S. military, which Philippine forces can benefit from.The challenge, however, is how to balance a greater focus on Taiwan with other security priorities.The Philippines would probably rather remain focused on Chinese encroachments into its EEZ; instead, the Taiwan Strait will distract Manila and force it to dedicate at least some resources to the area that otherwise could have been used in the South China Sea.The Philippine Coast Guard's establishment of a station on Itbayat demonstrates how this is already happening.China may benefit from the Philippines' move to divide its forces, but this challenge can be mitigated if the U.S. military enhances its presence, as well.Manila's recent decision to approve U.S. deployment of the mid-range Typhon missile system to its territory could reinforce deterrence.The missiles, which Philippine soldiers have already been trained to operate, cover not only much of the South China Sea but could also reach military bases on the Chinese coast.Over the coming months and years, a number of factors could also disrupt Manila's shift toward Taiwan.U.S. President Donald Trump, for example, may expect the Philippines to do more for its own defense rather than relying on U.S. security commitments.For example, when then-Philippine President Rodrigo Duterte attempted to cancel the U.S.-Philippines Visiting Forces Agreement, which is a key pact undergirding the two countries' mutual defense treaty, during Trump's first term, Trump  replied, 'I don't really mind if they would like to do that.It will save a lot of money.My views are different than others.'However, recent Trump administration engagements with Philippine counterparts by U.S. Secretary of State Marco Rubio and National Security Adviser Mike Waltz have underscored that the alliance will remain 'ironclad.'Besides the uncertainty that Trump adds to the mix, new leadership in Manila could also seek to downgrade the U.S. military presence.Duterte's daughter, Sara Duterte, currently serves as Marcos's vice president and is quite popular.If she runs and wins the next presidential election in 2028, she could take her nation down the path laid out by her father of relying less on the United States in favor of closer ties with China.Regardless of these and other uncertainties, China's pressure campaign against Taiwan will not abate.This will keep the United States and Philippines increasingly engaged on cross-strait security with an eye toward limiting the impact a Taiwan conflict will almost certainly have on the Philippines.Link to the original story.N"
  },
  {
    "id": 772,
    "title": "Rand Issues Commentary to Foreign Policy: Philippines Is Ever More Focused on Taiwan",
    "created_at": "2025-01-29",
    "text": "\n(TNSres) -- Rand issued the following commentary to Foreign Policy:\n* * *\nThe Philippines Is Ever More Focused on Taiwan\nBy Derek Grossman\nEscalating tensions between China and Taiwan have forced the Philippines--whose northernmost point is less than 100 miles from Taiwan--to intensify its focus on a potential cross-strait conflict. Until now, Manila has prioritized internal security, particularly with regard to Islamist insurgents on the southern island of Mindanao, as well as Beijing's growing encroachment into the Philippines' exclusive economic zone (EEZ) in the South China Sea. But a future Taiwan scenario--how the Philippines might react and potentially support its security ally, the United States, if the latter were to intervene--is now beginning to take up more of Manila's bandwidth.\nSignificantly, in a departure from past administrations, Philippine President Ferdinand Marcos Jr. has publicly discussed his growing concerns over Taiwan. Last summer, Marcos visited his northern army unit and remarked, \"The external threat [from the Taiwan Strait] now has become more pronounced, has become more worrisome. And that is why we have to prepare.\" In a February 2023 interview, Marcos said, \"It's very hard to imagine a scenario where the Philippines will not somehow get involved.\"\nMarcos has also presided over an expansion of the U.S.-Philippines Enhanced Defense Cooperation Agreement (EDCA), which authorizes the U.S. military to work alongside Philippine forces at nine designated bases for a range of potential future missions. Marcos insists that the new EDCA bases--three of which are on Luzon, the major Philippines island closest to Taiwan--will not be used for \"offensive purposes,\" but he has also noted that U.S. access to these sites will \"prove to be useful for us should that terrible occurrence come about,\" referring to a Chinese invasion of Taiwan.\nMuch of the operational and strategic planning revolves around Manila's recently completed Comprehensive Archipelagic Defense Concept. This document has never been publicized, but Philippine experts have told me that it is an attempt to shift Manila's mindset away from focusing on internal security threats in favor of external threats and ongoing intrusions, primarily by China against Philippine maricreated_at borders.\nU.S. and Philippine forces are contributing to the new defense strategy with an obvious focus on Taiwan. Within the last few months, the two countries have been constructing a joint facility on Itbayat in the Batanes province to counter China's military presence in the area. It will reportedly house emergency equipment and provisions. The U.S. Army has referred to the facility as a \"weatherproof warehouse for disasters\" that may store equipment and supplies not only for natural disasters but war, as well. In May and June 2024, Washington and Manila held combat exercises on the islands in the Batanes, designed to defend them from attack. The fact that some of these exercises were integrated into the annual United States-Philippines Balikatan exercise is also significant because it demonstratively mainstreams the alliance's attention on Taiwan-related threats.\nAnd in response to then-Speaker of the House Nancy Pelosi visiting Taiwan in 2022 to meet with then-President Tsai Ing-wen, Manila later built a new Philippine Coast Guard station on Itbayat. In the words of Philippine National Security Advisor Eduardo Ano, the new site was necessary because \"China's corresponding naval response was observed in the Luzon Strait\" in the aftermath of Pelosi's visit.\nManila's newfound attention on Taiwan is likely to have several significant implications. For one, Washington and Manila will now have to collaboratively address another security threat beyond Beijing's rising assertiveness within the Philippines' EEZ in the South China Sea. Beyond their recent Taiwan-focused activities, this could mean that the U.S. military will seek additional force posture and presence options that leverage the Philippines' unique geographic advantages. It could result, for example, in U.S. access to additional bases, particularly in the country's north, and further alliance work on enhancing force interoperability through joint military drills and other activities.\nFor Manila, paying greater attention to threats in the north likely means broader and deeper collaboration with the U.S. military, which Philippine forces can benefit from. The challenge, however, is how to balance a greater focus on Taiwan with other security priorities. The Philippines would probably rather remain focused on Chinese encroachments into its EEZ; instead, the Taiwan Strait will distract Manila and force it to dedicate at least some resources to the area that otherwise could have been used in the South China Sea. The Philippine Coast Guard's establishment of a station on Itbayat demonstrates how this is already happening.\nChina may benefit from the Philippines' move to divide its forces, but this challenge can be mitigated if the U.S. military enhances its presence, as well. Manila's recent decision to approve U.S. deployment of the mid-range Typhon missile system to its territory could reinforce deterrence. The missiles, which Philippine soldiers have already been trained to operate, cover not only much of the South China Sea but could also reach military bases on the Chinese coast.\nOver the coming months and years, a number of factors could also disrupt Manila's shift toward Taiwan. U.S. President Donald Trump, for example, may expect the Philippines to do more for its own defense rather than relying on U.S. security commitments. For example, when then-Philippine President Rodrigo Duterte attempted to cancel the United States-Philippines Visiting Forces Agreement, which is a key pact undergirding the two countries' mutual defense treaty, during Trump's first term, Trump replied, \"I don't really mind if they would like to do that. It will save a lot of money. My views are different than others.\" However, recent Trump administration engagements with Philippine counterparts by U.S. Secretary of State Marco Rubio and National Security Advisor Mike Waltz have underscored that the alliance will remain \"ironclad.\"\nBesides the uncertainty that Trump adds to the mix, new leadership in Manila could also seek to downgrade the U.S. military presence. Duterte's daughter, Sara Duterte, currently serves as Marcos's vice president and is quite popular. If she runs and wins the next presidential election in 2028, she could take her nation down the path laid out by her father of relying less on the United States in favor of closer ties with China.\nRegardless of these and other uncertainties, China's pressure campaign against Taiwan will not abate. This will keep the United States and Philippines increasingly engaged on cross-strait security with an eye toward limiting the impact a Taiwan conflict will almost certainly have on the Philippines.\n* * *\nMore About This Commentary\nDerek Grossman is a senior defense analyst at RAND, an adjunct professor at the University of Southern California, and a former daily intelligence briefer to the U.S. assistant secretary of defense for Asian and Pacific security affairs.\n* * *\nOriginal text here: \n* * *\n[Category: ThinkTank]\nCopyright Targeted News Services\nMSTRUCK-9032799 MSTRUCK\n"
  },
  {
    "id": 773,
    "title": "WITH ACOUSTIC BLAST, CHINA UPS AGGRESSION IN DISPUTED WATERS: PHILIPPINE NAVY",
    "created_at": "2025-01-29",
    "text": "\nThe following information was released by Radio Free Asia:\nChina's use of a long-range acoustic device against Filipino sailors in the South China Sea marks an \"increase in aggression\" in the disputed waters, a Philippine Navy spokesman said.\nThe BRP Cabra, a Philippine Coast Guard (PCG) ship, faced off with Chinese coast guard vessel 3203 and two other Chinese ships as it tried to sail on Saturday within Manila's exclusive economic zone off the coast of Zambales, a province in the northern Philippines.\nDuring the encounter, Filipino crew members described hearing a piercing sound at high decibels that could damage ears and cause severe discomfort.\n\"The long-range acoustic device [LRAD] is an increase in the aggression of the Chinese Communist Party in the West Philippine Sea,\" said Rear Adm. Roy Vincent Trinidad, navy spokesman for the West Philippine Sea Manila's name for South China Sea waters within its exclusive economic zone.\n\"[Saturday's incident] only highlights the illegal presence, their coercive and now more aggressive actions,\" Trinidad told reporters on Tuesday.\nAnalysts said that the auditory weapon was the latest in China's \"gray-zone\" tactics activities that fall between ordinary statecraft and open warfare to advance its interests without necessarily provoking war.\nIt follows the same tactic Beijing used in 2023, when the China Coast Guard (CCG) pointed a laser at a PCG vessel, temporarily blinding some crewmembers.\n\"The LRAD is a sound weapon that is harmful and can lead to deafness if overexposed. China has used this gray-zone tactic before against the PCG and it's not something new as a military operation,\" said security analyst Chester Cabalza, head of the International Development and Security Cooperation, a Philippine think-tank.\n\"But due to its detrimental effects to health and human text, this is no different to the lights war or laser light that Beijing keeps on poking against Manila in the [West Philippine Sea],\" he told RFA affiliate BenarNews.\nHe said China had been abusing the gray-zone tactic, which he described as \"illegal, coercive, aggressive and deceptive in nature.\"\nLast week, Filipino scientists were forced to suspend a mission to a cay near Philippine-occupied Thitu (Pag-asa) island when three CCG vessels subjected it to \"aggressive maneuvers,\" Philippine officials said.\nTrinidad noted that the actions at sea came shortly after a suspected Chinese spy was caught with two Filipino accomplices after allegedly scouting sensitive areas around Luzon the main northern Philippine island including near military bases that host American troops.\nTrinidad said the arrested Chinese national and suspected accomplices were conducting \"intelligence surveillance and reconnaissance of government critical infrastructure.\"\n\"Connecting all these dots, we could now see a bigger picture that would give the government a clearer picture of what is happening. It's not yet a complete puzzle. The puzzle is still being assembled, but we are now starting to see bits and pieces of the direction where this is taking us,\" the navy spokesman said.\nAlthough Trinidad would not elaborate on the alleged spy's mission, the Philippines has allowed American troops access to nine bases throughout the country. Three of those are located in northern Luzon and face Taiwan, which China has threatened to invade.\nTyphon training\nAlso on Tuesday, Army spokesman Col. Louie Dema-ala confirmed that Filipino soldiers would train with U.S. troops next month in using the Typhon mid-range missile system. It has been in the country since last year, but Beijing has hotly protested the weapons deployment.\nThe Philippine Army has indicated its plans to acquire the system.\nIn the meancreated_at, Dema-ala said Filipino soldiers would train with their American counterparts in the Typhon's \"payload delivery system.\"\n\"This is planned. It will be conducted somecreated_at in the second week to the third week of February,\" he told a news briefing.\nThe Typhon System can fire the Standard Missile 6 (SM-6) and Tomahawk missiles and support strike capabilities from land, sea and air.\nThe missile system, developed by U.S. firm Lockheed Martin, has a range of 480 kilometers (300 miles), and can reach the disputed Scarborough Shoal as well as targets around Taiwan.\nBenarNews is an RFA-affiliated online news organization.\n"
  },
  {
    "id": 774,
    "title": "Filipino soldiers to train on US Typhon missile system; no live-fire exercises",
    "created_at": "2025-01-29",
    "text": "\nPhilippine soldiers will train on the US military’s intermediate range missile system during unilateral army drills next month as part of preparations for bigger exercises with US counterparts, a military official said on Tuesday.\nA platoon of about 20 Filipino soldiers from the army artillery regiment will train with the US Army Pacific’s First Multi-Domain Task Force on the Typhon missile system in mid-February, Philippine army spokesperson Louie Dema-ala said.\nThe exercise will focus on the “payload delivery system” and will highlight the system’s capabilities, he said, adding that it would not include live-fire exercises. “As long as the MRC (mid-range capability) is here, we maximize its utilization to train our personnel with these new technologies,” he told a news briefing.\nThe Typhon missile system was deployed by US forces to the Philippines in April last year as part of their Balikatan or “shoulder-to-shoulder” military exercises, and has since stayed in the country, angering China which has repeatedly called for its withdrawal.\nThe launchers have been redeployed to a new location in the Philippines that officials declined to disclose, Reuters reported last week.\nTomahawk cruise missiles used in the launchers can hit targets in both China and Russia from the Philippines. The SM-6 missiles it also carries can strike air or sea targets more than 200 km away.\nThe Philippines last year expressed interest to acquire the launchers as part of its modernization program.\nPhilippine military spokesperson Francel Margareth Padilla-Taborlupa on Tuesday said preparations were under way for this year’s annual Balikatan exercises, which are billed to be one of the biggest.\nSecurity engagements between the Philippines and treaty ally the US have intensified in recent years, as both countries aim to counter what they see as an increasingly assertive China.\nStrong ties between the two are expected to continue under US President Donald J. Trump, whose Secretary of State Marco Rubio last week reaffirmed Washington’s “ironclad” commitment to the Philippines under their decades-old Mutual Defense Treaty.\nAlso on Tuesday, the Philippine Coast Guard (PCG) accused a Chinese vessel of shadowing its ship that was trying to rescue a distressed fishing boat near the Zambales coast.\nIt said China Coast Guard-3304’s shadowing efforts had hindered BRP Cabra from retrieving the text of a deceased fisherman from the boat.\nUpon reaching the fishing boat 70 nautical miles (129.6 kilometers) southwest of Silanguin Island, Zambales, the team manning BRP Cabra “discovered that the fisherman had no pulse and was already deceased.”\n“To transport the text of the fisherman back to Subic, Zambales, BRP Cabra bravely navigated through the heavy waves to retrieve the deceased using its crane,” it said.\n“Chinese Coast Guard vessel CCG 3304, despite being aware of the distress call from the Filipino fishermen, engaged in shadowing that hindered the PCG vessel’s efforts to recover the text.”\nDEFENSE ECOZONE\nMeanwhile, Senator Juan Miguel F. Zubiri said the Senate’s approval on Monday of a bill that seeks to set up a one-stop economic hub in Bataan for defense industry investors would fast-track Manila’s goal of developing a self-reliant defense posture and boosting the local production of raw materials.\n“This approval will go a long way towards developing a fully self- reliant defense posture, where our armed forces are supplied by our own homegrown defense industry,” the senator, who sponsored Senate Bill No. 2900, said in a statement.\n“In the interest of self-reliance and in line with our Filipino-first policies, we made sure to require that special defense economic zone locators acquire a percentage of their raw materials from local producers,” he said.\nThe measure will set up a 370-hectare special defense economic zone in Limay, Bataan and give locators value-added tax exemptions for imports and local purchases and an income tax holiday.\nThese defense industry companies must pay a 5% final tax on their gross income, to be shared by Bataan province, the Special Defense Economic Zone Authority and the Armed Forces of the Philippines for its pension fund.\nPhilippine President Ferdinand R. Marcos, Jr. in October signed into law a bill that seeks to boost the country’s defense program through investments in local defense equipment and manufacturing amid tensions with China.\nIt allows the Defense department to develop a self-reliant defense posture program that will encourage manufacturers to produce weapons and defense systems in the country for local use and exports. It will give the agency P1 billion in funding.\nManila and Beijing have repeatedly clashed in the South China Sea, accusing each other of aggressive behavior involving their ships and of damaging the marine environment.\nThe Philippines, one of the weakest in the world in terms of military capability, is important to Washington’s efforts to push back against China, which claims the South China Sea almost in its entirety.\n"
  },
  {
    "id": 775,
    "title": "US aid freeze sparks fears Philippines will become 'bargaining chip' in Trump's China talks",
    "created_at": "2025-01-29",
    "text": "\n Philippine officials insist the pause in US$500 million in military aid is temporary, but analysts warn it signals a broader strategy shift   \nThe Philippines is bracing for the possible loss of half a billion dollars in promised US military aid under President Donald Trump, as analysts warn Manila could become a \"bargaining chip\" in Washington's dealings with Beijing. \nThe uncertainty follows a sudden 90-day freeze on all US foreign aid funded by or through the State Department and the US Agency for International Development (USAID), announced on Friday by Secretary of State Marco Rubio. \nThe announcement comes less than six months after former US Secretary of State Antony Blinken announced in late July that Washington would allocate \"US$500 million in foreign military financing to the Philippines to boost security collaboration with our oldest treaty ally in this region\". \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nDepartment of Foreign Affairs Undersecretary Eduardo de Vega attempted to downplay the damage during a palace press briefing on Saturday, insisting there was still room to negotiate. \n\"We're still talking to the Americans about that,\" he said, adding that the freeze was still temporary. \nHe also argued a stoppage in help from Washington would not \"severely affect us\" because the Philippines still has the financial support of other allies. \nDe Vega also stressed that, despite the suspension, operations at the nine existing EDCA sites - military facilities jointly used by US forces in the country authorised by the 2014 Enhanced Defence Cooperation Agreement (EDCA) - will in \"no way\" be affected. \n\"They don't have a reason to abandon the EDCA sites,\" De Vega said, adding that they are in \"the interests of both the US and the Philippines\". \nBut not everyone is convinced the US presence in the Philippines is secure. \nNewly appointed Trump administration official John Byers, who is set to oversee defence policy for South and Southeast Asia, has previously suggested that the United States consider using its military presence in the Philippines as leverage in negotiations with China. \nIn a paper published last month titled \"Can the US and China Forge a Cold Peace?\", Byers wrote, \"The United States might begin a cooperation spiral with China by proposing to remove US military forces or weapons systems from the Philippines in exchange for the China Coast Guard executing fewer patrols when operating in the shoal's vicinity.\" \nByers has argued that a \"cooperation spiral\" approach - rather than traditional deterrence - could reduce tensions, describing how fears and miscalculations in an anarchic international system can unintentionally escalate conflicts. \nPolitical science professor Rush Doshi, a security studies expert at Georgetown University's School of Foreign Service, argued that Byers' position implies the US should \"cut first, and if China doesn't follow through, we could reverse course.\" \nIn a social media post, Doshi noted that Byers \"also opposes tariffs on China, sanctions on China, and suggests reducing the US military presence in Asia to see if China reciprocates.\" \nDoshi, who is now with the Council on Foreign Relations and formerly a deputy senior director for China and Taiwan at the National Security Council under the Biden administration, told This Week in Asia: \"It's naive to think cutting US support to a key ally is somehow going to persuade Beijing to de-escalate.\" \n\"It's the worst possible trade: it makes us give up hard-won trust with the region for nothing but the hope of concessions from Beijing. And ironically, all this would probably be more likely to embolden Beijing anyway,\" Doshi said. \nRubio has defended the 90-day aid freeze as a review to ensure all help \"makes America safer,\" \"makes America stronger\" and \"makes America more prosperous.\" \nSome experts argue that military funding for the Philippines clearly meets those criteria. \n\"The question of whether military aid to the Philippines makes America safer and stronger is actually one of the strongest points in favour of retaining and even expanding such aid,\" Raymond Powell, director of Stanford University's Gordian Knot Centre for National Security Innovation, told This Week in Asia. \n\"Not only is the Philippines a US treaty ally, it occupies key terrain along the first island chain nearest to mainland China, marking a very important line of defence against PRC expansionism,\" said Powell, a retired air force colonel. \n\"Senior Trump administration officials, including Secretary Rubio, Defence Secretary Pete Hegseth and National Security Adviser Michael Walz, have all expressed deep concerns about deterring China's aggression. Strengthening the Philippines is key to that endeavour,\" Powell added. \n\"I don't think Secretary Rubio was suggesting that all three questions need to be answered in equal measure for all aid. However, one could easily argue that there is no prosperity without security,\" he said. \nHe also pointed out that when Rubio was a senator last year, he sponsored a bill entitled the US-Philippines Partnership Act of 2024 to deter China's aggression in the South China Sea. \nRetired Supreme Court justice Antonio Carpio, who has championed the Philippine cause in the South China Sea dispute, expressed confidence \"that foreign aid suspension does not include military aid\" despite the lack of official details. \nChester Cabalza, founding president of the International Development and Security Cooperation think tank in Manila, pointed out to This Week in Asia that Rubio's aid freeze contradicted his reaffirmation days earlier of the US' \"ironclad\" commitment to Manila's defence. \nMax Montero, an Australia-based defence and security analyst, expressed doubts that an agreement to remove US forces from the Philippines in exchange for reduced aggressive Chinese activities to assert their claim in the South China Sea would happen. \nHe told This Week in Asia, \"I believe the CCG would not back down from their claim unless the US makes significant progress in their deployment in the Philippines.\" \n\"I believe Trump may even use the Philippines-China dispute to further American presence in the country. Trump may push to make China meet halfway if he increases American presence and aid to the Philippines,\" Montero said. \nLucio Blanco Pitlo III, president of the Philippine Association for Chinese Studies, suggested that \"close consultation and coordination between allies can ensure shared interests are considered in any great power deal and there is less likelihood of Manila being marginalised\". \nHowever, some analysts warn that Manila may have little say in the matter. \nWalden Bello - a retired adjunct professor of sociology at the State University of New York at Binghamton and currently co-chair of the Focus on the Global South institute in Bangkok - warned that Trump will \"likely deal directly\" with Chinese President Xi Jinping and leave Philippine President Ferdinand Marcos Jnr \"on the sidelines.\" \n\"Again, my caveat: he's unpredictable,\" Bello said. \nHe argued that Philippine officials should recognise Trump's \"paradigm shift from the liberal internationalist perspective of defending US interests everywhere\" to a strategy of \"retrenching into the Americas.\" \nWhile \"the rhetoric of continued engagement with the region will be there,\" he said, \"the reality will be relative disengagement\" because Trump and his political base are \"isolationist and inward-looking\". \nFor his part, Cabalza, who studied at the College of Defense Studies at the National Defense University in Beijing, said Trump's \"avid admiration for autocracy\" and his invitation to Xi Jinping to his inauguration reflected a strategic effort to \"tame the shrew\" - a Shakespearean, performative act aimed at managing a difficult competitor until relations soften and the rivalry is no \"longer a threat\". \nBut while Trump may seek to recalibrate ties with Beijing, some analysts believe US-China tensions will remain deeply intertwined with regional security issues. \n\"The sea dispute will certainly become a bargaining chip in US relations with China, especially in regard to trade and tariffs,\" retired professor Roland Simbulan, now chair of the Centre for People Empowerment in Governance (CenPeg), told This Week in Asia. \n\"Everything is on the table to be bargained because Trump is no cold warrior. He is a deal maker who may even sell his own mother,\" he added. \n\"This may augur well for the Philippines as the US and China will reduce their militaristic arms race, negotiate and bargain like business partners or competitors.\" \nBoth Simbulan and Cabalza suggested that Trump's actions that reduced tension could force Manila to ramp up its own spending on external defence instead of relying on foreign help. Montero similarly predicted Trump would push Australia and Japan to shoulder more responsibility in defending the Indo-Pacific. \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 778,
    "title": "Philippines Move on U.S. Missile System Worrying China",
    "created_at": "2025-01-29",
    "text": "\nJanuary 29th, 2025 (The Independent View — Delivered by Newstex)\n.S.The Philippines will Train its Soldiers with a U.S. Medium-Range Missile system next month, which China has Opposed the Weapon's Deployment in the American Ally.The Mid-Range Capability (MRC) Missile system can Fire the Tomahawk Cruise Missile, and the Standard Missile 6, with respective Ranges of 1,000 and 290 miles.The former Hits Targets at Sea and on Land, while the latter can perform Anti-Air and Anti-Surface Missions.The U.S. Army deployed an MRC, also known as Typhon, to the Philippines in April 2024 for Drills, but it was decided to keep it there \"Indefinitely.\"The Chinese Foreign Ministry said last week, that the U.S. Missile System's Deployment is a \"highly dangerous move.\"Colonel Louie Dema-ala, spokesperson for the Philippine Army, announced on Tuesday, that 20 Soldiers, who are Assigned to an Artillery Regiment, will Train with their American Counterparts, the U.S. Army Pacific's First Multi-Domain Task Force, in Mid-February, 2025.The First Multi-Domain Task Force Operates the Typhon, with the Deployment of the Missile System aiming to Enhance the Philippine Maricreated_at Defense Capabilities, as well as Bolster Military Co-Operation and Readiness within the U.S.-Philippine Security Alliance.The U.S. has Signed a Security Treaty with the Philippines that comes with Mutual Defense Commitments.Beijing has Territorial Disputes with Manila in the South China Sea, which often Lead to Confrontations at Sea between their Coast Guards and Navies.The subject of the Training will be the Typhon's \"Payload Delivery System\" to Highlight its Capabilities, the Spokesperson added, who emphasized that this would Not include Live-Fire Exercises.Manila revealed last November, that it was considering Purchasing the Typhon.The Training came after the Typhon was Relocated from its Original Site, Laoag Airfield on the island of Luzon, in the Northern Philippines, to another Location on the island, Reuters reported last week.The Tomahawk Missiles can Hit Eastern and Southern China from Laoag.Philippinene's Army is Scheduled to hold a Realistic Warcreated_at Ooperations simulation in March, which aims at preparing Soldiers for Drills, including the Salaknib and the Balikatan, that are conducted with U.S.Forces.Philippine Army Spokesperson Colonel Louie Dema-ala said at a Press Briefing on Tuesday: \"The second iteration of the subject matter expert exchanges (SMEE) with the MRC and between the U.S. Army Pacific and the Philippine Army Artillery Regiment is focused on the payload delivery system and the continuation of what we have learned in the first iteration of the SMEE.\"Chinese Foreign Ministry Spokesperson Mao Ning, said at a Press Conference on January 23rd: \"We once again call on the Philippines to heed the call from regional countries and their peoples, correct the wrongdoing as soon as possible, quickly pull out the Typhon missile system as publicly pledged, and stop going further down the wrong path.\"China is likely to continue to raise Objection to the Typhon's Deployment.It remains to be seen whether the Missile system will conduct Live-Fire Tests in the Philippines in the Future.NYC Wins When Everyone Can Vote!Michael H. Drucker\n\nN"
  },
  {
    "id": 779,
    "title": "DeepSeek: ¿otro Pearl Harbor?, por La Vanguardia",
    "created_at": "2025-01-29",
    "text": "\nWith Deep Seek, China has gained a competitive advantage over the United States in the struggle for global hegemony through artificial intelligence (AI) that could be decisive in its future outcome. A scenario that could lead to open warfare between the two powers. That this is possible is a thesis of Graham T. Allison. According to this political scientist, history shows that when the power of a superpower is disputed by another emerging superpower, there are twelve out of sixteen chances of war breaking out between them. Thesis on which he later based his essay Destined for war (2017), where he predicted a war between the United States and China.\nTrump's coming to power aggravates this possibility. Especially after China has released a generative AI that disrupts the innovation plans on which the US has based its technological leadership following Biden's approval of the Chips & Science Act of 2022. A White House-centric design that has planned the US effort in AI innovation.\nThe tech complex surrounding Trump sees its oligopoly in jeopardy\nJake Sullivan, former presidential advisor to Biden, explained very well what AI meant for the U.S. He did so in a lecture titled Special competitive studies project of September 16, 2022. In it he said flatly that Washington would never allow China to lead in AI innovation because the country's geopolitical survival was subordinate to its development. A reflection shared by Democrats and Republicans since the US adopted the role of a technological hawk since Obama in 2010 glimpsed the danger and approved the first bans on technology transfer to Chinese companies. Since then, the hawk has been sharpening its talons. So much so that it seems inevitable that it will seek to employ them. With Trump as president, this will not be difficult. First, because the industrial-technological complex that Biden aligned has now become the praetorian guard surrounding Trump and has access to the Oval Office. And second, because the corporations that make up the aforementioned complex have seen the oligopolistic model that aligned their innovative efforts damaged with DeepSeek.\nA week after Trump's inauguration and when the images of the party that Silicon Valley held to celebrate him are still in the air, a Chinese startup has starred in a technological Pearl Harbor that, with an investment of a handful of million dollars, threatens to sink the innovation oligopoly driven by the White House to win the battle of AI. First, because it renders inefficient the horizontal public-private coordination that, from above, national security imposes on AI companies, hardware suppliers and massive training infrastructure providers. And second, because the incentive among AI companies that whoever comes up with the best and cheapest generative design will take it all ( winner takes it all ), is lost with the open source offered by DeepSeek. Thus, the innovation endeavor based on a monopoly of algorithmic property ceases to be potentially profitable because the multi-million dollar investments that the industrial-technological complex makes in generative AI designs such as ChatGPT, Microsoft Copilot, Google Gemini and Perplexity, will not have the return as their business model disappears.\nThis being the case, and with the risk that it will be confirmed in the coming months that an AI bubble has burst in the US, we should not rule out the possibility of the US technology hawk taking a combat flight over the Taiwan Strait or the South China Sea. Now, turned into an imperial republic with Trump at its head, it seems almost inevitable.\n"
  },
  {
    "id": 780,
    "title": "US Ally Doubles Down on American Missile System Worrying China",
    "created_at": "2025-01-29",
    "text": "\nThe Philippines will train its soldiers with a United States medium-range missile system next month, which China has opposed the weapon's deployment in the American ally.\nNewsweek has reached out to the U.S. Indo-Pacific Command for comment by email. The Chinese Defense Ministry did not immediately respond to a request for comment.\nWhy It Matters\nThe Mid-Range Capability (MRC) missile system can fire the Tomahawk cruise missile and the Standard Missile 6, with respective ranges of 1,000 and 290 miles. The former hits targets at sea and on land, while the latter can perform anti-air and anti-surface missions.\nThe U.S. Army deployed an MRC, also known as Typhon, to the Philippines last April for drills, but it was decided to keep it there \"indefinitely.\" The Chinese Foreign Ministry said last week that the U.S. missile system's deployment is a \"highly dangerous move.\"\nWhat To Know\nColonel Louie Dema-ala, spokesperson for the Philippine army, announced on Tuesday that 20 soldiers, who are assigned to an artillery regiment, will train with their American counterparts, the U.S. Army Pacific's First Multi-Domain Task Force, in mid-February.\nThe First Multi-Domain Task Force operates the Typhon, with the deployment of the missile system aiming to enhance the Philippine maricreated_at defense capabilities, as well as bolster military cooperation and readiness within the U.S.-Philippine security alliance.\nThe U.S. has signed a security treaty with the Philippines that comes with mutual defense commitments. Beijing has territorial disputes with Manila in the South China Sea, which often lead to confrontations at sea between their coast guards and navies.\nThe subject of the training will be the Typhon's \"payload delivery system\" to highlight its capabilities, the spokesperson added, who emphasized that this would not include live-fire exercises. Manila revealed last November that it was considering purchasing the Typhon.\nThe training came after the Typhon was relocated from its original site, Laoag airfield on the island of Luzon in the northern Philippines, to another location on the island, Reuters reported last week. The Tomahawk missiles can hit eastern and southern China from Laoag.\nAccording to the Philippine GMA News Online, the country's army is scheduled to hold a realistic warcreated_at operations simulation in March, which aims at preparing soldiers for other drills, including the Salaknib and the Balikatan that are conducted with U.S. forces.\nWhat People Are Saying\nPhilippine army spokesperson Colonel Louie Dema-ala said at a press briefing on Tuesday: \"The second iteration of the subject matter expert exchanges (SMEE) with the MRC and between the [U.S. Army Pacific] and the [Philippine] Army Artillery Regiment is focused on the payload delivery system and the continuation of what we have learned in the first iteration of the SMEE.\"\nChinese Foreign Ministry spokesperson Mao Ning said at a press conference on January 23: \"We once again call on the Philippines to heed the call from regional countries and their peoples, correct the wrongdoing as soon as possible, quickly pull out the Typhon missile system as publicly pledged, and stop going further down the wrong path.\"\nWhat Happens Next\nChina is likely to continue to raise objection to the Typhon's deployment. It remains to be seen whether the missile system will conduct live-fire tests in the Philippines in the future.\nLink to Image\n\nGraphic\n \nU.S. Missile System Deploys to Philippines\nCaptain Ryan DeBooy/U.S. Army\nA United States Army Mid-Range Capability missile system arrives in Northern Luzon, the Philippines, on April 8, 2024.\n"
  },
  {
    "id": 781,
    "title": "Carpio fears PH pact on Ayungin Shoal may expand China's reach",
    "created_at": "2025-01-29",
    "text": "\n The Philippines and China's 'provisional understanding' regarding the Manila's rotation and resupply (RORE) missions in Ayungin Shoal should be 'temporary' and 'end soon,' according to retired Supreme Court Senior Associate Justice Antonio Carpio.\nCarpio claimed China might expand this understanding to the entire West Philippine Sea, reiterating that Ayungin Shoal is inside that country's exclusive economic zone (EEZ), which he explained meant all countries have the freedom to navigate the area.\nThe former senior associate justice was part of the team that argued the claims of the Philippines before the arbitral tribunal of the United Nations Convention on the Law of the Sea. The tribunal decided in favor of the Philippines.\n'We cannot expand this, it should be temporary, and we should end it as soon as we can because what I can see China will do now is expand this agreement to the entire West Philippine Sea,' he explained in a forum in Quezon City on Wednesday.\nBased on previous reports, the provisional understanding between the two countries allows Manila's RORE missions to BRP Sierra Madre in Ayungin Shoal.\nOn January 17, both countries upheld this understanding during the 10th Bilateral Consultation Mechanism (BCM) on the South China Sea. The Department of Foreign Affairs explained that the two parties acknowledged the 'positive outcomes' of the understanding and 'agreed to continue its implementation to sustain the de-escalation of tensions without prejudice to respective national positions.'\nBut Carpio expressed worry with the setup, claiming that the Asian superpower might think that it has 'some sort of control' over the Philippines' RORE missions.\n'We can give them some leeway but only once, because if you allow it, again and again, it becomes precedence and that is what we don't want,' he said.\n'Because right now, if you look at it every created_at we resupply in [BRP] Sierra Madre we have to meet with the Chinese. Is that mandatory? The Chinese are saying that it is mandatory, we say it's not mandatory, but we comply with it,' Carpio claimed.\n'By practice, we actually follow what China wants. We have to sit down with them before we resupply Sierra Madre,' he further said.\nPH notifies, not ask permission\nContrary to what Carpio said, National Security Council and National Task Force West Philippine Sea spokesperson Jonathan Malaya said the Philippines does not meet with China to seek the latter's permission to conduct RORE missions.\n'There is no meeting, na we sit down with them and parang every created_at magre-resupply tayo, magme-meeting tayo, walang ganoon,' Malaya said in an ambush interview after the forum.\n(... where we sit down with them or where we meet with them every created_at we do our resupply mission, we don't do that.)\n'There is something called notifying them but not asking for permission. Permission is different from notification, for example, you inform that you are going out, just like that. But if you ask if it's okay to go out, it's a different story,' he further explained partly in Filipino.\n'We don't get permission. We just have a notification system with them na parang itong sa araw na to magre-resupply kami, so huwag kayong manggugulo kasi magre-resupply kami,' he added.\n(... that for this day we are conducting a resupply mission so do not interfere with our operations.)\nWhen asked about concerns that this understanding could extend to other West Philippine Sea features, Malaya said that it is only limited to Ayungin Shoal.\n'We are not gonna do that. As mentioned, this arrangement is only for Ayungin. It does not apply to other parts of the West Philippine Sea,' he disclosed.\nHe added that China also notifies the Philippines how many Chinese ships operate in the shoal.\n'It is a win for the Philippines e. Because at the end of the day, we are able to resupply BRP Sierra Madre, and the crew there do not get hungry. Plus BRP Sierra Madre gets to stay there,' he said in a mix of Filipino and English.\n"
  },
  {
    "id": 783,
    "title": "The Chinese in our hearts",
    "created_at": "2025-01-29",
    "text": "\n In case you're not aware, all those fireworks, lion / dragon dances and feasting in our country for the Lunar New Year are in celebration of an Intangible Cultural Heritage as declared by the United Nations Educational, Scientific and Cultural Organization.\nSpecifically, the 'social practices of Chinese people celebrating the traditional New Year - Spring Festival' was inscribed by UNESCO in its Representative List of Intangible Cultural Heritage on Dec. 4 last year.\nI learned about the latest inclusion of a Chinese element in the UNESCO Intangible Cultural Heritage list (bringing the total to 44 for China, the most in the world) when I attended the Lunar New Year celebration at the Shangri-La The Fort in Taguig last Jan. 19 co-hosted by the Chinese embassy together with the top Filipino-Chinese business federations.\nEach guest was welcomed with warmth, literally, through a red woolen shawl given away as gift.\nChinese Ambassador Huang Xilian reminded guests that 2025 marks 50 years of diplomatic ties between the Philippines and the People's Republic of China. The ambassador, who lacks the personal warmth of some of his predecessors, nevertheless highlighted the traditional friendship and cultural ties and hoped for mutual prosperity for the 1.5 billion combined populations of the two countries.\nThe Filipino-Chinese business federations also presented videos showing cooperation with China in poverty alleviation and in projects such as the construction of classrooms and school buildings.\nTsinoy singer-songwriter (and sugar baron) Jose Mari Chan of 'Christmas In Our Hearts' renown said in a video message: 'Kami din ay Pinoy sa puso at gawa.'\n*   *   *\nFor all the goodwill, let's face it, these days it takes some effort to dwell on the positive aspects of Philippine ties with China.\nFilipino-Chinese businessmen, many of whom are doing business with Chinese companies and source materials from the mainland, are naturally among the most concerned about the escalating tension in the West Philippine Sea.\nThe entry (widely suspected to be hostile) of President Marcos' pet vanity project, the Maharlika Investment Fund, into the National Grid Corp. of the Philippines is seen as the first step in kicking out the Chinese shareholders from the NGCP.\nMaharlika Investment Corp. CEO Rafael Consing Jr. has indicated as much, expressing openness to buy out the State Grid Corp. of China.\nIn light of Beijing's disregard for the Philippines' maricreated_at economic entitlements that are based on international rules, its gray zone attacks on Philippine vessels within our exclusive economic zone and its greedy claim over nearly the entire South China Sea, there's some basis to be worried about a Chinese state-run firm being involved in the operator of the country's electricity grid.\nStill, NGCP is a private company, which took in the State Grid Corp. as a partner at a created_at when the Philippine government itself was inviting Chinese investors to the country and working to increase bilateral trade. There has been no prohibition against Philippine private companies, including those engaged in public utilities and other critical industries, against partnering with Chinese companies whether state-run or private, although Chinese laws effectively give Beijing a degree of control over all Chinese enterprises (yes, including TikTok owner ByteDance).\nNevertheless, Maharlika's manner of entering the NGCP is spooking the business community in general.\nThere are many other Filipino-run private companies with Chinese companies as partners in part or all of their operations. Will they have to kick out these partners, or wait for a hostile takeover by the government?\n*   *   *\nAt the Shangri-La event, the Grand Ballroom was full, but considering who were the hosts, the guests could have included more big guns in both government and the private sector.\nThere was a representative from the Department of Foreign Affairs, and the emcee announced the presence of the chiefs of the Bureau of Immigration and the National Bureau of Investigation. There were videotaped greetings from Vice President Sara Duterte ('Let us look ahead to future cooperation,' she said) and from First Lady Liza Marcos.\nI spotted Senate Minority Leader Koko Pimentel, Makati Mayor Abby Binay and business tycoon Hans Sy. Among the diplomatic corps, the dean was present, Papal Nuncio Charles Brown, along with the ambassadors of Japan, the United Kingdom, the European Union, France and several other individual member states of the EU.\nMaybe other guests arrived after I had left the gathering without partaking of the food.\nAt least there's one thing Filipinos aren't disputing with the Chinese: they have terrific cuisine.\n*   *   *\nAs I write this, the pata tim is being tenderized at my home, and the ingredients for my XO long life noodles (made of 100 percent sweet potato flour, so it's OK even for the diabetics and gout sufferers in the household) with braised pork leg have been laid out.\nIn a nod to Pinoy culture, I'm substituting giant bangus inihaw for the Chinese-style steamed whole fish that I usually serve for the Lunar New Year celebration.\nBy our elders' accounts, my maternal Chinese grandmother was an accomplished cook, but unfortunately found her children too rowdy and shooed them away from her kitchen. So my mother and I had to improvise in our Chinese cooking. Plus I took lessons from my favorite teacher, Sylvia Reynoso Gala, and a Chinese guy in Manila who couldn't speak Filipino and blew air under the skin of the Peking duck with his mouth.\nAs I welcome the Year of the Wood Snake, I dwell on my Chinese heritage and stuff my face with tikoy and other delectable Chinese food. Like many Filipinos, I may dislike the Chinese government led by Xi Jinping, but not the people and the culture.\n"
  },
  {
    "id": 792,
    "title": "Senate Commerce Committee Ranking Member Cantwell Calls for Revitalized US Maricreated_at Strategy to Secure Panama Canal From Foreign Adversaries, Increase Trade and Lower Costs for Americans",
    "created_at": "2025-01-29",
    "text": "\nSen. Maria Cantwell, D-Washington, ranking member of the Senate Commerce, Science and Transportation Committee, issued the following news release on Jan. 28, 2025:\nFollowing today's Commerce Committee hearing on the Panama Canal, U.S. Senator Maria Cantwell (D-Wash.), Ranking Member of the Senate Committee on Commerce, Science and Transportation, reiterated the need for continued U.S.-Panama cooperation to increase investments in port infrastructure and cybersecurity measures that will strengthen national security, increase trade and lower costs for consumers. The senator will request Defense officials to brief Committee members on foreign threats to the Panama Canal and plans to lead a delegation to visit the Canal's operations.\n\"The Panama Canal is vital to America's supply chains, lowering costs of consumer goods and our national security,\" Sen. Cantwell said following the hearing. \"It's critical that the United States and Panama work cooperatively on new cyber security measures to close backdoors to foreign adversaries. The United States and Panama should also work together to boost port and Canal infrastructure to lower costs, and ensure reliability of the Canal. To that end, I am requesting the Department of Defense and the Coast Guard provide a classified briefing so that all committee members are fully informed about foreign adversary threats to the Canal, including adjacent areas. I also plan to lead a delegation to visit the Panama Canal Authority this Spring to see operations first-hand. I support more U.S. trade and investment in Latin America and want a new Free Trade Agreement of the Americas. And I hope the Committee will work on a maricreated_at strategy.\"\nRanking Member Cantwell's Opening Statement at the Hearing as Delivered: VIDEO (\nAccess to the Panama Canal is essential to maintaining America's supply chains, lowering inflation and the costs of consumer goods, and ensuring our national security.\nWith about 72% of the goods transiting the Canal coming to or from U.S. markets, a stable waterway is vital for states like mine where 1 in [3] jobs are related directly or indirectly to trade.\nSeattle-based SSA Marine operated the Manzanillo International Terminal in Colon, Panama, for the last 30 years is our largest US logistic presence in Panama with 19 massive cranes, 3.5 million cargo containers, and employing over 1,000 people.\nIn fact, Washington's maricreated_at economy supports 170,000 jobs and $45 billion in annual revenue.\nAnd our U.S. maricreated_at economy supports over 21 million jobs. And almost $3 trillion in America's GDP.\nSo, anything that our Committee can do to help grow our maricreated_at economy, I'm all for.\nThat is why it's so important that this Committee not just to focus on Panama, but on broader solutions to meet our U.S. maricreated_at opportunities and challenges.\nThis Committee passed the Ocean Shipping Reform Act led by our colleagues, Senator Klobuchar and Senator Thune, to address shipping costs and stop carriers from practices that delayed U.S. cargo and increased costs. This law also gave the FMC, our two Commissioners who are here today, the ability to do better investigations. So I look forward to hearing about their investigation on the Panama Canal and these cost issues.\nAnd many members of this Committee have worked on the infrastructure bill to do dock replacements in places like Alaska, rail improvements, pier infrastructure, safety improvements, and container yard expansions. And I know that my colleagues who represent these maricreated_at investments need a maricreated_at workforce and continued investment.\nMany of our colleagues, Mr. Chairman, have great ideas. Senators Kelly and Young from the Senate, along with Representatives Garamendi and Kelly from the House, and they have been working with maricreated_at stakeholders on these larger bills.\nBut Mr. Chairman, if this Committee doesn't embrace this larger agenda, it's going to get decided in the Finance Committee. So I hope that we can get some of these issues and show that this Committee is the Committee for maricreated_at jurisdiction.\nA bill that provides a comprehensive strategy to rebuild America's supply chain supremacy, the sea lift capacity that we need to defend our interests in the South China Sea and the Indo-Pacific region, and to revitalize our nation's ports and ship building capacity.\nA revitalized U.S. Maricreated_at strategy would not only be good for our economy but critical for our national security.\nAt the same created_at, we face cyber threats from our foreign adversaries--and Panama is a perfect example.\nWhich bring us to the today's hearing.\nI am concerned about the Chinese-owned ports in Panama and their proximity to the Canal.\nI am also deeply concerned about the installation of Chinese equipment from Huawei and other Chinese companies near the Canal.\nThis is why this Committee successfully worked to get $3 billion in rip and replace at the end of last Congress. So if we're trying to get them out of U.S. ports and areas, we certainly shouldn't allow them in ports and vessels and backdoors in places like Panama.\nMr. Chairman, I would like to ask for Unanimous Consent to enter into the record a letter from the two most recent U.S. Ambassadors to Panama who make the case for continued U.S. investment in infrastructure and cybersecurity.\nThese ambassadors know better than anyone that America's adversaries have built backdoors into communications technology in our supply chains - both software and hardware. Whether it's a crane over the port or a bridge, we cannot tolerate Huawei, TikTok, Artificial Intelligence, or other adversaries using a government backdoor.\nMr. Chairman, I'm a very big fan of the five biggest technology interests in basic democracies forming a \"Technology NATO.\" We should be saying to the world, notext should be buying technology or equipment that has a government backdoor.\nThese are complex issues and we need solutions.\nI will be requesting that the Department of Defense provide a classified briefing to all members of our Committee about foreign adversary threats to the Panama Canal, including these adjacent areas.\nI received an initial classified briefing from U.S. Southern Command and have spoken to former U.S. Southern Command leader, General Laura Richardson, on these issues.\nI also plan to go as a Delegation, or by myself to Panama, and visit the Panama Canal Authority. I invite other members to do so, hopefully this spring.\nAny successful strategy also has to not just focus on cybersecurity and cooperation, and we'll ask some of our witnesses here today, but the larger issue is we need to understand what are the shortfalls of the current agreement that doesn't get at this upgraded technology concern. I would hope that Panama would be very cooperative in discussing these cybersecurity investments and what needs to be made.\nAs we all know, the Panama Canal is an authority independent, the Chinese government doesn't [set]...the shipping rates, but the authority has been grappling with historic rainfalls, climate change, and a solution I believe is for us to work together, as the Army Corps did before on solutions and making sure that instability in water is not the cause of increase in rates. We need to work on these solutions.\nBut Mr. Chairman, I also believe that the larger issue here, as you mentioned in your statement about Belt and Road initiatives by the Chinese and their expansion, needs to be met with an aggressive response by the United States. I firmly believe in trade.\nBut again, easy for me to say, or maybe from Texas, when you're coming from a very trade-dependent state.\nBut the issue is, we didn't have [a Senate-confirmed] ambassador there for five years in Panama. For all my colleagues who hold up ambassadors, you should rethink your strategies when you do this. Because holding up ambassadors and not dealing with these issues put us behind the eight ball.\nExpanding exports to the 95% of the world's consumers, and roughly 3.5 billion people, I believe is a good idea.\nI hope we can have a more aggressive strategy in Latin America.\nI think the proposals by Senators Cassidy and Bennet, the Americas Act, is also a like-minded...[coalition] of Latin American countries so that we could join together in sort of a US-Mexico-Canada Free Trade Agreement.\nAnd I also believe that a Free Trade Agreement of the Americas that links modernization and all our FTAs in Latin America and Caribbean would help along with an aggressive strategy of saying no government backdoors and making the kind of investments that the Export-Import Bank can do to counter China.\nMr. Chairman, thank you for organizing this important hearing, such investments ensure resilient supply chains, boost exports, lower consumer costs, and most importantly, protect our national security.\nRanking Member Cantwell's Q&A Segment: VIDEO (\nCANTWELL: Mr. Kramek, I think costs are critical. When you think about it, we're here discussing costs. Why? Because consumers pay more when shipping costs are higher. Whether our farmers who are trying to export their products, as we saw during COVID, our products are getting left on the docks, and importers are paying more if shipping costs are too high.\nSo when we look at these incidents that we now see in our supply chain, and we had our own incident in Seattle where a container ship lost power and was careening towards our big Ferris Wheel in the downtown, right next to our ferry terminal. Luckily, some passenger ferry vessels were able to push the tug from, you know, out of the direct path of severe devastation. So now we mentioned the Suez Canal. We mentioned Baltimore. We have our own Seattle experience.\nWhat do we need to do to make sure, on the cost side, that we're making the right investments from a security level to make sure that these kinds of incidents that can do great harm do not happen?\nAnd Commissioner Sola, since you were at US Southern Command. What do you think we need to do to renegotiate or to have a conversation with the Panamanians about the security level that we think needs to exist in Panama with this close proximity?\nAnd Mr. Maffei, will the audit lead to a discussion with Panama about those contracts? As I've said in my opening statement, I believe we should be very aggressive about U.S. involvement here and in Latin America. I think Panama represents one of the biggest U.S. supporters in that region, but we should engage to get this right, both on the cost side and on the security side. So if I could just hear your comments on each of those.\nMR. KRAMEK: Thank you, Senator Cantwell. Well certainly even one incident is unacceptable from a safety perspective that you're citing. Our members work tremendously hard with the International Maricreated_at Organization, the U.S. Coast Guard and other entities to try to have the safest operations possible. But accidents do occur. They are rare if you count the number of some 7,000 port visits a year. But again, one is unacceptable. So continued investment, obviously, in U.S. infrastructure and a review. We have a lot of old infrastructure, as the tragic incident in Baltimore illustrated, unfortunately. We have these bridges that, you know, need a hard look to whether or not they need additional fendering systems and the like. And investments in our ports and infrastructure can be helpful along those lines as well. And for our members, I can assure you that they continue to invest in the latest technology. We have over 600 new ships on order with some of the latest technology in the world. So we are playing our role.\nCANTWELL: I want the U.S. to get a big portion of that. That's why we need to reinvigorate.\nCommissioner Sola, what about just a new US Southern Command and U.S. government conversation with the canal authorities and the government about the security level that we seek?\nCOMMISSIONER SOLA: Thank you very much, Senator. First of all, the airborne wing that I'm wearing today is decorative. I have not worn a uniform in 35 years. So this is my personal experience here. I believe that the security of the Canal has always been understood to be provided by the United States. Panama does not have a military, and I always believe that there has been a close relationship with Southern Command that we would provide that. And it would be nice to see if we had a formalization of that in one way or another because I don't believe that it's in the treaty at all.\nCANTWELL: Okay, so formalization of maybe a cyber security agreement. See, I'm thinking this is, you have accidents, and then you have larger cyber security issues that you just have to be on top of. And what I don't like about anytext that has a backdoor is, I'm for the United States advocating don't buy it from people who have a government backdoor. Don't do it. Because what are you going to do? At some point in created_at, you're going to regret that.\nCommissioner Maffei, what about this audit? And could we push Panama on these issues of looking at closer U.S. infrastructure instead? Particularly since, you know, the sea change here is like what everytext said, everytext thought this was Hong Kong. Then it turned into China. We didn't have an ambassador. After that, next thing you know, they've made more aggressive postures. They're making aggressive postures everywhere. That's why the United States saying no government backdoors in technology, and getting five other technology nations and democracies to say the same thing and evangelize that every day is going to help us. And so is the investment.\nBut what about getting the stevedoring business, or some of that back into proximity under the audit?\nCOMMISSIONER MAFFEI: Well, it is the Panama Controllers Office, and they are investigating, you know, contracts at Panamanian ports. And we don't have any jurisdiction over Panamanian ports per se. But your broader point, I think, is very, very important. While we were down there, both of us heard, I think several created_ats, that the Panamanians--the ones we talked to anyway--would welcome U.S. companies coming in and doing a lot of this work. Frankly, they're bids are not competitive with the Chinese bids. Frankly, they're not that existent, because the U.S. companies can make more money doing things other places. But even if they were existing, it is difficult to put competitive bids when the Chinese bids are so heavily subsidized by China. So you're absolutely right. This is a problem, and it's a problem in many, many other areas of the world that we can get into if you want in subsequent questions.\nCANTWELL: My created_at is expired, but I think my major point is, let's be a big maricreated_at powerhouse. Let's revitalize our supply chains, drive down costs for consumers, and secure what we need to secure. Thank you, Mr. Chairman.\n* * *\nOriginal text here: \nCopyright Targeted News Services\nMSTRUCK-9021720 MSTRUCK\n"
  }
]