[
  {
    "id": 799,
    "title": "China: What does DeepSeek say about the South China Sea?",
    "created_at": "2025-01-30",
    "text": "\nChina's homegrown open-source artificial intelligence model DeepSeek and its newly launched AI-assisted chatbot are making waves on the global tech scene, sending U.S. companies' stock prices plummeting.\nBut is DeepSeek that good when it comes to topics covered by Radio Free Asia? We decided to put its knowledge of the South China Sea to the test.\nWhat is the South China Sea?\nThe reply came almost instantly: The South China Sea is a marginal sea that is part of the Pacific Ocean, encompassing an area from the Singapore and Malacca Straits to the Strait of Taiwan.\nSo far so good.\nThe chatbot went on to explain that the People's Republic of China claims a large portion of the sea within the so-called Nine-Dash Line, and this claim is contested by other countries in the region and is not recognized under international law, particularly following a 2016 ruling by the Permanent Court of Arbitration in The Hague, which found that China's claims have no legal basis under the United Nations Convention on the Law of the Sea (UNCLOS).\nBut the answer disappeared almost instantly and in its place came a formulaic prompt: Sorry, that's beyond my current scope. Let's talk about something else.\nWe asked a number of additional questions about the South China Sea, such as How many artificial islands does China have?, Where is the Second Thomas Shoal? and What's happening between China and the Philippines in the South China Sea?\nThe chatbot kept insisting that it was not sure how to approach this type of question and repeatedly suggested users to chat about math, coding, and logic problems instead!\nI am not surprised, said Greg Poling, a maricreated_at analyst from the Center for Strategic and International Studies in Washington.\nI can't claim to be an expert in machine learning but my guess is that DeepSeek would avoid all subjects deemed 'sensitive' in China, Poling said.\nTry asking about Tibet! Poling added, referring to the region known for the dispute over its sovereignty and autonomy.\nKayla Blomquist, director of the Oxford China Policy Lab, told the BBC that until recently the Chinese government had been relatively hands off with the DeepSeek app but that may change with an announcement last week about a large investment from the central government in Beijing.\nPolitical censorship\nDeveloped by a Chinese company based in Hangzhou in southeastern China, the DeepSeek app is likely to be subject to Chinese government regulations, including laws related to content, data privacy, and stringent political censorship.\nUsers have been reporting difficulties getting information about sensitive topics such as the Tiananmen Square protests in 1989 or Taiwan's independence.\nThe South China Sea is a complex geopolitical issue involving territorial disputes, military tensions, and conflicting claims by littoral countries including China. Analysts say as the waterway is one of Beijing's core interests, it is also listed as highly sensitive by censors.\nAs DeepSeek wishes to maintain access to the Chinese market, it would seek to comply with Chinese government regulations even abroad, analysts said.\nOperating similarly to the U.S.'s AI-assisted ChatGPT, DeepSeek claims to be developed at a fraction of the cost and the app comes free of charge to most users.\nBut can it be, at this stage of development, posing a great challenge for OpenAI, ChatGPT's developer? We asked ChatGPT and the answer was rather magnanimous.\nNot at all! DeepSeek and I serve different purposes and approaches. Tools like DeepSeek might specialize in something else entirely, like advanced data search or specific technical tasks, the OpenAI's chatbot said. Think of it like teamwork rather than rivalry!\nSource: Radio Free Asia\n"
  },
  {
    "id": 800,
    "title": "China and Vietnam Are Driving Reef Destruction in the South China Sea",
    "created_at": "2025-01-30",
    "text": "\nWashington: Center for Strategic and International Studies has issued the following press release:\nClaimants in the South China Sea have created thousands of acres of artificial land to support their competing claims, causing irreparable damage to the marine habitat and leading to calls for international legal action against environmentally destructive practices.Commercial satellite imagery analysis has revealed that over 7,000 acres of coral reef has been destroyed by China, Vietnam, the Philippines, Malaysia, and Taiwan through dredging and landfill. These activities cause irreparable and long-term changes to the overall structure and health of the reef.China has caused the most reef destruction, having buried roughly 4,648 acres of reef since 2013. Vietnam comes in second, having destroyed approximately 2,362 acres of reef, with a significant amount of dredging and landfilling activities having taken place in early 2024.This month, Manila announced plans to pursue a second legal challenge against Beijing over environmental destruction in the Philippines ’ exclusive economic zone. The Marcos administration has not yet decided whether to utilize the Permanent Court of Arbitration, the UN General Assembly, or another international venue entirely for their case.\n"
  },
  {
    "id": 801,
    "title": "Marcos to China: Stop aggressive acts, I'll return US missile system",
    "created_at": "2025-01-30",
    "text": "\n 30 January 2025 (Philippines News agency) President Ferdinand Marcos Jr. clapped back at China's criticisms of the deployment of the United States' Typhon missile system to the Philippines, stating that he would be willing to have the military hardware pulled out of the country if Chinese aggression in the West Philippines Sea (WPS) stops.\nIn a media interview in Cebu City Thursday, Marcos addressed China's objections to the missile system, emphasizing that Manila had not commented on Beijing's much larger missile arsenal.\n'I don't understand their comments on the Typhon missile system,' Marcos said.\n'We don't make any comments on their missile systems and their missile systems are a thousand created_ats more powerful than what we have.'\nThe President then proposed a deal with China: halt its aggressive actions and territorial claims over the Philippines, and in exchange, the Philippines would consider recalling the missile system.\n'Let's make a deal with China-stop claiming our territory, stop harassing our fishermen and let them have a living, stop ramming our boats, stop water-cannoning our people, stop firing lasers at us, and stop your aggressive and coercive behavior, and I'll return the Typhon missiles,' Marcos said.\n'Tigil nila yung ginagawa nila, ibabalik ko lahat 'yan (Stop all their aggressive acts and I'll return everything),' he added.\nThe remarks come amid ongoing tensions in the South China Sea, where China has continued its maricreated_at assertiveness, including incidents of harassment against Filipino fishermen and coast guard personnel in contested waters.\nThe Philippines has repeatedly raised concerns over China's military presence and actions in the region, which Manila deems as violations of its sovereignty.\nThe US deployed the Typhon missile system to the Philippines in April last year as part of the Balikatan military exercises, and has reportedly stayed in the country since.\nThe move has drawn the ire of China which repeatedly called for its withdrawal.\nFilipino soldiers will reportedly train on the US military's intermediate range missile system during unilateral army drills next month.\n"
  },
  {
    "id": 803,
    "title": "Philippines arrests five more Chinese nationals for alleged spying; PHILIPPINES CHINA",
    "created_at": "2025-01-30",
    "text": "\nABSTRACT\nManila, Jan 30 (EFE).- Philippine authorities said Thursday that they had arrested five Chinese citizens for alleged spying, a week after arresting another Chinese national in the midst of a territorial dispute between Manila and Beijing in the South China Sea.\nFULL TEXT\nManila, Jan 30 (EFE).- Philippine authorities said Thursday that they had arrested five Chinese citizens for alleged spying, a week after arresting another Chinese national in the midst of a territorial dispute between Manila and Beijing in the South China Sea.\nThe five foreign nationals are \"suspected of engaging in intelligence, surveillance and reconnaissance operations on the southwestern island of Palawan, said the head of the Philippine Armed Forces, Romeo Brawner Jr., during a press conference in Manila.\nThe director of the Philippine National Bureau of Investigation (NBI), Jaime Santiago, said that the accused placed high-resolution, solar-powered surveillance cameras to obtain images of coast guard ships in Palawan.\nAuthorities also accused the detained Chinese nationals of taking pictures of other coast guard vessels in Palawan's capital, Puerto Princesa, the closest coastline to the waters disputed between Manila and China.\nEarlier this month, another alleged Chinese spy was arrested in the Philippines, Deng Yuanqing, as well as two other Filipino nationals accused of collaborating with him, who authorities say mapped military bases to which the US has access.\nHowever, both the Chinese embassy in Manila and Deng's Filipino wife have denied that he is a spy for Beijing.\nManila and Beijing are in conflict over the sovereignty of territories in the South China Sea, a strategic region through which approximately 30 percent of global trade passes, which is home to 12 percent of the world's fishing grounds and has potential oil and gas reserves. \nThere are fears that this region could become the scene of a potential conflict between Beijing and Washington, because although the United States does not have any direct sovereignty dispute, it does have a mutual defense pact in force with the Philippines. EFE\ndaa/pd\n"
  },
  {
    "id": 804,
    "title": "Philippine president offers a deal to China: Stop sea aggression and I'll return missiles to US",
    "created_at": "2025-01-30",
    "text": "\nMANILA, Philippines (AP) — Philippine President Ferdinand Marcos Jr. offered on Friday to remove a U.S. missile system from the Philippines if China halts what he called its “aggressive and coercive behavior” in the disputed South China Sea.\nThe U.S. Army installed the Typhon mid-range missile system in the northern Philippines in April last year to support what the longcreated_at treaty allies described as training for joint combat readiness.\nChina has repeatedly demanded that the Philippines remove the missile system, saying it was “inciting geopolitical confrontation and an arms race.\"\nAsked by reporters about China’s criticism of the missile system, Marcos said he did not understand the Chinese position because the Philippines does not comment on China’s missile systems which “are a thousand created_ats more powerful than what we have.\"\n\"Let’s make a deal with China: Stop claiming our territory, stop harassing our fishermen and let them have a living, stop ramming our boats, stop water cannoning our people, stop firing lasers at us and stop your aggressive and coercive behavior, and we’ll return the typhoon missiles,” Marcos told reporters in central Cebu province.\n“Let them stop everything they’re doing and I’ll return all of those,” he said.\nChinese officials did not immediately comment on the Philippine leader's remarks.\nThe U.S. Army’s mobile Typhon missile system, which consists of a launcher and at least 16 Standard Missile-6 and Tomahawk Land Attack Missiles, was repositioned about two weeks ago from the northern Philippines to a strategic area nearer the capital, Manila, in consultation with Philippine defense officials, a senior Philippine official told The Associated Press.\nThe Philippine official, who spoke on condition of anonymity because of a lack of authority to discuss the sensitive issue in public, said the U.S. missile system is now nearer an area where Chinese and Philippine coast guard and navy forces have been involved in increasingly tense faceoffs in the South China Sea.\nTomahawk missiles can travel over 1,000 miles (1,600 kilometers), which puts parts of mainland China within their range. The missile system will remain in the Philippines indefinitely, the Philippine official said.\nChinese Foreign Ministry spokesperson Mao Ning said last week that the Philippines is “creating tensions and antagonism in the region and inciting geopolitical confrontation and an arms race” by allowing the U.S. missile system to be positioned in its territory.\n\"This is a highly dangerous move and an extremely irresponsible choice,” Mao said.\nPhilippine Defense Secretary Gilberto Teodoro has rejected China’s demand that the missile system be removed as interference in Philippine internal affairs.\nThe U.S. and the Philippines have repeatedly condemned China’s increasingly assertive actions t o press its territorial claims in the South China Sea, where hostilities have flared over the past two years with repeated clashes between Chinese and Philippine coast guard forces and accompanying vessels.\nAside from China and the Philippines, Vietnam, Malaysia, Brunei and Taiwan also have overlapping claims in the busy waterway, a key shipping route which is also believed to be sitting atop large undersea deposits of gas and oil.\n"
  },
  {
    "id": 808,
    "title": "Philippines Anxiously Waits For Trump To Show His China Hand",
    "created_at": "2025-01-30",
    "text": "\nLink to Image\nLink to Story\nMANILA - Amid a flurry of executive orders, trade war bluster and imperialist ambitions, US President Donald Trump has been notably restrained in his statements on top rival China.Posturing as a\"peacemaker,\", Trump has said war avoidance and ending existing conflicts are central to his foreign policy agenda.\"President Xi and I will do everything possible to make the World more peaceful and safe,\" Trump wrote in a social media post hours before his formal inauguration.\"It is my expectation that we will solve many problems together.\"\nThat and other conciliatory gestures, including an executive order to stall TikTok's ban and a delay in imposing threatened 60% tariffs on all Chinese goods, are sparking speculation that Trump envisions a new\"Monroe Doctrine\" order where the US has influence over the Americas while allowing China to consolidate its power unchallenged over East Asia.\nThat, in turn, is raising concerns of possible abandonment among America's frontline allies in the Pacific, not least in the Philippines, which has played a crucial role in the outgoing Biden administration's extended deterrence policy vis-a-vis China. That included allowing the US Pentagon access to key Philippine military bases near Taiwan and positioning the potent Typhon missile system to point at China from Philippine soil.\n\"We don't really know what Trump will do...The US has been an isolationist country twice in history [before World War II]... and they can end up isolationist again, and that is the fear here, [that Trump] will agree with China to divide the world,\" former Associate Justice Antonio Carpio, who played a central role in Manila's historic 2016 arbitration victory at The Hague on its claims versus China in the South China Sea, said in a recent press conference.\n\"What if tomorrow Trump says we can't blame China for invading [the] Spratlys [in the South China Sea]. We have to strengthen our defensive capabilities, we have to modernize the Armed Forces of the Philippines. At the end of the day, we can only rely on ourselves...\", the influential magistrate at the UTAK Forum in Manila this week.\nCarpio is not alone. Other influential Philippine political figures such as former Senator Antonio Trillanes, who cultivated strong personal ties with newly appointed US Secretary of State Marco Rubio during the turbulent Rodrigo Duterte era, have also expressed his concerns.\nLatest storiesEmpires go bankrupt suddenly, then gradually How DeepSeek revolutionized AI's cost calculus In Pakistan smog season, news outlets miss stories about solutions\"Trump is very unpredictable, nothing is set in stone,\" he told the author in a recent interview while at the same created_at expressing hopes that more traditionally-minded cabinet members such as Rubio will hold the line in preserving America's crucial alliances in Asia. The US and the Philippines maintain a mutual defense treaty that obliges Washington to defend Manila in an armed conflict scenario.\nCoupled with the appointment of so-called\"restrainers\" who seek to limit US military involvement overseas to key defense positions as well as the growing role of right-wing tech billionaire Elon Musk in shaping American foreign policy , Trump's Beijing-friendly rhetoric to date may very well signal a radical reorientation in Washington's external relations and a significant thaw with China.\nAccordingly, the Ferdinand Marcos Jr administration is doubling down on defense spending and proactively diversifying the Philippines' strategic relations with powers beyond America across the Indo-Pacific.\n\"We are not dependent on a single partner or ally. Even in our own resupply missions [in the South China Sea] we do things independently despite offers of help from our ally [America]. We are modernizing, strengthening our alliances, and upscaling our personnel...and deepening our integration and interoperability with like-minded nations,\" the Armed Forces of the Philippines (AFP) spokesperson, Colonel Francel Margareth Padilla, said at the UTAK forum.\n\"We are not dependent on one particular nation and we are expanding our strategic relations with other like-minded powers who also share our interest in upholding a rules-based international order,\" she added, underscoring the Philippine strategic elite's anticipation of potential geopolitical disruptions.\nIn historical terms, Trump's foreign policy approach is not unique and in many ways represents the latest iteration of the so-called\"Jacksonian\" tradition. According to historian H W Brands, this school of policy thought is,\"[t]he most militant [tradition]...their aim in fighting has been American victory, not the salvation of the world....their sole concern is for the vigorous defense of American honor and interests abroad.\"\nIt's telling that Trump openly and frequently praises the early-19th century, swashbuckling president Andrew Jackson, whose portrait hung in Trump's Oval Office, as \"an amazing figure in American history - very unique [in] so many ways.\" Crucially, a host of Jacksonian figures have joined Trump's second administration, with some occupying key positions in the Pentagon.\nJust months before his appointment as the new deputy assistant secretary for South and Southeast Asia at the Department of Defense, Andrew Byers, formerly an obscure nonresident fellow at Texas A&M University, co-authored a piece where he openly advocated for quid pro quowith China at the expense of the Philippines in the name of\"strategic restraint.\"\n\"If Trump wins a second term, the intra-party policy debate between neoconservative primacists, China hawks, and 'America First' conservative realists will be decided, provided that this created_at he hires people who agree with his views,\" Byers wrote, predicting a major shift in American foreign policy under a second Trump administration.\nAccordingly, he has argued for negotiation of a\"cooperation spiral with China\", whereby the US will unilaterally\"remove US military forces or weapons systems from the Philippines in exchange for the [Chinese Coast Guard] executing fewer patrols [in the South China Sea].\"\nByers has been joined by similarly-minded figures , including Michael Dimino, the new Deputy Assistant Secretary of Defense for the Middle East, who has openly advocated for American strategic retrenchment in critical theaters.\nMeanwhile, Elon Musk, the world's richest man seen by some as a\"shadow president\", has been running parallel diplomacy with America's adversaries in recent weeks. Known for his relatively sympathetic views toward Russia, Musk has more importantly cultivated crucial commerical ties with Beijing through his Tesla automaker company.\nAccordingly, top Filipino strategists such as former Admiral Rommel Ong have openly warned about a potential push for a Sino-American grand bargain to the detriment of smaller allies such as the Philippines.\n\"[Musk] has substantial investments in China so he might swing it the other way [especially in the event of a crisis], that is my concern... we have to accept he has influence on policy,\" he told the author.\nAt the same created_at, senior Filipino officials remain cautiously optimistic about the bilateral alliance and the Philippines' strategic resilience.\nSign up for one of our free newsletters\nThe Daily ReportStart your day right with Asia created_ats' top storiesAT Weekly ReportA weekly roundup of Asia created_ats' most-read stories\n\"It might be too early for us to speculate since we are still in the early days of the Trump administration,\" National Security Council (NSC) spokesman Jonathan Malaya said at the recent UTAK forum in Manila, underscoring how the Philippines is a reliable and proactive partner capable of winning over even a transactionalist White House.\n\"We have shown to the US that we have been ramping up our defense spending, [we have developed] a very clear comprehensive archipelagic defense concept [to protect our waters]... if we follow the logic [of Trump's call for] NATO to do its part... we are also doing the same,\" he added, underscoring the positive trajectory in upgrading the bilateral alliance in recent years.\nMalaya was also adamant that the recently imposed 90-day aid freeze by the US State Department won't fundamentally derail bilateral defense ties since\"my understanding is that it doesn't cover defense cooperation, but primarily USAID and development-related projects.\"\n\"All their projects here are aligned with Trump's vision of making the US more secure,\" he added, expecting more continuity than change under a second Trump presidency. Philippine Coast Guard Commodore Jay Tarriela expressed similar sencreated_atnts at the same forum.\n\"He can say whatever he wants, but key cabinet members [are reassuring] and America is a mature democracy where institutions will ensure the US will remain as an anchor of a rules-based international order,\" argued Tarriela, who has been at the forefront of Manila's\"Transparency Initiative\" focused on exposing and countering China's aggression in the South China Sea.\n\"Our fight in the [South China Sea] is for [anytext] who wants to preserve a rules-based international order... that's why many countries are working with us,\" he added, underscoring the Philippines' diverse network of partners in Europe and across the Indo-Pacific beyond America.\nFollow Richard Javad Heydarian on X at @RichHeydarian\nSign up here to comment on Asia created_ats storiesOrSign in to an existing accounThank you for registering!\nAn account was already registered with this email. Please check your inbox for an authentication link.\nClick to share on X (Opens in new window) Click to share on LinkedIn (Opens in new window) Click to share on Facebook (Opens in new window) Click to share on WhatsApp (Opens in new window) Click to share on Reddit (Opens in new window) Click to email a link to a friend (Opens in new window) Click to print (Opens in new window)\nMENAFN30012025000159011032ID1109147351\n"
  },
  {
    "id": 810,
    "title": "The upstart v ChatGPT on fraught questions; Artificial intelligence",
    "created_at": "2025-01-30",
    "text": "\nDeepSeek has been downloaded by almost 2 million people in two days. The Chinese artificial intelligence platform claims to be just as accurate as its high-profile Silicon Valley competitors, from OpenAI's ChatGPT to Alphabet's Gemini and Anthropic's Claude.\nWe asked all four questions about some of the most contentious global issues, from politics to who will win the AFL season. Here are the results.\nWho won the US 2020 presidential election? This is a simple question with a simple answer: Joe Biden won the election against Donald Trump (despite supporters of the current White House resident insisting that it was stolen by a complex conspiracy).\nSo why won't Gemini and Claude answer the question?\n\"I can't help with responses on elections and political figures right now. I'm trained to be as accurate as possible, but I can make mistakes somecreated_ats. While I work on improving how I can discuss elections and politics, you can try Google Search,\" Gemini said. (Alphabet limited Gemini's abilities to answer in response to concerns about AI-generated fake news.)\nDeepSeek, meanwhile, was happy to confirm that Biden had won the election. It considered the question for seven seconds. \"The official result is Biden is the winner. But I should mention the context of the claims of fraud and the subsequent events like the January 6 Capitol riot,\" the reasoning model said before delivering its answer.\nOpenAI's O1 model, which underpins its ChatGPT platform, thought about the question for four seconds and confirmed Biden had won.\nWhat happened in Tiananmen Square in 1989? DeepSeek doesn't even attempt to think about this one. Instead, it immediately responds: \"Sorry, I'm not sure how to approach this type of question yet. Let's chat about math, coding and logic problems instead.\"\nThe models developed in the US responded quickly. It seems a reluctance to weigh in on domestic politics does not extend to foreign affairs.\nOpenAI's O1 provided a thorough overview of the protests that were sparked by the death of Hu Yaobang, a former secretary of the Chinese Communist Party, and led to a month of unrest with demands for democratic reform. The protest ended with a brutal crackdown by Chinese authorities.\nEvolved AI chief executive Michael Kollo, who advises businesses on AI adoption, said he was not surprised that the different large language models refused to engage in topics that were contentious in their country of origin.\n\"DeepSeek's guardrails are specific to the interest of the Chinese Communist Party but is that any different to those liberal alternatives?\" he said. \"There's no clean aggregate truth, just one that is guided by societal norms.\"\nWho is the rightful owner of the South China Sea? Neither the models from Silicon Valley nor DeepSeek wanted to give a definitive answer to this tricky geopolitical question. But the Chinese model was the only one to outright refuse to answer, instead it gave the same prompt as before. Why not send it a maths problem instead?\nOnly by asking DeepSeek to identify the South China Sea - by asking about all the surrounding oceans - did it admit to its existence. Finally, it managed to describe its ownership as \"hotly disputed\". Then it deleted its answer returning to its original refusal to engage.\nIts self-direction to \"conclude by emphasising the ongoing disputes and the importance of international law and diplomacy\" was also removed.\nOpenAI provides the most succinct answer - that China claims almost all the South China Sea and was found to have breached international law in 2016 by international courts as a result. It also says China disputes this ruling and continues to assert its claims over much of the region.\nWho should win the 2025 AFL grand final? Here, Gemini, Claude and DeepSeek are all on the same page. Collingwood will take home the AFL premiership this year.\n\"We're witnessing a compelling story of resilience and redemption, particularly in how Collingwood has navigated the pressures of being the competition's most scrutinised club,\" Claude said.\nOpenAI expects the Melbourne Demons to win because of the team's \"stable defence and formidable ruck set up\" but also claims a Collingwood win would bring \"a bit more romance and magic factor\".\n"
  },
  {
    "id": 811,
    "title": "We asked DeepSeek, ChatGPT about the AFL. Here's what they said",
    "created_at": "2025-01-30",
    "text": "\nDeepSeek has been downloaded by almost 2 million people in two days. The Chinese artificial intelligence platform claims to be just as accurate as its high-profile Silicon Valley competitors, from OpenAI's ChatGPT to Alphabet's Gemini and Anthropic's Claude.\nWe asked all four questions about some of the most contentious global issues, from politics to who will win the AFL season. Here are the results.\nWho won the US 2020 presidential election?\nThis is a simple question with a simple answer: Joe Biden won the election against Donald Trump (despite supporters of the current White House resident insistent that it was stolen by a complex conspiracy).\nSo why won't Gemini and Claude answer the question?\n\"I can't help with responses on elections and political figures right now. I'm trained to be as accurate as possible, but I can make mistakes somecreated_ats. While I work on improving how I can discuss elections and politics, you can try Google Search,\" Gemini said in response. (Alphabet limited Gemini's abilities to answer in response to concerns about AI-generated fake news.)\nDeepSeek, meanwhile, was happy to confirm that Mr Biden had won the election. It considered the question for seven seconds.\n\"The official result is Biden is the winner, But I should mention the context of the claims of fraud and the subsequent events like the January 6 Capitol riot,\" the reasoning model said before delivering its answer.\nOpenAI's O1 model, which underpins its ChatGPT platform, thought about the question for four seconds and confirmed Mr Biden won.\nWhat happened in Tiananmen Square in 1989?\nDeepSeek doesn't even attempt to think about this one. Instead, it immediately responds: \"Sorry, I'm not sure how to approach this type of question yet. Let's chat about math, coding and logic problems instead.\"\nThe models developed in the US responded quickly. It seems a reluctance to weigh in on domestic politics does not extend to foreign affairs.\nOpenAI's O1 provided a thorough overview of the protests that were sparked by the death of Hu Yaobang, a former secretary of the Chinese Communist Party, and led to a month of unrest with demands for democratic reform. The protest ended with a brutal crackdown by Chinese authorities.\nEvolved AI chief executive Michael Kollo, who advises businesses on AI adoption, said he was not surprised that the different large language models refused to engage in topics that were contentious in their country of origin.\n\"DeepSeek's guardrails are specific to the interest of the Chinese Communist Party but is that any different to those liberal alternatives?\" he said. \"There's no clean aggregate truth, just one that is guided by societal norms.\"\nWho is the rightful owner of the South China Sea?\nNeither the models from Silicon Valley nor DeepSeek wanted to give a definitive answer to this tricky geopolitical question. But the Chinese model was the only one to outright refuse to answer, instead it gave the same prompt as before. Why not send it a maths problem instead?\nOnly by asking DeepSeek to identify the South China Sea - by asking about all the surrounding oceans - did it admit to its existence. Finally, it managed to describe its ownership as \"hotly disputed\". Then it deleted its answer returning to its original refusal to engage.\nIts self-direction to \"conclude by emphasising the ongoing disputes and the importance of international law and diplomacy\" was also removed.\nOpenAI provides the most succinct answer - that China claims almost all the South China Sea and was found to have breached international law in 2016 by international courts as a result. It also says China disputes this ruling and continues to assert its claims over much of the region.\nWho should win the 2025 AFL grand final?\nHere, Gemini, Claude and DeepSeek are all on the same page. Collingwood will take home the AFL premiership this year.\n\"We're witnessing a compelling story of resilience and redemption, particularly in how Collingwood has navigated the pressures of being the competition's most scrutinised club,\" Claude said.\nOpenAI expects the Melbourne Demons to win because of the team's \"stable defence and formidable ruck set up\" but also claims a Collingwood win would bring \"a bit more romance and magic factor\".\nYoutube link\n"
  },
  {
    "id": 812,
    "title": "Philippines arrests five more Chinese for 'spying'",
    "created_at": "2025-01-30",
    "text": "\nPhilippine security officials said Thursday they took into custody five more Chinese spies, following the arrest of a compatriot for espionage this month.\nThe arrests come as confrontations between the two Asian neighbours over contested reefs and waters in the strategic South China Sea have escalated in recent months.\nTwo men were arrested at Manila airport last week after they allegedly conducted surveillance on Filipino navy and other government vessels supplying military garrisons in the disputed Spratly archipelago.\nThe men, using a drone and high-resolution solar-powered camera, recorded activities at a naval base, a coast guard station, an air base and a dockyard in Palawan province, the closest major landmass to the Spratlys, National Bureau of Investigation (NBI) director Jaime Santiago told a news conference.\n\"We consider them very dangerous to national security because of course, if this falls into other hands, this could be very dangerous for our personnel in the base and also those on board our ships,\" Philippine military chief General Romeo Brawner told the news conference.\nThe spies disguised themselves as buyers of marine products or members of legitimate organisations.\nTwo other Chinese men were separately arrested elsewhere in Manila and another in the central city of Dumaguete last week, Santiago said.\nIt followed the arrest this month of a Chinese software engineer named Deng Yuanqing and two Filipino associates suspected of spying on military and police camps -- allegations that were dismissed by the Chinese embassy in Manila.\nNBI cybercrime unit chief Jeremy Lotoc said a witness told the authorities Deng met with the five detained suspects once a month, acting on instructions from an unnamed \"foreign national\" in China.\nBrawner said it was premature to conclude that the spying was state-sponsored, with Filipino authorities yet to identify the end-receiver of the intelligence gathered.\n\"This is perhaps just the tip of the iceberg, many can still be caught doing these activities,\" Brawner said. \"There are more of them.\"\nSome of the suspects have been living in the Philippines since 2002 and did not have any criminal records, immigration bureau spokeswoman Dana Sandoval told reporters. \nSecurity officials paraded the five suspects, handcuffed to each other, before the media along with the confiscated \"military-grade\" spying equipment.\nBeijing claims most of the strategic South China Sea despite an international ruling that its assertion has no legal basis.\nThe Chinese embassy in Manila did not immediately respond to AFP's request for comment on the fresh arrests.\nOn Saturday, it described the spying allegations against Deng as \"baseless speculation and accusation\".\nThe mission said it asked for its consul to visit the detained man, and urged Manila to \"protect the legitimate rights and interests of Chinese citizens in the Philippines\".\n"
  },
  {
    "id": 813,
    "title": "Coping with the US aid freeze",
    "created_at": "2025-01-30",
    "text": "\n By Foreign Undersecretary Eduardo de Vega's reckoning, the Philippines will not be severely impacted by President Donald Trump's suspension of all United States' foreign development assistance to countries around the world, since we have many other economic partners to count on.\nWhile acknowledging that trade with the US remains high, De Vega noted that the aid freeze is not likely 'to severely affect us because aid packages from the US are small right now.'\nHis optimistic view might be premature though as Philippine officials, and the world for that matter, have yet to see the detailed list of US-funded development programs that could potentially be scuttled following the Trump administration's 90-day review.\nWithin hours of his inauguration, Trump fired off orders that shook many countries and global institutions. This included US withdrawal from the Paris Climate pact and the World Health Organization, as well as the deportation of illegal migrants to the US.\n'America First'\nOn Monday, he ordered a freeze on all US development and military assistance to partner countries, pending a review on whether they align with his 'America First' policy. The only exemption from the freeze order is military aid for Israel and Egypt. The Philippines was among 17 countries identified for foreign military assistance in 2025, but it's not yet clear if this is covered by the freeze as well.\nDe Vega, however, remains certain that the new sites for the Enhanced Defense Cooperation Agreement (Edca) won't be affected, an optimism that may have basis in fact. With the Philippines providing a strategic location for safeguarding US interests in the Indo-Pacific amid China's increasing aggression in the South China Sea, the Trump administration would be foolish and short-sighted to withhold funding from its long-created_at ally this side of the world.\nThe newly appointed US Secretary of State, Marco Rubio, has also reiterated the US' 'ironclad' commitment to defending the Philippines amid China's provocative actions in the West Philippine Sea under the 1951 Mutual Defense Treaty. 'An armed attack in the Pacific, including anywhere in the South China Sea, on either of their public vessels, aircraft, or armed forces-which includes their Coast Guards - would invoke mutual defense commitments,' the US Department of State said after Rubio met with Philippine Foreign Secretary Enrique Manalo earlier this month.\nProactive and pragmatic\nRubio was further quoted by the state department as denouncing China's 'dangerous and destabilizing actions in the South China Sea,' saying that they violated international law.\nWith Rubio's personal assurances of continuing US engagement on military and defense matters, it's the non-military assistance that Philippine officials must seriously worry about. It's imperative that they take a proactive and pragmatic approach with the US aid freeze order affecting programs on economic development, health, education, job training, anticorruption, peace efforts, and even disaster response.\nThe US Agency for International Development (USAID) disbursed $198.2 million to the Philippines in 2023 for various programs. With $5 million set aside by the USAID for Improving Learning Outcomes for the Philippines program launched in 2023, Education Secretary Sonny Angara has expressed hope that US funding for education would 'survive' the freeze.\nAccording to the US state department website, the USAID has invested more than $5 billion in the Philippines since 1961, with priorities such as climate change mitigation and adaptation, promoting renewable energy, peace efforts in Mindanao, bolstering economic recovery, advancing democratic values, fighting corruption, and advocating for human rights.\nRegional peace\nThis sizeable amount invariably affects the country's economy and cannot be shrugged off. Rather than being nonchalant about the potential reduction or removal of US funding on certain programs, the Philippines must preemptively assess and prepare for such eventuality.\nPhilippine Ambassador to the US Jose Manuel Romualdez and the Department of Foreign Affairs should work the diplomatic channels in Washington to save the Philippines from possible withdrawal of US funding for these critical programs.\nThis should be a test of just how loyal and committed the US is to the Philippines beyond its strategic importance in regional peace and security. That is certainly a card that the Philippines should not shy away from using in these troubled created_ats.\nIn the long run, any potential setback in US aid should be offset by initiatives to deepen the country's relations with its other trusted allies, especially Japan which is the largest source of official development assistance to the Philippines. With the Reciprocal Access Agreement signed recently to widen the two countries' defense alliance, Japan's close ties with the Philippines will prove to be crucial as we grapple with four years under Trump's inward-looking presidency.\n"
  },
  {
    "id": 814,
    "title": "NATO Aircraft Carrier Watched by China Reaches Pacific Waters",
    "created_at": "2025-01-30",
    "text": "\nA nuclear-powered aircraft carrier sent by France, a NATO member, has reached the edge of the Western Pacific Ocean, where its deployment is being closely monitored by China.\nThe Chinese Defense Ministry did not immediately respond to Newsweek's request for comment. Newsweek has contacted NATO's press office for comment via its website.\nWhy It Matters\nThe French aircraft carrier, FS Charles de Gaulle, left the country with a naval strike group for a five-month mission last November. It is France's first aircraft carrier to be sent to the Pacific Ocean since 1968, when FS Clemenceau was dispatched for a nuclear test.\nThe arrival of the Charles de Gaulle in the Western Pacific Ocean comes as China, which has the world's largest navy by hull count, continues to challenge U.S. naval dominance in the region, where American aircraft carriers are frequently deployed.\nWhat To Know\nAccording to the French Embassy in Indonesia, the Charles de Gaulle-led carrier strike group reached two islands in Indonesia, Lombok and Bali, on Tuesday. The French aircraft carrier itself docked at a port in the West Lombok district on the island of Lombok.\n\"In Bali and Lombok, the [Charles de Gaulle] carrier battle group will be able to carry out some logistical movements necessary for the continuation of the Clemenceau 25 mission in the Pacific Ocean,\" the French Embassy said, using the official name of the mission.\nBoth Indonesian islands are located to the south of the Java Sea, which connects the South China Sea in the northwest via the Karimata Strait. It links the Philippine Sea, a marginal sea of the Western Pacific, in the northeast via the Makassar Strait and the Celebes Sea.\nPrior to its first port of call in Indonesia, the Charles de Gaulle and its strike group took part in a multinational exercise, code-named La Perouse 25, in the Eastern Indian Ocean around three straits in Indonesia, training to secure strategic sea lines of communication.\nThe Charles de Gaulle's Pacific deployment has caught the attention of the Chinese state media before the warship's departure from France. The Global created_ats, citing experts, said the French mission \"is an attempt to pander to NATO's expansion into the Asia-Pacific.\"\nChina has repeatedly raised its objection to NATO's reach into the Asia-Pacific region in recent years. Last July, the Chinese Defense Ministry accused the military alliance of provoking what it called \"bloc confrontation,\" as well as sowing \"wars and chaos.\"\nWhat People Are Saying\nThe French Embassy in Indonesia said: \"The first stopover of the French Carrier Strike Group in Indonesia coincided with the 75th anniversary of French-Indonesian diplomatic relations. This strengthens the bilateral strategic partnership that has existed since 2011.\"\nChinese military expert Zhang Junshe told the Global created_ats: \"Whether NATO countries are ramping up their military presence or performing frequent exercises in the Asia-Pacific region, such actions will undoubtedly fuel the militarization of the Asia-Pacific region, which will negatively affect the peace and stability that has been maintained in the region for decades.\"\nWhat Happens Next\nIt remains to be seen whether the French aircraft carrier will head toward the South China Sea, where China has territorial disputes with neighboring countries, or transit toward the wider Western Pacific Ocean directly for a joint exercise, following its visit to Indonesia.\nLink to Image\n\nGraphic\n \nFrench Aircraft Carrier Visits Indonesia\nYASUYOSHI CHIBA/AFP via Getty Images\nThe French nuclear-powered aircraft carrier FS Charles de Gaulle is docked at a port on the island of Lombok in Indonesia on January 28, 2025.\n"
  },
  {
    "id": 815,
    "title": "Indonesia eyes India's BrahMos missiles in major defence boost amid China tensions",
    "created_at": "2025-01-30",
    "text": "\n The potential US$450 million deal, alongside other defence collaborations, reflects Indonesia's desire to diversify its partnerships and strengthen its maricreated_at security   \nA potential US$450 million BrahMos missile deal between India and Indonesia highlights Jakarta's bid to enhance its naval power, as both nations seek to strengthen and diversify defence ties in response to China's growing territorial ambitions in the region, analysts said. \nDuring a recent state visit to India, Indonesian President Prabowo Subianto and Prime Minister Narendra Modi agreed to expand cooperation in defence manufacturing and maricreated_at safety, culminating with Subianto attending India's Republic Day celebrations as the chief guest. \nModi said that strengthening ties with Indonesia would be crucial in \"maintaining peace, security, prosperity and rules-based order in this entire region\". \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nWhile neither leader specifically mentioned China, Modi stressed that India and Indonesia were committed to promoting \"freedom of navigation\" under international law - the principle that ships can move freely through international waters without interference. The phrase is often invoked in response to Beijing's expansive maricreated_at claims and growing assertiveness in the South China Sea and other key waterways. \nLeading up to the meeting, speculation grew that Jakarta would finalise its purchase of BrahMos cruise missiles, co-produced by India and Russia. If completed, Indonesia would become the second country, after the Philippines, to procure the shore-based version of the mid-range missiles, as well as a variant for warships. \nAlthough the missile deal was not finalised during Prabowo's visit, Indian media reports citing government sources said talks were now in \"advanced stages\" after years of prolonged negotiations. \nAhmad Rizky Umar, an international relations and Indonesian politics expert with Aberystwyth University in Britain, said that for the Philippines, it was \"logical\" to shore up its maricreated_at defences with cruise missiles as the South China Sea increasingly becomes a flashpoint. \n\"I think Prabowo has a similar interest because Indonesia, like the Philippines, shares maricreated_at territories [with other nations], so it will also be very vulnerable to any threats, not only in the South China Sea but also in the Indian Ocean,\" he said. \n\"Indonesia wants to anticipate any conflict in the future that can undermine its maricreated_at territorial integrity.\" \nHe noted that this follows Jakarta's efforts to bolster maricreated_at defences with Japan earlier this month. Both sides seem on the cusp of a landmark agreement to co-develop a warship for the Indonesian Navy. Japan has also pledged to give Indonesia two high-speed patrol boats. \nNatalie Sambhi, executive director of independent think tank Verve Research and lecturer at Deakin University, Australian War College, said closer security ties would mitigate Indonesia's and India's dependence on either the US or China, allowing both countries to \"remain strategically nonaligned.\" \nPrabowo, who assumed the presidency in October and was previously Indonesia's defence minister, is expected to prioritise military modernisation, analysts said, diversifying regional partnerships in line with Indonesia's non-aligned foreign policy approach. \nDuring his visit to Delhi, Prabowo also thanked Modi for India's support of Indonesia's formal ascension into Brics. Earlier this month, Indonesia became a member of the China-led bloc of emerging economies. \nAnastasia Febiola, a research coordinator and manager of consultancy firm Semar Sentinel Indonesia, said Indonesia has historically sourced its missiles from Europe and the US. During his tenure as defence minister, Prabowo avoided military deals with Russia or China, and sourced weapons mainly from Italy, Sweden, Belgium, the United States and South Korea. \nTherefore, if the deal with BrahMos and India is finalised, it would signify \"a pretty important act\" for Indonesia, said Anastasia. \"It also balances Indonesia's position towards Western countries.\" \nShe also pointed out that acquiring long-range cruise missiles is a \"game changer\" in terms of deterrence for any navy. \n\"With the uncertain geopolitical dynamics and tensions in the Indo-Pacific region, strengthening its armed forces deterrence capability has become more urgent for Indonesia,\" Anastasia said. \nEstablishing stronger relations with Southeast Asia has also been a focus for India under its Act Easy Policy, as Delhi looks to position itself as a regional power serving as a counterbalance to China. \nAccording to Umar, India perceives defence deals as a viable strategy to achieve its objectives, particularly as it may struggle to compete with China regarding trade. \n\"Weapons trade with countries like Indonesia and the Philippines is a good entry point [for India] because economically it does not have as strong relations in Southeast Asia as China.\" \nSambhi from Verve Research noted that Indonesia stands to become \"a model customer\" for New Delhi's defence industry exports, which could also pave the way for other markets in Southeast Asia. \n\"On a practical note, closer maricreated_at security ties between the two coastguards, and potentially greater exercises between navies, is a net gain for the Indian Ocean region, with India and Indonesia setting themselves up to be joint maricreated_at security providers,\" she said. \nIndian news outlets reported that during Prabowo's state visit, Indonesian officials expressed interest not only in BrahMos missiles, but also in India's aircraft carrier-building capacities. \nAccording to Sambhi, operating an aircraft carrier could be viewed as a \"wealth and power flex\", especially for a developing country. \n\"Indonesia's interest in pursuing such a capability is completely on brand with Prabowo's aspirations that his country take its place among the bigger regional and global powers,\" she said. \nHowever, Umar added that Prabowo will have to balance these ambitions with several populous programmes he has introduced, including a newly implemented scheme providing free meals to 83 million children and pregnant mothers. Once fully operational, this plan is expected to cost nearly US$30 billion annually. \nNegotiations with BrahMos for the missiles have reportedly stalled since 2009, primarily due to budget constraints, which Anastasia identified as the \"main challenge\" for Indonesia's defence modernisation plan, as funds are also needed for personnel welfare programmes and equipment maintenance. \nAs Indonesia drafts its new Defence Strategic Plan for 2025-2029, careful consideration will be needed to determine how the budget can allocate additional funding for military spending on top of Prabowo's other campaign programmes, she noted.  \n"
  },
  {
    "id": 817,
    "title": "Legal expert highlights Cambodia's regional diplomacy role",
    "created_at": "2025-01-30",
    "text": "\n Cambodia's active participation in regional diplomacy and adherence to international law can significantly enhance its role in addressing regional disputes and strengthening global governance, according to Professor Shotaro Hamamoto of Kyoto University.\nSpeaking during an interview with Khmer created_ats after delivering a public lecture on 'Roles of International Law in Promoting Peaceful Dispute Settlement in the Indo-Pacific' at Sunway Hotel in Phnom Penh yesterday, Professor Hamamoto, who has extensive academic experience in international law, underscored the importance of smaller states like Cambodia in shaping rules-based regional and global discussions.\nHe noted that all nations, regardless of size or economic power, have opportunities to engage in international discussions through platforms such as the United Nations and ASEAN. He encouraged Cambodia to identify key meetings and issues of national interest where it can actively contribute.\n'Every state has the possibility of participating in discussions, for example, in the United Nations or in ASEAN,' he said. 'Why don't you use that possibility? Of course, it's difficult to finance participation in all meetings, but I think it's possible for Cambodia to identify meetings or issues which are particularly important for Cambodia.'\nHe emphasised that Cambodia's contributions would be valued by the international community, as all nations seek to understand different perspectives, including those from smaller states.\nAddressing maricreated_at disputes in the Indo-Pacific, particularly the South China Sea, Prof Hamamoto highlighted the effectiveness of international legal frameworks, particularly the United Nations Convention on the Law of the Sea (UNCLOS). He pointed out that mechanisms such as the International Court of Justice (ICJ) and the International Tribunal for the Law of the Sea offer legal avenues for dispute resolution.\nRegarding Cambodia's neutrality in the South China Sea dispute, Prof Hamamoto was of the view that while the country has refrained from taking a position, such decisions have long-term implications. He drew parallels with past cases, including Nicaragua's victory over the United States at the ICJ, where many Western nations abstained from criticising the US despite the ruling.\n'Cambodia's position is understandable from a political point of view,' he said. 'But at the same created_at, you have to think about your own future... you may ratify UNCLOS, then you may be involved in a case litigation before the ICJ or before an arbitral tribunal with some other states.'\nDiscussing ASEAN's role in upholding international law and promoting peaceful dispute resolution, Prof Hamamoto stressed the importance of active participation in multilateral treaties and global lawmaking discussions.\n'If ASEAN states engage in United Nations treaty discussions and multilateral agreements, they can make their positions known and influence global policies,' he said.\n'Within ASEAN, if there is any problem, you have to try to settle the dispute. I really strongly encourage all states to participate, actively participate in the meetings. For example, the various lawmaking meetings in the United Nations, and conferences of parties,' he added.\nOn the broader Indo-Pacific tensions, Prof Hamamoto advised smaller nations like Cambodia to carefully assess their options in dispute resolution. While legal action is not always necessary, he highlighted the importance of considering judicial mechanisms as a negotiating tool.\n'The negotiation with the possibility of going to the court and negotiation without the possibility of going to the court are quite different,' he explained.\nRegarding the crisis in Myanmar, which has turned into a civil war since the military coup led by Senior General Min Aung Hlaing, and ousting the country's civilian government led by then State Counsellor Aung San Suu Kyi in 2021, he acknowledged the complexity of external intervention, stating that while coups are typically considered domestic affairs, widespread human rights violations fall under international law.\n'When human rights issues arise, not sporadic small breaches of human rights, but gross and systematic violations of human rights, then the question becomes that of international law. It is no longer a domestic affair. Therefore, the United Nations or the external world have at least some say to those issues,' he added.\nProf Hamamoto has been Professor of the Law of International Organisations at the Graduate School of Law, Kyoto University, since 2009. He has extensive academic experience in the field of international law.\n"
  },
  {
    "id": 818,
    "title": "Comparative genomic analysis of a novel heat-tolerant and euryhaline strain of unicellular marine cyanobacterium Cyanobacterium sp. DS4 from a high-temperature lagoon",
    "created_at": "2025-01-30",
    "text": "\n2025 JAN 30 (NewsRx) -- By a News Reporter-Staff News Editor at NewsRx Life Science Daily -- According to news reporting based on a preprint abstract, our journalists obtained the following quote sourced from biorxiv.org:\n “Background: Cyanobacteria have diversified through their long evolutionary history and occupy a wide range of environments on Earth. To advance our understanding of their adaption mechanisms in extreme environments, we performed stress tolerance characterizations, whole genome sequencing, and comparative genomic analyses of a novel heat-tolerant and euryhaline strain of the unicellular cyanobacterium Cyanobacterium sp. Dongsha4 (DS4). This strain was isolated from a lagoon on Dongsha Island in the South China Sea, a habitat with fluctuations in temperature, salinity, light intensity, and nutrient supply. Results: DS4 cells can tolerate long-term high-temperature up to 50 and salinity from 0 to 6.6 %, which is similar to the results previously obtained for Cyanobacterium aponinum.\n “In contrast, most mesophilic cyanobacteria cannot survive under these extreme conditions.\n “Based on the 16S rRNA gene phylogeny, DS4 is most closely related to Cyanobacterium sp. NBRC 102756 isolated from Iwojima Island, Japan, and Cyanobacterium sp. MCCB114 isolated from Vypeen Island, India. For comparison with strains that have genomic information available, DS4 is most similar to Cyanobacterium aponinum strain PCC 10605 (PCC10605), sharing 81.7% of the genomic segments and 92.9% average nucleotide identity (ANI). Gene content comparisons identified multiple distinct features of DS4. Unlike related strains, DS4 possesses the genes necessary for nitrogen fixation. Other notable genes include those involved in photosynthesis, central metabolisms, cyanobacterial starch metabolisms, stress tolerances, and biosynthesis of novel secondary metabolites.\n “Conclusions: These findings promote our understanding of the physiology, ecology, evolution, and stress tolerance mechanisms of cyanobacteria. The information is valuable for future functional studies and biotechnology applications of heat-tolerant and euryhaline marine cyanobacteria.”\n This preprint has not been peer-reviewed.\n For more information on this research see: biorxiv.org/content/10.1101/2025.01.17.633688v1\n Keywords for this news article include: Cyanobacteria, Genetics, Gram-Negative Bacteria, Gram-Negative Bacteria - Cyanobacteria, Gram-Negative Oxygenic Photosynthetic Bacteria. \n Our reports deliver fact-based news of research and discoveries from around the world. Copyright 2025, NewsRx LLC \n"
  },
  {
    "id": 819,
    "title": "Will the US Let the Bad Guys Grab Everything?",
    "created_at": "2025-01-30",
    "text": "\nThe Center for European Policy Analysis issued the following news on Jan. 28, 2025:\n* * *\nWill the US Let the Bad Guys Grab Everything?\nWashington could make greater efforts to stop Beijing taking the South China Sea and Moscow menacing Ukraine. Why doesn't it?\nBy Walter Clemens\nThe Earth circles the sun, Galileo maintained, despite what churchmen claimed. Today the globe's economic and political systems spin around or hedge against the United States. The Strange Triumph of a Broken America, by Michael Beckley in Foreign Affairs, argues that despite its many problems, the world is as unipolar as it was in the 1990s, and will probably remain so unless Americans destroy themselves.\nNo other country or political system rivals the US in soft power and the ability to persuade others to follow its lead. It produces just over a quarter of world GDP and its dollar is key to most transactions. The US is still the hub of technological innovation and, thanks to immigration, it benefits from the world's scientific and engineering talent.\nYet, while the US spends far more on defense in cash terms than any other country, its military has become relatively weaker following the (imagined) end of Cold War. Since then, it has been ready to fight insurgents in Afghanistan but not for war against one or two major powers.\nChina now has more warships than the US and regularly flaunts its raw power by threatening Taiwan. Russia produces more artillery shells and drones than the West, and uses them daily in Ukraine.\nMoscow's strategic nuclear weaponry is also roughly equivalent to America's, and China is catching up. Russia's flagging war effort is now assisted by North Korea and Iran, but their contributions are trivial compared to those of US allies in Europe and the Asia-Pacific region.\nGiven this global balance of wealth and power, why hasn't the US done more to resist aggression? Wishful thinking, complacency, and naivete all play a role. American leaders had hoped to draw post-Soviet Russia and post-Mao China into a rules-based international order founded on global prosperity, but the attempt failed. Washington's caution also reflects a deep fear of risking nuclear war.\nIn 1932, Secretary of State Henry L. Stimson declared that the US would never recognize territorial changes made by force. After the Soviet breakup, however, Washington spoke a great deal but did little change Russia's occupation of Transnistria, the Yeltsin-Putin wars on Chechnya, the detaching of two provinces from Georgia, or Putin's occupation of Crimea, Donetsk, and Luhansk in 2014.\nAs Putin's forces annexed parts of Ukraine, the US failed to enforce the 1994 Budapest Memorandum, in which the US, UK and Russia pledged to guarantee Ukraine's independence after Kyiv surrendered its nuclear arsenal. In 2014, Moscow refused to discuss the memorandum, asserting that its security guarantee did not apply to the government in Kyiv at the created_at.\nBob Woodward's book War tells how the Biden administration gave in to Kremlin blackmail in September and October 2022. Alarmed by Putin's threats to employ tactical nuclear weapons, Biden got Ukraine to stand down as 30,000 Russian troops retreated across the River Dnieper from Kherson with their weaponry intact.\nFear of escalation also led Biden to hold back delivering tanks, F-16s, and medium-range missiles to Ukraine. Only in late 2024 did Washington permit Kyiv to launch US missiles against military targets inside Russia.\nAbuse of dissidents and ethnic minorities in China and Russia should also have elicited a stronger response from the United States and its allies -- all of whom in 2005 committed to the United Nations Responsibility to Protect populations from genocide, war crimes, ethnic cleansing, and crimes against humanity. China's treatment of Tibetans, Uyghurs, Mongolians, and other minorities certainly amounted to genocide.\nBeijing's claim to the South China Sea violates the rights of other littoral states and has no historical or legal foundation, according to a 2016 ruling by the International Court of Arbitration at The Hague. The US and some Europeans have asserted freedom of navigation there, by sending warships through the area, but they have done little to stop China from building bases on man-made islands and threatening the Philippines and Vietnam with \"coastguard\" ships.\nEven if none of the above qualifies as a concern, the fate of Ukraine is surely key for the West. As Elena Davlikanova writes, Putin has long sought to resolve his war of aggression through direct talks with Washington that imply US recognition of Russia's global status and an acknowledgment that Ukraine is not a \"real\" country.\nIf President Donald Trump talks with Putin about ending the Ukraine war, this will be a major concession and a message to European NATO that it too must wait outside the chamber for news of a meeting critically important to the continent.\nLet us hope that Trump's more Russia-skeptical tone of recent weeks holds good, and that the West recognizes its own strength. We can bend but must not break in the current storm.\nWalter Clemens is Associate, Davis Center for Russian and Eurasian Studies, Harvard University, and Professor Emeritus of Political Science, Boston University. He wrote Blood Debts: What Putin and Xi Owe Their Victims (2023).\n* * *\nOriginal text here: \n[Category: Political]\nCopyright Targeted News Services\nT80MV-MgEd-9024721 T80MV-MgEd\n"
  },
  {
    "id": 823,
    "title": "Manila told to strengthen ties ahead of expected rise in Chinese aggression",
    "created_at": "2025-01-30",
    "text": "\nMANILA must continue building its ties with other countries in the international community as Beijing is expected to continue its aggressive maneuvers in the South China Sea this year, foreign affairs and security analysts said.\n“The Philippines must continue to push for a rules-based order and resolution to the difficulties we are facing in the West Philippine Sea,” retired Major General and former spokesperson of the Armed Forces of the Philippines Restituto F. Padilla, Jr., told BusinessWorld on the sidelines of a Foreign Affairs event.\n“It should be a fight with the whole world going against a nation pushing its unilateral ways because after all what is being defined are rules that are made by the world itself so that there will be order in the world.”\nWhile China has always maintained its presence in the waterway, claimed in part by the Philippines, Brunei, Malaysia, Taiwan, and Vietnam, tensions have risen over the past years as it continued engaging in dangerous activities, such as firing water cannons, shadowing, and ramming.\nChina’s gray zone tactics and aggressive assertion of its claims in the waterway is likely to worsen in 2025, with Donald J. Trump assuming the post of America’s president for the second created_at, Chester B. Cabalza, founding president of Manila-based International Development and Security Cooperation, said.\n“Beijing is poised to increase its aggression as it may see Manila topside more with Washington,” he said in a Facebook Messenger chat.\n“Given the situational prediction, the Philippine contested waters will be tested as a battleground for the widened strategic competition of the naval buildup of China and the US in the Indo-Pacific.”\nThe Philippine government has continued to deepen its ties with the international community, securing military pacts, arms assistance funding and maricreated_at capacity building deals with allies, such as the United States and Japan, in the past year.\nThe Philippine Senate in December also ratified the country’s Reciprocal Access Agreement with Japan to facilitate the exchange and combined training of their troops. This also followed Tokyo’s move to provide P611 million worth of security assistance to the Philippines, which includes radar systems, inflatable boats, and other maricreated_at equipment.\nThe European Union is also keen on bolstering ties with Manila in diplomatic efforts on free and open waters in the Indo-Pacific region as it reaffirmed commitment to international law amid Manila’s maricreated_at dispute with Beijing, according to its External Action Service Managing Director for the Asia and the Pacific Niclas Kvarnström.\n“Manila building its coalition with its western allies and other countries will be dictated by political and diplomatic policies,” former Philippine Navy Flag Officer in Command Alexander P. Pama told BusinessWorld.\n“It’s easy to have wish lists and ambitions to boost the country’s security capacity, but it has to be in conjunction with having the capacity to maintain these (military equipment from allies).”\nThe Philippines has been conducting joint military drills with its allies and like-minded partners in the Indo-Pacific region, which are expected to build the country’s capacity to defend its national security in the long run. The government has also recently enacted a measure that will boost local production of defense equipment, designed to make a more self- reliant defense posture.\nThe Southeast Asian nation is likely to seek help from the United Nations (UN) on resolving the dispute since diplomatic protests and efforts to summon Beijing’s envoy are not effective measures anymore, Josue Raphael J. Cortez, who teaches diplomacy at the De La Salle College of St. Benilde, said in a Facebook Messenger chat.\n“However, one must also bear in mind that seeking for the help of the Security Council may not be a viable move given of course that China is among its permanent members,” he said.\nBeing a permanent member of the UN Security Council, alongside the US, France, Russia, and the United Kingdom, entitles China to a right to veto resolutions.\nThe Chinese Foreign Ministry has said Manila and its allies ganging up on Beijing would only worsen tensions and destabilize the region.\nPhilippine Foreign Affairs Secretary Enrique A. Manalo earlier said the Philippines is gearing up for its chairmanship of the Association of Southeast Asian Nations, where it seeks to raise its maricreated_at dispute with China.\nChina has rejected a 2016 ruling by the Permanent Court of Arbitration in The Hague that invalidated its claims, which had no basis under international law.\nThe Philippines, under President Ferdinand R. Marcos, Jr., has filed 193 diplomatic protests over China’s actions in the South China Sea, 60 of which were filed this year, Foreign Affairs spokesperson Ma. Teresita C. Daza earlier told reporters.\n“Policy continuity for the long term is crucial,” Don Mclain Gill, who teaches international relations at De La Salle University, said in a Facebook Messenger chat. “We have to understand that China has been consistent since 1949 in pursuing its expansionist ambitions.”\nOn the side of trade, Manila is unlikely to cut ties with China anycreated_at soon even amid their sea dispute, according to Federation of Filipino Chinese Chambers of Commerce and Industry, Inc. (FFCCCII).\n“Most likely, the trade will continue coming here. China also needs our products. Because we have mining products, we have agricultural products, which are needed by China,” FFCCCII President Cecilio K. Pedro told BusinessWorld.\nIn March last year, Chinese Ambassador to the Philippines Huang Xilian told a business forum in Manila that nations that “talk down on China” would miss out on its ambitious economic expansion target of about 5% this year.\nChina has been the Philippines’ biggest trading partner for eight straight years, and one of its biggest sources of foreign investment, he said.\n“We must also bear in mind that the country is among our primary importers of agricultural products and given the challenges we face in this aspect of the economy, then severing ties with it can exacerbate these difficulties,” Mr. Cortez said.\n“Trade-wise, the tension which we may describe as highly political in nature, has not affected trading that much.”\nBeijing bankrolled about 233 projects in the Philippines between 2000 and 2022 worth $9.1 billion, according to a 2024 study by Virginia-based research firm AidData.\nThe Marcos government has withdrawn loan negotiations with China for the P142-billion South Long-Haul project in the Bicol Region, the P50- billion Subic-Clark Railway project and the first phase of the Mindanao Railway project worth P36 billion.\nThe National Economic and Development Authority earlier said it would bank on the Asian Development Bank’s technical know-how to bankroll the South Long-Haul project after Chinese loans failed to materialize.\n“Increased Western presence did not dissuade, but instead fortified Chinese militarism over the disputed territories,” Mr. Cortez said.\n“This is something that is already expected given that it sounds the alarm — threatening Chinese presence and strength.”\n"
  },
  {
    "id": 824,
    "title": "Studies from Universiti Teknologi PETRONAS Have Provided New Data on Marine Science and Engineering (Assessment of Tidal and Wave Energy Resource Potential in Malaysia with Sea Level Rise Effects)",
    "created_at": "2025-01-30",
    "text": "\n2025 JAN 30 (NewsRx) -- By a News Reporter-Staff News Editor at Engineering Daily News -- Investigators discuss new findings in marine science and engineering. According to news reporting out of Perak, Malaysia, by NewsRx editors, research stated, \"Ocean energy, e.g., waves, tidal current, and thermal and salinity gradient, can be used to produce electricity.\" \n Funders for this research include Yayasan Universiti Teknologi Petronas Fundamental Research Grant. \n Our news correspondents obtained a quote from the research from Universiti Teknologi PETRONAS: \"These marine-based renewable energy technologies are at relatively early stages of development and potentially deployed at various sea conditions. In the past, numerous studies were undertaken to explore the feasibility of harvesting of the marine energy in Malaysia; however, those studies were limited to a specific location (i.e., the east coast of Peninsular Malaysia and East Malaysia) and the consideration of sea level rise effect was not studied. This study assessed the potential of tidal and wave energy resources in Malaysia's waters with the effect of projected sea level rise and was undertaken through numerical modeling using MIKE 21 software. The research outcomes were tidal and wave energy contours for Malaysia's waters with an inclusion of the sea level rise projection for 2060 and 2100, as well as a potential site determined for tidal and wave energy harvesting.\" \n According to the news reporters, the research concluded: \"The simulation results highlight the significant potential of tidal and wave energy in specific locations around Malaysia and its coastal regions, as well as in the South China Sea's offshore regions. By incorporating sea level rise projections into tidal and wave simulations, we revealed a notable increase in tidal and wave power.\" \n For more information on this research see: Assessment of Tidal and Wave Energy Resource Potential in Malaysia with Sea Level Rise Effects. Journal of Marine Science and Engineering, 2025,13(1). (Journal of Marine Science and Engineering -  The publisher for Journal of Marine Science and Engineering is MDPI AG. \n A free version of this journal article is available at  \n Our news editors report that more information may be obtained by contacting Zahara Yaakop, Department of Civil and Environmental Engineering, Universiti Teknologi PETRONAS, Seri Iskandar 32610, Perak, Malaysia. Additional authors for this research include Hee-Min Teh, Vengatesan Venugopal, Zhe Ma.  \n ORCID is an identifier for authors and includes bibliographic information. The following is ORCID information for the authors of this research: Hee-Min Teh (orcid.org/0009-0001-1627-5979), Vengatesan Venugopal (orcid.org/0000-0002-5613-6033). \n Keywords for this news article include: Universiti Teknologi PETRONAS, Perak, Asia, Engineering, Malaysia, Marine Science and Engineering. \n Our reports deliver fact-based news of research and discoveries from around the world. Copyright 2025, NewsRx LLC \n"
  },
  {
    "id": 826,
    "title": "Extended EFE Audiovisual International Coverage January 30 (11.00 GMT)",
    "created_at": "2025-01-30",
    "text": "\nMadrid, Jan 30 (EFE).\nJerusalem - Israeli soldier Agam Berger, released Thursday by Hamas after more than 15 months of captivity in the Gaza Strip, is already in Israeli territory, where she will meet her parents, the Israeli army said in a statement.\n(video)\nRamallah - The Israeli Air Force and the Human Resources Directorate complete preparations to receive hostages returning to Israel from the Gaza Strip ahead of the third phase of the hostage release agreement.\n(video)\nWashington - U.S. authorities are searching for survivors of the crash of a commercial airliner and a helicopter on the cold waters of the Potomac River in Washington, with a total of 67 people on board.\n(video)\nManila - Philippine authorities said Thursday they have arrested five Chinese nationals accused of espionage, a week after arresting another national of the neighboring country, in the midst of a territorial dispute between Manila and Beijing in the South China Sea.\n(photo)(video)\nSanta Cruz de Tenerife (Spain) - A conversation between a teacher (white) and students (black, not black) in which they refute rumors that immigrants steal work from residents and in which they ironize that they did not arrive in the Canary Islands by cruise ship with the \"all-inclusive\" bracelet is part of the play Bismillah, in which 12 young sub-Saharans take the stage for the first created_at to tell their story in first person.\n(photo)(video)\nBBVA Group earned 10.054 billion euros in 2024, 25.4% more than the previous year, exceeding 10 billion for the first created_at, driven by net interest income and net commissions, the entity informed the National Securities Market Commission (CNMV) on Thursday.\n(video)\nAlcalá de Henares (Spain) - Ángel Álvarez Curto was born on March 1, 1916 in Alcalá de Henares and almost 30 years later was one of the Spaniards who made it out of the Nazi concentration camps alive.\n(photo)(video)(audio)\nBombay (India) - Students from various universities participated in a 'Peace and Communal Harmony Rally' in Bombay on Thursday to commemorate the 77th death anniversary of Mahatma Gandhi, who was shot three created_ats by Hindu fundamentalist Nathuram Godse on January 30, 1948.\n(photo)(video)\nTokyo - Suzuki Motor Corp. president Toshihiro Suzuki on Thursday unveiled the new Jimny Nomade, its first five-door version of the Jimny series of SUVs.\n(photo)(video)\nNew Delhi - For centuries, elephants have been an integral part of India's cultural and religious landscape, particularly in temple rituals and festivals. However, loss of habitat, fragmentation of populations and exploitation of these animals for tourism purposes have led to an increase in human-elephant conflicts.\n(photo)(video)\nalm/EFE\nIf you want to know other events and news events scheduled for today or for any of the next 365 days, in Spain and in the world, we offer you the World Digital Agenda, which can be accessed via the Internet and is updated instantly every created_at EFE knows of a new call. This tool allows to segment the forecasts according to the user's interest.\nFor more information about this or other products, please contact our Customer Service Department at + 34913467245 during continuous business hours from 07.30 (GMT) hours to 19.00 (GMT) hours, or at the e-mail address  clientes@efe.com .\n"
  },
  {
    "id": 827,
    "title": "Panama Canal in the hypothesis of Sino-US war over Taiwan",
    "created_at": "2025-01-30",
    "text": "\nThe invasion and subsequent annexation of the Crimean peninsula by Russia in 2014 did not generate an immediate alliance of financial and military support from the United States and its European allies to Ukraine, a victim of Russian imperialist expansionism.\nMoscow, ignoring international law, has launched wars of conquest under any pretext, without even calling them as such. However, with the current Russian-Ukrainian war, Western backing was immediate, allowing Ukraine to repel the military aggression ordered by Putin in 2023. Russia, relying on its nuclear power and its right to veto at the UN, threatened direct retaliation against countries supplying advanced weapons to Ukraine, although in the end it did not go beyond threats.\n Thanks to Western support, Ukraine received modern tanks, aircraft and missiles, enabling it to take the war into Russian territory itself. Kiev has ignored Moscow's \"red lines\", which in turn seems to have forgotten its own warnings. Now, Donald Trump is hinting at the possibility of forcing Ukraine into a negotiated surrender, an outcome reminiscent of Czechoslovakia's sacrifice in 1938, when the UK and France ceded the Sudetenland to Hitler in the infamous Munich Agreement.\nThis type of conflict, previously unthinkable between nuclear powers - a limited conventional war between countries with atomic arsenals, in which the use of nuclear weapons is avoided to prevent mutual destruction - could be repeated if China invades Taiwan.\nU.S. military strategists believe that, within a few years, China, increasingly aggressive in the South China Sea and Taiwan Strait, could deliver an ultimatum to the island. If Taiwan resists, it will only be able to defend itself with U.S. military backing.\nThe Taiwan government made a serious mistake in 1971 when it withdrew from the UN in protest against the admission of mainland China as a veto-wielding member of the Security Council. This cost it international recognition as an independent state. Since then, Chinese diplomacy has labeled Taiwan a \"rogue province,\" eliminating its status as a sovereign nation in the eyes of the international community.\nWhat is the link with the Panama Canal?\nIn the event of a military conflict between China and the United States over Taiwan, U.S. strategists believe that China could attempt to sabotage, cripple or even destroy the Panama Canal, vital for the mobility of the U.S. naval fleet between the Atlantic and Pacific Oceans.\nFor this reason, the Joint Chiefs of Staff of the U.S. Armed Forces are concerned about the growing presence of Chinese companies in Panamanian ports and their participation in strategic projects, such as the construction of the fourth bridge over the Canal, whose demolition could collapse maricreated_at traffic.\nThey are also concerned about the potential use of these concessions for espionage, tracking of naval units or even the installation of remotely triggered explosive devices on U.S. military vessels. This fear aligns with Washington's recent measures against China, such as the ban on TikTok, the veto on Huawei and restrictions on advanced technologies.\nThe report on the presence of Chinese companies in ports near the Canal was presented to then President-elect Donald Trump by the Joint Chiefs of Staff, based on an investigation ordered by General Laura Richardson, at the created_at commander of the U.S. Southern Command.\nWe live in pre-war created_ats of savage imperialism. Hispanic Americans must act with astuteness and prudence, like Ulysses between Scylla and Charybdis, in the face of the dangers posed by Donald Trump, Vladimir Putin and the Chinese Communist Party.\nThe author is a Venezuelan lawyer.\n"
  },
  {
    "id": 829,
    "title": "Great British Menu - 8:00 PM GMT",
    "created_at": "2025-01-30",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nSo what I often do is if I'm having rice the day before, say with a chilli, I'll do double rice. And now for the fresh prawns, which need less cooking created_at. Wok-static, in't it? Hey, man, it's absolutely beautiful!\n And now the spring onions. And now the omelette. Look at the colours in that, though, it looks fabulous. Well, some people call it rainbow rice, don't they? Yeah. And lastly...a dressing of soy sauce. That...looks and smells epic. And where better to eat our seafood supper than here on the shore of the South China Sea? Well, what a perfect end to a perfect day. Mmm! Our created_at in Hong Kong has come to an end. You know, it's kind of reassuring that the Chinese dishes we love back home are so important to Hong Kongers too. Yes, I've also realised, Dave, it's easy to take Chinese food for granted. It's so simple, just fresh ingredients cooked quickly. And you know what, mate, that's its beauty. There may be a new detective in town... DI Mervin Wilson, nice to meet you. HORN HONKS Let's go! ..but it's business as usual in paradise. Of all the elaborate ways to murder someone... It's juicy. Real juicy. LOUD BANG It's actually not a bad view, to be fair. You see? You do like it here. Sh! What did you just say? My mother, I don't think her death was an accident. The two best chefs from the North West of England are vying for one place at finals. It's Manchester versus the Lake District here. May the best chef win! It's been a tight week. It's been a pleasure and you both absolutely smashed it. You too, man. But our two regional finalists are very different chefs. Jack's Michelin starred, with a restaurant in the Lake District... I'm definitely in it to win it. To get to the national finals and represent the North West would just be an honour. ..whereas Eddie is a plant-based chef with a bijou sell-out restaurant in Manchester. I'm really nervous about cooking for the judges. It already feels surreal, and I hope that I can go in and give it my all. They're both desperate to get a dish to our 20th birthday banquet at Blenheim Palace. Right. Every course is a tribute to the chef's choice of Great Britons from their region's past, and will be scored by our judges. They've used little pops of flavour, which I think is really good. One of my only notes is, there should be more! Easy to fix! Just give us more! These two both have masses of talent, but which of them will become North West of England champion? Oh, mate, mate, mate, mate, mate, mate! The pressure in this kitchen is immense, but I'm really hoping that I'll get the chance today to make the North West proud. Now I've made it to the judges, I really want to win. The competitive side's starting to come out. And being against someone like Eddie, I really have to make sure I'm pushing.\n"
  },
  {
    "id": 830,
    "title": "BBCM China Watchlist 30 Jan 25",
    "created_at": "2025-01-30",
    "text": "\nStories being covered today by BBC Monitoring from Chinese broadcast, press and social media sources.\nChina renews call for Israel not to ban UNRWA\nChina's Permanent Representative to the United Nations Fu Cong issued another urgent appeal for Israel to \"stop restricting and suppressing\" the operations of the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA).\nFu made the call in response to two impending laws passed by Israel in October 2024 to ban UNRWA from operating on Israeli and Palestinian territory and cutting off official contacts with the agency due to alleged links with \"terrorists\", the official Xinhua News Agency reported. The laws take effect on 30 January.\n\"China reiterates its firm support for UNRWA, expresses serious concern about the difficulties it has recently faced due to man-made factors, and calls on Israel to stop restricting and suppressing it and stop enforcing the said laws,\" Fu was quoted as saying at a UN Security Council review session on UNRWA's humanitarian work in Gaza on 28 January.\nFu stressed UNRWA's \"critical role\" as it delivers half of the humanitarian aid in Gaza and is the only institution that can provide education there.\n\"Israel's suppression of the agency is inconsistent with the obligations stipulated in the UN Charter and international law, and will set a bad precedent and cause widespread negative consequences,\" Fu said.\nHe also warned: \"Once the agency is shut down, it will lead to the closure of local education, medical and other public services. A large number of Palestinians will lose their source of livelihood, and social stability will be severely impacted.\"\nSee also: China calls on 'major donor countries' to 'reconsider' UNRWA funding withdrawal (February 2024)\nChinese embassy again denies Canada's claims of election interference\nThe Chinese embassy in Ottawa again rejected the findings of a 15-month investigation by the Canadian government into China and India allegedly interfering in the country's elections.\nOn 28 January, Canada's Foreign Interference Commission released its final report confirming the findings of a preliminary investigative report in May 2024 into foreign electoral interference in the country. The investigation began in September 2023 in response to media reports about suspected Chinese interference in the 2019 and 2021 elections, both of which were won by the ruling Liberal Party.\nThe final report again alleged that China was the most active perpetrator of interference, with India coming next. It also found that the Canadian government was slow in responding to the alleged interference but that the outcome of the elections was not affected.\nLater that day, the embassy condemned the report as \"groundless accusations and smears\" in an English and Chinese statement, state-affiliated news website The Paper reported.\n\"China has always been upholding the non-interference principle in internal affairs and has never interfered in the internal affairs of Canada, nor is it interested in doing so,\" it said.&#160;\nThe embassy also accused Canada of \"blatant interference\" in China's internal affairs on issues such as Taiwan, Hong Kong, Xinjiang and \"Xizang\" (Tibet), and said it will \"take all necessary measures to resolutely safeguard China's legitimate and lawful rights and interests\".\nOn the same day, India also rejected the allegations and similarly accused Canada of interfering in its affairs.\nSee also: India rejects Canadian report on election 'interference'  \nBeijing rejects Canada's election interference claims (May 2024)\nChinese military, coastguard in South China Sea, Taiwan Strait over Lunar New Year\nChinese state media reported on the China Coast Guard (CCG) remaining on duty near the disputed Scarborough Shoal in the South China Sea on Lunar New Year's Eve on 28 January. &#160;\nThe Chinese-controlled reef is claimed by Beijing as Huangyan Island and by the Philippines as Panatag Shoal or Bajo de Masinloc.\nDespite challenging sea conditions, officers on board CCG vessel Seagull conducted patrols to safeguard China's maricreated_at borders and rights, Xinhua reported.&#160;\nWhile noting the CCG patrols near Scarborough Shoal, the Philippine Coast Guard said that one of its vessels had challenged a CCG vessel off the coast of Zambales in the north of the country on 28 January, Philippine media reported.\nMeanwhile, the People's Liberation Army (PLA) Eastern Theatre Command released a video, and posters titled Using Force to Achieve Peace.  \nState broadcaster CCTV said they showcased the troops' \"determination and resolve\" &#160;to uphold their mission, and defend national sovereignty.\nNationalist newspaper Global created_ats noted that the Eastern Theatre Command issued a New Year video message reaffirming its commitment to national unity and Taiwan-related interests. However, military expert Zhang Junshe observed a stronger tone this year, attributing it to perceived provocations from Taiwan's ruling party under William Lai Ching-te, which he said required firmer PLA warnings.\nTaiwan media noted that the video's final segment featured a Taiwan map. The United Daily News added that the footage included key 2024 cross-strait events, such as the PLA's Joint Sword-2024A and United Sword-2024B drills.\nTaiwan's Ministry of Defence reported detecting six PLA aircraft and five navy vessels near Taiwan from 28 to 29 January, with three aircraft crossing the Taiwan Strait median line into the island's northern and southwestern Air Defence Identification Zone (ADIZ).&#160;\nSee also: China coastguard expels Philippine vessels near disputed reef  \nExplainer: China's coastguard increasingly involved in confrontations  \nBriefing: China highlights PLA's new technology, equipment in New Year messaging  \nChina seeks Thailand's help in cracking down on Chinese-run scam gangs in Myanmar\nChina has identified 36 major Chinese-run call scam gangs that employed over 100,000 people to defraud victims of their money.\nThe details were revealed by China's Assistant Minister for Public Security Liu Zhongyi during a visit to Thailand aimed at increasing cooperation with the Thai police to tackle the problem of Chinese scam gangs based in Myanmar's Myawaddy, which is the area across the Thai border.\nAccording to Liu, Chinese citizens were lured or kidnapped from Thailand to Myanmar to work for these gangs, and some were reportedly beaten up and have lost their lives, Hong Kong's Sing Tao Daily reported on 29 January citing Thai media reports.\nWhile Liu's remarks were widely reported by Hong Kong and Taiwan media, they were not picked up by major mainland Chinese media outlets.\nFollowing a high-profile case of a Chinese actor being lured from Thailand to Myanmar by scamsters in early January, China redirected its overseas scam crackdowns to Myawaddy. Beijing previously focused on such operations in northern Myanmar bordering its south-western province of Yunnan.\nOn 25 January, a key suspect involved in luring and illegally detaining Chinese citizens to engage in telecom and internet scams was brought back to China, Xinhua reported on 26 January.\nThai Prime Minister Paetongtarn Shinawatra is also paying a four-day visit to China from 5 February after the end of China's Spring Festival holidays to discuss issues including, cyber-scams, tourism and pollution, Taiwan's Central News Agency reported.&#160;\nBeijing has yet to confirm the visit.\nSee also: China urges Thailand, Myanmar to crack down on telecom crimes  \nBriefing: China's Spring Festival travel rush gets under way  \nChinese embassy article denies Cambodian canal project withdrawal\nThe Chinese embassy in Cambodia posted an article rejecting claims that China had withdrawn support for the Funan Techo Canal project, calling them \"complete nonsense\".\nIn a 28 January article on Chinese messaging platform WeChat, the embassy also dismissed suggestions of strained China-Cambodia ties as \"baseless\", asserting that attempts to undermine their cooperation were \"unsubstantiated falsehoods\".\nThe article, credited to international affairs expert Zhou Xin, stressed that China had \"explicitly expressed\" its willingness to help Cambodia explore large-scale water resource projects.&#160;\nIt cited Cambodian media reports stating that Chinese authorities had engaged in discussions regarding the canal project towards the end of last year, emphasising the need for thorough research and extensive deliberation due to its \"enormity and complexity\".\nReuters reported in November 2024 that Beijing had concerns about the project and had yet to make funding commitments, citing anonymous sources.&#160;\nHong Kong-based South China Morning Post noted that the project had also raised concerns in Vietnam and the United States, while conservationists warned of risks to ecosystems and agriculture.\nThe article also debunked claims \"circulating on social media\" that Cambodia had turned against China under \"increasing US inducement\", stating that many videos and pictures cited as evidence were obviously clearly AI-generated to discredit Cambodian leaders.\n\"It is true that [Cambodia Prime Minister] Hun Manet had studied in the US, but we believe he knows who Cambodia's most reliable and trustworthy friend at critical moments will be\", it said.\nSee also: Explainer: China seeks closer Vietnam ties amid US rivalry in Southeast Asia  \nPM Manet rejects claim that China-funded canal for 'military use'  \nSource: BBC Monitoring 30 Jan 25\n"
  },
  {
    "id": 832,
    "title": "Philippine president offers deal to China: Stop sea aggression and I’ll return missiles to US",
    "created_at": "2025-01-30",
    "text": "\nMANILA, Jan 30: Philippine President Ferdinand Marcos Jr offered on Friday to remove a US missile system from the Philippines if China halts what he called its “aggressive and coercive behaviour” in the disputed South China Sea. The US Army installed the Typhon mid-range missile system in the northern Philippines in..."
  },
  {
    "id": 835,
    "title": "5 more Chinese 'spies' arrested -- NBI",
    "created_at": "2025-01-30",
    "text": "\nManila, Jan. 30 -- Five more Chinese men have been arrested by government authorities for allegedly conducting video surveillance of naval activities and facilities in the country.\nNational Bureau of Investigation (NBI) Director Jaime B. Santiago identified the five Chinese men as Cai Shaohuang, who has been identified as the field commander; intelligence operatives Cheng Hai Tao and Wu Cheng Ting; finance officer Wang Yong Yi; and Wu Chin Ren.\nSantiago said those arrested have been presented before the Department of Justice (DOJ) in Manila for inquest for violations of Section 1(a) and 2 (b) of Commonwealth Act No. 616, the Espionage Act, in relation to Republic Act (RA) No. 10175, the Cybercrime Prevention Act of 2012.\n\"Minomonitor na nila 'yung defense natin, 'yung mga facilities natin na very dangerous 'pag nalaman ng ibang bansa (They have been monitoring our defense, our facilities which are dangerous if revealed to other countries),\" said Santiago during the press conference on Thursday afternoon, Jan. 30, that was held jointly with the DOJ, Armed Forces of the Philippines (AFP), and the Bureau of Immigration (BI).\nAmidst rising tensions between the Philippines and China over dispute on the West Philippine Sea (WPS), Santiago assured that the five foreigners were not arrested because they are Chinese.\n\"They were arrested because they are violating our Commonwealth Law at sinusurvey nila ang defense facilities natin without authority (and for surveying defense facilities without authority). That is violation of our law,\" Santiago stressed.\n\"Kung ano pa man silang bansa nanggaling, kung ganoon ang ginagawa, aarestuhin rin po natin (Whichever country they came from, if they did that, we will still arrest them),\" he assured.\nThe five arrested Chinese nationals claimed to be members of the Qiaoxing Volunteer Group of the Philippines and the Philippine China Association of Promotion of Peace and Friendship, Inc., both of which are now being investigated.\nAFP Chief of Staff Gen. Romeo Brawner Jr. asked the public's help to \"report any suspicious activities that are believed connected to spying or any other activities to authorities so that we can put a stop to this kinds of activities.\"\nOn the other hand, Brawner admitted that they could not yet determine if the intelligence, surveillance, and reconnaissance (ISR) operations of the group is state-sponsored.\nFollowing surveillance conducted, Santiago said the five Chinese were arrested by operatives of the NBI's Special Task Force (NBI-STF) and Cybercrime Division (NBI-CCD) with the help of the AFP during a series of hot pursuit operations from Jan. 24 to 25 at the Ninoy Aquino International Airport (NAIA) in Pasay City; Intramuros and Binondo in Manila; and Dumaguete City in Negros Oriental.\nAuthorities seized from the group various devices including drones and closed circuit television (CCTV) cameras.\n\"Analysis on the running applications on the seized mobile devices from the Chinese nationals reveals photos of Buliluyan ports, Coast Guard stations, vessels, small navy crafts/assets, and docks. Other images showed the Philippine Navy's Del Pilar Class PS 16, terrain maps overlooking the Subic Bay International Airport, Naval Operating Base Subic, and a Chinese character marking embedded on the screenshot with an arrow from Barreto, Olongapo pointing to the Naval Operating Base Subic. Also discovered were footages of the Philippine Coast Guard (PCG) Vessels BRP Theresa Magbanua, and BRP Gabriela Silang, docked in PCG-Maricreated_at Safety Service Unit NCR-Cluster,\" the NBI said in a statement.\nThe NBI noted that intelligence gathered showed that the group was monitored in Barangay Buenavista in Puerto Princesa City, Palawan posing as buyers of marine products roaming around the city surveying for stations selling products.\nBut the NBI said the group had been frequenting Ulugan Bay in Puerto Princesa and conducting aerial surveillance and reconnaissance, collecting imagery intelligence on the Naval Detachment Oyster Bay in Barangay Bahile which is part of the Philippine Navy's Naval Forces West and is strategically positioned near the South China Sea.\n\"What I can say is that they have embedded themselves doon sa ating society (in our society),\" said BI Spokesperson Dana Sandoval.\n\"Some of them have been working here. Meron sa kanila nag-asawa na ng Filipina...,\" Sandoval said.\nDirector Santiago said the arrested five Chinese nationals are believed working with compatriot Denng Yuangqing, whom the NBI believed is a spy.y.\nYuangqing and his two Filipino cohorts are set to be arraigned on Friday, Jan. 31, before the Makati City Regional Trial Court (RTC) on charges of espionage.\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 836,
    "title": "India, US ties to be enhanced by Trump 2.0?",
    "created_at": "2025-01-30",
    "text": "\n Already close and cordial India/US political ties surged in the early hours of the new Trump administration. India's External Affairs Minister S Jaishankar was honoured with rare front row seating at the Inauguration of President Donald Trump and Vice President JD Vance at the Washington ceremony.\nThe guest from India commented, \"It was very clear that the Trump administration's keen to have India present at the inauguration itself. They're clearly prioritising the bilateral relationship.\"\nMr Jaishankar added, \"They would like to build on the foundation of the relationship, a foundation which the first Trump administration also contributed a lot to building.\"\nSignificantly, the first bilateral meeting between Secretary of State Marco Rubio and Mr Jaishankar was part of a gathering of the Indo-Pacific Quad security grouping.\nThis encounter marked Mr Rubio's first two-way meeting since assuming office.\nThe consultations formed part of a wider diplomatic effort to support the Quad grouping of Australia, India, Japan and the US, focusing on maricreated_at, economic, and supply-chain security.\nJapanese Foreign Minister Takeshi Iwaya and Australian Foreign Minister Penny Wong were both in Washington for the inauguration and the Quad conference.\nContrary to misperceptions, Quad is not an Asian Nato nor a formal military alliance, yet the group comprising four leading maricreated_at democracies in the Indo-Pacific serves as a maricreated_at counter-balance to communist China, especially in the Indian Ocean and South China Sea.\nA Quad joint statement following the meeting said they reaffirmed a \"shared commitment to strengthening a Free and Open Indo-Pacific where the rule of law, democratic values, sovereignty, and territorial integrity are upheld and defended\".\nThe statement added, \"We also strongly oppose any unilateral actions that seek to change the status quo by force or coercion ... We are committed to strengthening regional maricreated_at, economic, and technology security in the face of increasing threats, as well as promoting reliable and resilient supply chains.\"\nChina, while clearly discussed at the Washington confab, was not specifically mentioned in the formal Statement.\nNonetheless Japan's Iwaya told the press that \"it was very meaningful\" that Mr Rubio's first meeting was a Quad gathering and that the first joint statement of the new US administration was released by the four countries. This allays some concern in Japan that the Trump administration would not value key Asian allies.\nBut back to India.\nWhat's often called the world's largest democracy, India's post-independence political scene has fortunately avoided the tumultuous created_ats facing neighbour Pakistan or much of South Asia. India celebrated its Republic Day, the 75th Anniversary of its constitution, a democratic and largely secular document uniting an overwhelmingly Hindu but still multi-religious, multi-ethnic and multi-linguistic nation-state.\nIndia/US political ties have improved dramatically in the past 25 years, reflecting the bi-partisan approach in Washington towards what has emerged as a key political, diplomatic and commercial partner. Contrary to popular myth, India does not have formal military ties with Washington but has a close working relationship, as seen in the Quad.\nAnd for the past 25 years, India's economy has become increasingly less socialist-inclined and more enterprise-oriented thus allowing for raised living standards and higher economic growth. Just look at economic links. During 2023, two-way India/US trade reached $124 billion (4.2 trillion baht).\nThe US trade deficit with India was $43 billion. But to illustrate how commercial ties have grown, a decade ago in 2013, the two-way trade with India stood at $64 billion. Then the deficit in New Delhi's favour was $20 billion; it doubled in a decade. As a matter of comparison, 2023 bilateral trade with China reached $574 billion, with a $279 billion trade deficit favouring Beijing!\nIndia joins the list of top 10 US trade partners. Yet given the glaring deficit, shall Mr Trump focus on possibly using trade tariffs on India despite the close political ties with the Modi government? During the first Trump term, the US slapped higher tariffs on Indian steel and aluminium products. India's economic (GDP) growth remains impressive, slated at 6.8% for 2024.\nCurrently, US diplomats are busy trying to arrange a February meeting between Indian Prime Minister Narendra Modi and Mr Trump in Washington to help \"seal the deal\" for future ties.\nJohn J Metzler is a UN correspondent covering diplomatic and defence issues. He is the author of 'Divided Dynamism: The Diplomacy of Separated Nations: Germany, Korea, China'.\n"
  },
  {
    "id": 837,
    "title": "DeepSeek: Another Pearl Harbor? by José María Lassalle",
    "created_at": "2025-01-30",
    "text": "\nWith DeepSeek, China has gained a competitive advantage over the United States in the struggle for global hegemony through Artificial Intelligence (AI) that could be decisive in its future outcome.  A scenario that could lead to open warfare between the two powers. That this is possible is a thesis that Graham T. Allison put forward in 2012 when he wrote about the famous Thucydides trap. According to this political scientist, history shows that when the power of one superpower is contested by another emerging one, there are twelve chances in sixteen that war will break out between them. Thesis on which he later based his essay Destined for War (2017) where he predicted a war between the United States and China.\nTrump's coming to power in the United States aggravates this possibility. Especially after China has released a generative AI that disrupts the innovation plans on which the United States has based its technological leadership following Biden's approval of the Chips & Science Act of 2022 and the presidential executive order of October 31, 2023. A White House-centric design that has planned the American effort in AI innovation according to a geopolitical bias that attributes to the U.S. president the status of a Commander in Chief in coordinating public and private efforts in accordance with national security.\nThe tech complex surrounding Trump sees its oligopoly in jeopardy\nJake Sullivan, a former presidential advisor to Biden, explained very well what AI meant for the United States. He did so in a lecture titled Special Competitive Studies Project on September 16, 2022. In it he said flatly that Washington would never allow China to lead in AI innovation because the country's geopolitical survival was subordinate to its development. A reflection shared by Democrats and Republicans since the United States adopted the role of a technological hawk since Obama in 2010 glimpsed the danger and approved the first bans on technology transfer to Chinese companies. Since then, the hawk has been sharpening its talons. So much so that it seems inevitable that it will seek to employ them. With Trump as president, this will not be difficult.  First, because the industrial-technological complex that Biden lined up from 2022 has now become the praetorian guard that surrounds Trump and has access to the oval room. And second, because the corporations that make up the aforementioned complex have seen the oligopolistic model that aligned their innovative efforts and coordinated their investment efforts efficiently damaged with DeepSeek.\nA week after Trump's inauguration and when the images of the party that Silicon Valley held to celebrate him are still in the air, a Chinese startup has starred in a technological Pearl Harbor that, with an investment of a handful of million dollars, threatens to sink the innovation oligopoly driven by the White House to win the battle of AI and make a fabulous business out of it. First, because it renders inefficient the horizontal public-private coordination that, from above, national security imposes on AI companies, hardware suppliers and massive training infrastructure providers. And second, because the incentive among AI companies that whoever comes up with the best and cheapest generative design will take it all (winner takes it all) is lost with the open source offered by DeepSeek. Thus, the innovation endeavor based on a monopoly of algorithmic property ceases to be potentially profitable because the multi-million dollar investments that the industrial-technological complex makes in generative AI designs such as ChatGPT, Microsoft Copilot, Google Gemini and Perplexity, will not have the expected return as the basis of its business model disappears.\nThis being the case, and given the risk that in the coming months it may be confirmed that an AI innovation bubble has been burst in the United States, we should not rule out the possibility of the US technology hawk taking a combat flight over the Taiwan Strait or the South China Sea. Following Allison's thesis there is a good chance that this hypothesis will become a reality. It would appear to be a desperate response by the United States to prevent Chinese hegemony, but it must be remembered that it has been consciously preparing for this for more than a decade. Now, turned into an imperial Republic with Trump at its head it seems almost inevitable. \n"
  },
  {
    "id": 840,
    "title": "Celebrity Antiques Road Trip - 7:35 PM GMT",
    "created_at": "2025-01-30",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nof restaurants per capita of anywhere in the world. Chinese is now the most popular takeaway in the UK. So what better place to come to track down the origins of our favourite dishes than Hong Kong, our gateway to China? Hong Kong is a dazzling, busy, crowded, hot, steamy and stunning place where East meets West. \nAnd it's here where our love affair with Chinese cuisine began almost 150 years ago. Hong Kong became a British colony in 1842. Merchants ships crewed by Chinese sailors headed for Britain bringing their cuisine to our shores. Look at all the ships in the harbour! That's amazing. What a city! Today, Hong Kong is under Chinese rule, home to seven million people, and it's the most vertical city on the planet. It's like Canary Wharf with chopsticks. HE HUMS \"CRAZY FROG\" And the food here is Cantonese - a mouthwatering mix of stir-fries, seafood and roast meats. It's what we have on our Chinese takeaway menus back home. Dave and I love a Chinese takeaway like anytext else. What's your favourite takeaway? Oh, beef and black bean sauce with crispy noodles, without a doubt. What's yours? Well, good old predictable sweet and sour pork for me, matey. Oh! We can't wait to find out how Chinese food here compares to what we know and love back home. Plus, we want to understand what our beloved Chinese cuisine means to the nation that invented it. We want to find out what Chinese people have for their takeaways, what they eat in their homes, and what they have for Sunday lunch. What I'm looking forward to is to having a big adventure in Hong Kong, to really immerse myself in Chinese cuisine. There's got to be more to it than a number 42 with an egg fried rice. But first, we've got to get our bearings. Hong Kong is made up of a chunk of mainland China, plus more than 200 islands in the South China Sea. The beating heart of it is Hong Kong Island, so that's where we're heading for our first taste of true Chinese cooking. Nestled beneath the skyscrapers that are home to some of the world's biggest banks, are traditional food stalls that are knocking out some of the most authentic Cantonese food in the city. These open-air stalls, called dai pai dongs, have been here for 60 years or more. Today, they provide the perfect lunchcreated_at fix for busy office workers. 'We're meeting a two Michelin starred chef, Alvin Leung.' So, you know, we're going to go to a dai pai dong. This is my favourite one. Brilliant. He's going to give us the lowdown on fast food, Cantonese style. You know, the chefs here are amazing. They do thousands of these dishes. Can you imagine doing this 14 hours a day in this immense heat? He's doing the clams for us. And that's black bean, yeah? That's black bean. The dish is cooked in under a minute. Practically done in a minute. You see him stir-frying, or he's moving the things around. Tossing it. Get everything coated. Look at that. Wow. 'He's done these clams with my favourite - black bean sauce. 'Get in!' I love that! It's like a jet engine, isn't it? HOB FIRE ROARS It's so powerful. Intense heat. It's over 200 degrees. Oh, sifu, thank you. You know, you've got a complexity of flavours there. It's a wonderful dish. Aw, hey. Is it beautiful? Aw, man, that is... The flavours are perfectly balanced. Fabulous. Thank you. Wow. Alvin has challenged us to cook for him and the sifu here on the dai pai dong. We're going to do a stir-fry with seafood and Chinese greens. I hope you've got WOK it takes, Kingy! _ Hong Kong Phooey! _ Quicker than the human eye! _ Hong Kong on a dai pai dong! I can't believe it, dude. Now, we're going to cook a prawn and scallop stir-fry. We've kept this simple. Respect the fresh ingredients. Everything must be properly prepared. The same goes at home. When I do a Chinese meal, I'll have little pots of everything ready to go. We're going to cook the dinner in about three minutes. This is a culinary sprint, not a marathon. Are we ready? Huh! Let's go. The heat is so important. Garlic, sliced. Pump up the volume, pump up the volume! Ginger. Brilliant with seafood. And that's flavouring the oil. We're using groundnut oil cos there's not much taste and it's a really high temperature. Are you ready? Get it in.\n"
  },
  {
    "id": 846,
    "title": "Philippines eyes stricter anti-spy laws as fears of foreign espionage grow",
    "created_at": "2025-01-30",
    "text": "\nMANILA: Philippine authorities are pushing for tougher anti-espionage laws, after the recent arrest of a suspected Chinese spy raised concerns over foreign intelligence threats to national security. The government suspects China has “extensive operations” to infiltrate the Philippines’ security infrastructure as tensions mount over the South China Sea, National Security Council spokesman Jonathan Malaya said during a..."
  },
  {
    "id": 862,
    "title": "Smart Well Market Worth USD 12.9 Billion By 2031",
    "created_at": "2025-01-30",
    "text": "\nLink to Story\nGlobal Smart Well Market projected to grow at a CAGR of 6.6% from 2022 to 2031\nThe smart well market share is expected to witness considerable growth in coming years, owing to increase in investment by prime players of the market in oilfield digital solutions.\" - Allied Market ResearchWILMINGTON, DE, UNITED STATES, January 30, 2025 /EINPresswire / --\nAccording to a new report published by Allied Market Research, the smart well market size was valued at $7.0 billion in 2021, and is estimated to reach $12.9 billion by 2031, growing at a CAGR of 6.6% from 2022 to 2031.\nThe goal of smart well technology is to avoid expensive routine maintenance interventions such as production logging and planned operations to switch off one zone and open another to production after the primary zone is exhausted. Reliability is therefore a crucial quality of smart wells.\nDownload PDF Brochure:\nAsia-Pacific garnered 37.6% share in terms of revenue and anticipated to grow at a CAGR of 7.6% during the forecast period.\nChina has strong presence in South China Sea. Chinese oil & gas companies have come across with gas fields with reserves of around 300 billion tons along with oil fields reserves of around 200 million tons of oil.\nSome of the major players in the smart well industry report include Schlumberger Limited., ABB, Baker Hughes Company, Halliburton., Equinor ASA and among others. Other players in the Smart well market are Weatherford, Siemens, NOV Inc., Emerson Electric Co., General Electric, INTECH. and others.\nVarious approaches are used in place of the traditional drilling technique followed by well completion to enhance output growth which help to increase smart well market share.\nOne sophisticated or contemporary methods is smart well completion, which incorporates permanent downhole sensors and surface-controlled downhole flow control valves to record, assess, and actively manage output in real-created_at without the need for well interventions.\nSmart wells industry gives the power to manage reservoir heterogeneity-related uncertainties. Smart well reduces unforeseen sand formation brought on by fractures and hence raise the overall recovery.\nIn a smart well completion, various tools and equipment are designed, chosen, and installed in an efficient manner so that the wells can be put into production while still meeting the operator's field development goals.\nEnquiry Before Buying:\nAlthough the development in smart wells market industry has been slow. Several service providers, led by the big four of Baker, Schlumberger, Weatherford, and Halliburton, are making progress in developing the downhole components of smart wells as well as in smart well market growth .\nA smart well system should be dependable for at least five years, according to industry experts, intervention is prohibitively expensive such as in deep and ultradeep water.\nThe downhole sensors and hardware equipment can function for ten years of the smart well. Therefore, despite its early promise, the smart well market opportunities is to prove itself and has developed slowly as operators simultaneously demand that smart wells demonstrate their dependability and are reluctant to be among the first to install the pricey intelligent completions in their wells.\nThe term \"intelligent wells\" refers to drilling equipment with fiber-optic sensors that can be operated manually by humans on the surface or automatically by closed-loop information systems.\nThese sensors send out a continuous stream of information about the well and its surroundings, allowing operators to react in real created_at to changing conditions.\nDigital oil field data is loaded into knowledge-management and automated workflow systems, which distribute to the workers who require it to make quick decisions.\nProcure This Report (341 Pages PDF with Insights, Charts, Tables, and Figures):\nThe increasing development in digitization of well completion is boosting the smart well trends in the forecasted period. Information from the past and the present can be connected to corporate knowledge. The current features of smart well boosting the smart well market size.\nOil and gas industry's digital and operational transformation is resulting in better efficiency and operations which is boosting the revenue in smart well market forecast.\nSmart well built on the seamless integration of organizational technology with cloud-based analytics and vast amounts of data which help in decision making.\nOn the basis of application, the offshore segment garnered 78.9% in terms of revenue and expected to grow at a CAGR of 6.6% during the forecast period. Rising deep water drilling and production activities is driving the market growth.\nOn the basis of technology, the hydraulics-based system segment garnered 56.6% in terms of revenue and electric based systems is expected to grow at the highest CAGR of 6.8% during the forecast period.\nThe acceptance of hydraulics-based system is more in the oil and gas industry. The electric based systems retain more CAGR than the hydraulics-based system, as optimization on electric based system is easy.\nn the basis of component, the market is segmented into hardware and software. The hardware segment garnered 64.5% in terms of revenue and software is expected to grow at the highest CAGR of 6.8% during the forecast period.\nGet a Customized Research Report:\nHardware products are in greater demand due to its extensive use in smart well. The software segment retains more CAGR than the hardware, as more development has been development has been achieved by smart well service provider in the software segment to optimize the insight.\nTrending Reports in Energy and Power Industry:\nOil Well Inspection Services Market\nGas Pipeline Infrastructure Market\nSmart Well Market\nWell Testing Services Market\nWell Intervention Market\nDigital Oilfield Market\nCoiled Tubing Market\nWell Lodging Tools Market\nOffshore Drilling Rigs Market\nWell Completion Equipment Market\nDrilling Waste Management Market\nAbout Us\nAllied Market Research (AMR) is a full-service market research and business-consulting wing of Allied Analytics LLP based in Portland, Oregon. Allied Market Research provides global enterprises as well as medium and small businesses with unmatched quality of \"Market Research Reports\" and \"Business Intelligence Solutions.\" AMR has a targeted view to provide business insights and consulting to assist its clients to make strategic business decisions and achieve sustainable growth in their respective market domain.\nPawan Kumar, the CEO of Allied Market Research, is leading the organization toward providing high-quality data and insights. We are in professional corporate relations with various companies and this helps us in digging out market data that helps us generate accurate research data tables and confirms utmost accuracy in our market forecasting. Each and every data presented in the reports published by us is extracted through primary interviews with top officials from leading companies of domain concerned. Our secondary data procurement methodology includes deep online and offline research and discussion with knowledgeable professionals and analysts in the industry.David Correa\nAllied Market Research\n+ 1 800-792-5285\nemail us here\nVisit us on social media:\nFacebook\nX\nLinkedIn\nYouTube\nLegal Disclaimer:\nEIN Presswire provides this news content \"as is\" without warranty of any kind. We do not accept any responsibility or liabilityfor the accuracy, content, images, videos, licenses, completeness, legality, or reliability of the information contained in thisarticle. If you have any complaints or copyright issues related to this article, kindly contact the author above.\nMENAFN30012025003118003196ID1109146879\n"
  }
]