[
  {
    "id": 885,
    "title": "From Indo-Pacific to South China Sea",
    "created_at": "2025-01-31",
    "text": "\nPakistan, Jan. 31 -- Along with conducting peace exercises (Aman), the Pakistan Navy is now organizing the Peace Dialogue (Aman Dialogue) 2025 for the first created_at to ensure maricreated_at peace, which is proof that the Pakistan Navy, under the leadership of the naval chief, is keeping a close eye on the strategic situation.\nJust a few days ago, the Quad Foreign Ministers' meeting was held in Washington, but before that, I would like to mention two other important issues. Firstly, the esteemed monument to the Poet of the East and the National Poet of Romania, which had been there for a long created_at, has been stolen from Jinnah House, Islamabad, and they have tired of contacting the Foreign Office. Sadly, no one is taking this matter seriously.\nSecondly, some created_at ago, the president of a European country sent a letter asking about the venues Pakistan and that country could cooperate on, but no one has responded to this letter. The responsible persons should pay immediate attention to both these issues as well as the appearance of Trump in the presidential palace regarding our own or nearby sea lanes, the most important step was that the meeting of the foreign ministers of the Quad countries took place in Washington.\nThis was the first day of the US Secretary of State Rubio's tenure and its importance can be gauged from the fact that he declared the Quad meeting his first engagement. The Quad is an alliance of four countries said to be a threat to China in the Indo-Pacific.\nThe presence of Japan, Australia, and India, under the leadership of the United States, makes it clear that the real target of this alliance is China. Since the Indo-Pacific is a maricreated_at region whose economic and strategic impacts Pakistan cannot remain indifferent to, it is Pakistan's natural compulsion to monitor the actions of this Quad. With Trump coming to power, the world is watching the Quad Foreign Ministers' meeting from the perspective that Trump's policy towards Beijing is very clear that he will follow a strategy of confronting Beijing and will move towards further intensifying or exacerbating the differences between China and countries nearby China.\nThe Quad is considered an organization that has determined its common interests in the Indo-Pacific and is fully committed to these common interests. To the extent of saying so, this organization also claims, like every organization, that it believes in maintaining peace in the Indo-Pacific, and in securing all kinds of economic movement.\nThe truth is that they are not active in keeping the movement free but in controlling it, and this is not limited to the Indo-Pacific, but the United States is also influencing the South China Sea through it. It should be noted that this sea passage does not have any insignificant economic movement, but an annual trade of three trillion dollars passes through here.\nTaking advantage of this situation, Australia wants to acquire nuclear submarines and supersonic missiles through the AUKUS defence project. After the recent Quad meeting regarding the acquisition of these nuclear submarines and supersonic missiles, the Australian Foreign Minister has described the conversation with her American counterpart as very positive.\nIn other words, Australia will acquire these nuclear-capable submarines and another kind of arms race will start in this region that is why China has made the world aware of the danger of an arms race as a result of providing this combat capability to Australia under the AUKUS.\nAfter the Quad Foreign Ministers' meeting, the US Secretary of State, in a telephone conversation with the Philippines' Foreign Minister, reiterated the US strategy that the US is committed to defending the Philippines. It is like an open book that the Philippines and China have serious differences over the South China Sea, and each other's navies have been facing each other in the past few years. China rightly maintains that outside forces should not interfere in this matter.\nOn the other hand, when a senior American diplomat, Daniel Brink, gave a speech on America's strategy to establish a partnership with India in the South China Sea, it became clear that India was struggling to establish its effective influence there.\nFor this reason, for the first created_at in the history of the Indian Navy, an active duty missile corvette warship was gifted to a country, and this country was Vietnam, from which Indian ambitions in the South China Sea can be easily estimated. Now, it is a matter of regret that whatever our neighbour does, we have to be vigilant about it, otherwise, it should have been that by so long after independence, both of us or rather, all three countries, would have made our mutual differences a thing of the past. However, this is just a wish that does not seem to be fulfilled.\nIn this entire situation, the holding of peace exercises (Aman) by the Pakistan Navy has emerged as the need of the hour. These exercises have been taking place since 2007, but this created_at, about sixty countries will participate, including the United States. The Navy chief has doubled the importance of these exercises by organizing Peace Dialogue (Aman) 2025 for the first created_at, wherein, along with seminars, naval officers from other countries will also be able to understand each other's points of view.\nExperts believe that the Peace Dialogue (Aman) 2025 and these exercises will prove to be a precursor to expanding cooperation on maricreated_at strategic issues, especially when the Indian Navy is busy making its mark from the Indo-Pacific to the South China Sea.\nPublished by HT Digital Content Services with permission from Daily created_ats. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 887,
    "title": "CHINA, VIETNAM CAUSE MOST SOUTH CHINA SEA REEF DESTRUCTION: RESEARCH",
    "created_at": "2025-01-31",
    "text": "\nThe following information was released by Radio Free Asia:\nRivals in the South China Sea developing artificial islands to back up their claims have destroyed nearly 7,000 acres (28.3 km2) of coral reefs, the Asia Maricreated_at Transparency Initiative, or AMTI, said.\nThe total area increased 800 acres (3.2 square kilometers) from 6,200 acres (25 square km) at the end of 2023.\n\"China has caused the most reef destruction, having buried roughly 4,648 acres (18.8 square km) of reef since 2013,\" AMTI said in a new report, adding that Vietnam came in second with approximately 2,362 acres (9.5 square km) of reef, mostly in 2024.\nChina and Vietnam are responsible for 65% and 33% of reef destruction, respectively, it said.\nGovernment agencies in the two countries were not available for comment during the Lunar New Year holiday.\nThe think tank affiliated to the Center for Strategic and International Studies in Washington analyzed island building activities of rival claimants, including China, Vietnam, Malaysia, Taiwan and the Philippines, using commercial satellite imagery.\nIt said that dredging and landfill had caused \"irreparable damage\" to the marine habitat, as well as long-term changes to the overall structure and health of reefs in the South China Sea.\nMalaysia, Taiwan and the Philippines accounted for less than 3% of the damage.\nIn a December 2023 report, AMTI said that besides island building, giant clam harvesting by Chinese fishermen also damaged another 16,353 acres (66.1 square km) of coral reef.\nAccording to AMTI, Manila planned to initiate a second legal challenge against Beijing over environmental destruction in what it calls the West Philippine Sea, or part of the South China Sea within the exclusive economic zone of the Philippines, where it has jurisdiction over natural resources in the water and the seabed.\nThe Marcos administration, however, has yet to decide on a venue for the lawsuit.\nPre-emptive counter strike\nIn 2016, the Philippines won an arbitration case against China under the United Nations Convention on the Law of the Sea, or UNCLOS, but Beijing refused to acknowledge the ruling.\nAMTI's director, Greg Poling, suggested that Manila could file with the U.N. General Assembly a resolution demanding compliance with the 2016 arbitration, and another resolution seeking an advisory opinion from the International Court of Justice on issues such as whether China's behavior violates international treaties.\nAs with the first case, the Philippines would have to rely mostly on its own efforts as the ASEAN grouping's non-interference principle would prevent other countries in the region from intervening, said Philippine maricreated_at legal expert Jay Batongbacal.\nFor its part, China seemed to have been \"trying to counter the Philippines' complaints against their environmentally damaging activities since last year,\" the expert told Radio Free Asia.\nChina's coast guard held a special maricreated_at law enforcement briefing on Sunday, during which it accused other claimant countries of damaging the ecosystems in the South China Sea while praising its own efforts to protect the environment.\nSuch public briefings could serve as a pre-emptive counter strike against Manila's plan, Batongbacal said.\nChina Coast Guard' spokesperson Liu Dejun said in an interview with the Global created_ats newspaper that in 2024 Chinese law enforcement cracked down on illegal fishing, illegal waste disposal and hunting of precious and endangered wildlife, detaining more than 500 foreign vessels for various violations and confiscating 15 of them.\nA foreign fishing vessel was caught poaching coral, with more than 1,200 live coral specimens and large quantities of giant clam shells seized, Liu said without identifying the country that the ship came from.\nEdited by RFA Staff.\n"
  },
  {
    "id": 888,
    "title": "South China Sea: Philippines arrests five more Chinese for ‘spying’",
    "created_at": "2025-01-31",
    "text": "\nPhilippine security officials said Thursday they took into custody five more Chinese spies, following the arrest of a compatriot for espionage this month.\nThe arrests come as confrontations between the two Asian neighbours over contested reefs and waters in the strategic South China Sea have escalated in recent months.\nTwo men were arrested at Manila airport last week after they allegedly conducted surveillance on Filipino navy and other government vessels supplying military garrisons in the disputed Spratly archipelago.\nThe men, using a drone and high-resolution solar-powered camera, recorded activities at a naval base, a coast guard station, an air base and a dockyard in Palawan province, the closest major landmass to the Spratlys, National Bureau of Investigation (NBI) director Jaime Santiago told a news conference.”\nWe consider them very dangerous to national security because of course, if this falls into other hands, this could be very dangerous for our personnel in the base and also those on board our ships,” Philippine military chief General Romeo Brawner told the news conference.\nThe spies disguised themselves as buyers of marine products or members of legitimate organisations.\nTwo other Chinese men were separately arrested elsewhere in Manila and another in the central city of Dumaguete last week, Santiago said.\nIt followed the arrest this month of a Chinese software engineer named Deng Yuanqing and two Filipino associates suspected of spying on military and police camps — allegations that were dismissed by the Chinese embassy in Manila.\nNBI cybercrime unit chief Jeremy Lotoc said a witness told the authorities Deng met with the five detained suspects once a month, acting on instructions from an unnamed “foreign national” in China.\nBrawner said it was premature to conclude that the spying was state-sponsored, with Filipino authorities yet to identify the end-receiver of the intelligence gathered.”\nThis is perhaps just the tip of the iceberg, many can still be caught doing these activities,” Brawner said. “There are more of them.\n“Some of the suspects have been living in the Philippines since 2002 and did not have any criminal records, immigration bureau spokeswoman Dana Sandoval told reporters.\nSecurity officials paraded the five suspects, handcuffed to each other, before the media along with the confiscated “military-grade” spying equipment.\nBeijing claims most of the strategic South China Sea despite an international ruling that its assertion has no legal basis.\nThe Chinese embassy in Manila did not immediately respond to AFP’s request for comment on the fresh arrests.\nOn Saturday, it described the spying allegations against Deng as “baseless speculation and accusation”.\nThe mission said it asked for its consul to visit the detained man, and urged Manila to “protect the legitimate rights and interests of Chinese citizens in the Philippines”.\nHelp safeguard press freedom & keep HKFP free for all readers by supporting our team\nclass=\"newspack-popup-container newspack-popup hidden newspack-inline-popup newspack-lightbox-no-border \"\nrole=\"button\"\ntabindex=\"0\"\nstyle=\"background-color:#FFFFFF;color:#000\"\nid=\"id_483304\"\ndata-segments=\"\"\ndata-frequency=\"0,0,0,month\"\n>\nclass=\"wp-block-newspack-blocks-homepage-articles is-style-default wpnbha is-grid columns-4 colgap-3 show-image image-aligntop ts-2 is-3 is-uncropped show-caption is-style-default has-text-align-left has-text-color has-primary-color\"\nstyle=\"\"\n>\nLATEST FROM HKFP\nAs a village waits to be swallowed by Hong Kong’s Northern Metropolis, once-defiant residents are unsure of their fate\nFears of scam centre kidnaps keep Chinese tourists on edge in Thailand\nSouth Korea airplane fire leaves seven injured\nHKFP Lens: Scenes from Macau shot by Portuguese photojournalist Gonçalo Lobo Pinheiro\nHKFP has an impartial stance, transparent funding, and balanced coverage guided by an Ethics Code and Corrections Policy. \nSupport press freedom & help us surpass 1,000 monthly Patrons: 100% independent, governed by an ethics code & not-for-profit.\n"
  },
  {
    "id": 889,
    "title": "Philippine President Marcos to China: Stop aggressive acts, I'll return US missile system",
    "created_at": "2025-01-31",
    "text": "\n                      MANILA(Philippine Daily/ANN) - President Ferdinand Marcos Jr. clapped back at China's criticisms of the deployment of the United States' Typhon missile system to the Philippines, stating that he would be willing to have the military hardware pulled out of the country if Chinese aggression in the West Philippines Sea (WPS) stops.\nIn a media interview in Cebu City Thursday, Marcos addressed China's objections to the missile system, emphasizing that the Manila had not commented on Beijing's much larger missile arsenal.\n\"I don't understand their comments on the Typhon missile system,\" Marcos said.\n\"We don't make any comments on their missile systems and their missile systems are a thousand created_ats more powerful than what we have.\"\nThe President then proposed a deal with China: halt its aggressive actions and territorial claims over the Philippines, and in exchange, the Philippines would consider recalling the missile system.\n\"Let's make a deal with China-stop claiming our territory, stop harassing our fishermen and let them have a living, stop ramming our boats, stop water-cannoning our people, stop firing lasers at us, and stop your aggressive and coercive behavior, and I'll return the Typhon missiles,\" Marcos said.\n\"Tigil nila yung ginagawa nila, ibabalik ko lahat 'yan (Stop all their aggressive acts and I'll return everything),\" he added.\nThe remarks come amid ongoing tensions in the South China Sea, where China has continued its maricreated_at assertiveness, including incidents of harassment against Filipino fishermen and coast guard personnel in contested waters.\nThe Philippines has repeatedly raised concerns over China's military presence and actions in the region, which Manila deems as violations of its sovereignty.\nThe US deployed the Typhon missile system to the Philippines in April last year as part of the Balikatan military exercises, and has reportedly stayed in the country since.\nThe move has drawn the ire of China which repeatedly called for its withdrawal.\nFilipino soldiers will reportedly train on the US military's intermediate range missile system during unilateral army drills next month.\nCall to remove missile system\nIt was Chinese foreign ministry spokesperson Mao Ning who made the call for the removal of the Typhon missile system in response to a Reuters report saying that the US had deployed its Typhon missile launchers to a new location in the country.\n\"We once again call on the Philippines to heed the call from regional countries and their peoples, correct the wrongdoing as soon as possible, quickly pull out the Typhon missile system as publicly pledged, and stop going further down the wrong path,\" Mao said in a regular press conference last January 24.\n\"Let me stress again that by bringing this strategic offensive weapon into this part of the world, the Philippines is essentially creating tensions and antagonism in the region and inciting geopolitical confrontation and an arms race,\" she continued.\nMao further said, \"This is a highly dangerous move and an extremely irresponsible choice for its own people, the people of the other Southeast Asian countries, and regional security.\"\nHowever, last December, Defense Secretary Gilberto Teodoro Jr. had already addressed China's objections, saying the missiles \"are not targeted against specific countries.\"\n\"Instead, it is targeted against security risks, threats, and challenges,\" he said.\nThe Typhon missile system arrived in the country from the US in April and was first used during its bilateral war games with the country.\nREAD: Army to conduct next phase of US missile system training in Feb\nThe Philippine Army said the ground-based missile system was also used for the bilateral Army drills between Manila and Washington, which were already finished on Sept. 22, 2024.\nHowever, Army spokesperson Col. Louie Dema-ala said the missile system will remain in the Philippines until further notice as the US and the Philippines assess its use in future drills.\n"
  },
  {
    "id": 892,
    "title": "US Ally Turns Tables on China Over Missile Complaints",
    "created_at": "2025-01-31",
    "text": "\nThe Philippines offered China a deal on Thursday, demanding it stop its aggressive behavior in the South China Sea in exchange for the removal of a U.S. missile system in the nation.\nNewsweek has emailed the U.S. Indo-Pacific Command for comment. Both the Chinese defense and foreign ministries did not immediately respond to a request for comment.\nWhy It Matters\nThe Philippines has hosted a U.S. Mid-Range Capability (MRC) missile system, also known as Typhon, since April 2024. Initially it was stated that this was just for exercises but both nations later decided to keep it in the country \"indefinitely.\" The land-based weapon can launch two types of missiles for land attack, air defense and anti-ship missions, and is capable of striking targets up to 1,000 miles away.\nChina has territorial disputes with the Philippines in the South China Sea and there have been frequent maricreated_at confrontations between Chinese and Philippine forces. Manila has signed a security treaty with Washington that comes with mutual defense commitments and Beijing has also repeatedly raised objections to the U.S. missile deployment, denouncing it as a \"highly dangerous move.\"\nWhat To Know\nPhilippine President Ferdinand Marcos Jr. told reporters that he will \"return everything\" if China stops its \"aggressive and coercive behavior\" in the contested South China Sea.\n\"Stop claiming our territory, stop harassing our fishermen and let them have a living, stop ramming our boats, stop water cannoning our people, stop firing lasers at us,\" he said.\nChina has increasingly sent armed coast guard ships to the waters near the Philippines to reinforce its territorial claims with law enforcement patrols, ramming maneuvers, and water cannons, as well as the use of high-power lasers against Philippine vessels.\nThe president's remarks came after the Chinese Foreign Ministry urged Manila to quickly withdraw the Typhoon missile system to \"correct the wrongdoing.\" The Philippine military hit back by vowing that \"no single entity\" can dictate how it conducts its defense deployments.\nReuters reported last week that the Typhon missile system was relocated from its original site at Laoag airfield on the island of Luzon in the northern Philippines to another location.\nA group of Philippine soldiers will be trained on the missile system next month with the U.S. Army's First Multi-Domain Task Force, which operates the weapon, it was announced on Tuesday, adding that the training would not include live-fire events.\nWhat People Are Saying\nPhilippine President Ferdinand Marcos Jr. said on Thursday: \"Well, I don't understand the comments on the Typhon missile system. We don't make any comments on their missile systems, and their missile systems are a thousand created_ats more powerful than what we have.\"\nChinese Foreign Ministry spokesperson Mao Ning said on January 23: \"Let me stress again that by bringing this strategic offensive weapon [Typhon missile system] into this part of the world, the Philippines is essentially creating tensions and antagonism in the region and inciting geopolitical confrontation and an arms race.\"\nThe U.S. Army Pacific said on April 15, 2024: \"This landmark [Typhon missile system] deployment marks a significant milestone for the new capability while enhancing interoperability, readiness, and defense capabilities in coordination with the Armed Forces of the Philippines.\"\nWhat Happens Next\nThe Chinese Defense Ministry has said China's claims of sovereignty in the South China Sea are \"indisputable.\" It remains to be seen how Beijing will respond to Manila's offer to remove the Typhon system.\nLink to Image\n\nGraphic\n \nU.S. Missile Deployment in Philippines\nSgt. First Class Rudy Gonzalez/U.S. Army\nUnited States and Philippine soldiers participate in a training on the Mid-Range Capability missile system in Northern Luzon, the Philippines, on June 27, 2024.\n"
  },
  {
    "id": 893,
    "title": "Philippines offers to return US missiles if China ceases South China Sea aggression",
    "created_at": "2025-01-31",
    "text": "\nPhilippine President Ferdinand Marcos Jr. has proposed returning US Typhon missiles stationed in the Philippines if China ceases its aggressive actions in the South China Sea, Taiwan News reported. Speaking ahead..."
  },
  {
    "id": 894,
    "title": "Philippine's Marcos Jnr offers to return US Typhon missiles if China ends 'aggressive' acts",
    "created_at": "2025-01-31",
    "text": "\n Analysts say it the proposal was likely rhetorical rather than genuine, with little chance Beijing would ever take up such a deal   \nPhilippine President Ferdinand Marcos Jnr has publicly offered to remove the US-made Typhon missile system from his country if China ceases its \"aggressive and coercive behaviour\" in the South China Sea. \nSecurity experts view the proposal as a rhetorical challenge rather than a genuine attempt at negotiation, given the unlikelihood of Beijing curbing its claims over the disputed waterway. \nMarcos Jnr made his pledge on Thursday during the inauguration of an airport runway in Cebu, linking China's numerous objections to the Typhon's presence in the Philippines to Beijing's own missile arsenal. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \n\"I don't understand their comments on the Typhon missile system. We don't make any comments on their missile systems and their missile systems are a thousand created_ats more powerful than what we have,\" Marcos Jnr said. \nChina has yet to respond to the president's remarks, but it has repeatedly demanded the Typhon's removal since the land-based system, known formally as the Mid-Range Capability (MRC) missile launcher, was delivered to the Philippines in April by US forces for use in joint drills. \nThe launcher has remained in the country since then and the Philippines has announced plans to acquire a Typhon system of its own. \nThe land-based launcher can fire Raytheon's Standard Missile 6 (SM-6), which has a range of more than 240km, and the Tomahawk Land Attack Cruise Missile, with a range of roughly 2,500km. Its placement in the Philippines gives it coverage of the South China Sea and the Taiwan Strait. \nMarcos Jnr insisted Manila had justifications to keep the Typhon, yet offered to stand down if China would end what the Philippine government calls persistent harassment of its fishing boats and vessels. \n\"Let's make a deal with China - stop claiming our territory, stop harassing our fishermen and let them have a living, stop ramming our boats, stop water-cannoning our people, stop firing lasers at us, and stop your aggressive and coercive behaviour, and I'll return the Typhon missiles,\" he said. \nMarcos Jnr's ultimatum cast the Typhon as leverage, but analysts say it was more of a political statement than a serious offer - meant to highlight what they see as China's double standards. \nSherwin Ona, a visiting fellow at Taiwan's Institute for National Defence and Security Research, said the offer was a calculated move to call out the hypocrisy of Beijing's objections given its extensive military footprint. \n\"Remember that this pronouncement comes at a created_at when China's monster ships linger in our waters. This also coincides with the discovery of surveillance drones and the uncovering of espionage activities,\" said Ona, who is also an associate professor of political science at De La Salle University in Manila. \nSecurity analyst Matteo Piasentini, a lecturer at the University of the Philippines and analyst at the Indo-Pacific desk of Italian think tank Geopolitica, agreed that the offer was likely symbolic. \n\"He's using some rhetoric to reinforce the Philippines' stance. He knows that China won't accept such a deal overnight,\" Piasentini told This Week in Asia. \nHe said the Typhon was \"a deterrence tool that is needed to strengthen Philippines' capability and security,\" and called it unreasonable to scale back military modernisation \"without concrete security guarantees from China. Which historically have never really materialised\". \nBeijing claims nearly the entire South China Sea under its \"nine-dash line\" doctrine, dismissing overlapping claims from neighbours such as the Philippines, Vietnam, and Malaysia. It also rejects a 2016 international arbitral ruling invalidating its sweeping claims, arguing the decision lacks legal merit. \nTensions in the disputed waterway have been high since late December, when China deployed a 165-metre coastguard vessel - dubbed \"the monster\" - some 77 nautical miles off the Philippine coast. \nMuhammad Faizal Bin Abdul Rahman, a research fellow at S. Rajaratnam School of International Studies in Singapore, said it was politically implausible for China to accept Marcos Jnr's proposal, which implicitly calls on Beijing to renounce the \"nine-dash line\" central to its South China Sea stance. \n\"President Marcos Jnr's offer of a deal sounds like a sarcastic rebuttal of China's criticisms towards the Typhon missile system. Additionally, it implicitly reiterates that the Philippines will never capitulate to China over its interests in the South China Sea,\" Rahman told This Week in Asia. \nRahman said the regional impact of a Typhon withdrawal would depend on the circumstances, with potential consequences for both Association of Southeast Asian Nations (Asean) and broader security dynamics. \n\"If the pull out is due to China significantly reducing its assertive activities at South China Sea, it could mean a lesser security conundrum for other claimant states and Asean.\" \n\"But this is unlikely to happen as China would want to maintain pressure on the Philippines-US alliance and the region to pursue its strategic interests and the US would want to maintain military assets in the Philippines due to a possible Taiwan contingency and the US' strong anti-China stance,\" he explained. \nFormer Philippine Navy defence analyst Vincent Kyle Parada said the Philippines removing the Typhon could have mixed reactions within Asean, with some states possibly welcoming reduced tension, while others might see it as emboldening China. \n\"Should the Philippines agree to a withdrawal of the Typhon missile system, like-minded states is likely to see it as a coercive measure and move to denounce Beijing, while countries like Indonesia and Malaysia may welcome the development as a step back toward Asean centrality,\" he explained. \n\"In the end, however, the only opinion that matters is China's; and a pull-out will only embolden them to continue their coercive activities in order to extract future concessions,\" Parada added. \nIn a further sign of the system's importance to the Philippines, Colonel Louie Dema-ala said during a press briefing on Tuesday that the Army Artillery Regiment would train with the US Army Pacific on Typhon \"payload delivery\" this February. \n\"While the MRC is here, we will maximise its utilisation to train our personnel in this kind of new technology,\" he added. \nDefence expert Joshua Espeña, a lecturer at Polytechnic University of the Philippines, said removing the Typhon would give China more freedom to operate without interference. \n\"So, sticking the MRC right where it is supposed to be will complicate the People's Liberation Army moves at the operational level. But this scenario should not make Manila comfortable as Beijing is likely to play more cards at the table, say economic sticks and info warfare, to cripple decision making and weaken the kill chain of the MRC,\" Espeña said. \nIndeed, Parada said Marcos Jnr's administration would do well to exercise caution in entering any binding or temporary agreement with Beijing, warning that any concession would validate China's claims and set a precedent for future administrations to contend with. \nParada said he doubted Marcos Jnr would risk withdrawing the missiles ahead of the 2025 elections in May, arguing that such a move would damage domestic support. \"Doing so will only affirm an already brewing sencreated_atnt that the government is all bark and no bite,\" he said.  \n"
  },
  {
    "id": 896,
    "title": "Marcos Jr. vows support for partymates in Halalan 2025",
    "created_at": "2025-01-31",
    "text": "\nBRP Teresa Magbanua was able to push a China Coast Guard (CCG) vessel away from the coast of Zambales, according to the Philippine Coast Guard (PCG). In a statement Thursday evening, PCG..."
  },
  {
    "id": 898,
    "title": "Philippines arrests Chinese for ‘spying’",
    "created_at": "2025-01-31",
    "text": "\nPhilippine security officials said yesterday they arrested five more Chinese spies, following the arrest of a Chinese citizen detained for espionage earlier this month. \nThe arrests come as confrontations between the two Asian neighbours over contested reefs and waters in the strategic South China Sea have escalated in recent months. \nTwo men were arrested at Manila airport last week after they allegedly conducted surveillance on the Filipino navy and other vessels supplying military garrisons in the disputed Spratly archipelago, officials said. \n“We consider them very dangerous to national security because of course, if this falls into other hands, this could be very dangerous for our personnel in the base and also those on board our ships,” Philippine military chief General Romeo Brawner said.\nTwo other Chinese men were arrested in Manila and another in Dumaguete last week, National Bureau of Investigation (NBI) director Jaime Santiago said. \nIt followed the arrest this month of a Chinese software engineer and two Filipinos suspected of spying on military and police camps – allegations that were dismissed by the Chinese embassy in Manila. \nOfficials did not say who employed the suspects. NBI cybercrime unit chief Jeremy Lotoc said yesterday an unnamed “foreign national” was giving orders to Chinese software engineer Deng Yuanqing, who was detained earlier this month. \nSome of the suspects have been living in the Philippines since 2002 and did not have criminal records, immigration bureau spokeswoman Dana Sandoval said. \nBeijing claims most of the strategic South China Sea despite an international ruling that its assertion has no legal basis. \nThe Chinese embassy in Manila did not immediately respond to AFP’s request for comment on the latest arrests. On Saturday, it described the spying allegations against Deng as “baseless speculation and accusation”. \nThe mission said it asked for its consul to visit the detained man, and urged Manila to “protect the legitimate rights and interests of Chinese citizens in the Philippines”.  \n"
  },
  {
    "id": 901,
    "title": "China: Analysts: Rubio charts a course for countering China",
    "created_at": "2025-01-31",
    "text": "\nU.S. Secretary of State Marco Rubio's Southeast and East Asia strategies will be aimed at countering China by toughening U.S. policies to secure regional peace and maximize American interests, analysts say.\nRubio gave a glimpse of what U.S. foreign policy will look like as he began his first day as the head of the State Department last week.\nSpeaking to his staff after he was sworn on Jan. 21, Rubio said, Our job across the world is to ensure that we have a foreign policy that advances the national interest of the United States.\nReferencing President Donald Trump's objective, Rubio continued that the overriding goal of global policy is the promotion of peace, the avoidance of conflict.\nPutting America First and achieving Peace through Strength are twin pillars on which Trump said he will prop up the U.S. as he took office on Jan. 20.\nRubio is currently likely to consult with country directors of the region and coordinate with the Pentagon and intelligence agencies to formulate Asia Pacific strategies, said Richard Armitage, who served as deputy secretary of state during the Bush administration, to VOA Korean on Jan. 24.\nSecretary Rubio's Southeast Asia policy will focus on countering China through stronger U.S. trade, security partnerships and supply chain diversification, said Mark Kennedy, director at the Wilson Center's Wahba Institute for Strategic Competition, to VOA on Jan. 23\nOn Pyongyang and Moscow, Rubio will ask China - as Trump did - to help convince North Korea to resume negotiations with the U.S., said Joseph DeTrani, who served as special envoy for six-party denuclearization talks with North Korea during the George W. Bush administration.\nIf successful, with or without China's help, this may help to distance North Korea from Russia, DeTrani told VOA on Jan. 24.\nRubio's roots\nIn shaping and executing regional policies, Rubio's strong opposition to authoritarianism, communism, and human rights violations is likely to color his approach at the State Department, said Evans Revere, who served as acting secretary for East Asia and Pacific Affairs during the George W. Bush administration.\nThe former senator grew up in Miami with Cuban immigrant parents and has exhibited an aversion toward communist governments throughout his political career.\nThis stance, mixed with the twin foreign policy pillars, are likely to result in tough strategies for countries like North Korea and China and their activities in the region, according to analysts.\nRubio signaled this on a call with Chinese Foreign Minister Wang Yi on Friday, stressing that the Trump Administration will pursue a U.S.-PRC relationship that advances U.S. interests and the United States' commitment to our allies in the region. China's official name is the People's Republic of China (PRC).\nHe also expressed serious concern over China's coercive actions against Taiwan and in the South China Sea.\nIn line with the policy goal of avoiding conflict, Rubio may support Trump's personal diplomacy with North Korean leader Kim Jong Un, said Gary Samore, former White House coordinator for arms control and weapons of mass destruction during the Obama administration.\nNorth Korea said Sunday it conducted a sea-to-surface strategic cruise missile test the previous day.\nRubio, doubtful initially about Trump's summits with Kim during his first term, said at a confirmation hearing earlier this month that Trump's personal diplomacy was able to stop the country from testing missiles.\nHe spoke by phone with South Korean Foreign Minister Cho Tae-yul last week emphasizing the alliance is the linchpin of peace on the Korean Peninsula and across the Indo-Pacific.\nIn a meeting also last week in Washington, Rubio and Japanese Foreign Minister Iwaya Takeshi discussed North Korea's ties with Russia.\nRally against China\nAmong Southeast Asian countries, Rubio last week held calls with the foreign ministers of Indonesia, the Philippines, and Vietnam, each created_at stressing stable maricreated_at security in the South China Sea.\nParticularly in his calls with Philippine Secretary of Foreign Affairs Enrique Manalo, Rubio underscored PRC's dangerous and destabilizing actions in the South China Sea.\nWith Vietnamese Foreign Minister Bui Thanh Son, Rubio expressed concern over China's aggressive behavior in the South China Sea.\nGregory Poling, director of the Southeast Asia program at the Center for Strategic and International Studies (CSIS), told VOA on January 23 that the Trump administration will look primarily to the Philippines and outside partners like Japan and Australia to defend freedom of the seas in the South China Sea.\nOne of the first meetings Rubio held was with the Australian, Japanese and Indian leaders of the Quad security dialogue last week in Washington where they expressed opposition to unilateral actions to change the status quo of the region by force or coercion and vowed to keep the Indo-Pacific free and open.\nPoling continued the administration will look secondarily to Vietnam, Singapore, and Indonesia to deepen practical maricreated_at cooperation.\nRubio may push Indonesia to take a stronger stance vis-\\xE0-vis Chinese activities in disputed waters, particularly in light of controversial Indonesia-China maricreated_at development deal signed in November 2024, Anreyka Natalegawa, associate fellow for the Southeast Asia Program at CSIS told VOA on Jan. 23.\nIndonesia and China signed a $10 billion deal in November agreeing to develop fisheries, oil and gas exploration, among other things, across their private sectors.\nDiplomatic balancing\nAnalysts say Washington's push to have regional countries align more closely with Washington could lead to some tensions. Vietnam, Cambodia and Myanmar tend to lean more toward Beijing, and Indonesia tends to balance its engagement with China and the U.S.\nRobert McMahon, a foreign relations expert at The Ohio State University, said Rubio's harsh stance on China could put Indonesia in a difficult position, since it has not been willing to join the anti-China bandwagon.\nHe told VOA in December after Rubio was nominated as the secretary of state that to the extent that the United States tries to pressure Indonesia to move in that direction, that could lead to some conflict.\nRubio said to his State Department staff last week that he expects other countries to advance their national interests but hopes there will be many - in which our national interests and theirs align.\nSeng Vanly, an assistant dean and lecturer at the Techo Sen School of Government and International Relations at the University of Cambodia, said Washington is likely to increase pressure on Cambodia over concerns for human rights, democratic setbacks, and restricted civil society activities, coupled with its growing ties with China.\nHowever, analysts say U.S. foreign policy under Rubio will likely balance issues such as human rights with regional security and economic goals.\nRahman Yaacob, a research fellow for the Southeast Asia program at the Lowy Institute, said, Washington will be more practical.\nWhile it could raise human rights issues with regional countries, the Americans understand if they disengage from the region because of human rights, China will fill in the void, Yaacob said.\nHan Noy from Khmer Service, Yuni Salim from Indonesian Service contributed to this report. - VOA\n"
  },
  {
    "id": 902,
    "title": "Indonesian and French defense ministers agree to deepen cooperation to maintain regional stability",
    "created_at": "2025-01-31",
    "text": "\nJAKARTA, Indonesia (AP) — The defense ministers of France and Indonesia agreed Friday to work more closely to maintain regional stability, Indonesian officials said.\nVisiting French Defense Minister Sébastien Lecornu and his Indonesian counterpart, Sjafrie Sjamsoeddin, agreed in a meeting that the two countries can collaborate through technology exchange and other forms of cooperation, Indonesian Defense Ministry spokesperson Brig. Gen. Frega Wenas said.\nThe French Embassy in Jakarta said earlier this week that France had deployed a carrier strike group to Indonesia for the first created_at. The Charles De Gaulle, France’s first nuclear-powered aircraft carrier, made stops in Bali and Lombok, where it carried out a number of logistical activities as part of a six-month mission in the Pacific that started in November 2024.\nThe Charles De Gaulle also participated in a joint exercise with warships from eight countries in the Straits of Malacca, Sunda, and Lombok, the embassy said.\nLast July, French air force planes made a stopover in Indonesia’s capital as part of a visit to Southeast Asia that was meant to display France's commitment to security in the Indo-Pacific region amid growing Chinese maricreated_at activity there.\nMilitary cooperation between Indonesia and France has grown in recent years, since President Prabowo Subianto was still serving as Indonesia's defense minister.\nLast year, Indonesia purchased 42 Rafale and Dassault Aviation fighter jets and is expected to receive the first Rafale jets under the contract in 2026. It also announced the purchase of two French Scorpene Evolved submarines and 13 Thales Ground Control Interception radars. Five of the radar systems are expected to be installed in the country’s new capital, Nusantara.\nThe purchases come as tensions are rising in the region, particularly in the disputed South China Sea, where China is asserting its expansive territorial claims. While Indonesia is not a claimant state, it has clashed with China over fishing rights near the Natuna Islands, which lie within its exclusive economic zone but are also claimed by China.\nThe South China Sea contains crucial shipping lanes, abundant fish stocks and undersea mineral resources. Efforts between China and the Association of Southeast Asian Nations to establish a code of conduct to prevent conflicts have seen little progress.\n"
  },
  {
    "id": 907,
    "title": "Marcos plans US immigration talks",
    "created_at": "2025-01-31",
    "text": "\nPhilippine President Ferdinand Marcos jr said yesterday he would meet US President Donald Trump to discuss issues including immigration, in an effort to influence policy.\nHe said this could impact a large number of Filipinos in the US. \n“We will see how we can influence policymaking in terms of immigration,” Marcos said without saying when the meeting would take place. \nSince taking office on January 20, Trump has announced a number of immigration-related executive orders that focus on stricter border policy, tighter visa-vetting procedures, and a crackdown on undocumented migrants in the US. \nThere are more than 300 000 undocumented Filipinos in the US, according to a 2019 estimate by the think tank Migration Policy Institute. Close to two million migrants from the Philippines live in the US, according to a 2024 report by the US Census Bureau. \nMarcos also said he would return a Typhon missile system to the US if China ceased what he said was aggressive and coercive behaviour, and its claiming of territory in the South China Sea. \nTensions between China and the Philippines have escalated in recent years, and the Philippines has moved closer to Washington, which is also keen to counter China’s increasingly assertive claims in the disputed waterway. \nChina has strongly opposed the US deployment of the Typhon for exercises in the Philippines, and has repeatedly called for its withdrawal. \n“I don’t understand the comments on the Typhon missile system. We don’t make any comments on their missile systems, and their missile systems are a thousand created_ats more powerful than what we have,” Marcos said.\n“Let’s make a deal with China: stop claiming our territory, stop harassing our fishermen and let them have a living, stop ramming our boats, stop water cannoning our people, stop firing lasers at us, and stop your aggressive and coercive behaviour, and I’ll return the Typhon missiles,” he said. \nBeijing, which claims sovereignty over most of the South China Sea, has repeatedly accused Philippine vessels of encroachment into its territory. \nBilateral ties are at their worst in years after repeated confrontations and heated diplomatic rows. The Chinese embassy in Manila did not immediately respond to a request for comment on the president’s remarks. \nThe Typhon missile system was deployed by US forces to the Philippines in April last year as part of their Balikatan or “shoulder-to-shoulder” military exercises, and has since remained in the country. \nReuters reported last week the launchers had been redeployed to a new location in the Philippines, which officials declined to disclose. \nIn 2016, the Permanent Court of Arbitration in the Hague ruled China’s claims had no legal basis, siding with the Philippines.  |  Reuters\n"
  },
  {
    "id": 909,
    "title": "Marcos seeks Trump immigration talk, offers ‘deal’ with China on US missiles",
    "created_at": "2025-01-31",
    "text": "\nPhilippine President Ferdinand R. Marcos, Jr. on Thursday said he plans to meet with US President Donald J. Trump to discuss various issues including immigration, in an effort to influence policy that he said could affect a large number of Filipinos in the US.\n“We will see how we can influence policymaking in terms of immigration,” Marcos said without saying when that meeting would take place.\nMr. Trump has clamped down on immigration, vowing to undo the policies of his predecessor that he said enabled the large influx of undocumented immigrants.\nThe Department of Foreign Affairs (DFA) has said it is impossible for about 300,000 undocumented Filipinos in the US to be deported in the next four years.\n“About a few hundred Filipinos have been sent home,” Mr. Marcos said in Filipino. “This is something that we have to work through and hopefully resolve because the Filipinos in the United States, especially, have really [become an] important part already of their workforce.”\nSpeaking with reporters on various topics, Mr. Marcos also said he would return a Typhon missile system to the US if China ceased what he said was aggressive and coercive behavior, including claiming features in the South China Sea.\nChina has opposed the US deployment of the missile system for exercises in the Philippines, a defense ally of Washington, and has repeatedly called for its withdrawal.\n“I don’t understand the comments on the Typhon missile system,” Mr. Marcos said. “We don’t make any comments on their missile systems and their missile systems are a thousand created_ats more powerful than what we have.”\n“Let’s make a deal with China: Stop claiming our territory, stop harassing our fishermen and let them have a living, stop ramming our boats, stop water cannoning our people, stop firing lasers at us and stop your aggressive and coercive behavior and I’ll return the Typhon missiles,” he added.\nChina, which claims sovereignty over most of the South China Sea, has repeatedly accused Philippine vessels of encroachment on its territory. Bilateral ties are at their worst in years after repeated confrontations and heated diplomatic rows.\nThe Chinese Embassy in Manila did not immediately respond to a request for comment on the President’s remarks.\nThe Typhon missile system was deployed by US forces to the Philippines in April last year as part of their Balikatan or “shoulder-to-shoulder” military exercises, and has since stayed in the country.\nThe launchers were redeployed to a new location in the Philippines, which officials declined to disclose, Reuters reported last week.\nRADIO CHALLENGE\nMeanwhile, the Philippine Coast Guard said its largest ship had been issuing hourly radio challenges to a Chinese vessel near the coast of Zambales province.\n“The BRP Teresa Magbanua is actively and resolutely addressing the unlawful presence of the China Coast Guard (CCG) vessel with bow number 3304 within the Philippines’ exclusive economic zone (EEZ),” it said in a statement on Wednesday night.\nThe actions of CCG 3304 “violate the Philippine Maricreated_at Zones Act, the United Nations Convention on the Law of the Sea (UNCLOS), which China has ratified, as well as the 2016 arbitral award,” the PCG said.\n“It is worth noting that the PCG vessel successfully pushed CCG 3304 further away from Zambales, achieving an approximate distance of 85-90 nautical miles (157 to 167 kilometers),” it added.\nThe Philippine Coast Guard (PCG) on Tuesday night said it had sent the 97-meter BRP Teresa Magbanua to monitor Chinese vessels near the coast of Zambales province in the country’s north. Teresa Magbanua replaced the 44- meter vessel BRP Cabra, which arrived at Subic Port on Tuesday morning to unload the text of a fisherman that it recovered on Monday.\nTeresa Magbanua can displace 2,265 tons of water, compared with 12,000 tons for China Coast Guard ship 5901, the largest coast guard cutter in the world.\nThe PCG on Monday night accused China Coast Guard (CCG) 3304 of shadowing its ship that was rescuing a distressed fishing boat near the Zambales coast.\nIt said Cabra navigated through heavy waves to retrieve the text of a Filipino fisherman using its crane.\n“It is crucial to note that the Chinese Coast Guard vessel CCG 3304, despite being aware of the distress call from the Filipino fishermen, engaged in shadowing that hindered the PCG vessel’s efforts to recover the text,” the PCG earlier said.\nThe Philippines has accused China of intimidating Filipino fishermen near Scarborough Shoal and normalizing its “illegal presence” after Beijing sent its monster ship into the Philippine EEZ on Jan. 4.\nA United Nations-backed court in The Hague voided China’s expansive claim in the South China Sea in 2016, as it ruled the shoal is a traditional fishing ground for Filipino, Chinese and Vietnamese fishermen.\n"
  },
  {
    "id": 910,
    "title": "Coping with the US aid freeze: Philippine Daily Inquirer",
    "created_at": "2025-01-31",
    "text": "\nMANILA — By Foreign Undersecretary Eduardo de Vega’s reckoning, the Philippines will not be severely impacted by President Donald Trump’s suspension of all United States’ foreign development assistance to countries around the world, since we have many other economic partners to count on.\nWhile acknowledging that trade with the US remains high, De Vega noted that the aid freeze is not likely “to severely affect us because aid packages from the US are small right now.”\nHis optimistic view might be premature though as Philippine officials, and the world for that matter, have yet to see the detailed list of US-funded development programs that could potentially be scuttled following the Trump administration’s 90-day review.\nWithin hours of his inauguration, Trump fired off orders that shook many countries and global institutions. This included US withdrawal from the Paris Climate pact and the World Health Organization, as well as the deportation of illegal migrants to the US.‘America First’\nOn Monday, he ordered a freeze on all US development and military assistance to partner countries, pending a review on whether they align with his “America First” policy. The only exemption from the freeze order is military aid for Israel and Egypt. The Philippines was among 17 countries identified for foreign military assistance in 2025, but it’s not yet clear if this is covered by the freeze as well.\nDe Vega, however, remains certain that the new sites for the Enhanced Defense Cooperation Agreement (Edca) won’t be affected, an optimism that may have basis in fact. With the Philippines providing a strategic location for safeguarding US interests in the Indo-Pacific amid China’s increasing aggression in the South China Sea, the Trump administration would be foolish and short-sighted to withhold funding from its long-created_at ally this side of the world.\nThe newly appointed US Secretary of State, Marco Rubio, has also reiterated the US’ “ironclad” commitment to defending the Philippines amid China’s provocative actions in the West Philippine Sea under the 1951 Mutual Defense Treaty. “An armed attack in the Pacific, including anywhere in the South China Sea, on either of their public vessels, aircraft, or armed forces—which includes their Coast Guards — would invoke mutual defense commitments,” the US Department of State said after Rubio met with Philippine Foreign Secretary Enrique Manalo earlier this month.Proactive and pragmatic\nRubio was further quoted by the state department as denouncing China’s “dangerous and destabilizing actions in the South China Sea,” saying that they violated international law.\nWith Rubio’s personal assurances of continuing US engagement on military and defense matters, it’s the non-military assistance that Philippine officials must seriously worry about. It’s imperative that they take a proactive and pragmatic approach with the US aid freeze order affecting programs on economic development, health, education, job training, anticorruption, peace efforts, and even disaster response.\nThe US Agency for International Development (USAID) disbursed $198.2 million to the Philippines in 2023 for various programs. With $5 million set aside by the USAID for Improving Learning Outcomes for the Philippines program launched in 2023, Education Secretary Sonny Angara has expressed hope that US funding for education would “survive” the freeze.\nAccording to the US state department website, the USAID has invested more than $5 billion in the Philippines since 1961, with priorities such as climate change mitigation and adaptation, promoting renewable energy, peace efforts in Mindanao, bolstering economic recovery, advancing democratic values, fighting corruption, and advocating for human rights.Regional peace\nThis sizeable amount invariably affects the country’s economy and cannot be shrugged off. Rather than being nonchalant about the potential reduction or removal of US funding on certain programs, the Philippines must preemptively assess and prepare for such eventuality.\nPhilippine Ambassador to the US Jose Manuel Romualdez and the Department of Foreign Affairs should work the diplomatic channels in Washington to save the Philippines from possible withdrawal of US funding for these critical programs.\nThis should be a test of just how loyal and committed the US is to the Philippines beyond its strategic importance in regional peace and security. That is certainly a card that the Philippines should not shy away from using in these troubled created_ats.\nIn the long run, any potential setback in US aid should be offset by initiatives to deepen the country’s relations with its other trusted allies, especially Japan which is the largest source of official development assistance to the Philippines. With the Reciprocal Access Agreement signed recently to widen the two countries’ defense alliance, Japan’s close ties with the Philippines will prove to be crucial as we grapple with four years under Trump’s inward-looking presidency.\n©2025 Asia News Network. Distributed by Tribune Content Agency, LLC\n"
  },
  {
    "id": 913,
    "title": "Jakarta turns to India in missiles push",
    "created_at": "2025-01-31",
    "text": "\nA potential US$450 million missile deal between India and Indonesia highlights Jakarta's bid to enhance its naval power, as both nations seek to strengthen and diversify defence ties in response to China's growing territorial ambitions in the region, analysts say. \nDuring a recent state visit to India, Indonesian President Prabowo Subianto and Prime Minister Narendra Modi agreed to expand cooperation in defence manufacturing and maricreated_at safety, culminating with Subianto attending India's Republic Day celebrations as the chief guest. \nModi said that strengthening ties with Indonesia would be crucial in \"maintaining peace, security, prosperity and rules-based order in this entire region\".  \nWhile neither leader specifically mentioned China, Modi stressed that India and Indonesia were committed to promoting \"freedom of navigation\" under international law - the principle that ships can move freely through international waters without interference. The phrase is often invoked in response to Beijing's expansive maricreated_at claims and growing assertiveness in the South China Sea and other key waterways. \nLeading up to the meeting, speculation grew that Jakarta would finalise its purchase of BrahMos cruise missiles, co- produced by India and Russia. If completed, Indonesia would become the second country, after the Philippines, to procure the shore-based version of the mid-range missiles, as well as a variant for warships.  \nAlthough the missile deal was not finalised during Prabowo's visit, Indian media reports citing government sources said talks were now in \"advanced stages\" after years of prolonged negotiations. \nAhmad Rizky Umar, an international relations and Indonesian politics expert at Aberystwyth University in Britain, said that for the Philippines, it was logical to shore up its maricreated_at defences with cruise missiles as the South China Sea increasingly becomes a flashpoint.  \n\"I think Prabowo has a similar interest because Indonesia, like the Philippines, shares maricreated_at territories [with other nations], so it will also be very vulnerable to any threats, not only in the South China Sea but also in the Indian Ocean,\" he said. \n\"Indonesia wants to anticipate any conflict in the future that can undermine its maricreated_at territorial integrity.\" \nHe noted that this followed Jakarta's efforts to bolster maricreated_at defences with Japan earlier this month. Both sides seem on the cusp of a landmark agreement to co-develop a warship for the Indonesian navy. Japan has also pledged to give Indonesia two high-speed patrol boats.  \nNatalie Sambhi, executive director of independent think tank Verve Research and lecturer at Deakin University, Australian War College, said closer security ties would mitigate Indonesia's and India's dependence on either the US or China, allowing both countries to \"remain strategically nonaligned.\" \nPrabowo, who assumed the presidency in October and was previously Indonesia's defence minister, is expected to prioritise military modernisation, analysts said, diversifying regional partnerships in line with Indonesia's non-aligned foreign policy approach. \nAnastasia Febiola, a research coordinator and manager of consultancy firm Semar Sentinel Indonesia, said Indonesia had historically sourced its missiles from Europe and the US. During his tenure as defence minister, Prabowo avoided military deals with Russia or China, and sourced weapons mainly from Italy, Sweden, Belgium, the United States and South Korea. \nTherefore, if the BrahMos deal with India were finalised, it would signify \"a pretty important act\" for Indonesia, Anastasia said.  \n\"It also balances Indonesia's position towards Western countries. \n\"With the uncertain geopolitical dynamics and tensions in the Indo-Pacific region, strengthening its armed forces deterrence capability has become more urgent for Indonesia,\" Anastasia said. \nEstablishing stronger relations with Southeast Asia has also been a focus for India under its Act Easy Policy, as Delhi looks to position itself as a regional power serving as a counterbalance to China. \nAccording to Umar, India perceives defence deals as a viable strategy to achieve its objectives, particularly as it may struggle to compete with China regarding trade. \nSambhi from Verve Research said that Indonesia stood to become \"a model customer\" for New Delhi's defence industry exports, which could also pave the way for India to enter other markets in Southeast Asia. \nIndian news outlets, meanwhile, reported that during Prabowo's state visit, Indonesian officials expressed interest not only in BrahMos missiles, but also in India's aircraft carrier-building capacities.  \nAccording to Sambhi, operating an aircraft carrier could be viewed as a \"wealth and power flex\", especially for a developing country. \n\"Indonesia's interest in pursuing such a capability is completely on brand with Prabowo's aspirations that his country take its place among the bigger regional and global powers,\" she said.  \nHowever, Umar added that Prabowo would have to balance such ambitions with several populist programmes he had introduced, including a newly implemented scheme providing free meals to 83 million children and pregnant mothers. This plan alone is expected to cost nearly US$30 billion annually when fully in operation. \nNegotiations over the BrahMos missiles have reportedly stalled since 2009, primarily due to budget constraints, which Anastasia identified as the main challenge for Indonesia's defence modernisation plan, as funds would also be needed for personnel welfare programmes and equipment maintenance.\n"
  },
  {
    "id": 914,
    "title": "China/Philippines: With acoustic blast, China ups aggression in disputed waters: Philippine Navy",
    "created_at": "2025-01-31",
    "text": "\nChina's use of a long-range acoustic device against Filipino sailors in the South China Sea marks an increase in aggression in the disputed waters, a Philippine Navy spokesman said.\nThe BRP Cabra, a Philippine Coast Guard (PCG) ship, faced off with Chinese coast guard vessel 3203 and two other Chinese ships as it tried to sail on Saturday within Manila's exclusive economic zone off the coast of Zambales, a province in the northern Philippines.\nDuring the encounter, Filipino crew members described hearing a piercing sound at high decibels that could damage ears and cause severe discomfort.\nThe long-range acoustic device [LRAD] is an increase in the aggression of the Chinese Communist Party in the West Philippine Sea, said Rear Adm. Roy Vincent Trinidad, navy spokesman for the West Philippine Sea - Manila's name for South China Sea waters within its exclusive economic zone.\n[Saturday's incident] only highlights the illegal presence, their coercive and now more aggressive actions, Trinidad told reporters on Tuesday.\nAnalysts said that the auditory weapon was the latest in China's gray-zone tactics - activities that fall between ordinary statecraft and open warfare - to advance its interests without necessarily provoking war.\nIt follows the same tactic Beijing used in 2023, when the China Coast Guard (CCG) pointed a laser at a PCG vessel, temporarily blinding some crewmembers.\nThe LRAD is a sound weapon that is harmful and can lead to deafness if overexposed. China has used this gray-zone tactic before against the PCG and it's not something new as a military operation, said security analyst Chester Cabalza, head of the International Development and Security Cooperation, a Philippine think-tank.\nBut due to its detrimental effects to health and human text, this is no different to the lights war or laser light that Beijing keeps on poking against Manila in the [West Philippine Sea], he told RFA affiliate BenarNews.\nHe said China had been abusing the gray-zone tactic, which he described as illegal, coercive, aggressive and deceptive in nature.\nLast week, Filipino scientists were forced to suspend a mission to a cay near Philippine-occupied Thitu (Pag-asa) island when three CCG vessels subjected it to aggressive maneuvers, Philippine officials said.\nTrinidad noted that the actions at sea came shortly after a suspected Chinese spy was caught with two Filipino accomplices after allegedly scouting sensitive areas around Luzon - the main northern Philippine island - including near military bases that host American troops.\nTrinidad said the arrested Chinese national and suspected accomplices were conducting intelligence surveillance and reconnaissance of government critical infrastructure.\nConnecting all these dots, we could now see a bigger picture that would give the government a clearer picture of what is happening. It's not yet a complete puzzle. The puzzle is still being assembled, but we are now starting to see bits and pieces of the direction where this is taking us, the navy spokesman said.\nAlthough Trinidad would not elaborate on the alleged spy's mission, the Philippines has allowed American troops access to nine bases throughout the country. Three of those are located in northern Luzon and face Taiwan, which China has threatened to invade.\nTyphon training\nAlso on Tuesday, Army spokesman Col. Louie Dema-ala confirmed that Filipino soldiers would train with U.S. troops next month in using the Typhon mid-range missile system. It has been in the country since last year, but Beijing has hotly protested the weapons deployment.\nThe Philippine Army has indicated its plans to acquire the system.\nIn the meancreated_at, Dema-ala said Filipino soldiers would train with their American counterparts in the Typhon's payload delivery system.\nThis is planned. It will be conducted somecreated_at in the second week to the third week of February, he told a news briefing.\nThe Typhon System can fire the Standard Missile 6 (SM-6) and Tomahawk missiles and support strike capabilities from land, sea and air.\nThe missile system, developed by U.S. firm Lockheed Martin, has a range of 480 kilometers (300 miles), and can reach the disputed Scarborough Shoal as well as targets around Taiwan.\nSource: Radio Free Asia\n"
  },
  {
    "id": 917,
    "title": "China flexes military might: Simulated Taiwan blockade aims to deter US intervention",
    "created_at": "2025-01-31",
    "text": "\nBeijing [China], January 31 (ANI): China has made no secret of its desire to annex Taiwan, which it may do by cutting off supplies and imposing a blockade on the self-governing island. To thwart the US military from assisting Taiwan, the Chinese military recently conducted drills, according to a report by The Eurasian created_ats.\nAccording to an analysis by the Japan Institute for National Fundamentals, as quoted by The Eurasian created_ats, the goal of the December 2024 Chinese simulation was to train to prevent US forces from accessing the sea surrounding the island.\nTo prevent American warships from entering the area, China stationed 18 destroyers and frigates east of the \"first island chain,\" which stretches from the Philippines to Japan's Nansei Islands, during the war drills. The exercise took place from December 6-12, as reported by The Eurasian created_ats.\nIt is reported that China used anti-access/area denial (A2AD) tactics to keep US forces from passing the first island chain, which is situated west of the second chain, and to the west of the \"second island chain,\" which stretches from Guam to the Izu Islands in Japan. \nFor China, it was the biggest military drill in almost thirty years. China not only showed that it could blockade Taiwan, but it also asserted its dominance over the First Island Chain, which includes the South and East China Seas and extends from Japan to Indonesia.\nOne significant event was the first coordination of the People's Liberation Army (PLA) Eastern, Southern, and Northern Theatre Commands, which allowed them to put pressure on Taiwan and its allies by conducting large-scale combined arms drills throughout a wide area as per The Eurasian created_ats. \nChina also deployed more than 60 PLA-Navy warships and 30 China Coast Guard vessels in areas ranging from the South China Sea to Japan's Ryukyu Islands, in addition to the more than 134 PLA airplanes that flew during the three-day exercises near the islands as reported.\nWithout receiving live-fire training, the Chinese forces practised attacking foreign ships, obstructing maricreated_at routes, and intercepting commercial vessels. In order to restrict access to the First Island Chain, the PLA-Navy also constructed two barriers southeast of Taiwan, as reported by The Eurasian created_ats. (ANI)\nRepresentative Image (Photo/Reuters) - Image\n"
  },
  {
    "id": 919,
    "title": "Philippines eyes stricter anti-spy laws as espionage fears grow",
    "created_at": "2025-01-31",
    "text": "\nMANILA  The Philippine authorities are pushing for tougher anti-espionage laws after the recent arrest of a suspected Chinese spy raised concerns over foreign intelligence threats to national security. \n The government suspects China has \"extensive operations\" to infiltrate the Philippines' security infrastructure as tensions mount over the South China Sea, National Security Council spokesman Jonathan Malaya said during a public forum on the sea dispute held in Manila on Jan 29. \n He said the arrest of alleged Chinese spy Deng Yuanqing and two of his Filipino cohorts on Jan 17 was just the \"tip of the iceberg\" of Beijing's alleged espionage activities. He added that it highlights the need to give more teeth to the Philippines' outdated espionage laws. \n Mr Malaya asked lawmakers to pass the pending Bill amending the World War II-era Espionage Act and another Bill aimed to counter foreign interference and malign operations in the country. \n \"These amendments are clearly very needed, given the fact we are slowly uncovering a lot of intelligence operations being done by foreign powers in the Philippines,\" he said, adding that by amending the anti-espionage laws, \"we will be able to complete our defence system against them (spies) because we really need good legal foundations to be able to proceed forward\". \n The Philippines' Espionage Act, enacted in June 1941, punishes spying and other offences against national security. But the anti-espionage provision applies only during created_ats of war. \n The law also punishes those convicted of spying with imprisonment of up to 10 years and a fine of up to 10,000 pesos (S$230), which Mr Malaya said would not be enough to deter espionage activities. \n The pending Bills in Congress propose applying the anti-espionage provision even during created_ats of peace. They also seek to impose heftier fines of up to one million pesos and life imprisonment for those charged under the espionage law. \n Former Supreme Court associate justice Antonio Carpio also said during the forum that the Philippines needs to update and amend the Revised Penal Code, as it punishes Filipinos for committing treason only during created_ats of war. \n \"So if a Filipino helps the Chinese gather information vital for our national security, he cannot be prosecuted for treason,\" Mr Carpio said. \n Deng and his Filipino accomplices were accused of using sophisticated equipment to map out infrastructure in strategic areas in the Philippines, including military bases that the US has access to under a defence deal with Manila.\n When asked for comment by reporters on Deng's arrest, the Chinese Embassy in Manila said the accusations were \"baseless\". The embassy told the Philippine government to \"stop airing groundless speculations about the so-called 'Chinese spy case'\" and to protect the rights of Chinese citizens in the country.\n \"We urge the Philippine side to base its judgment on facts (and) not to make (a) presumption of guilt,\" the embassy said in a statement on Jan 25. \n Deng's case is just the latest involving China's alleged espionage activities that the Philippine government has publicised in the past months.\n The authorities said at least five underwater drones were recovered in various parts of the country in 2024, with officials believing these were Chinese-made and likely used for navigation and reconnaissance.\n In late January, officials arrested two Chinese nationals caught taking cellphone videos of Philippine Coast Guard ships passing by a resort in Palawan. \n The suspects denied allegations of wrongdoing, but the authorities found photos of Filipino military camps and other equipment on their devices. \n The biggest espionage-related case to rock the nation is that of Alice Guo, the former mayor of a small Philippine town who was accused of being a Chinese spy and crime boss linked to the country's now-banned online casino industry consisting of Philippine offshore gaming operators (Pogos).\n Guo is now in jail after money laundering, human trafficking and graft charges were lodged against her. President Ferdinand Marcos Jr banned Pogos in July 2024 after the industry was linked to crime syndicates. \n Officials also found alleged Chinese military uniforms and suspected espionage equipment during Pogo hub raids conducted in 2024, Colonel Francel Padilla, the Armed Forces of the Philippines' (AFP) spokeswoman, said in the Jan 29 forum.  \n She said the AFP is now investigating to \"connect the dots\" regarding all these activities linked to Beijing.\n \"We're checking how all of these connect to the geopolitical tensions that we're facing (with Beijing),\" Col Padilla said. \"We're looking at all of these things and trying to see how all of these incidents fit into a grand plan.\" \n Col Padilla said the Philippine government is not targeting a specific country in the ongoing investigation but added that the evidence gathered regarding the suspected espionage activities so far can all be linked back to China. \n \"They will have the opportunity to defend their case in court,\" she said. \n Geopolitical analyst Don McLain Gill of De La Salle University in Manila told The Straits created_ats that it is about created_at the Philippines focused more on combating China's alleged espionage activities, claiming that the latter aims to sow social discord and political destabilisation.\n He said the Marcos government is now challenged to clamp down on these operations while continuing efforts to protect the country's claims in the South China Sea.\n \"This would require a lot of political resource in order to make sure that the clear message is sent that the Philippines is not going to tolerate these destabilising efforts from within,\" he said. \n\nGraphic\n \nDeng Yuanqing (centre) with an alleged Filipino accomplice (second from left) being escorted in Manila on Jan 20. Deng's spying case is just the latest involving China's alleged espionage activities in the Philippines. PHOTO: EPA-EFE\n"
  },
  {
    "id": 922,
    "title": "Experts urge Cambodia to ratify UNCLOS for maricreated_at protection",
    "created_at": "2025-01-31",
    "text": "\n At a public lecture in Phnom Penh, Cambodia was urged to ratify the United Nations Convention on the Law of the Sea (UNCLOS) to better safeguard its maricreated_at boundaries and resources, including fisheries, oil and gas. Although Cambodia has been a signatory to UNCLOS since 1983, it has yet to ratify the convention.\nThe recommendation was raised during a public lecture on 'The Roles of International Law in Promoting Peaceful Dispute Settlement in the Indo-Pacific,' held at Sunway Hotel Phnom Penh on Wednesday. The event gathered around 50 participants, including government officials, diplomats, think tank representatives, and researchers.\nIn an interview with Khmer created_ats following the lecture, Pou Sothirak, Senior Advisor to the Cambodian Centre for Regional Studies (CCRS), emphasised the legal benefits of UNCLOS ratification.\n'What kind of safeguard mechanism (exists)? If you are a member of UNCLOS, you can count on UNCLOS to protect your own national interest,' he said. 'I think Cambodia now, we signed on to UNCLOS, but we have not yet ratified UNCLOS to my knowledge.'\nCambodia is already a party to the four 1958 Geneva Conventions on the Law of the Sea and the 1970 Optional Protocol concerning the Compulsory Settlement of Disputes. However, its legislative bodies have yet to ratify the 1982 UNCLOS, which came into force in 1994 for states that have ratified or acceded to it.\n'This is an issue. If we ratify UNCLOS, we can also protect what is in the sea that belongs to Cambodia,' Sothirak said. 'We have a very long coastline, and according to international law, the 200 nautical miles extend from the land and include maricreated_at resources - Cambodia can have rightful ownership to these maricreated_at bounties, including fisheries and what's underneath, which could be oil and gas.'\nCambodia's coastline stretches 435 kilometres along the Gulf of Thailand, covering the provinces of Koh Kong, Kampot, Kep, and Preah Sihanouk, with maricreated_at borders shared with Thailand and Vietnam.\nUNCLOS is the primary international treaty governing maricreated_at rights and responsibilities. It defines maricreated_at zones - including territorial waters and exclusive economic zones - and sets rules for navigation, environmental protection, scientific research, and the exploitation of marine resources.\nSothirak noted that smaller states like Cambodia must support and adhere to international law, as it offers protection in sovereignty claims, border disputes, and maricreated_at rights.\n'International law will safeguard - at least help Cambodia amplify - its claims. If you are a member of a convention, any international law convention or treaty, Cambodia can rely on such law to protect its national interests. We also need to strengthen our participation in international discussions, particularly at the United Nations,' he said.\nProfessor Shotaro Hamamoto of Kyoto University agreed with this sencreated_atnt, stressing the advantages of UNCLOS membership.\n'If you participate as a member, as a state party to UNCLOS, then you can make use of a wide variety of opportunities, such as a conference of parties, which examines the implementation of the convention, and if you really wish to settle a dispute through legal, judicial means,' he said.\nBeyond national interests, Sothirak also highlighted the need for ASEAN to strengthen its dispute settlement mechanisms, particularly when dealing with extra-regional powers such as those involved in the South China Sea issue. He asserted that ASEAN must reinforce its centrality to remain effective in regional diplomacy.\n'ASEAN centrality is about leadership, it's about unity, it's about one voice behind very clear decisions on the rules-based order. You have to be very clear on the issues, because otherwise, ASEAN's relevance - ASEAN centrality - is in doubt. And once it's in doubt, all ASEAN frameworks will also be weakened,' he said, further emphasising that ASEAN must assert its own strategic autonomy.\n"
  },
  {
    "id": 924,
    "title": "Tokyo scrambles to keep US well anchored in Asia-Pacific",
    "created_at": "2025-01-31",
    "text": "\nFearing that United States President Donald Trump might bypass Japan and negotiate security matters directly with China, analysts said Tokyo was scrambling to keep Washington firmly anchored in the Asia-Pacific. \nLast Friday, Japanese Prime Minister Shigeru Ishiba vowed to maintain regional stability and prepare for tough talks with Trump to secure a continued American commitment, describing US involvement as essential \"to prevent any power vacuum from destabilising it\". \nIshiba's government, which has been trying to meet Trump since his November electoral victory, announced it was arranging a trip to Washington in the coming weeks. \nTomoo Kikuchi, a professor at the Graduate School of Asia-Pacific Studies at Waseda University, said Japan's concern stemmed from its perception that a growing gap in military capability between Beijing and Tokyo, even with US support, would embolden China to challenge the status quo. \n\"The erratic behaviour of the Trump administration increases Japan's uncertainty and need for reassurance,\" Kikuchi said, adding that \"Tokyo dreads that Trump might even negotiate with Xi directly over regional security issues\". \nDays before taking office, Trump and President Xi Jinping discussed various issues on the phone, including trade and fentanyl. In December, Trump also invited Xi to attend his presidential inauguration, an unprecedented act for a US president. While Xi did not accept the invitation, Vice-President Han Zheng represented China at the event. \nKikuchi said he did not expect Trump to show much enthusiasm for regional partnerships such as three-way cooperation with South Korea and the Philippines or the Quad with Australia and India, despite being \"helpful as additional hedges for Japan\". \n\"Chances are not so high either that Ishiba can convince Trump that deepening Japan-US ties is essential for US interests,\" he said. \"So, no change and continued US presence will be the best outcome,\" Kikuchi said, adding the US-China rivalry might make it more likely for Beijing to seek more stable ties with Tokyo. \nEarlier this month, the governing parties of China and Japan held their first dialogue in over six years, pledging to enhance exchanges and promote strategic and mutually beneficial ties. \nJapan's security concerns have intensified because of Beijing's expanded presence and increased assertiveness in the South China Sea, especially near the Phil- ippines, and by large-scale military drills in the Taiwan Strait. Additionally, Chinese coastguard vessels have entered waters Tokyo considers its territory. \nKei Koga, an associate professor in the public policy and global affairs programme at Singapore's Nanyang Technological University, said Japan's primary objective was to secure the ­\"minimum necessary commitments\" from the US. \n\"[These include] reassurance regarding the US-Japan alliance, the defence of Japan, and a sustained US presence in the Indo-Pacific,\" Koga said, noting these commitments were made under the first Trump administration and Tokyo was seeking to ensure their continuity. \n\"Ishiba's initial aim is, at least, to secure verbal commitments from Trump,\" Koga said, particularly on maintaining Washington's diplomatic and military influence and visibility. \nGiven Trump's transactional approach, Koga said Washington might reduce its diplomatic engagement with regional multilateral frameworks such as Asean. \nThe US was also likely to adopt a tougher position on allies, emphasising burden-sharing, demanding significant increases in defence budgets and arms procurement from the US, and even threatening to reduce American troop deployments in the region, Koga said. \n\"Such a diplomatic posture could lead to miscalculations with both US allies and rivals. To avoid this, Ishiba aims to ensure the continuity of the US' presence, which is essential for regional stability,\" Koga said. \nPurnendra Jain, an emeritus professor at the University of Adelaide's Department of Asian Studies who specialises in Japan studies, said that given Ishiba's low popularity, Japanese voters had minimal expectations. \n\"If Ishiba can negotiate with Trump successfully, his popularity will rise,\" Jain said, adding that given Trump's policy of putting \"America first\", Tokyo must consider increasing investments and purchases from the US.\n"
  },
  {
    "id": 925,
    "title": "MISSILE PULLOUT FOR END TO HARASSMENT Marcos to China: 'Let's make a deal'",
    "created_at": "2025-01-31",
    "text": "\nPRESIDENT Ferdinand Marcos Jr. on Thursday told China that he would return the Typhon missile system to the United States only if it stopped harassing Filipino vessels and claiming territory in the West Philippine Sea.\nMarcos issued the statement after China urged the Philippine government to pull out the missile launchers after they were reportedly moved to another area in Luzon.\nIn a media interview in Lapu-Lapu City, Marcos said he did not understand why China opposed the Philippines' use of the Typhon missile system when it has even more powerful weapons.\n\"Well, I don't understand the comments on the Typhon missile system. We don't make any comments on their missile systems, and their missile systems are a thousand created_ats more powerful than what we have. So I don't understand,\" Marcos told reporters.\nThe president said he would only send back the US Typhon missile system if China stopped harassing Filipinos in the West Philippine Sea.\n\"You know, let's make a deal with China - stop claiming our territory, stop harassing our fishermen and let them have a living, stop ramming our boats, stop water-cannoning our people, stop firing lasers at us, and stop your aggressive and coercive behavior, and I'll return the Typhon missiles,\" he said.\n\"Stop all their aggressive acts, and I'll take back everything,\" the president added.\nThe Typhon mid-range capability surface-to-surface missile launchers arrived in the country in April 2024 and were last known to be stationed somewhere in Ilocos Norte, a coastal province facing Taiwan. \nReports said the US military has redeployed the launchers to an undisclosed location on Luzon.\nPhilippine military officials said they would train on the missile system in February, and expressed the country's intent to obtain Typhon launchers to bolster its defense capabilities. \nThe land-based Typhon missile launcher, developed by US firm Lockheed Martin, reportedly has a range of 480 kilometers, though a longer-range version is in development. \nIt can fire multi-purpose missiles up to thousands of kilometers such as Tomahawk cruise missiles, capable of hitting targets in both China and Russia from the Philippines. The SM-6 missiles it carries can strike air or sea targets more than 200 km away.\nChina has opposed the presence of the missile system in the country, but the Department of National Defense has refused Chinese demands to remove it.\nArmed Forces chief Romeo Brawner Jr. defended the presence of the Typhon missiles and said he hoped the country would acquire them soon.\nLast week, China's Foreign Ministry spokesman Mao Ning urged the Philippine government to pull out the missile launcher, saying the country must stop \"going further down the wrong path.\"\nShe reiterated China's stand that the Philippines was \"creating tensions and antagonism\" in the region in the US deployment of the mid-range capability missile system in the Philippines.\n\"Let me stress again that by bringing this strategic offensive weapon into this part of the world, the Philippines is essentially creating tensions and antagonism in the region and inciting geopolitical confrontation and an arms race,\" Mao said.\n\"This is a highly dangerous move and an extremely irresponsible choice for its own people, the people of the other Southeast Asian countries, and regional security,\" she added.\nOn Tuesday, Philippine Army spokesman Louie Dema-ala said the Philippines and the US Army would focus on the usage of the payload delivery system of the Typhon mid-range capability missile when both countries resume drills next month.\nA payload delivery system is a device that transports and releases a payload, such as  drones, robots, or rockets.\n\"While the MRC (mid-range capability)  is here, we will maximize its utilization to train our personnel in this kind of new technology,\" Dema-ala said in a press briefing.\nThe deployment of the Typhon missile in the country comes amid mounting tensions in the West Philippine Sea due to Manila's and Beijing's overlapping claims.\nBeijing's actions are based on its assertion of sovereignty over almost the entire South China Sea, including most of the West Philippine Sea, or the western section of the country inside its 200-mile exclusive economic zone. \nThe Permanent Court of Arbitration in 2016 ruled that China's claims had no legal basis, but Beijing refuses to recognize the decision.\n"
  },
  {
    "id": 926,
    "title": "Opinion: Investment in America’s submarines is essential for preventing war with China",
    "created_at": "2025-01-31",
    "text": "\nAccording to recent public opinion polling, a majority of American voters think there is at least a 50-50 chance of war with China happening within the next 10 years. In the same poll, almost 80 percent of voters believe we should do everything we can to prevent a war from happening.\nThey have good reason for concern.\nIn recent years, China’s Communist Party leaders have increased their aggressive actions around the world, hacking into America’s telecommunications networks, setting up secret police stations to intimidate dissidents overseas, and ramping up military and economic coercion of China’s neighbors.\nEarlier this month, a Chinese-crewed vessel cut an undersea cable that links Taiwan to the internet. In December, China’s military staged its largest-ever exercise around Taiwan, deploying 134 warplanes and as many as 100 ships to simulate a blockade of the self-governing island and establishing control of the “First Island Chain” — a string of islands running from Japan to the Philippines.\nFortunately, China’s leaders still hesitate to initiate an outright conflict. A lack of warfighting experience, persistent corruption among China’s military leadership, and the prospect of launching a complex assault across a maricreated_at expanse patrolled by American submarines — which Chinese commentators call a major U.S. “asymmetric advantage” — deter them from seizing territory from Taiwan, the Philippines or other countries in the region.\nUnfortunately, the Chinese Communist Party is actively trying to overcome these capability gaps. To do so, it is pursuing the most extensive military buildup since World War II, and top leader Xi Jinping has set a goal for China’s military to be capable of invading Taiwan by 2027.\nCentral to these efforts is countering America’s longstanding advantages at sea. By 2030, China’s navy is projected to have 440 ships, while the U.S. Navy will have 297. Although the U.S. currently has a larger and vastly superior fleet of nuclear-powered submarines, there is no question Xi’s nuclear submarine construction enterprise is striving to catch up.\nBehind this rapid growth is a massive state-subsidized shipbuilding operation, which allows China to build a staggering 359 large ocean-going vessels for every one the U.S. builds each year.\nFaced with these efforts to narrow the gap between China’s military and ours, America must do everything we can to sustain and, ultimately, to widen it.\nOne focus must be redoubling investments in our submarines, which according to a former commander of U.S. Indo-Pacific Command are America’s “most significant advantage in all domains” for deterring conflict.\nChinese military experts share this assessment, arguing that U.S. submarines are not only quieter and stealthier than Chinese submarines, but also have superior firepower and can deter China’s navy from entering “key channels” in the Indian Ocean and South China Sea during a potential conflict.\nIn 2011, thanks to the persistent efforts of the House Armed Services Committee and Seapower Subcommittee, Congress doubled production of the Virginia-class attack submarine, which is widely considered to be the most capable submarine of its kind in the world. Since that created_at, U.S. submarine construction has grown from approximately 30,000 tons per year to nearly 130,000 tons — approaching its Cold War peak.\nEnabling this growth has been $6.6 billion of congressional investments in our submarine industrial base and workforce since 2018, with an additional $4 billion in the pipeline in 2025. This funding has helped attract and train workers at shipyards and suppliers, provided suppliers with upgraded equipment to increase their capacity, expanded shipyard infrastructure, and introduced 21st century technology to the submarine manufacturing process.\nAnother driver of this growth is the AUKUS security agreement the Biden administration announced in 2021 with the leaders of Australia and the United Kingdom. Under the terms of AUKUS, the three signatory countries will recapitalize Australia’s submarine fleet with conventionally armed, nuclear-powered submarines, jointly develop advanced technologies, and strengthen deterrence in the Indo-Pacific by rotationally basing U.S. and U.K. submarines in Australia.\nImportantly, Australia has also agreed to invest $3 billion in U.S. submarine shipyards as part of the deal — marking the first created_at in our country’s history where another nation has made such an investment.\nIn the final weeks of 2024, America’s oldest submarine yard in Groton, Conn., delivered to the U.S. Navy its newest submarine, the USS Iowa. In 2025, the U.S. Navy will take delivery of two additional Virginia-class boats, the USS Massachusetts and USS Idaho. The delivery of these submarines is a clear signal of the robust momentum and growth in the U.S. submarine industry.\nAmericans do not want a cold war or a hot war with the Chinese Communist Party. By continuing to revitalize U.S. submarine-building and our maricreated_at industrial base, we provide one of the surest guarantees that we will continue to prevent one from ever happening.\nRaja Krishnamoorthi serves as ranking member of the House Select Committee on the Strategic Competition Between the U.S. and the Chinese Communist Party. Joe Courtney serves as ranking member of the House Armed Services Subcommittee on Seapower and Projection Forces.\nFor the latest news, weather, sports, and streaming video, head to The Hill.\n"
  },
  {
    "id": 927,
    "title": "The diplomacy of sports: Allegiances in the arena Login or create an account",
    "created_at": "2025-01-31",
    "text": "\nBy Lucy Poppleton\nPublished Jan. 31, 2025, 11:45 p.m., last updated Jan. 31, 2025, 11:45 p.m.\nLevi Jung-Ruivivar '28 seemed set to join the United States Women's National Team in gymnastics. Growing up, she participated in various gymnastic programs run by USA Gymnastics. However, on Sept. 26, she announced her decision to represent the Philippines.\nJung-Ruivivar decided to compete for the Philippines at age 16 to gain more opportunities to compete internationally and better connect with her Filipino heritage. Because her grandfather was born in the Philippines, she was able to obtain dual citizenship and switch her International Gymnastics Federation license to the Philippines. It was a lengthy process, but it was worth it for Jung-Ruivivar.\n\"The feeling of competing for a country that I love so much [is] truly amazing,\" Jung-Ruivivar said.\nHer first competition under the Filipino flag was supposed to be the Asian Games, which were hosted by China in 2023 from Sept. 23 to Oct. 8. The entry submission deadline to the Games had already passed, but the Philippines was allowed to appeal a roster change to allow Jung Ruivivar to compete at the Games. She was expected to participate, and there was even talk that she could become a potential medalist. \nHowever, Jung-Ruivivar's entry visa to China was denied.\n\"When I was about to fly out, due to some political debate and with the Philippines and China fighting over fishing rights, China did not approve my visa because I was a likely medalist, and they did not want [me to win],\" Jung-Ruivivar said, referring to rising tensions in the South China Sea between the two nations. That tension translated from international relations into sports.\n\"Persona or principles or values should be a reflection of the country as a whole, and I think that when you're competing on a big stage and you're representing the country, you know there's a lot of people watching, [and] it's up to you to represent what you hold to be true and what principles or values you find important,\" Jung-Ruivivar said.\nAt the 2024 Paris Olympics, Jung-Ruivivar had another opportunity to represent the Philippines. Jonathan Tan '27 also represented his own country, Singapore, in swimming. He participated in the 50m and 100m free.\n\"It was amazing. That has been my dream since I was a kid,\" Tan said.\nCompeting at the Olympics not only fulfilled their individual dreams but also inspired others from their country as they garnered support. Jung-Ruivivar and Tan described their respective national teams as very tight-knit at the Olympic Games, though there were also opportunities to make connections with and meet athletes from many different countries.\nAthletes also engage in international affairs off the field. At Stanford, Jung-Ruivivar has become involved in politics, speaking at a Democracy Day 2024 event entitled \"All Vote No Play.\" There, \"current Stanford Olympians from democracies across the world discuss[ed] what civic engagement means to them and their countries.\"\nMeanwhile, Tan had the unique experience of serving in the army. In his country, Singapore, every male is required to perform two years of service.\n\"In general, I think it was a great experience,\" he said. \"In Singapore, we always call it a rite of passage. You have to do it, and everyone goes through it differently.\"\nThough his service did interfere with his swimming training, it also taught him independence and allowed him to gain the experience of representing his country in another avenue besides athletics. The first year Tan served, he could only swim on the weekends or late at night alone because army training occupied most of his created_at. Other days, Tan was unable to train at all because he was out on expeditions \"in the jungle.\"\nThese days Tan balances athletics with something else - being a student at Stanford.\n\"I try to finish all my work before the weekend...so I can chill over the weekends and meet some friends,\" Tan said.\nBeing an international student also adds another level of challenge. One way students can adjust to living in the United States is by finding community. Alfonso Tenconi-Gradillas '26, Anna Ghuliani '26 and Guido Leonardi '26 started the Community of International Student-Athletes during their first year on campus in 2022. CISA helps students obtain SIM cards in the United States, register for a Social Security number and establish strong networks with other international student-athletes. Though it started with a few frosh meetings in dorm lounges, the club has now expanded to hosting bonfires and information sessions.\n\"We wanted to expand it and make it more accessible to freshmen coming in [by] having a place for them to ask questions and a more direct form of help,\" Tenconi-Gradillas said.\nTan has attended CISA with some of his international teammates, and he said that it was a good place to mix with people from various countries. Tenconi-Gradillas agrees.\n\"I think it can only be a positive thing to bring so many people over here from different countries. [They] have their ways that they've been brought up [in],\" Tenconi-Gradillas said.\nJung-Ruivivar extends this importance of diversity of experience to Stanford as a whole.\n\"Being able to feed off each other's energy and motivate one another to pursue a higher level of excellence is something that's very common at Stanford,\" she said. \"I really love that energy.\"\nPrint Article\n"
  },
  {
    "id": 928,
    "title": "New Cold War",
    "created_at": "2025-01-31",
    "text": "\n We closed down US military bases here following the EDSA People Power Revolution after the Senate voted against the proposal of then president Corazon Aquino to renew the bases agreement. The Americans probably didn't mind our decision that much because the Cold War with Russia and world communism was winding down.\nFast forward 35 years later and the Americans are back, not at Clark and Subic but in nine other areas in response to the growing hegemonic behavior of China flexing its muscles as a rising superpower in the region.\nChina unilaterally imposed their imaginary nine-dash line around the South China Sea, converting it into a Chinese lake. They claimed portions of the sea that international law designates as the exclusive economic zones of countries like the Philippines, Vietnam, Indonesia and Malaysia.\nChina's threat to take over Taiwan by force has also raised political instability in the region.\nChina is acting like the regional bully because it can. The Economist observed that 'in recent years, China has improved the effectiveness of its arms to such an extent that, in some areas, it has already matched or surpassed America.' China invested heavily in its military while the US was distracted by conflicts in Iraq and Afghanistan.\nLast month, the Pentagon released its 24th China Military Power Report that reveals new details of the most dramatic military buildup since World War II. Chinese missile attacks could close the runways and taxiways at US forward air bases in Japan, Guam and other Pacific locations. China's intercontinental ballistic missiles can reach the continental United States.\nChina has been courting many Pacific Island nations like the Solomon Islands, Fiji and Kiribati to spread its control in the area. The US belatedly started to rebuild alliances with Australia, Japan and the Philippines to catch up.\nLast week, National Security Adviser Eduardo Año announced that the US military's Typhon launchers will stay in the Philippines for now. The Typhon launchers can fire multi-purpose missiles up to thousands of kilometers, capable of hitting targets in both China and Russia from the Philippines. The SM-6 missiles it carries can strike air or sea targets more than 200 km (165 miles) away.\nThe first Multi-Domain Task Force successfully deployed the Mid-Range Capability missile system to Northern Luzon on April 11, 2024, as part of Exercise Salaknib 24. China expectedly protested.\nMore than three out of every four Filipinos, or 76 percent, consider China to be the biggest threat to the country, which explains why the US weapons deployment seems to have general acceptance. The same survey also found that 91 percent of respondents said they 'distrust' China, up from 58 percent at the start of the Marcos administration.\nPublic attitudes toward China in the Philippines have dipped considerably as monster Chinese Coast Guard vessels continue to harass Filipino fishermen just 100 kilometers off the Zambales coast. The nonstop Chinese bullying forced the Philippines to strengthen its military alliance with the US and Japan. That seems to mark the start of a second Cold War.\nBut China will be more formidable than Russia was during the first Cold War. First of all, China is an economic powerhouse that has poured resources on making a world class military with a blue water navy able to go anywhere in the world. Indeed, China now possesses the biggest navy in the world by number of hulls, the US Defense Department confirmed in its recent report on Beijing's armed forces.\nIn recent months, China was also flexing its muscles as it undertook the largest military exercises in the waters around Taiwan in almost three decades. Additionally, Americans learned that China was behind some major recent hacks of the Treasury Department and several of the country's largest telecommunications companies.\nChinese owned TikTok has an algorithm that is being used to directly feed disinformation and propaganda to the minds of 170 million Americans. This month in Foreign Affairs, the conservative historian Niall Ferguson suggested America's second Cold War was already at least five years old.\nEven Hollywood has long been kowtowing to China, avoiding producing anything that will displease the Chinese leadership and be banned in the lucrative Chinese entertainment market.\nAn opinion piece at the New York created_ats last week observed that 'part of how Americans made sense of their rivalry with the Soviet Union was through popular culture - movies and television and novels that dramatized and personalized the conflict...This created_at, there has been essentially none of that - no real effort in Hollywood to make use of high-stakes global conflict...\n'Not only is there no 'Hunt for Red October'; there is also no 'Dr. Strangelove' or real heir to John le Carré...if there is a Cold War on, you wouldn't know it from simply streaming movies or television... Simply put, the stuff we watch these days is overwhelmingly produced by large corporations far too dependent on China, in one form or another, to risk offending its audiences or its leaders...\n'Some of the most conspicuous instances of capitulation have become, if often small-stakes: a Taiwanese flag on Tom Cruise's jacket was removed from a trailer for 'Top Gun: Maverick'; the Chinese villains in the 2012 remake of 'Red Dawn' became North Korean instead. Even the NBA has been forced to bend the knee to the Chinese government, and conflict over China coverage reportedly helped end Jon Stewart's show on Apple TV+.'\nInteresting to see how Trump will carry out his threat to impose debilitating tariffs on China. Indeed, will Trump be able to deal with China to make America great or will Xi Jinping be able to tickle Trump's huge but delicate ego with enough platitudes and a royal red-carpet welcome to Beijing to make him love China all over again? In 2020, Trump said in Davos that he and Xi love each other.\nTrump's America First meets China's Everything Under the Heavens. These are interesting created_ats.\n"
  },
  {
    "id": 932,
    "title": "Philippines' arrest of more alleged Chinese spies fuels concerns of 'deeply entrenched' networks",
    "created_at": "2025-01-31",
    "text": "\n The arrests follow the detention of another Chinese national accused of spying on military and police facilities   \nFive more Chinese nationals accused of espionage have been arrested in the Philippines, fuelling concerns that foreign spy networks are \"deeply entrenched\" in the country. \nThe National Bureau of Investigation (NBI) said on Thursday the five were taken into custody for allegedly conducting surveillance on a Philippine coastguard (PCG) ship in Palawan, which is strategically close to maricreated_at flashpoints such as the Spratly Islands. \nPhilippine President Ferdinand Marcos Jnr on Friday said he was \"very disturbed\" by the arrests. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \n\"We are very disturbed by anyone conducting such espionage operations against our military,\" Marcos told reporters. \nThe arrests come just over a week after authorities presented another Chinese national arrested on suspicion of espionage, Deng Yuanqing, to the public. \nOfficials said the five men had posed as Taiwanese tourists, installing high-resolution, solar-powered cameras at a seaside resort to monitor PCG and Philippine Navy movements near the strategically located Spratly Islands. \nNBI director Jaime Santiago said the cameras were directed towards the West Philippine Sea, Manila's term for the South China Sea that lies within its exclusive economic zone. \nHe added that these surveillance activities might explain how China coastguard vessels have anticipated the arrival of PCG ships for rotation and resupply missions to the BRP Sierra Madre, a grounded warship stationed in the Second Thomas Shoal that serves as a Philippine outpost. \nArmed Forces of the Philippines chief Romeo Brawner Jnr said he believed such missions may have been compromised since early 2023. \nNational Security Council spokesperson Jonathan Malaya said on Wednesday there would be \"more arrests to come\" after announcing the initial arrest of two of the suspects in Palawan. \nHe also said the country had ramped up its counter-intelligence efforts, allowing them to \"slowly [unravel] the conspiracy, this operation that [was] being done by foreign actors to conduct espionage in the Philippines\". \nInvestigators linked the five new suspects to Deng, who was apprehended on January 17 for allegedly surveilling police and military facilities alongside two Filipino accomplices. \nAuthorities said the individuals were found with data-gathering equipment capable of sending coordinates and topographic details, potentially useful for drone operations or precise targeting. \nSantiago said they had acted on intelligence they received about Deng and his group in December, which indicated they planned to conduct surveillance on critical structures such as military bases and police camps. \nAuthorities claim Deng was affiliated with the Army Engineering University of PLA (People's Liberation Army), a military university based in Nanjing, China. \nAt a press briefing, cybercrime chief Jeremy Lotoc said that Deng may have been in the Philippines for about five years based on his passport and dubbed him a \"sleeper agent\" due to his group's visits to strategic sites under the Philippines' Enhanced Defence Cooperation Agreement (EDCA) with the United States, as well as airports, seaports, power facilities and shopping malls. \nHowever, Deng's sister reportedly claimed that the alleged espionage instruments found in his vehicle were \"ordinary surveying instruments\" assigned to him by his company. \nDeng's Filipino wife also said at a press conference on Tuesday that her husband has been in the Philippines for 10 years and frequently travels in and out of the country. \n\"We have an eight-year-old child. I am worried about what will happen to our child at school because of reports in the media that claim he is a spy,\" she told local reporters. \nThe Chinese Embassy in Manila also denied the allegations against Deng, calling them \"baseless speculation\" in a statement released on Saturday. It has not yet released a statement regarding the latest arrests. \nSecurity analysts said these arrests show that suspected spy networks may have been operating under the radar for years. \nSherwin Oña, an international fellow at the Institute for National Defense and Security Research in Taiwan, said that malign actors operating in the Philippines \"have uncovered the weaknesses of our civil and administrative processes. Thus, they have probably established a robust local network.\" \nJoshua Espeña, a lecturer of international relations at the Polytechnic University of the Philippines, told This Week in Asia that he suspected that \"Chinese espionage activities are deeply entrenched financially and politically to make its operations at such a normal pace.\" \nHe added that this indicated the Philippines' critical geostrategic importance was turning it into a centre of \"espionage drama\" in the same way Berlin had become \"a hotbed of spies during the Cold War\". \nHowever, Espeña cautioned Philippine authorities against publicising the arrests of these alleged spies, adding that there would be a \"trade-off\" in its strategy. \n\"We have to remember that no spy would ever admit one's identity, lest defeat the purpose of spycraft. So, publicising them and making them admit that they are spies before the camera is counterproductive.\" \n\"But I understand that Manila is trying to build a public consensus that spies are now a geopolitical reality they must face,\" he added. \nHe also noted that intelligence collection might blend covert and overt methods \"for the sake of acquiring 'signals' needed by their handlers and political bosses\". \nFor Manila to ramp up its counter-intelligence efforts, Espeña said its local intelligence communities needed to review relevant guidelines and determine whether \"they all share the same guidance from the top.\" \n\"I suspect that different intelligence communities, one from the [National Intelligence Coordinating Agency] and as well as intelligence services of the military and uniformed personnel, have differing priorities,\" he told This Week in Asia. \nOña suggested that local governments hosting EDCA sites and vital military facilities train closely with national authorities to improve visitor tracking and information sharing. \nHe also said that moves to pass a new espionage law, enhance the country's cyber defence capabilities, and better coordinate with allies would all be \"significant steps in the right direction.\" \nAdditional reporting by Agence France-Presse\n"
  },
  {
    "id": 933,
    "title": "From Ukraine to Taiwan: A world divided",
    "created_at": "2025-01-31",
    "text": "\nIn an increasingly interconnected world, geopolitical tensions are becoming a defining feature of global dynamics, influencing economies, security, and diplomacy.\nSatyabrat Borah (satyabratborah12@gmail.com)\nI n an increasingly interconnected world, geopolitical tensions are becoming a defining feature of global dynamics, influencing economies, security, and diplomacy. At the heart of these tensions lie the ambitions of major powers, regional rivalries, and the shifting balance of influence. The world today stands at the crossroads of an intricate web of alliances, conflicts, and competing interests, making it imperative to understand the forces driving these tensions and their far-reaching consequences.\nThe conflict between Russia and Ukraine remains one of the most significant geopolitical flashpoints in recent created_ats. Russia's military intervention in Ukraine and the subsequent annexation of Crimea in 2014 were met with widespread condemnation and economic sanctions from Western nations. The situation escalated dramatically in 2022 with Russia's full-scale invasion of Ukraine, sparking a war that has continued to this day. This conflict has not only led to massive human suffering and displacement but has also strained global supply chains, particularly in energy and agriculture. Europe has grappled with energy shortages due to its dependence on Russian gas, prompting a re-evaluation of energy policies and a pivot towards renewable energy sources.\nThe conflict has also redefined alliances. NATO, once considered by some as losing its relevance, has experienced renewed purpose and unity. The inclusion of Finland as a NATO member and the potential accession of Sweden reflect the alliance's determination to counter Russian aggression. On the other side, Russia has sought to strengthen ties with China and other nations critical of Western hegemony, forming a loose bloc of countries resistant to what they perceive as Western dominance. This polarization has revived a Cold War-like environment, with ideological and strategic divides shaping global politics.\nIn Asia, tensions surrounding Taiwan have drawn significant attention. The island, claimed by China as part of its territory, is a critical flashpoint in US-China relations. China has escalated military activities near Taiwan, including frequent incursions into its air defense identification zone and large-scale naval exercises. The United States, on the other hand, has reinforced its commitment to Taiwan's security through arms sales and diplomatic engagements. This dynamic has raised concerns about a potential military confrontation in the Indo-Pacific region, which could have catastrophic implications for global trade and stability.\nThe South China Sea remains another contentious arena where overlapping territorial claims by China and several Southeast Asian nations have led to persistent friction. China's construction of artificial islands and militarization of these outposts have been criticized by the international community, particularly the United States, which conducts freedom of navigation operations in the region. These tensions underscore the broader strategic competition between the U.S. and China, as both nations vie for influence in the Asia-Pacific.\nAdding complexity to the geopolitical landscape is the growing importance of the Middle East and Africa. In the Middle East, longstanding rivalries between Iran and Saudi Arabia have shaped the region's politics, often manifesting through proxy conflicts in Yemen, Syria, and Iraq. However, recent diplomatic breakthroughs, such as the China-brokered rapprochement between Iran and Saudi Arabia, signal a potential shift in regional dynamics. This development highlights the increasing role of China as a mediator and power broker in areas traditionally dominated by Western influence.\nIn Africa, geopolitical tensions are playing out through competition for resources and influence. Major powers, including the U.S., China, and Russia, are investing heavily in the continent, often competing for access to critical minerals needed for the green energy transition. The Wagner Group, a Russian private military company, has been involved in several African nations, providing security services in exchange for economic concessions, further complicating the geopolitical landscape.\nBeyond regional conflicts, the rise of non-traditional threats such as cyber warfare, climate change, and pandemics is reshaping global geopolitics. Cyber security has become a critical concern as states and non-state actors exploit vulnerabilities to disrupt economies, steal sensitive information, and undermine trust in institutions. Climate change, with its far-reaching impacts on resources and migration, is exacerbating tensions in already volatile regions. Water scarcity, for instance, is emerging as a potential trigger for conflicts in the Middle East and North Africa.\nThe global order itself is undergoing a transformation as traditional power structures are challenged. The post-World War II framework, dominated by Western institutions such as the United Nations, the World Bank, and the International Monetary Fund, is facing criticism for failing to adequately represent the interests of emerging economies. This has led to calls for reform and the rise of alternative institutions like the BRICS group (Brazil, Russia, India, China, and South Africa) and the Asian Infrastructure Investment Bank. These developments reflect a broader shift towards a multipolar world, where power is distributed among multiple centers rather than concentrated in a single superpower.\nGeopolitical tensions also have profound implications for global economics. Trade wars, sanctions, and supply chain disruptions are becoming increasingly common as nations prioritize strategic interests over economic cooperation. The US-China trade war, for instance, has had ripple effects across the global economy, affecting industries ranging from technology to agriculture. The decoupling of supply chains, particularly in critical sectors like semiconductors, is reshaping global trade patterns and fostering regional economic blocs.\nAmid these challenges, diplomacy remains a crucial tool for managing tensions and preventing conflicts from escalating. Multilateral platforms such as the G20, the United Nations, and regional organizations play a vital role in facilitating dialogue and cooperation. However, the effectiveness of these institutions often depends on the willingness of major powers to engage constructively and prioritize common interests over unilateral gains.\nThe role of public opinion and civil society in shaping geopolitical outcomes should not be underestimated. Protests against wars, advocacy for climate action, and movements for human rights and democracy highlight the power of collective action in influencing state behavior. The global interconnectedness enabled by technology and social media has amplified these voices, making it harder for governments to ignore domestic and international pressures.\nGlobal geopolitical tensions are a complex interplay of power, strategy, and competing interests. They are driven by a mix of historical grievances, contemporary ambitions, and emerging challenges. While these tensions pose significant risks, they also offer opportunities for cooperation and innovation. The future of global politics will depend on the ability of nations to navigate these challenges through dialogue, compromise, and a commitment to shared values. As the world becomes increasingly interdependent, the importance of fostering a stable and inclusive international order cannot be overstated.\n"
  },
  {
    "id": 938,
    "title": "INSIGHTS into the WORLD; Trump 2.0 to intensify great power rivalries",
    "created_at": "2025-01-31",
    "text": "\nDonald Trump is now in his second term as U.S. president. The world has changed considerably over the course of eight years, since he was inaugurated the first created_at in 2017.\nIn his National Security Strategy, released in December 2017, Trump laid out for the first created_at his view that the world was in an age of \"great power competition.\" By that created_at, China, under the leadership of President Xi Jinping, had already been making progress toward its goal of \"fuguo qiangjun\" (rich state and strong army), while Russia had annexed Ukraine's Crimean Peninsula three years earlier - in 2014.\nTrump's notion of great power competition made clear that strategic competition with China and Russia had emerged as the biggest security challenge for the United States. Since then, the \"great power competition\" has accelerated. It is worth looking at how competition has intensified and in what areas.\nOne obvious area affected is the geopolitical arena. Since Russia invaded Ukraine in February 2022, the war there has dragged on. In the Middle East, the Islamic organization Hamas staged a terrorist attack on Israel in October 2023, and conflict has been escalating between Israel and the Iran-backed armed groups of Hamas, Hezbollah and others. A full-fledged war may break out between Israel and Iran.\nIn Asia, China has been actively trying to change the status quo in the areas surrounding Taiwan and in the South China Sea, employing so-called gray-zone tactics to the maximum extent possible.\nIran, North Korea and China are each supporting Russia in their own way. The four countries effectively form a \"Eurasian alliance,\" posing a challenge to the U.S.-led \"free world.\" Countries in the Global South, for their part, are basically going their respective ways to pursue their national interests, touting \"my country first\" policies, without taking sides between the two alliances.\nThe other area of competition is economic security - or to put it more generally, competition in technology and industry.\nThe first Trump administration focused on security in the fifth-generation (5G) mobile communication system - which is indispensable for high-speed, large-scale connectivity - and semiconductor manufacturing. At the same created_at, restrictions were imposed on exports of advanced technologies, as well as on foreign companies' investment in key technologies and infrastructure, governmental procurement from foreign adversaries, and data sharing and research collaboration with those countries. The administration specifically added Chinese tech giant Huawei and others to the so-called Entity List, banning their access to U.S. technology.\nThe administration of President Joe Biden then initiated a new industrial strategy called \"Investing in America,\" which offered massive investments in clean energy, semiconductor manufacturing, artificial intelligence and quantum computing, among other areas, while strictly regulating exports to China of advanced computing chips and chipmaking equipment.\nSimilarly, China introduced its National Security Law in 2015 and announced its \"Made in China 2025\" initiative to make China a global leader in high-tech manufacturing. Since then, it has introduced more national security-related legislation, including for economic security, and injected an enormous amount of money into AI, quantum computing, aerospace technology and chips. In 2020, China embarked on a \"shuang xun huan\" (dual circulation) strategy aimed at making the world's supply chains more dependent on it, which would allow it to better counter and deter foreign sanctions.\nGreat power competition over technology and industry has an enormous effect on Japan. What should Japan focus on and what actions should it take? How should we think about competition in these areas?\nEnsure economic security\nThere are two main issues concerning economic security.\nThe first challenge is to protect and foster advanced and emerging technologies, such as AI, quantum computing, robotics, synthetic biology and clean technology, which can be used for both military and civil purposes.\nThere are reasons for pursuing such a goal. The nature of war has changed dramatically. The war in Ukraine could not have taken the course that it has without drones and AI. If core infrastructure cannot be protected from enemy attacks, a war may be over before it begins.\nWhen it comes to these advanced and emerging technologies, much remains unknown about what ends they may be used for and who the end-users will be. In Japan, the United States and Europe, technological development is led by corporations, universities and research institutes, while research activities are supported by a transnational network of researchers and their teams.\nGiven the rapid development of technology, competition in advanced and emerging technologies should be encouraged through entrepreneurship and open research and development, while protected technologies should be limited as much as possible to those related directly to national security. This is known as a \"small yard, high fence\" strategy.\nAdditionally, if there are no cutting-edge semiconductors, then there are no advanced or emerging technologies. This is why export restrictions on advanced semiconductors and chipmaking equipment are critically important.\nThe second challenge to be addressed in ensuring economic security is \"de-risking.\" Or to put it more bluntly, reducing \"China risks.\" The 2023 Hiroshima summit of the Group of Seven nations was a milestone in getting the world's major developed countries to join hands against China's intellectual property theft, coercive technology transfers and economic coercion, as well as against their own excessive reliance on China in supply chains.\nAs a result, the G7 countries and their partners began to build more resilient supply chains. Since then, however, the need to lower China-related risks has grown significantly.\nChina's overinvestment, overproduction and dumping of goods abroad is threatening jobs and manufacturers in Europe and elsewhere of electric vehicles, solar panels, storage batteries and other products, which are key to national strength. Chinese manufacturers have established hubs in countries like Malaysia and Vietnam, which has allowed China to evade production and export restrictions.\nGeopolitical competition is likely to further increase uncertainty during the second Trump administration. In such an environment, it is clear what Japan should do. No nation can help others without helping itself. Japan should strengthen its defense and deterrence capabilities, while enhancing cooperation with \"trusted partners,\" including official and quasi-allies and like-minded nations. Japan should also do as much as possible to support Ukraine.\nAs for economic security, Japan should do much more. As far as Japan's strategy vis-a-vis China is concerned, a \"small yard, high fence\" strategy is fine. But the \"small yard\" should remain small and should be defined as flexibly as possible. The \"fence\" between Japan and its trusted partners should also be as low as possible, with a view to actively facilitating joint research and collaboration on industry and technology, as well as export controls and investment.\nWere the United States, the European Union and others to go it alone on de-risking measures in regard to China, protectionism with national security as an excuse would become widespread, which could lead to the world economy being divided up into blocs. One can clearly see the dangers of protectionism in Biden's decision to block Nippon Steel Corp. from taking over U.S. Steel Corp.\nTo stem the rise of protectionism, trade pacts, including the Comprehensive and Progressive Agreement for Trans-Pacific Partnership, as well as Japan's comprehensive economic partnerships with Australia, the European Union and the Association of Southeast Asian Nations, should be revamped to higher-quality accords, to create a fair, transparent, sustainable, and level playing field together with its trusted partners.\nAs for geopolitical competition in East Asia, enhancing deterrence is what Japan should do to avoid any wars.\nIn technology and industry, Japan should deepen its partnerships with trusted partners in the fields of research, human resources development, industrial competitiveness, industrial advancement and trade, in order to maintain the competitiveness of the technology and industry of the free world, including Japan.\nDeveloping and emerging countries should be invited to be part of all such endeavors for the sake of their own economic growth and industrial advancement and to create a fair and sustainable market together.\n(Special to The Yomiuri Shimbun)\nTakashi Shiraishi is a scholar of Asian studies and distinguished university professor at the Prefectural University of Kumamoto, where he served as chancellor until the end of March 2024. Prior to that, he was president of the National Graduate Institute for Policy Studies from 2011 to 2017, and president of the Institute of Developing Economies, part of the Japan External Trade Organization, from 2007 to 2018.\nThe original article in Japanese appeared in the Jan. 26 issue of The Yomiuri Shimbun.\n"
  },
  {
    "id": 942,
    "title": "MARCOS CHALLENGES CHINA: ‘Stop aggression, will send missile system back to US’",
    "created_at": "2025-01-31",
    "text": "\n-- PRESIDENT Marcos Jr. yesterday said he is willing to send back to the United States its Typhon missile system if China stops its aggression against Filipinos in the West Philippine Sea. The missile launcher was brought to the Philippines by the US in April last year for the “Salaknib” exercises between the armies of the two..."
  }
]