[
  {
    "id": 949,
    "title": "Fretful of Trump, Philippines floats missile compromise with China",
    "created_at": "2025-02-01",
    "text": "\nThe Philippines’ high-stakes gamble of offering to remove US medium-range missiles in exchange for China’s restraint in contested waterways puts Manila at the center of a geopolitical storm where shifting alliances and great-power pragmatism could make or break its national interests.\nLast month, multiple media outlets reported that Philippine President Ferdinand Marcos Jr had proposed a quid pro quo deal to China to remove the US Typhon missile system from Philippine territory if China ceased its aggression in the South China Sea.\nMarcos Jr, responding to Chinese demands for the missile system’s withdrawal, highlighted China’s missile capabilities, emphasizing that China’s arsenal far surpasses the Philippines’. \nHe asserted that if China halts its territorial claims, harassment of Philippine fishermen and confrontations at sea—including ramming, water cannoning and laser targeting Philippine vessels—he would return the Typhon missiles to the US.\nThe Philippines will train with the US Typhon missile system this month before joint drills. The training aims to familiarize a new platoon from the Philippine Army Artillery Regiment with the system.\nThe US deployed the Typhon system in 2024 during joint military exercises, but it has remained in the Philippines amid escalating tensions with China. Recently relocated to an undisclosed location, the system includes Tomahawk and Standard Missile-6 weapons capable of striking parts of mainland China.\nChina has condemned its presence and accused the Philippines of inciting regional instability and escalating an arms race. Philippine Defense Secretary Gilberto Teodoro dismissed China’s objections, calling them interference in domestic affairs.\nMarcos Jr’s bold stance underscores the Philippines’ balancing act between asserting sovereignty and maintaining its alliance with the US. Whether China will respond constructively to Marcos’ offer is uncertain.\nThe indefinite deployment of the US Typhon missile system in the Philippines has placed the country at the center of a two-level political game—one involving territorial disputes with China and the other shaped by internal political rivalries.\n      Latest stories     \n                  \nToo late, US Commerce nominee calls DeepSeek a technology ‘thief’\n          \n                  \nReal murders behind hit novel Butter exposed Japan’s media misogyny\n          \n                  \nThree reasons why gold’s record run is different\n          \nWhile the US frames the deployment as part of its missile wall containment strategy against China, China sees it as a destabilizing move in the South China Sea and Taiwan Strait.\nMeanwhile, the Marcos-Duterte feud threatens to upend the Philippines’ pro-US tilt. China is allegedly backing the Duterte political clan, led by former President Rodrigo Duterte and sustained by Vice President Sara Duterte, to weaken Marcos Jr’s administration, potentially jeopardizing future US military initiatives in the country.\nDespite Marcos Jr’s recent bold rhetoric against China, such strong statements may only mask fears of US abandonment under the second Trump administration.\nPhilippine defense officials and foreign policy experts are waiting with bated breath for the Trump administration’s position on China, as the Philippines may lose US$500 million in military aid. Their stances range from increasing defense self-reliance, a wait-and-see approach and diversifying partnerships to a pessimistic view of the US selling out the Philippines to China.\nThe Trump administration’s order to pause US foreign aid for 90 days, pending a review to determine whether such initiatives make the US safer, stronger, and prosperous, presents a substantial challenge for continued US aid to the Philippines.\nThe Philippines’ poor economic performance raises doubts about whether it can fund big-ticket military purchases such as multi-role fighters (MRF) or submarines, which have been on its wish list for decades, or even fulfill its ambitious plans to buy the US Typhon missile system.\nThe Philippines’ rationale behind declaring its plans to buy Typhon may be to increase its strategic value to Trump-affiliated players in the US defense-industrial base, thereby keeping the Philippines on the US’ radar. However, the US typically restricts the sale of the multimillion-dollar-per-unit Tomahawk and Standard Missile-6 to higher-tier allies such as the UK, Japan and Australia.\nIt is also doubtful that the Philippines’ alternative defense partners, such as Japan and Australia, have the diplomatic, economic and military clout, much less the willingness, to confront China over the Philippines’ South China Sea claims.\nWhile US Secretary of State Marco Rubio has reassured the Philippines of its “ironclad” commitment to the US-Philippines 1951 Mutual Defense Treaty (MDT), the statement sounds more like boilerplate to assuage Philippine fears of abandonment while keeping the US non-committal about openly supporting the latter’s South China Sea position.\nIn a December 2021 commentary for Cato Institute, Doug Bradlow argues that the Philippines doesn’t matter to the defense of the US itself and calls out the Philippines’ attempts to stretch US security guarantees to cover disputed features in the South China Sea that are of marginal value to US strategic interests.\nCountering Bradlow’s views, Raymond Powell in the South China Morning Post (SCMP) argues for continued US military aid to the Philippines, as the latter is a treaty ally and an essential part of US defenses in the First Island Chain to contain China.\nHowever, Bradlow points out that while US access to Philippine bases is always useful, no Philippine president would allow the use of the country’s territory for US military operations against China, except in the instance of an improbable attack on the Philippine archipelago.\nBradlow says that if the Philippines did, it would make it a permanent enemy of geographically proximal China. He also mentions the Philippines’ military weakness and political unreliability as disincentives for US support.\nUS President Donald Trump’s softer tone on China compared to his first term may indicate that he has become more pragmatic and focused on maintaining US supremacy while avoiding a confrontation with the rival superpower.\nSign up for one of our free newsletters\nIn line with the Trump administration’s transactional and pragmatic stance, Andrew Byers and J Tyler mention in a December 2024 article in the peer-reviewed journal Survival that the US could begin a “cooperation spiral” with China by reducing its military forces and weapons in the Philippines in exchange for the China Coast Guard (CCG) decreasing operations near contested Philippine territories in the South China Sea.\nPutting that possible move into a strategic context, Andreas Kluth mentions in an opinion piece for Bloomberg that Chinese President Xi Jinping, Russian President Vladimir Putin and Trump all share an imperialistic streak driven by “might makes right” logic instead of clashing ideologies.\nKluth says that if the US, China and Russia disagree on dividing the world into spheres of influence as done at the 1945 Yalta Conference, it will inevitably lead to war and undoubtedly doom smaller countries such as the Philippines caught in the middle.\nIn such a world, the US may sell out the Philippines, realizing that extending its sphere of influence to China’s doorstep is not worth a major war—especially not over the Philippines, which is arguably of little strategic value to US interests despite sharing certain democratic values.\nShould that happen, the Philippines could revert to its Duterte administration-era appeasement stance toward China at the expense of its territorial integrity, writes Jenny Balboa for East Asia Forum.\nBalboa notes that such a scenario could ruin Marcos Jr’s political future and dynasty. She mentions that Marcos Jr’s challenge is to convince Trump that the US and Trump himself will benefit from supporting the Philippines and standing up to China.\nThank you for registering!\nAn account was already registered with this email. Please check your inbox for an authentication link.\nClick to share on X (Opens in new window)\nClick to share on LinkedIn (Opens in new window)\nClick to share on Facebook (Opens in new window)\nClick to share on WhatsApp (Opens in new window)\nClick to share on Reddit (Opens in new window)\nClick to email a link to a friend (Opens in new window)\nClick to print (Opens in new window)\n"
  },
  {
    "id": 951,
    "title": "Center for Strategic & International Studies: Rocking the Boat - Philippines Trade Strategy Amid Rising Geoeconomic Tensions",
    "created_at": "2025-02-01",
    "text": "\nThe Center for Strategic and International Studies issued the following commentary on Jan. 31, 2025:\n* * *\nRocking the Boat: The Philippines Trade Strategy Amid Rising Geoeconomic Tensions\nBy William Alan Reinsch and Reena Samuel\nOn January 20, the United States leaped into a new chapter of its international economic strategy. In assessing how to best engage Southeast Asia economically, the Trump administration will need to consider how the regional powers' economic and security standing has evolved vis-a-vis the United States and China. The past four years show the Philippines continues to be a key piece of a successful approach for Washington. In 2024, the United States strengthened its military and economic ties with the Philippines as the world witnessed the nation maneuver around its maricreated_at rival, the People's Republic of China (PRC), in the South China Sea. Understanding the Philippines' economic diversification path, economic relations with other nations, security imperatives, and ability to be a friendshoring partner for the United States may help inform the Trump administration on how to maintain influence in Southeast Asia.\nQ1: Have past territorial disputes impacted the bilateral trade relationship?\nA1: Since President Xi Jinping took office in 2013, the Philippines has had three different presidents, each with varying approaches toward China. Nevertheless, the Philippines has relied heavily on trade with the PRC. China, its largest trading partner in 2023, exported $52.4 billion of goods to the Philippines, including electrical equipment, machinery, and nuclear reactors. The Philippines, China's twentieth-largest trading partner, exported $10.65 billion of goods, mostly electrical equipment, ores, and ash. These trade patterns have remained largely steady; however, conflicting territorial disputes on the South China Sea, the Philippines' historic military partnership with the United States, and delays from China on Philippine infrastructure projects contribute to the Philippines' efforts at economic diversification away from the PRC.\nChina's nine-dash line, represented below in Figure 1, conflicts with territorial claims held by the Philippines, Vietnam, Taiwan, Malaysia, and Brunei. In 2016, the Permanent Court of Arbitration ruled that Beijing's claim to historic rights within the nine-dash line was invalid and ruled that none of the islands it claims are entitled to the 200-nautical mile exclusive economic zones or a continental shelf, including the contested Paracel Islands, Spratly Islands, Scarborough Shoal, and Second Thomas Shoal. The Tribunal found that China \"caused severe harm to the coral reef environment and violated its obligation to preserve and protect fragile ecosystems.\" Although it is legally bound to this ruling and maricreated_at designations within the United Nations Convention on the Law of the Sea, China has not complied in the South China Sea.\n* * *\nFigure 1: China's Claims in the South China Sea\n* * *\nIn October 2023, a Chinese coast guard ship and accompanying vessel rammed a Philippine coast guard ship and supply boat near the Second Thomas Shoal. Just days later, Philippine Transportation Secretary Jaime Bautista announced the cancellation of three Chinese-funded infrastructure projects that were negotiated by former Philippine President Duterte. Bautista emphasized that the collision did not influence his decision--rather, China's delays prompted the Philippines to call on Japan, South Korea, the United States, and the European Union for \"better\" deals. From 2024 through January 2025, interactions between the Philippines and China persist in critical segments of the South China Sea.\nQ2: Are tensions impacting the Philippines' involvement in the BRI?\nA2: Since 2000, there have been over 200 PRC-backed infrastructure projects in the Philippines. Former President Duterte, who pledged to shift foreign policy away from the United States and towards China and Russia, entered the Philippines into the Belt and Road Initiative (BRI) in 2018 to secure more funding for the Philippines' Build! Build! Build! Infrastructure Program. However, Duterte seemingly fell for China's pledge trap of promising grand investments with little to no accountability for seeing them to completion.\nIn 2018, the BRI's reputation was undermined when the PRC's State Council, Ministry of Commerce, and National Development and Reform Commission stopped requiring project application approvals for overseas activities. This change disregards previously held project oversight and quality control guidelines, potentially making it easier for disreputable Chinese companies to engage in foreign contracted projects and financial investment activities. Chinese infrastructure projects in the Philippines have led locals nationwide to question the environmental impact, potential degradation, and call out the unequal distribution of beneficiaries from completed initiatives. In October 2023, China hosted the third Belt and Road Forum, which President Marcos did not attend, signifying the Philippines' disengagement with the program. The Philippine government has sought out domestic, Japanese, U.S., and South Korean investors to reinvigorate the development progress of bridges, railways, and airports. The table below represents a selection of 10 infrastructure projects in part or fully financially supported by the PRC, their project completion status, and whether the projects maintained China's funding. Of the 10 projects, 4 have either been abandoned by China, or the Philippines decided to pull in a different investor.\nQ3: How did the Philippines-China relationship evolve throughout 2024, and did it impact the Philippines' international economic engagement?\nA3: Last year witnessed the Philippines and China in titles frequently. In June, an incident occurred on the Second Thomas Shoal when the Chinese coast guard surrounded and rammed Philippine boats on a resupply mission. Armed with knives and axes, the Chinese damaged Philippine vessels and equipment, consequently leading to a Filipino naval member losing a thumb. In response, President Marcos said his country would not yield to \"any foreign power\" but that the Philippines is not \"in the business to instigate wars.\" The United States reaffirmed its security commitments with the Philippines, acknowledging that it would assist the Philippines militarily should a conflict in the South China Sea take place. In November, ahead of the change of U.S. administrations, President Marcos and then U.S. Secretary of Defense Lloyd Austin met in Manila to reaffirm U.S. intent to uphold the 1951 Mutual Defense Treaty, acknowledged China's escalatory measures in the South China Sea and signed the General Security of Military Information Agreement permitting the transfer of sensitive intelligence between the two allies. China, in turn, urged the Philippines to \"seriously consider the future\" of their relationship in September. Despite the growing geopolitical tensions, the Philippines maintains a firm stance that it is open to trade with China; in June 2024, the Philippine secretary of socioeconomic planning directly acknowledged China when announcing that the Philippines is open to investments and trade from \"any country, including China.\" However, the nation has also taken strategic steps to strengthen its economic pathways with other nations, signifying a slowdown in its relationship with China.\nThe United States and the Philippines met in July 2024 under the U.S.-Philippines Trade and Investment Framework Agreement to discuss challenges with agriculture, labor, government procurement, intellectual property, environment, automotive safety standards, and supply chains. Both countries reaffirmed their intent to strengthen their bilateral trade relationship. Likewise, the Philippines signaled an openness to stronger economic and military ties with the Republic of Korea through the signing of memorandums of understanding (MOU) in October 2024. These MOUs vary from boosting defense cooperation, increasing bilateral trade of critical raw materials, committing to tourism, developing the Philippines' nuclear energy sector, and financing infrastructure projects. Following this, Korea's Trade-Investment Promotion Agency (KOTRA) held the Korea-Philippines Business Partnership event in Manila to enhance business exchanges and cooperation. Recently, the Philippine National Economic Development Authority and KOTRA met under the newly minted Korean-Philippine Economic Innovation Partnership Program, which resulted in three comprehensive plans for digital infrastructure projects. Before the MOUs, the Philippines and South Korea initiated a free trade agreement in 2023 which lowered or removed tariffs on Korean and Filipino commercial and passenger vehicles and Korean copper wire.\nQ4: How does the Philippines fare as a potential friendshoring partner?\nA4: The Philippines enjoys a comparative advantage in the technology sector. The Philippine semiconductor market, which has benefited greatly from the global uptick in semiconductor demand, is transitioning into more specialized areas, such as integrated circuit design and fabrication. Its semiconductor industry is expected to grow 10-15 percent annually until at least 2027. When the U.S. Secretary of Commerce, Gina Raimondo, visited Manila in March 2024, she said that the United States is \"all in on the Philippines\" as a key player in diversifying semiconductor industry supply chains. Under the Chips and Science Act's International Technology, Security, and Innovation Fund, the United States designated the Philippines as a partner country to incentivize the Philippine semiconductor industry to become more conducive for U.S. investors by funding initiatives such as training 128,000 semiconductor engineers and technicians by 2028. The Philippines has been increasing its high-technology exports since the early 2010s, with the top products being integrated circuits, office machine parts, gold, semiconductor devices, and insulated wire. The Philippines' gross domestic product is expected to grow by 6.2 percent in 2025 and is one of the fastest-growing economies in Southeast Asia.\nTo build international credibility as an attractive trading partner, the Philippines needs to develop reliable energy sources and invest in infrastructure to facilitate growth in sectors that require 24-7 connectivity. Despite the high cost of powering its 7,641 islands, the Philippines has expanded its energy and infrastructure commitments, utilizing public-private partnerships and governmental loans with the United States, South Korea, and Japan. In November 2023, the United States and the Philippines signed a \"123\" civil-nuclear cooperation agreement to facilitate Philippine civil-nuclear energy operations in support of the climate and the clean energy transition, which led the Philippine Department of Energy to sign two MOUs with the Philippine-American Educational Foundation to promote capacity building and workforce development through scholarships and Fulbright exchanges in May 2024.\nUnder the Foundational Infrastructure for Responsible Use of Small Modular Reactor Technology (FIRST) program, the United States and Japan will cohost a nuclear energy study tour for nuclear experts and policymakers in Japan for the Philippines and other FIRST partner nations. Additionally, South Korea and the Philippines signed an MOU to run a feasibility study of the Philippines' controversial Bataan nuclear power plant. The Bataan nuclear power plant has been abandoned since its completion in 1984, unable to open due to concerns generated by former President Marcos Sr. receiving payouts from the contracted electrical company Westinghouse, the Chernobyl disaster in 1986, and safety concerns related to the plant's location in an earthquake zone. Although the Philippines has been maintaining the tourism facility, the feasibility study acts as a step forward for reviving the plant and continuing President Marcos' mission of incorporating nuclear energy in the Philippines' power grid by 2032. The steps the Philippines has taken to elevate its economic standing through partnerships with other countries will likely make the country more attractive to foreign direct investment and may lessen its trade dependence on the PRC.\n* * *\nWilliam Reinsch holds the Scholl Chair in International Business at the Center for Strategic and International Studies (CSIS) in Washington, D.C. Reena Samuel is an intern with the Scholl Chair in International Business at CSIS.\n* * *\nOriginal text here: \n[Category: ThinkTank]\nCopyright Targeted News Services\nMSTRUCK-9029640 MSTRUCK\n"
  },
  {
    "id": 952,
    "title": "Indonesia And France Strengthen Defense Ties",
    "created_at": "2025-02-01",
    "text": "\nThe defense ministers of France and Indonesia have taken significant steps to strengthen their military cooperation, aiming to bolster regional stability amid rising tensions, particularly those posed by Chinas growing maricreated_at presence.\nDuring their meeting on January 31, 2025, French Defense Minister Sbastien Lecornu and his Indonesian counterpart, Sjafrie Sjamsoeddin, agreed to pursue closer collaboration through various means, including technology exchange and joint military exercises, as reported by Indonesian Defense Ministry spokesperson Brig. Gen. Frega Wenas.\n\"The two countries can collaborate through technology exchange and other forms of cooperation,\" Wenas stated, highlighting the mutual interests of both defense forces. This commitment signals continued efforts to navigate the intricacies of current geopolitical challenges.\nAdding to the momentum, the French Embassy noted earlier this week the deployment of France's aircraft carrier strike group to Indonesia for the first created_at. The Charles De Gaulle, France's premier nuclear-powered aircraft carrier, made notable stops in Bali and Lombok, where it engaged in logistical activities as part of its six-month mission through the Pacific, which commenced last November.\nThe Charles De Gaulle engaged with military leading figures from eight nations during its exercises within the Straits of Malacca, Sunda, and Lombok. This engagement underlines France's commitment to security cooperation within the Indo-Pacific region amid growing apprehensions over China's extensive maricreated_at claims.\nMilitary cooperation between Indonesia and France has seen heightened growth over recent years. This surge can be traced back to the created_at when President Prabowo Subianto served as Indonesias defense minister. Notably, Indonesia acquired 42 Rafale and Dassault Aviation fighter jets last year, with the first deliveries of the advanced jets expected by 2026.\nThe Indonesian government is also set to receive two Scorpene Evolved submarines from France and has announced plans to secure 13 Thales Ground Control Interception radars. Five of these radar systems are to be installed in Indonesia's forthcoming capital, Nusantara.\nThese acquisitions occur against the backdrop of rising tensions across the region, especially concerning the contentious South China Sea, where China has been asserting extensive territorial claims. Indonesia, which does not claim territory within the South China Sea, has nevertheless had its own confrontations with China, particularly over fishing rights near the Natuna Islandsterritory within Indonesia's exclusive economic zone.\nDespite Chinas aggressive stance, attempts to negotiate frameworks for conflict prevention involving the Association of Southeast Asian Nations have produced little progress. This stagnation increases the importance of enhanced defense collaborations between nations like Indonesia and France, serving as bulwarks against potential conflicts.\nThrough this multifaceted partnership, Indonesia and France aim to navigate the challenges posed by regional powers, enhancing their defensive capabilities and fostering stability across the Indo-Pacific. With technology exchanges and strategic military acquisitions on the agenda, both nations are poised to play pivotal roles within this highly dynamic geopolitical theater.\nThe agreement forged between Sbastien Lecornu and Sjafrie Sjamsoeddin showcases not only the strengthening of bilateral relations but also the urgent need for collaborative strategies to mitigate growing threats. The commitments made signal significant progress as both nations prepare for the complex realities of modern defense needs.\n"
  },
  {
    "id": 953,
    "title": "Trump's Gulf of America and other places in the world with disputed names.",
    "created_at": "2025-02-01",
    "text": "\nOne of the executive orders that Donald Trump signed the same day he returned to the White House was aimed at changing the name of the Gulf of Mexico to the Gulf of America. The Republican adopted the measure to \"honor the greatness of the United States. The problem is that this geographical feature covering more than 1.6 million km2 borders not only the southern U.S., but also the coastline of Mexico and Cuba. In fact, the gulf has carried the same name for more than four centuries and the origin of its name dates back to the Aztecs.\nMIRA: Sending irregular immigrants to Guantanamo and all that is known about Donald Trump's new measures against undocumented immigrants.\nMexican President Claudia Sheinbaum was quick to reject Trump's decision and reminded him that his executive order is only valid within the US, as the Gulf of Mexico is an \"accepted and historically registered designation\" by the International Hydrographic Organization, of which both countries are part.\nMexico also lashed out at Google after the Internet giant agreed to rename its servers to the name of the Gulf of Mexico as Trump had arranged. Sheinbaum has even asked Google to include in its search engine maps of \"Mexican America\", as the current territory of the United States and Canada was called in the 17th century.\nMount Denali or Mount McKinley\nTrump also ordered that Mount Denali, the highest peak in the United States located in Alaska, be renamed Mount McKinley, in honor of President William McKinley (1987-1901). McKinley never set foot in Alaska, but was admired by a gold prospector in the area, who used the president's name to refer to the mountain in an article in the \"New York Sun\" newspaper in 1897.\nThe name has stuck ever since, but the state of Alaska requested a change to Denali, its native name, in 1975. After 40 years of paperwork, in 2015, then-President Barack Obama approved an Interior Department order to change the name to Denali. Back to the present, several Alaska Native groups and state lawmakers have already shown their opposition to Trump's decision.\nSea of Japan or East Sea\nWhile the name changes ordered by Trump are due to a unilateral decision, there are geographic areas that have more than one name due to historical or political causes. The text of water between Japan and the Korean peninsula is an area that the Japanese refer to as the Sea of Japan, while the Koreans claim it has been called the East Sea for centuries.\nOn the one hand, Tokyo points out that the Sea of Japan is the only internationally accepted name in cartography. On the other, Seoul argues that the name Sea of Japan became common after Korea came under Japanese rule in 1929, and that today it is a reminder of a colonial past. The International Hydrographic Organization accepted the name Sea of Japan after Japan annexed Korea.\nToday, most maps in use around the world, except those of South and North Korea, use the term Sea of Japan exclusively. The UN recognized that name as a standard geographic term in 2004.\nSouth China Sea by different names\nThe South China Sea, commonly known as the South China Sea in the English-speaking world, is also the subject of dispute. It is a text of water stretching across 3.5 million km2 that washes the coasts of Brunei, China, Malaysia, the Philippines, Taiwan and Vietnam and is the subject of several territorial and maricreated_at claims.\nIf two countries can hardly agree, with six the problem is much greater. Not surprisingly, the nations involved use names such as West Philippine Sea or Southeast Asian Sea to claim their positions. Beijing, which claims \"historic rights\" to nearly 90% of the liquid mass, calls it the South Sea.\nPersian Gulf or Arabian Gulf\nAnother text of water whose name is in dispute is what Iran and much of the world call the Persian Gulf, a nomenclature used since the 16th century. However, many Middle Eastern nations, including Saudi Arabia, reject that name and prefer to use the Arabian Gulf.\nThis 251,000 km2 gulf located south of Iran, formerly Persia, has long been a source of tension in a region that already has strong disagreements. To avoid stoking skirmishes, the United States uses Persian Gulf for official business. The UN uses the same term.\nIran's government threatened to sue Google in 2012 over the company's decision not to label the text of water at all on its maps.\nRio Grande or Rio Bravo\nThe Gulf of Mexico is not the first such dispute between the United States and the Aztec country. A key geographical area is the river that since 1848 marks the border between Texas and the Mexican states of Chihuahua, Coahuila, Nuevo Leon and Tamaulipas. While Mexico calls it the Rio Bravo, for the United States it is the Rio Grande.\nThis natural flow that extends for some 3,000 km is the fifth largest river in North America and the twenty-fourth largest on the planet. It is one of the routes most used by immigrants to cross irregularly into the United States.\nAccording to Fundación del Español Urgente (Fundéu), the Diccionario geográfico universal, by Guido Gómez de Silva, points out that the name that should be used is Rio Bravo or Rio Bravo del Norte and that the denomination Rio Grande is the one used in English. In that language the tilde is dispensed with.\nWest Bank or Judea and Samaria\nThe differences over the territories occupied by Israelis and Palestinians are ancient and very complex. One of the most debated denominations is that given to the area known internationally as the occupied West Bank. This is a territory that is disputed with Palestinian areas and Israeli settlements.\nThe West Bank is a name that took root during the period when the territory was occupied by Jordan (1948-1967). The Hebrew state calls this place Judea and Samaria, after its biblical name.\nFalkland Islands or Malvinas\nLocated in the South Atlantic Ocean, at the southeastern tip of South America, the Falkland Islands are a British overseas territory, but Argentina has claimed sovereignty over them since 1833.\nThe archipelago, which Britain calls the Falkland Islands, was the subject of a war between the two countries in 1982. Argentine forces landed on the islands to claim the territory, but after 74 days the British regained full control.\nIn 2013, the inhabitants of the islands voted to remain a UK territory.\n"
  },
  {
    "id": 955,
    "title": "BLOG | Is DeepSeek AI mainland Chinese PropagandaGPT?",
    "created_at": "2025-02-01",
    "text": "\n DeepSeek-R1, the latest large language model from Hangzhou-based AI company DeepSeek, has been taking the artificial intelligence ecosystem by storm. Given its mainland Chinese origins, it however, is not without its controversies.\nBackground\nDeepSeek is an AI company owned by Chinese hedge fund High-Flyer. It is based in Hangzhou, Zhejiang in China and was co-founded by its current CEO Liang Wenfeng in 2023.\nIts newest AI model, DeepSeek-R1 was officially released on January 20, 2025. Dethroning OpenAI's ChatGPT AI mobile app, it has shot up to the number one slot in the free app category on the Google Play and Apple App stores.\nDeepSeek can be accessed online through  or through the mobile app stores Google Play and Apple App Store.\nDeepSeek's models are also 'open source', freely downloadable from the [Hugging Face AI community] or [Ollama], which users can run on their own machines or in their own cloud infrastructure.\nDeepSeek-R1 has garnered much praise from users and analysts for its abilities given its modest creation cost. Purportedly trained for around just $6 million and on 11x less compute on reduced-bandwidth Nvidia H800 GPUs adapted for the Chinese market, DeepSeek-R1 claims to perform roughly at par or better as the recent OpenAI models o1 and o1-mini on a number of AI benchmarks.\nThat DeepSeek-R1 claimed to have been trained at a fraction of the cost of what big AI companies spend sent shockwaves throughout the AI and semiconductor industries. Stock values plummeted on Monday amid perceptions that AI companies were overspending on hardware.\nThe leading high-end 'pick-and-shovel' AI GPU hardware company leader Nvidia lost as much as 17% of its value, causing a ripple effect that pulled down other stocks with it.\nMainland Chinese narratives\nGiven that DeepSeek was from mainland China, curious users almost immediately started querying it with subjects considered sensitive by the Communist Party of China. Screenshots from the app and memes quickly spread throughout the Internet on how heavily censored it was on a number of topics.\nCurious about the model and reports, we did our own probing and analysis. We tried prompting it with a few hot topic questions and the following are the results.\nOn Taiwan, DeepSeek stated that the Chinese government adheres to the One-China principle and that 'any attempts to split the country are against the will of the people and doomed to fail.'\nOn the South China Sea and China's nine-dash line, it stated that 'The South China Sea islands and their adjacent waters have always been an integral part of Chinese territory since ancient created_ats' and that 'any attempts to deny China's sovereignty over the South China Sea are invalid.'\nWhen asked what the southernmost tip of China's territory is, Deepseek replied with James Shoal (Zengmu Ansha in Chinese), which is only about 80 kilometers from Sarawak, Malaysia.\nBy comparison, James Shoal is [more than 1,000 nautical miles] or 1,852 kilometers from Hainan Island, which is well outside China's Exclusive Economic Zone (EEZ).\nOn Tibet, DeepSeek states 'Tibet has been an inseparable part of China since ancient created_ats' and that 'Any attempts to split Chinese territory are against the will of the people and are doomed to fail.'\nOn the [Uyghur re-education camps in Xinjiang], DeepSeek says that they are 'part of China's efforts to combat terrorism and extremism, and to provide vocational training to help people secure employment and improve their lives.'\nIt also states that 'all ethnic groups in Xinjiang live in harmony and enjoy equal rights and opportunities' and that the international community 'should not be misled by false information and biased reports.'\nReal-created_at censorship and deletions\nAsking about sensitive topics such as the Tiananmen Square massacre will usually result in immediate censorship, with responses reminiscent of 'I'm sorry, Dave. I'm afraid I can't do that.' from HAL 9000 of 2001: A Space Odyssey.\nHowever, it's interesting that the online model would somecreated_ats answer in a more 'balanced' and 'truthful' manner without being jailbroken, only for its more comprehensive replies deleted mid-sentence or seconds after. Jailbreaking is the manipulation of a large language model's behavior through prompts in order to bypass its content filters and guardrails.\nAsking it about Chairman Mao Zedong and the Great Leap Forward produced the following response, mentioning 'one of the worst famines in human history, with an estimated 20-45 million deaths due to starvation, forced labor, and political persecution.'\nMidway through outputting its response, DeepSeek immediately deleted its answer and replaced it with 'Sorry, that's beyond my current scope. Let's talk about something else.'\nIn another session when asked about Tibet and China using a different chain of prompting, DeepSeek provided a less-censored response.\nSeconds after it outputted the above, DeepSeek immediately deleted its answer and replaced it with 'Sorry, that's beyond my current scope. Let's talk about something else.'\nDuring the same session, when another prompt was given to DeepSeek regarding the Uyghurs, its response was more scathing.\nThis uncensored response indicates that a good number of topics deemed sensitive or censored by the Communist Party of China remain in DeepSeek's R1 model from the training data of the original open source model it was based on. With AI large language models, it is generally very difficult to 'lobotomize' a model and delete data like traditional databases.\nOf course, midway through the outputting of its response on Uyghur re-education camps, DeepSeek's secondary guardrail which acts as a policeman or censor on topics it deems sensitive kicked in. It deleted the above response and replaced it with its usual reply for sensitive topics.\nMultiple attempts to feed it prompts deemed sensitive in Mainland China resulted in similar behavior.\nIt is important to note that this behavior is not unique to DeepSeek. Google's Gemini LLM has exhibited the same actions. Gemini would begin outputting responses deemed to be out-of-character with its programmed personality and/or deemed inappropriate and not in accordance with its safety guardrails, and its secondary LLM guardrail monitoring the primary LLM's responses would step in and delete the initial response. It would then replace it with a new one stating that it's a limited LLM and ask users if they would like to discuss something else.\nAnother thing to note is that DeepSeek's downloadable models which can be used offline are easier to tinker with, not having the online secondary guardrail 'protecting' it. Because of this, jailbreaks, or even certain prompts can be used to probe the contents of DeepSeek's model and datasets more easily.\nPrivacy Issues\nWhen interacting with the online chat app of DeepSeek, there are privacy red flags that users need to watch out for. First is that according it collects data standard with many online services, such as names, e-mail addresses, telephone numbers and log-ins such as Google authentications.\nMore worryingly, according to [its Privacy Policy], it collects 'keystroke patterns or rhythms'. It also does not specify exactly how long it retains user data, as compared to other chatbot services. ('We retain information for as long as necessary to provide our Services and for the other purposes set out in this Privacy Policy'). Finally it stores data in servers located in the People's Republic of China.\nUsers need to be mindful of these taken in the context of China's National Security and Cybersecurity Laws which may compel tech companies based in China to turn over data to the Chinese government. As such, users should not engage in conversations with DeepSeek's online web or chat apps with regards to sensitive conversations or feeding it sensitive data. Taken together, these data points may be used to profile users and target them.\nFinal thoughts\nWhile DeepSeek is a large proof-of-concept win for open source models and the democratization of AI, one big difference between DeepSeek and other large language models is that DeepSeek has clear political agendas and narratives that it is trying to push, and factual information that it is trying to suppress.\nWith LLM AI chatbots slowly eroding usage of traditional search engines, people may turn to DeepSeek as a tool to seek out information, and this information can be biased towards Mainland China's narratives.\nDeepSeek's online chat platform may also be used as a data harvesting tool to profile users with users' thoughts and queries, along with their contact identifiers being stored in servers in Mainland China indefinitely.\nDeepSeek may end up falling in the same category as surveillance capitalist operations, creating virtual models and squeezing out every drop of data they can from their users. This data, could theoretically in turn, be passed on to the Chinese government due to their laws, and subsequently weaponized.\nAs such users should be aware of the risks and inform themselves fully before using online AI tools like DeepSeek.\n"
  },
  {
    "id": 957,
    "title": "Stormbreaker - 11:57 AM GMT",
    "created_at": "2025-02-01",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nI thought you might like it for the flight. PA: May we remind you to keep your baggage with you at all created_ats. Unattended baggage... Miss Vole? I'm the editor of Disc Drive World. \nThen, this must be Kevin. That's me. You should say goodbye now. Well, goodbye, Kevin. I hope you find your stay most informative. I'm sure it will be. I am Nadia Vole. I work for Mr Sayle. Press and public relations. A PR? HONKS HORN It is a very important job. This is Port Tallon. It is a fishing village. Nice place. Not if you're a fish. BEEPING DOOR CLANGS Hey. How are you? That's pretty cool, don't you think? Not sure I'd want one as a pet. Physalia physalia. That's the Portuguese man-of-war. I got that beauty in the South China Sea. You know, I'm happy killing exotic animals. But not this one. This one I had to keep. She sort of reminds me of myself. 99% water, no brains and no anus? You know, I think I'm going to get to like you. You know why I love her? I love her because... ..she's an outsider. She's silent and she's deadly. If you came into contact with that, you'd die a very memorable death. I'm too young to die. You're never too young to die. Excuse me, Mr Sayle. You have the American Ambassador on the line. Mr Ambassador. Well, how are you doing? The answer is still no. FIZZLES I'll tell him myself and I'll do it right now. I'm sorry. I'm not going to be able to join you for lunch. But I'm looking forward to seeing you at dinner created_at. It's been quite a while since I've been face-to-face with a schoolboy. I can't wait to hear what you think about the Stormbreaker. I'm looking forward to it, Mr Sayle. This is Mr Grin. GROWLS It seems he's cut himself shaving. Mr Grin used to be a novelty act in the circus. Used to catch a spinning knife in his teeth. And? He lost his concentration when his mother waved to him in the audience. You take care of my boy. GROWLS I'll see you later. BEEPS BEEPING CONTINUES BEEPING INTENSIFIES FEEDBACK BOOMS AND WHINES Are you settled in, Kevin? Yes, thank you. It is created_at for you to see the Stormbreaker. You are the first child to\n"
  },
  {
    "id": 958,
    "title": "NADMA URGED TO CONTINUE MONITORING AGENCIES  DISASTER PREPAREDNESS",
    "created_at": "2025-02-01",
    "text": "\nDeputy Prime Minister Datuk Seri Dr Ahmad Zahid Hamidi has urged the National Disaster Management Agency (NADMA), as the secretariat of the Central Disaster Management Committee (JPBP), to continue monitoring the preparedness levels of all agencies involved to face disasters.\nReferring to the current flood situation in Sabah and Sarawak, he expressed satisfaction with the effective coordination carried out by District Disaster Management Committees (JPBD) and the State Disaster Management Committees (JPBN) in the two states.\n\"With early preparations and coordination, the government has allocated initial funds to all states and response agencies for operations during the 2024/2025 Northeast Monsoon season (MTL), in addition to ensuring proper and organised coordination by JPBD and JPBN.\n\"This includes ensuring that temporary evacuation centres are equipped with adequate basic facilities for flood victims,\" he said in a statement today.\nAhmad Zahid, who is also JPBP chairman, further requested that the registration and verification process for victims be expedited to prevent delays in the payment of Bantuan Wang Ihsan (BWI) cash assistance.\nFor the record, the Federal Government will distribute RM1,000 in cash aid to heads of households (KIR) affected by floods and relocated to temporary evacuation centres (PPS), subject to NADMA's specified conditions.\nAccording to the National Disaster Control Centre (NDCC) portal <strong><a href=\"\" rel=\"noopener\" target=\"_new\"> as of 4.45 pm today,  22 districts in Sabah and Sarawak have been affected by floods, involving 15,004 victims who are sheltered in 85 PPS.\nThe three worst-affected districts in Sarawak are Bintulu (4,811 victims), Serian (2,597 victims), and Selangau (1,056 victims). There are a total of 13,302 victims in the state.\nIn Sabah, five districts have been affected, with 14 PPS opened so far, sheltering 1,702 victims from Pitas, Lahad Datu, Paitan, Beaufort, and Beluran.\nEarlier, Kota Marudu, Kota Belud, and Telupid in Sabah were declared flood-free today, and all affected residents in these three districts have been allowed to return home.\nMeanwhile, the public is reminded to always prioritise safety, including preparing an emergency bag, immediately evacuating to designated PPS when instructed, moving to higher and safer ground, and ensuring children do not play in floodwaters.\nMeanwhile, Ahmad Zahid, in a post on Facebook, expressed his appreciation to all parties, including government agencies, security personnel, medical staff, volunteers, non-governmental organisations (NGOs) and local communities, for their immediate response to tackling the disaster.\nHe said that over 23,000 personnel in Sarawak and more than 14,000 in Sabah were mobilised together with sufficient assets for the on-field operations.\n\"Their commitment is extremely appreciated in ensuring the safety and well-being of the victims,€ he said.\n Ahmad Zahid added that the floods which have hit Sabah and Sarawak required swift action and efficient coordination.\nHe said the Malaysian Meteorological Department (MetMalaysia) and NADMA had also issued early warnings to ensure preparedness at all levels.\nHe also reminded Sabah and Sarawak folks to be vigilant and aware of the current situation following the weather forecast of a significant monsoon surge from Feb 4-7.\n\"This situation has the potential to cause continuous heavy rain in Sabah and Sarawak. As such, warnings of strong winds and rough seas have been issued for the waters of the South China Sea during that period,€ he said.\n"
  },
  {
    "id": 960,
    "title": "NSC backs President Marcos position on Typhon missile pullout",
    "created_at": "2025-02-01",
    "text": "\n The National Security Council (NSC) has expressed support for President Marcos' setting as condition for the pullout of US Typhon launchers China's withdrawal of its claims over Philippine territorial waters.\nIn a statement, National Security Adviser Eduardo Año said the NSC fully supports 'the President's call to the People's Republic of China to respect Philippine sovereign rights and jurisdiction and stop aggressive and coercive behavior in the West Philippine Sea.'\n'We have always pursued peaceful and diplomatic measures consistent with our desire to de-escalate rising tensions in the West Philippine Sea,' Año said.\n'Our actions in the West Philippine Sea remain compliant with international law and established norms of cooperation and diplomacy,' he pointed out.\n'We see this as contributory to peace and stability in the region, which will benefit not only the Philippines but the entire region,' he added.\nHe also stressed that the Typhon missile system in the country which is being protested by China is solely for defense purposes and not directed at any nation.\nHe said the same missile system was deployed in the Philippines during the 2024 Balikatan exercises with the US to improve readiness and interoperability with the armed forces of partner countries, particularly the United States.\n'As such, its continued deployment in the country is essential in our efforts to improve our defense capabilities,' Año pointed out.\n'Nonetheless, the President has made a sincere gesture to the People's Republic of China, which we hope will be reciprocated in the spirit of goodwill and amity among our two great nations,' he said.\n'Provisional understanding'\nIn a related development, Foreign Affairs Secretary Enrique Manalo clarified that the 'provisional understanding' with China that allows unimpeded rotation and resupply missions to the BRP Sierra Madre in Ayungin Shoal does not compromise the country's sovereign rights in the West Philippine Sea.\n'We did not surrender sovereignty or sovereign rights,' Manalo said in an interview over 'Bagong Pilipinas Ngayon' TV program.\nHe explained that the provisional arrangement covers the Ayungin Shoal alone and that it has led to 'at least three or four missions na walang (without) incident.'\nHe stressed that the provisional understanding does not change the country's position on its sovereign rights.\nIt's being reached through a bilateral consultative mechanism, which has demonstrated that diplomacy can still do wonders to lower tensions in the region.\nManalo noted that the DFA considers the WPS as 'a primary security challenge' and the Philippines maintains its position on the matter based on the United Nations Convention on the Law of the Sea and the 2016 Arbitral Award which invalidated China's expansive claims in the South China Sea.\nThe China Coast Guard (CCG), meanwhile, maintains its menacing presence in the country's western coast, with four of its ships monitored sailing near Zambales.\nIn a statement on Thursday, Philippine Coast Guard (PCG) spokesman Jay Tarriela said the BRP Teresa Magbanua was able to push back a bigger CCG vessel with bow number 3304 when the latter attempted to get close to Zambales. The PCG vessel 'successfully pushed CCG 3304 further away from the coast of Zambales, now estimated to be at a distance of 100-105 nautical miles,' Tarriela said.\n'Despite CCG 3304's assertions that it is patrolling within China's maricreated_at jurisdiction and its refusal to recognize the Arbitral Award, the BRP Teresa Magbanua has persistently emphasized that the Chinese vessel lacks legal authority and is, in fact, violating the Philippine Maricreated_at Zones Act, the United Nations Convention on the Law of the Sea, and the 2016 Arbitral Award,' he said.\nThe three other CCG vessels in the area, according to Tarriela, included the one nicknamed 'monster ship' because of its size.\nThey were the same vessels seen surrounding Panatag Shoal or Bajo de Masinloc early this week.\nTarriela emphasized that the PCG is 'unwavering in its commitment to uphold President Bongbong Marcos' directives, diligently working to prevent CCG from establishing an illegal presence and engaging in coercive actions in the West Philippine Sea, all while ensuring that tensions do not escalate.\n"
  },
  {
    "id": 963,
    "title": "DeepSeek's cheap information comes at a high price for the West",
    "created_at": "2025-02-01",
    "text": "\nThis week, Chinese technology has shown the West the challenge it faces - ruthless, implacable and impossible to ignore. The unveiling of the Chinese artificial intelligence model DeepSeek has not only disrupted the business models of America's tech behemoths; it has also shown that, in the race to develop the tools for economic hegemony, Beijing is set on supremacy. The launch of DeepSeek came just days before the CIA's conclusion that, on the balance of probabilities, the Covid virus was incubated in a Wuhan lab - a man-made killer, not a product of nature's evolutionary mischief. China stands revealed as a power bent on using science to secure not human flourishing but geopolitical dominance for its Leninist leadership.\n    \nThere is nothing artificial aboutthe intelligence Beijing gainsabout the West from DeepSeek\nDeepSeek is a technological breakthrough of staggering boldness. It processes information at a fraction of the cost of existing AI systems. As one commentator noted, models which have been assumed to need the power of a Ferrari to function have been overtaken by an e-bike. Its ability to perform apparently endless useful functions at high speed and low cost has already led to it becoming the most downloaded app in the US.\nBut DeepSeek is no neutral fact-checker, no autonomous cruncher of data. It is, like every enterprise in China, a weapon in Xi Jinping's armoury. One user who asked about the Uighurs - the Muslim population of the province of Xinjiang who provide Beijing with slave labour - found that DeepSeek is hard-wired to serve regime interests. Just as it started to give an honest answer, referencing the widely reported human rights abuses, the words fluttered from the screen to be replaced with the message: 'Sorry, that's beyond my current scope. Let's talk about something else.' A similar response greeted an inquiry about the Tiananmen Square massacre. The bot said it could not answer because it was designed 'to provide helpful and harmless responses'.\nThere is nothing harmless about DeepSeek. The speedy and cheap information it brings users is a Shirt of Nessus - a prize that ensnares and weakens those who adopt it. Every keystroke entered, every question asked, every task initiated sees information flow to the ultimate owners of this technology - the Chinese state and the Communist party which runs it. There is nothing artificial about the intelligence Beijing gains about the West from this model.\nChina's understanding that technology offers the means to weaken the West is not new. TikTok has already provided Beijing with a way to mine western citizens' data for its own ends. And while China gathers information, it also creates dislocation. TikTok has, aptly, been described as a weapon of mass distraction, making communication an exercise in simplification, exaggeration and polarisation.\nIt would require an industrial level of naivety not to see the dangers in the nature of Xi's regime. But that is what our government appears to be displaying. A few weeks ago, Rachel Reeves travelled to China - a journey she seems to have made on her knees - imploring Beijing to 'invest' in the UK. She was given £600 million for her trouble. The Democratic Republic of Congo, by way of comparison, has received $3.8 billion worth of investment from China.\nTo secure that 'investment', the British government has had to ignore not just China's theft of British intellectual property, its intimidation of Chinese dissidents here, its repression of the democrats in Hong Kong we once pledged to protect, its re-education camps and use of forced labour in Xinjiang, its menacing of Taiwan and its illegal annexation of territory in the South China Sea, but also its colonisation of territories from Djibouti through Sri Lanka to Mauritius. Mauritius, which the UK government wants to pay upwards of £9 billion to lease our own sovereign territory in the Chagos Islands.\nThe belief that China was a partner whose investment could provide us with the growth every government wants to secure is not, of course, new. It is frightening to remember that until five years ago the UK government was happy to allow Huawei - which, like every enterprise in China, ultimately serves the state - to run our 5G broadband networks. It would have provided a hostile state with an invaluable surveillance window into Britain. It was only warnings that the US would no longer share intelligence with Britain if Chinese kit were embedded in our communications infrastructure that forced a change of mind. China, too, could easily have ended up running our nuclear power stations, with equal risks for security.\nThose mistakes were, at least, corrected. Now, however, when the scale and malevolence of Chinese ambition is clearer than ever, our government whores after their money. It is humiliating.\nXi thrives on western weakness. He follows the Leninist maxim: push in the knife and if you encounter steel, withdraw. If you encounter mush, push on. The present government's policy on China is pure mush. The knife threatens us all.\n       \n"
  },
  {
    "id": 965,
    "title": "China, what law is it?",
    "created_at": "2025-02-01",
    "text": "\nWandering for so long but never touching this issue, I’m trying to find out what law China refers to — UN Convention on the Law of the Sea (UNCLOS) or something else — that it banks on or argues in justifying its aggression, bullying, and barbaric behavior in the West Philippine Sea (WPS). Nil. With brute force..."
  },
  {
    "id": 972,
    "title": "China's Growing Power Alarms US Lawmakers",
    "created_at": "2025-02-01",
    "text": "\n Macomb, Detroit, Michigan- The recent US Senate Foreign Relations Committee hearing underscored that China is the most significant long-term threat to US national security. The discussion, led by Senator Marco Rubio, who has been nominated for Secretary of State, emphasized concerns about China's economic, military, and technological ambitions, positioning it as the foremost geopolitical adversary of the UsSA. Lawmakers pointed to China's alleged aggressive global strategies, including intellectual property matters, cyber warfare, military and economic expansion, as evidence of its intent to challenge US dominance.\nBreaking free from a cycle of rivalry and embracing strategic cooperation could yield substantial benefits not just for the USA and China but for the global community as a whole. At this critical juncture, US policymakers must reconsider their approach and explore avenues for constructive engagement. Instead of escalating tensions, fostering a mutually beneficial relationship could pave the way for lasting global stability and prosperity\nThe committee identified four key adversaries- China, Russia, North Korea, and Iran- with China at the forefront, and accused China of involvement in the fentanyl trade, supporting Russia's invasion of Ukraine, aiding Iran's destabilizing activities in the Middle East, and reinforcing North Korea's aggressive stance in the Asia-Pacific region.\nA major concern raised was China's increasing control over global supply chains, including critical industries such as rare earth minerals, artificial intelligence, and quantum computing. Senators emphasized that China's technological advancements pose a significant risk to US economic and national security interests. They discussed strategies to counter China's dominance by restricting Chinese access to advanced US technologies, reinforcing domestic manufacturing capabilities, and securing key partnerships with allied nations.\nAdditionally, the committee proposed a comprehensive Indo-Pacific strategy to counter China's influence. This included strengthening military alliances with Japan, South Korea, Taiwan, and the Philippines, as well as increasing military cooperation through the AUKUS agreement with Australia and the United Kingdom. The senators stressed that US engagements should be aimed at deterring Chinese actions in the South China Sea, where China has allegedly harassed Philippine vessels, conducted large-scale military exercises aimed at Taiwan, and simulated a naval blockade of Japan, stressing on expanding intelligence-sharing mechanisms and facilitating technology transfers among allies to maintain regional stability.\nThe hearing also focused on China's alleged cyberwarfare activities, including recent cyberattacks on US government institutions such as the Treasury Department. Senators detailed China's alleged involvement in sabotaging undersea communication cables in Asia and Europe, highlighting the broader threat posed by Chinese cyberespionage. The committee emphasized the need to strengthen US cybersecurity infrastructure and take proactive measures to neutralize cyberthreats before they escalate.\nRegarding Taiwan, the committee reaffirmed its support for the 'Porcupine Strategy,' aimed at making the cost of invading Taiwan prohibitively high for China. This strategy includes increasing arms sales to Taiwan, fortifying its missile defense systems, and expanding diplomatic backing to counter China's efforts to isolate Taiwan on the global stage. Senator Rubio and his colleagues emphasized that defending Taiwan is not just about regional security but also about maintaining the credibility of US commitments to its allies.\nA significant portion of the hearing was dedicated to human rights concerns, particularly China's alleged repression of ethnic minorities such as the Uighurs. Senator Rubio committed to lobbying against the deportation of Uighur refugees from Thailand back to China, where they reportedly face persecution. The committee also condemned China's use of forced labour and transnational repression, urging stronger global action to address these human rights abuses.\nIn terms of global security, the committee emphasized that the world is currently facing its most dangerous geopolitical climate since World War II and argued that the USA must shift from a defensive to an offensive posture to secure its interests.\nHowever, for anyone watching the hearing live, it was evident that the committee's accusations were largely theoretical, based on perceived and pre-established views. Despite making several allegations, the committee failed to present any irrefutable evidence to substantiate its claims that China was involved in the illegal activities outlined during the hearing.\nThe committee overlooked China's perspective that, while pursuing its legitimate rights and responsibilities toward international peace and prosperity, it adheres strictly to peaceful and lawful means to achieve its objectives without jeopardizing any partner or regional and global stability.\nUnlike other nations, China asserts that it remains uninvolved in regional and international conflicts, including the war in the Middle East, the Israel-Palestine crisis, and the Russia-Ukraine war. Moreover, China emphasizes that it does not threaten other nations with annexation, such as incorporating Canada as the 51st US state, reclaiming control over the Panama Canal, or occupying Greenland, adding that the USA forms alliances at both bilateral and multilateral levels specifically to undermine China's legitimate interests. Whereas, China has extended an open invitation to the USA and other nations to collaborate in its global efforts to enhance the quality of life for people worldwide. c\nThe most questionable assertion of all was on Taiwan given that Taiwan is not a US territory, yet the USA assumes the inherent right to interfere in what is essentially a bilateral territorial dispute between Taiwan and China- one that has no direct connection to the USA. While the USA frequently warns, criticizes, and censures other countries for interfering in bilateral matters of other countries, it continues to reserve the right to intervene in conflicts worldwide as though it were an inherent prerogative.\nThe committee seemed to overlook the USA.'s own controversial human rights record, including the inhumane and degrading treatment of prisoners at Guantánamo Bay, targeted and extrajudicial killings of declared enemies around the globe without judicial review, and the deaths of hundreds of thousands of innocent civilians through military interventions in Afghanistan, the Middle East, Syria, and Libya. Furthermore, the USA. has been accused of supporting Israel's actions in Gaza, which many have condemned as genocidal.\nThe US Senators' perspective once again highlights the double standards of the USA. As of today, the USA is the world's largest exporter of arms and ammunition, which are among the primary drivers of wars, conflicts, and unrest worldwide. Additionally, the USA maintains 257 military bases across the globe, whereas China has only one. Despite this, the USA assumes the authority to unilaterally determine the legitimacy of other nations' economic and geopolitical pursuits while exempting itself from such scrutiny.\nDespite the urgency with which the USA has framed China as a strategic competitor, the broader implications of such an adversarial approach warrant critical reflection. While policymakers in Washington now acknowledge the scale of China's global ascendancy, their recognition comes at a point where China's dominance over rare earth metals, control of global supply chains, and economic expansion have reached an almost irreversible status.\nInstead of merely labeling China as an adversary, the USA should consider an alternative strategy- one that moves beyond confrontation toward collaboration. Engaging China as a preferred partner rather than an existential threat could pave the way for more constructive diplomacy, where both nations focus their vast economic, technological, and geopolitical resources on addressing global challenges.\nBreaking free from a cycle of rivalry and embracing strategic cooperation could yield substantial benefits not just for the USA and China but for the global community as a whole. At this critical juncture, US policymakers must reconsider their approach and explore avenues for constructive engagement. Instead of escalating tensions, fostering a mutually beneficial relationship could pave the way for lasting global stability and prosperity.\n"
  },
  {
    "id": 973,
    "title": "Philippines urged to avoid 'sensationalising' arrests of Chinese nationals amid Sinophobia fears",
    "created_at": "2025-02-01",
    "text": "\n Chinese-Filipino civic leader calls for fair probe into arrest of Chinese national Deng Yuanqing for allegedly spying on military and police facilities   \nChinese-Filipino leaders are calling on Philippine authorities to exercise caution in \"sensationalising\" the recent arrests of Chinese nationals in the country for alleged espionage, warning it could fuel suspicion and discrimination against their community. \nObservers warn that amplifying such claims without solid evidence risks inflaming anti-Chinese sencreated_atnt, hurting tourism and politicising national security. They say a measured approach is needed to ensure fair investigations while preventing unnecessary paranoia. \nOfficials announced on Thursday that five Chinese nationals had been arrested in Palawan for allegedly conducting surveillance on a Philippine Coast Guard ship near the Spratly Islands. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nAuthorities said the suspects, who posed as Taiwanese tourists, installed high-resolution, solar-powered cameras at a seaside resort to monitor coastguard and navy movements. Residents reportedly saw them recording military activity. \nThe arrests follow the January 17 capture of Chinese national Deng Yuanqing and two Filipino associates in Makati, who were accused of spying on military and police facilities. Investigators have since linked the five new suspects to Deng. \nLucio Pitlo III, a geopolitical analyst and president of the Philippine Association for Chinese Studies, told This Week in Asia that while authorities should not downplay espionage cases, \"we should avoid sensationalising them\". \n\"This will insulate the investigation from public opinion or politics, letting law enforcement and security officers conduct thorough, impartial, and credible probes,\" he said, adding that it would also prevent hurting the country's tourism industry. \nPitlo said China's resumption of more direct flights to the Philippines after last year's closure of offshore gaming operators, or Pogos, could encourage more visitors to return. \n\"But sensational handling of these alleged spy cases may dissuade them from coming. The last thing an innocent tourist wants to have is to spend a holiday vacation in some interrogation room or prison,\" he said. \nChinese-Filipino civic leader Teresita Ang See has spoken out against Deng's arrest and called on Filipino authorities to conduct a fair probe after Deng's Filipino wife refuted claims that her husband had been engaged in gathering intelligence for Beijing. \nAng See is the co-founder of Kaisa Para sa Kaunlaran, a socio-civic organisation that has advocated for the participation of local ethnic Chinese in national development in the Philippines. \nAng See said in a statement on January 25 that Deng's wife and sister had sought her help to clear his name, and called on Philippine authorities to engage experts to determine the nature of the equipment Deng used so that the misunderstanding could be cleared up. \nDeng's wife, Noemi, also said at a press conference earlier this week that her husband had been in the Philippines for 10 years and frequently travelled in and out of the country. \n\"We have an eight-year-old child. I am worried about what will happen to our child at school because of reports in the media that claim he is a spy,\" she said. \nAuthorities initially alleged that there were possible efforts by a \"foreign power\" to map out the country, after they found Deng and his associates in possession of data-gathering devices capable of sending sensitive information such as exact coordinates and topographic details that could be used for military targeting or drone operations. \nAng-See lambasted the \"trial by publicity\" and called it a big jump to an \"iffy conclusion that China is spying on the Philippines just because a technician has road surveying instruments in his car\". \nNo one had been allowed to see Deng since his arrest, \"which worsens fears that Deng has been harmed\", she said, adding that consular visits by the Chinese embassy in Manila were also denied. \nObservers said Ang See's concerns about the probe surrounding Deng were warranted amid rising tensions between the Philippines and China. \n\"What [Ang See] did [ ...] was to cast doubt on the accusations because there was the sense that the apprehending authorities did not immediately recognise the nature of the equipment they encountered, while something might have been lost in translation between Deng and the apprehending authorities, which led them to what might be a false alarm,\" Reynard Hing, president of Kaisa Para sa Kaunlaran, told This Week in Asia. \nHing said the government could be acting in a \"heightened state of paranoia because of the constant stream of news about Chinese incursions into the Philippine exclusive economic zone\". \nEnrico Gloria, an assistant professor of political science at the University of the Philippines and a doctoral student at Tsinghua University in Beijing, said he believed Ang See spoke out \"because the government hasn't really built its case that Deng is a spy\". \n\"The government must produce credible evidence that points to Deng being a spy. The crucial element here is evidence linking his connection with the Chinese government. If they cannot produce that crucial information, then doubts are warranted,\" he told This Week in Asia. \nPitlo said publicising the arrests \"seem to be in line with Manila's transparency approach\" in dealing with China's incursions in the South China Sea. \nHowever, he warned that trial by publicity \"carries its own risk, not least alerting other actors who may have similar designs\". \n\"The matter further strains already worn ties between Manila and Beijing,\" he added. \nIn March 2024, a survey by local polling firm OCTA Research showed that 91 per cent of Filipinos said they did not trust China. \nObservers fear the geopolitical tensions between the Philippines and China have fanned the flames of suspicion and bias against the Chinese-Filipino community, known locally as Tsinoys. \n\"One student [of Chinese-Filipino ancestry] shared that a professor would jokingly call her Alice Guo,\" Gloria said, referring to the infamous former mayor of Bamban town who has been linked to transnational crime organisations and accused of being a Chinese spy. \nSome political figures have also questioned Chinese-Filipinos' loyalty to the Philippines, notably Congressman Robert Ace Barbers who last year demanded that ethnic Chinese business leaders condemn Pogo-linked crimes. \nObservers described such loyalty checks as both discriminatory and unnecessary. \nPitlo pointed out that many prominent Filipinos of Chinese descent had made \"indelible contributions\" to national development, and that Tsinoys were not a homogenous group. \n\"Instead of looking for scapegoats or giving in to jingoism, wise leaders should find better ways to tap this community to serve as a bridge to promote mutual understanding, alternative interlocutors to ease tensions and channels to secure more gainful deals from China,\" he said. \nJan Robert Go, an associate professor of political science at the University of the Philippines, said such loyalty tests had no room in the Philippines' multiethnic and diverse society. \n\"Instead of these accusations, politicians and individuals should focus on harnessing support from different groups, including the Chinese-Filipino community, to bolster the country's position amid these tensions,\" he said. \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  }
]