[
  {
    "id": 1013,
    "title": "China/Vietnam: China, Vietnam cause most South China Sea reef destruction: research",
    "created_at": "2025-02-03",
    "text": "\nRivals in the South China Sea developing artificial islands to back up their claims have destroyed nearly 7,000 acres (28.3 km2) of coral reefs, the Asia Maricreated_at Transparency Initiative, or AMTI, said.\nThe total area increased 800 acres (3.2 square kilometers) from 6,200 acres (25 square km) at the end of 2023.\nChina has caused the most reef destruction, having buried roughly 4,648 acres (18.8 square km) of reef since 2013, AMTI said in a new report, adding that Vietnam came in second with approximately 2,362 acres (9.5 square km) of reef, mostly in 2024.\nChina and Vietnam are responsible for 65% and 33% of reef destruction, respectively, it said.\nGovernment agencies in the two countries were not available for comment during the Lunar New Year holiday.\nThe think tank affiliated to the Center for Strategic and International Studies in Washington analyzed island building activities of rival claimants, including China, Vietnam, Malaysia, Taiwan and the Philippines, using commercial satellite imagery.\nIt said that dredging and landfill had caused irreparable damage to the marine habitat, as well as long-term changes to the overall structure and health of reefs in the South China Sea.\nMalaysia, Taiwan and the Philippines accounted for less than 3% of the damage.\nIn a December 2023 report, AMTI said that besides island building, giant clam harvesting by Chinese fishermen also damaged another 16,353 acres (66.1 square km) of coral reef.\nAccording to AMTI, Manila planned to initiate a second legal challenge against Beijing over environmental destruction in what it calls the West Philippine Sea, or part of the South China Sea within the exclusive economic zone of the Philippines, where it has jurisdiction over natural resources in the water and the seabed.\nThe Marcos administration, however, has yet to decide on a venue for the lawsuit.\nPre-emptive counter strike\nIn 2016, the Philippines won an arbitration case against China under the United Nations Convention on the Law of the Sea, or UNCLOS, but Beijing refused to acknowledge the ruling.\nAMTI's director, Greg Poling, suggested that Manila could file with the U.N. General Assembly a resolution demanding compliance with the 2016 arbitration, and another resolution seeking an advisory opinion from the International Court of Justice on issues such as whether China's behavior violates international treaties.\nAs with the first case, the Philippines would have to rely mostly on its own efforts as the ASEAN grouping's non-interference principle would prevent other countries in the region from intervening, said Philippine maricreated_at legal expert Jay Batongbacal.\nFor its part, China seemed to have been trying to counter the Philippines' complaints against their environmentally damaging activities since last year, the expert told Radio Free Asia.\nChina's coast guard held a special maricreated_at law enforcement briefing on Sunday, during which it accused other claimant countries of damaging the ecosystems in the South China Sea while praising its own efforts to protect the environment.\nSuch public briefings could serve as a pre-emptive counter strike against Manila's plan, Batongbacal said.\nChina Coast Guard' spokesperson Liu Dejun said in an interview with the Global created_ats newspaper that in 2024 Chinese law enforcement cracked down on illegal fishing, illegal waste disposal and hunting of precious and endangered wildlife, detaining more than 500 foreign vessels for various violations and confiscating 15 of them.\nA foreign fishing vessel was caught poaching coral, with more than 1,200 live coral specimens and large quantities of giant clam shells seized, Liu said without identifying the country that the ship came from.\nSource: Radio Free Asia\n"
  },
  {
    "id": 1014,
    "title": "Can Malaysia unite ASEAN in the South China Sea?; Whatever its strategy to manage the South China Sea dispute this year, Malaysian officials will need to devote attention to rebuilding trust among the ASEAN claimants, says Malaysian academic Thomas Daniel.",
    "created_at": "2025-02-03",
    "text": "\n                        As Malaysia chairs ASEAN this year, there are several difficult strategic-security issues that it is expected to address and mitigate. Almost all of them are legacy issues, stretching back years or even decades, with the South China Sea (SCS) dispute being of the most complicated and prominent. In fact, this dispute takes on added importance for Malaysia as one of the four ASEAN claimant states. \n                        However, it is not the disputes between the four members of ASEAN that generates titles but that of China’s claims and actions in the dispute. As a regional superpower that holds undisputed escalation dominance in the SCS, and has not been afraid to employ it, China has been strident on its expansive yet undefined claims. In recent years, China has worked to normalise the presence of its ships and aircraft in almost all areas of the SCS, including as far as the Natunas where it postulates overlapping claims with Indonesia. \n                        The fear that the SCS dispute will be subsumed by major power rivalry is one that resonates with most ASEAN member states, including Malaysia.\n                        The impact of great power rivalry\n                        Simmering tensions are manifested most acutely in the dispute over the Philippines’ attempt over the past year to resupply and reinforce its troops stationed at Second Thomas Shoal, a move opposed by China. The resulting highly publicised actions by both countries have seen aggressive maricreated_at manoeuvres, water cannon skirmishes, a severed finger and a “provisional arrangement” cobbled together after urgent diplomacy. It has increased worries among all stakeholders of a conflict, accidental or otherwise, that could draw in external powers like the US, a treaty ally of the Philippines. \n                        The nine-dash line shows China’s historical territorial claim in the South China Sea.\n                        The fear that the SCS dispute will be subsumed by major power rivalry is one that resonates with most ASEAN member states, including Malaysia. Actions like freedom of navigation and overflight exercises by the US and others, have a mixed reception in Southeast Asia due partly to the belief that China has used these to justify the militarisation of the reclaimed features it occupies. For much of 2024, the Biden administration repeatedly issued statements in support of the Philippines, while forward deploying naval units to support their treaty ally. The new Trump administration, which appears to be dominated by China hawks, has reassured the Philippines of its “ironclad” support, while criticising China. \n                        Trust among ASEAN countries a factor\n                        The possibility of the US choosing to increase pressure on China in the SCS as part of a wider strategy to renegotiate a new modus vivendi with China should not be ruled out. ASEAN member states would certainly feel the repercussions from that, which is another consideration for Malaysia in how it approaches the dispute. \n                        That said, a fundamental intra-ASEAN dynamic that the regional association and its Chair will have to navigate is the issue of trust, or the lack thereof. ASEAN member states, and claimant states in particular, simply do not trust each other due their own history of disputes, which predate China’s involvement. There are also more contemporary issues at play. \n                        While Anwar might have more friendly rhetoric when it comes to the bilateral relationship, there is no real evidence of a shift in the country’s SCS policy.\n                        Over the past year, for example, several analytical pieces on Malaysian foreign policy under Prime Minister Anwar Ibrahim have speculated about a growing alignment with China, one that he has repeatedly denied. While PM Anwar has repeatedly stressed that Malaysia has no major problems with China in the SCS, he has equally stressed that Malaysia will continue to uphold its interests in the SCS, especially in hydrocarbon exploration, and that the dispute needs to be solved peacefully in line with established international laws, especially UNCLOS. \n                        This has been a longstanding position of Malaysia, which has always sought to compartmentalise the dispute, so it would not affect the wider relationship. Beijing reciprocates this. While Anwar might have more friendly rhetoric when it comes to the bilateral relationship, there is no real evidence of a shift in the country’s SCS policy. \n                        Chinese President Xi Jinping meets Malaysian Prime Minister Anwar Ibrahim at the Great Hall of the People in Beijing, China, on 7 November 2024.\n                        Meanwhile, the perception by some in ASEAN that the Philippines under President Ferdinand Marcos Jr is too close to the US, hence drawing a particularly aggressive response from China on Second Thomas Shoal is an issue that stakeholders from Manila have had to respond to. While some dismiss this as a narrative propagated by China to diminish the agency of the Philippines, the nature of the security partnership between the latter and the US certainly feeds into the speculation which many officials do not openly discuss, with some exceptions. All ASEAN member states have been constant in their desire that both the Philippines and China find a more constructive way to manage the dispute. \n                        One thing is clear, whatever its strategy to manage the SCS dispute this year, Malaysian officials will need to devote attention to rebuilding trust among the ASEAN claimants. This might entail closer and more honest discussions among ASEAN claimants, and more empathy, leading to thoughtful language and framing from all ASEAN parties.  \n                        Black swan risks in South China Sea dispute\n                        Some might argue whether Malaysia is well placed to do this, but Malaysia has little choice. A fractious SCS does not benefit any of its littoral or claimant states, especially a state like Malaysia that is dependent on maricreated_at trade, hydrocarbon resources from the SCS. Don’t forget, Malaysia is also a non-contiguous state, physically separated by the SCS.  \n                        Additionally, Malaysia also has the role of ASEAN’s country coordinator for China until 2027, and thus, the onus on managing the Code of Conduct negotiations between ASEAN and China. Negotiations are now in the third reading of the single draft negotiating text, yet it remains to be seen if the targeted conclusion in 2026 would be achieved. A key consideration would be the final provisions and redress mechanisms in the code meant to govern behaviour in the SCS and minimise tensions. Fear among some observers in ASEAN member states that the Code might ultimately limit their leverage. \n                        An ASEAN member’s stint as chair will be judged on how it manages the difficult, high-profile challenges, somecreated_ats more than its other achievements. It is manifestly unfair, but perceptions do matter. \n                        Chinese Coast Guard vessels fire water cannons towards a Philippine resupply vessel Unaizah May 4 on its way to a resupply mission at Second Thomas Shoal in the South China Sea, on 5 March 2024.\n                        As with all country coordinators before it, Malaysia will strike an optimistic tone and seek to push the negotiations along. But it is cognisant that it would require an agreement of all member states. While the recent chair’s statement from the ASEAN Foreign Ministers’ Retreat held in Langkawi did not defer much from ASEAN’s usual language on the SCS, there were repeated mentions of UNCLOS as a universally recognised legal framework in which any and all maricreated_at activities, disputes and outcomes, including the Code of Conduct, must be based on. \n                        All signs are that Malaysian officials are reasonably confident when it comes to managing the dispute as they commence the rotational role of ASEAN chair for 2025. While it is not business as usual, Malaysia’s consistent position on its national and regional interests are not expected to create many waves. \n                        It will be in elements of the dispute that Malaysia has no control over — the dynamics between Philippines and China, whether Beijing suddenly decides to dial up pressure on all claimants, or perhaps even in how the US and other external stakeholders chooses to approach the SCS — which is where possible black swan development will come from. \n                        An ASEAN member’s stint as chair will be judged on how it manages the difficult, high-profile challenges, somecreated_ats more than its other achievements. It is manifestly unfair, but perceptions do matter. Malaysian officials know this and know that no small amount of deft diplomacy is needed as chair of ASEAN in 2025. \n                        Related: The South China Sea in 2025: More of the same, possibly worse | Typhon missile system: Philippines strengthens stance on South China Sea | [Big read] Malaysia leads ASEAN: Will Anwar deliver?\n                        This handout photo taken on 11 January 2025 and released on 12 January by the Philippine Coast Guard (PCG) shows a Chinese Coast Guard ship sailing some 60 nautical miles (111 kilometres, 69 miles) west of the main Philippine island of Luzon while being monitored by Philipine Coast Guard ship BRP Teresa Magbanua (not pictured).\n"
  },
  {
    "id": 1015,
    "title": "China/United States: Philippines: Marcos to China: Stop aggressive acts, I'll return US missile system",
    "created_at": "2025-02-03",
    "text": "\nPresident Ferdinand Marcos Jr. clapped back at China's criticisms of the deployment of the United States' Typhon missile system to the Philippines, stating that he would be willing to have the military hardware pulled out of the country if Chinese aggression in the West Philippines Sea (WPS) stops.\nIn a media interview in Cebu City Thursday, Marcos addressed China's objections to the missile system, emphasizing that Manila had not commented on Beijing's much larger missile arsenal.\nI don't understand their comments on the Typhon missile system, Marcos said.\nWe don't make any comments on their missile systems and their missile systems are a thousand created_ats more powerful than what we have.\nThe President then proposed a deal with China: halt its aggressive actions and territorial claims over the Philippines, and in exchange, the Philippines would consider recalling the missile system.\nLet's make a deal with China-stop claiming our territory, stop harassing our fishermen and let them have a living, stop ramming our boats, stop water-cannoning our people, stop firing lasers at us, and stop your aggressive and coercive behavior, and I'll return the Typhon missiles, Marcos said.\nTigil nila yung ginagawa nila, ibabalik ko lahat 'yan (Stop all their aggressive acts and I'll return everything), he added.\nThe remarks come amid ongoing tensions in the South China Sea, where China has continued its maricreated_at assertiveness, including incidents of harassment against Filipino fishermen and coast guard personnel in contested waters.\nThe Philippines has repeatedly raised concerns over China's military presence and actions in the region, which Manila deems as violations of its sovereignty.\nThe US deployed the Typhon missile system to the Philippines in April last year as part of the Balikatan military exercises, and has reportedly stayed in the country since.\nThe move has drawn the ire of China which repeatedly called for its withdrawal.\nFilipino soldiers will reportedly train on the US military's intermediate range missile system during unilateral army drills next month. - PNA\n"
  },
  {
    "id": 1016,
    "title": "Combat readiness patrols staged to reinforce control over Scarborough Shoal",
    "created_at": "2025-02-03",
    "text": "\nThe People's Liberation Army (PLA) has carried out combat readiness patrols in waters and airspace surrounding a ­disputed South China Sea shoal, the latest in a series of exercises to reinforce its control of the area. \nThe PLA's Southern Theatre Command said on Saturday, the day after the latest exercise, it had been stepping up naval and air patrols around Scarborough Shoal - known as Huangyan Island in China - since January, strengthening its maricreated_at and airspace control and management in the area. \n\"[These efforts are aimed at] resolutely safeguarding China's national sovereignty and security, and maintaining peace and stability in the South China Sea,\" it said.  \nScarborough Shoal is a group of tiny, low-lying rocky islets in waters claimed and controlled by China. But the shoal lies within the Philippines' 200-nautical-mile exclusive economic zone (EEZ) and is also claimed by Manila, which calls it Panatag Shoal. \nOn Friday, Philippine President Ferdinand Marcos Jnr said China should respect the country's sovereign rights and jurisdiction, and stop its \"aggressive and coercive\" behaviour in the West Philippine Sea - Manila's name for South China Sea waters that lie within its EEZ. \nThe shoal is a source of tensions between the two countries, with Manila protesting last month over what it described as the \"continued illegal presence and operations\" of Chinese coastguards.  \nIt is one of several South China Sea islets and reefs contested by Manila and Beijing. The disputed features also include Second Thomas Shoal and Sabina Shoal. \nThe two countries have also been at odds over the US ­military's deployment of the Typhon missile system in northern Philippines since April.  \nThe deployment has alarmed Beijing because the system covers not only the South China Sea but also the Taiwan Strait. \nThe US and the Philippines are long-created_at treaty allies. They claimed the aim of the Typhon deployment was to support training for joint combat readiness. \nBeijing has demanded Manila remove the missile system, saying it was \"inciting geopolitical ­confrontation and an arms race\". \nIn a video posted on January 19, Yuyuan Tantian, a social media account affiliated with state broadcaster CCTV, said the PLA's combat readiness patrols in the South China Sea had become routine. \nIt said the PLA had deployed many types of aircraft in its patrols around Scarborough Shoal, ­indicating China's control over the South China Sea airspace was becoming \"more systematised\". \nIt said bombers faced a high risk of interception and could not operate independently, making fighter jets essential in providing cover in the waters, while airdrops by transport aircraft was crucial in sustaining frontline troops for prolonged operations. \nIt added these activities would improve the PLA's overall combat strength and demonstrate China's determination to uphold its sovereignty in the disputed waters.\n"
  },
  {
    "id": 1017,
    "title": "Philippines deploys coast guard plane to check Chinese ships near Pangasinan",
    "created_at": "2025-02-03",
    "text": "\nThe Philippine Coast Guard (PCG) on Sunday said it had deployed an aircraft to check the “illegal presence” of two Chinese vessels 63 kilometers from the coast of Pangasinan province facing the South China Sea in the country’s north.\nIn a statement, the PCG said its Islander aircraft confirmed the presence of the China Coast Guard (CCG) vessels with bow numbers 3301 and 3104 at 9:30 am on Sunday.\n“Notably, the CCG vessels did not respond to the radio challenge issued by the PCG,” it added.\nIt said two 44-meter PCG vessels — BRP Cabra and BRP Bagacay — were dispatched to Bolinao, Pangasinan, “to address the illegal presence of the China Coast Guard.”\nThe vessels reinforce the Philippine government’s position against the “normalization of illegal patrols” by China within the Philippines’ exclusive economic zone in the South China Sea.\nOn Saturday night, the Philippine Coast Guard said BRP Teresa Magbanua had “successfully maneuvered” to drive CCG 3304 further away from the Zambales coastline.\nThis prompted China to replace CCG 3304 with CCG 5901, China’s “monster” ship, the PCG said.\n“The crew aboard BRP Teresa Magbanua demonstrated remarkable courage and resolve, remaining undeterred by the presence of the massive CCG 5901,” it said.\nBRP Teresa Magbanua, the Philippines’ biggest coast guard ship, can displace 2,265 tons of water, compared with 12,000 tons for China Coast Guard ship 5901, the largest coast guard cutter in the world.\nThe PCG said the actions of the Chinese vessels are illegal violate the United Nations Convention on the Law of the Sea (UNCLOS), to which China is a signatory.\n“The PCG reaffirms its commitment to the President and the Filipino people, ensuring that our dedicated personnel will continue to protect Filipino fishermen, uphold our maricreated_at rights, enforce international law and work towards the de-escalation of tensions,” it said.\nThe Philippine Coast Guard last week said its biggest ship had been issuing hourly radio challenges to CCG 3304 near the Zambales coast.\nThe Philippines has accused China of intimidating Filipino fishermen near Scarborough Shoal and normalizing its “illegal presence” after Beijing sent the monster ship into its exclusive economic zone (EEZ) on Jan. 4.\nChina, which claims sovereignty over most of the South China Sea, has repeatedly accused Philippine vessels of encroachment on its territory. Bilateral ties are at their worst in years after repeated confrontations and heated diplomatic rows.\nA United Nations-backed court in the Hague voided China’s expansive claims in the South China Sea in 2016, as it ruled the shoal is a traditional fishing ground for Filipino, Chinese and Vietnamese fishermen.\nTeresa Magbanua replaced the 44-meter vessel BRP Cabra, which arrived at Subic Port on Jan. 28 to unload the text of a Filipino fisherman that it recovered a day earlier.\nThe PCG on Monday night accused China Coast Guard 3304 of shadowing its ship that was rescuing the fisherman’s fishing boat. It said BRP Cabra navigated through heavy waves to retrieve the text using its crane.\nTensions between the two nations have worsened in the past year, with Manila accusing Beijing last month of using a long-range acoustic device (LRAD) against its vessel near the Zambales coast.\nDuring their 10th consultation, representatives from both sides agreed to continue the conduct of rotation and resupply missions to Second Thomas Shoal and sustain the de-escalation of tensions in the area, the Department of Foreign Affairs said last month.\nThe Philippines grounded BRP Sierra Madre, a Word War II-era vessel, at the disputed shoal in 1999 to assert its sovereignty.\n"
  },
  {
    "id": 1018,
    "title": "USS Carl Vinson strike group departs Thailand following hull-scrape incident",
    "created_at": "2025-02-03",
    "text": "\nFeb. 3—The USS Carl Vinson and its strike group recently steamed out of Thailand, where two of the aircraft carrier's escorts scraped hulls.\nPrior to their departure, the guided-missile destroyer USS William P. Lawrence and the guided-missile cruiser USS Princeton were involved in an allision — meaning the struck vessel was not moving — according to U.S. 7th Fleet spokeswoman Lt. J.g. Sarah Merrill.\nThe incident occurred Jan. 27, the same day the carrier strike group pulled into Laem Chabang, Thailand, she said by email Monday.\n\"No injuries occurred, and a full analysis of the damage is in progress,\" Merrill wrote. \"We are unable to provide further details at this created_at due to the ongoing investigation.\"\nThe William P. Lawrence struck the Princeton, USNI News reported Friday.\nBoth ships appeared to depart Friday with the Carl Vinson and a third escort, the guided-missile destroyer USS Sterett, USNI reported.\nThe strike group's five-day stopover primarily included cultural exchanges, community relations events and tours intended to \"enhance cultural understanding and cooperation between the two countries,\" according to a Friday news release from Carrier Strike Group One.\n\"Port visits like this are a testament to the vital importance of the U.S.-Thailand Alliance and Partnership that contributes to peace, stability, and prosperity in the Indo-Pacific region,\" Rear Adm. Michael Wosje, the carrier strike group commander, said in the release.\nWosje and Capt. Matthew Thomas, the Carl Vinson's skipper, met Jan. 26 aboard the aircraft carrier at sea with U.S. Ambassador to Thailand Robert Godec and Phumtham Wechayachai, Thailand's deputy prime minister and minister of defense, according to photos posted online by the ship Jan. 27.\nAdditional guests included Thailand's Defense Forces chief, Gen. Songwit Noonpackdee, and the commandant of the Thai marine corps, Rear Adm. Nirat Tagoodruar, Carl Vinson spokesman Lt. j.g. Jack Scypinski said by email Monday.\nThe allision was not mentioned in the news release.\nAfter leaving Thailand, the strike group sailed to the South China Sea, where it was conducting \"routine operations\" as of Sunday, according to a series of photos posted that day to the Defense Visual Information Distribution Service.\nThe William P. Lawrence was sailing alongside the Carl Vinson in the South China Sea on Sunday, according to two of the photos.\nOnce at sea, the Carl Vinson on Saturday began a series of routine flight operations by F-18 Super Hornet fighters, MH-60S Seahawk helicopters and E-2D Advanced Hawkeye early-warning and control aircraft, according to the photos.\n\"While underway in the South China Sea, USS Carl Vinson conducts flight operations on a routine basis to promote U.S. dedication to regional stability, highlight the U.S. Navy's enduring power projection capability, and maintain a free and open Indo-Pacific region for all nations,\" Scypinski wrote.\nThe following day, the carrier was replenished at sea by the dry cargo ship USNS Carl Brashear.\nScypinski declined to comment on future operations for the strike group, citing security concerns.\n© 2025 the Stars and Stripes. Visit www.stripes.com. Distributed by Tribune Content Agency, LLC.\n"
  },
  {
    "id": 1019,
    "title": "Philippines/China: Philippine president offers deal to China: Stop sea aggression and I'll return missiles to US",
    "created_at": "2025-02-03",
    "text": "\nPhilippine President Ferdinand Marcos Jr. offered on Thursday to remove a U.S. missile system from the Philippines if China halts what he called its \"aggressive and coercive behavior\" in the disputed South China Sea.\nThe U.S. Army installed the Typhon mid-range missile system in the northern Philippines in April last year to support what the longcreated_at treaty allies described as training for joint combat readiness.\nChina has repeatedly demanded that the Philippines remove the missile system, saying it was \"inciting geopolitical confrontation and an arms race.\"\nAsked by reporters about China's criticism of the missile system, Marcos said he did not understand the Chinese position because the Philippines does not comment on China's missile systems which \"are a thousand created_ats more powerful than what we have.\"\n\"Let's make a deal with China: Stop claiming our territory, stop harassing our fishermen and let them have a living, stop ramming our boats, stop water cannoning our people, stop firing lasers at us and stop your aggressive and coercive behavior, and we'll return the typhoon missiles,\" Marcos told reporters in central Cebu province.\n\"Let them stop everything they're doing and I'll return all of those,\" he said.\nChinese officials did not immediately comment on the Philippine leader's remarks.\nThe U.S. Army's mobile Typhon missile system, which consists of a launcher and at least 16 Standard Missile-6 and Tomahawk Land Attack Missiles, was repositioned about two weeks ago from the northern Philippines to a strategic area nearer the capital, Manila, in consultation with Philippine defense officials, a senior Philippine official told The Associated Press.\nThe Philippine official, who spoke on condition of anonymity because of a lack of authority to discuss the sensitive issue in public, said the U.S. missile system is now nearer an area where Chinese and Philippine coast guard and navy forces have been involved in increasingly tense faceoffs in the South China Sea.\nTomahawk missiles can travel over 1,000 miles (1,600 kilometers), which puts parts of mainland China within their range. The missile system will remain in the Philippines indefinitely, the Philippine official said.\nChinese Foreign Ministry spokesperson Mao Ning said last week that the Philippines is \"creating tensions and antagonism in the region and inciting geopolitical confrontation and an arms race\" by allowing the U.S. missile system to be positioned in its territory.\n\"This is a highly dangerous move and an extremely irresponsible choice,\" Mao said.\nPhilippine Defense Secretary Gilberto Teodoro has rejected China's demand that the missile system be removed as interference in Philippine internal affairs.\nThe U.S. and the Philippines have repeatedly condemned China's increasingly assertive actions to press its territorial claims in the South China Sea, where hostilities have flared over the past two years with repeated clashes between Chinese and Philippine coast guard forces and accompanying vessels.\nAside from China and the Philippines, Vietnam, Malaysia, Brunei and Taiwan also have overlapping claims in the busy waterway, a key shipping route which is also believed to be sitting atop large undersea deposits of gas and oil. - VOA\n"
  },
  {
    "id": 1020,
    "title": "Indonesia eyes Indian missiles amid China tensions",
    "created_at": "2025-02-03",
    "text": "\nIndonesia has been in talks with BrahMos Aerospace to procure shore-based mid-range missiles and a version that can be mounted on warshipsImage: Ruslan Shamukov/TASS/dpa/picture alliance\nMurali Krishnan in New Delhi\nIndia's impending sale of supersonic cruise missiles to Indonesia is being perceived as a counterbalance to China's territorial ambitions in the region.\nIndia and Indonesia are in the final stages of negotiating a $450-million (€440-million) deal for the export of the BrahMos supersonic cruise missile.\nIf concluded, Indonesia will become the second ASEAN nation, after the Philippines, to acquire this missile system.\nDuring Indonesian President Prabowo Subianto's recent visit to New Delhi, where he was the guest of honor at India's Republic Day, he met with BrahMos CEO Jaiteerth Joshi in the presence of Indian Prime Minister Narendra Modi.\nA high-level delegation led by Indonesian navy chief Admiral Muhammad Ali also visited the BrahMos facility.\nDefense boost amid China tensions\nThe missile, developed jointly by India and Russia, has gained traction among several countries in Southeast Asia and the Middle East, which are looking to procure both the shore-based and ship-mounted versions.\nMany experts believe the missile procurement is part of Indonesia's broader strategy to enhance its naval power and modernize its military amid growing security concerns related to China's territorial ambitions and assertiveness in the region.\nChina is pursuing territorial ambitions in the South China Sea through a combination of coercive tactics and military buildup, despite overlapping claims by Brunei, Indonesia, Malaysia, the Philippines and Vietnam.\nSrikanth Kondapalli, a professor of China studies at Jawaharlal Nehru University, told DW that India's offer to Indonesia to supply BrahMos cruise missiles is at an advanced stage of negotiations and should not be seen otherwise.\n\"I do not think that India is concerned about it. China had even transferred nuclear and ballistic missiles to Pakistan and submarines to Myanmar, Bangladesh and others, thus impinging on Indian security,\" said Kondapalli.\n\"At that created_at, China mentioned that it is a deal between two sovereign countries, hence now [China] should not have any anger on Indian sales to Southeast Asia or any other country. India also is aware that it is trying to normalize relations with China,\" he added.\nIndia's Defense Ministry and Foreign Office declined to comment on the specifics of the missile deal.\nIndia's balancing act\nSince October, India and China have engaged in a series of confidence-building measures aimed at normalizing their bilateral relations, which had been strained due to border disputes and geopolitical tensions.\nThis renewed engagement follows a significant meeting between Modi and Chinese President Xi Jinping on the sidelines of the October 2024 BRICS Summit in the Russian city of Kazan.\nBoth countries have moved forward to stabilize ties by agreeing to resume direct air services, start pilgrimages and increase cross-border trade.\nThe effort began after both sides pulled back their troops from two face-off points on their contested high-altitude border following border clashes in 2020, which resulted in the deaths of at lease 20 Indian soldiers and four Chinese troops.\nKondapalli pointed out that by arming Indonesia, India is signaling that its engagement with China will not come at the cost of its Indo-Pacific commitments.\n\"The sale of the BrahMos is related to creating a balance of power in Southeast Asia as China is militarizing the region to the exclusion of other countries,\" he said.\nManaging tensions in the South China Sea\nAlka Acharya, honorary director of the Institute of Chinese Studies in New Delhi, said the missile sale has been on the cards for a very long created_at and has prompted criticism from some Chinese commentators.\n\"This is not a new offer so that it could be linked to current tensions. But obviously, it will not go unnoticed or disregarded, and the Chinese official response would certainly state their objections strongly — especially with how this would destabilize the region and help outside powers who are inimical to China,\" Acharya told DW.\n\"However, the Indian position should be that this is not intended against any third country and is for the legitimate defense of Indonesia. It is not likely to derail the normalization process between India and China,\" she added.\nDeterrence without confrontation\nIndia and Indonesia are concerned about the increased muscle-flexing by a rising China, prompting analysts to argue that the \"China factor\" provides a strong basis for bilateral security cooperation.\nIndonesia has had repeated confrontations with China over the Natuna Islands, which lie within its exclusive economic zone. But they are also claimed by China, and Chinese fishing vessels and coast guard ships have entered the zone.\nIn a few weeks, a high-level Indonesian defense delegation is expected to visit India to continue discussions on defense cooperation.\nPhilippines denounces China's aggressive behaviour in the South China Sea\nAnil Wadhwa, a former Indian diplomat, said this trend of diversifying defense partnerships away from traditional reliance on China should not be seen as an encroachment on China's sphere of influence that could lead to likely diplomatic friction.\n\"China has been actively helping Pakistan in developing its naval capability and its air force through the F-17 fighter jets that are collaboratively produced, and has facilitated sales of military equipment to Bangladesh and Sri Lanka as well as Myanmar,\" Wadhwa told DW.\nWadhwa also referred to the Philippines' 2022 purchase of a $375-million BrahMos anti-ship missile system.\n\"As far as the proposed Indian sale of BrahMos missiles to Indonesia and before that to the Philippines, it is all as a response to these countries seeking a defensive deterrent against Chinese aggression in the South China Sea,\" he said. He added that under these circumstances, India should not be overly concerned about a Chinese reaction.\nEdited by: Keith Walker\nhttps:/www.dw.com \n"
  },
  {
    "id": 1022,
    "title": "Indonesian President Prabowo reaffirms 'intuitive, solo player' foreign policy image",
    "created_at": "2025-02-03",
    "text": "\nFeb. 3—JAKARTA(The Jakarta Post/ANN) — Through 10 state visits he embarked upon during the first 100 days of his presidency, President Prabowo Subianto appears to send a clear message to the world.\nAs viewed by analysts, the former Army general was telling the world that he was a foreign policy president with a strong nationalist foundation. He also shows himself as comfortable with taking on the spotlight on the global stage, boosting Indonesia's global standing and going where his immediate predecessor would not.\n\"There was a promise of continuity on the [domestic] political front, but it's clear that Prabowo is no Jokowi on the international stage,\" said international relations expert Dafri Agussalim at Gadjah Mada University.\n\"He's very comfortable on the global stage; many of his moves are seemingly intuitive in nature.\"\nIn the past three months, Prabowo, who won last year's presidential election on a populist platform to spur the national economy and eradicate hunger, kept his schedule busy with high-level visits around the globe. The President regularly flew abroad to reaffirm Jakarta's foreign cooperation and promote its economic interests.\nThe list of countries he visited since his inauguration in October includes China, the United States, Brazil, the United Kingdom, the United Arab Emirates (UAE) and India.\nBut the long list extended beyond those countries, as the former general's global campaign already started months before being sworn in as Indonesia's president.\nAfter the preliminary results of February's election showed his imminent victory, Prabowo, who served as Jokowi's defense minister, traveled to several major nations across Asia, Europe and the Middle East on a tour that experts dubbed as his bid to establish an international presence before officially taking office.\nRead also: Prabowo resumes European trip to Serbia, Turkey after French visit\nInstalling key ally\nPrabowo cemented his persona as a foreign policy president by installing Sugiono, a member of his Gerindra Party, to lead the traditionally professional Foreign Ministry. A day after the ministerial inauguration, Prabowo sent the new top diplomat to a BRICS summit in Russia as his first assignment.\nThe Russian assignment was then followed by a decision by Prabowo for Indonesia to join the economic grouping, which resulted in Indonesia joining as a full member as announced by Brazil in early January. Such a commitment contrasted years-long subtle messaging from Jokowi's administration that indicated Jakarta's reluctance to hop on the BRICS wagon.\nConcerns then surfaced that the BRICS move may potentially sour Indonesia's relationship with the United States after President Donald Trump took office for the second created_at. But the Foreign Ministry reiterated on several occasions that Jakarta's membership in the economic grouping was incentivized by economic benefits.\nEmphasizing its non-aligned position, the ministry reasserted that the BRICS move was a manifestation of a bolder free-and-active policy.\nRead also: Indonesia sees full BRICS membership as 'valuable' for Global South cooperation\n\"Prabowo is highly interested in geopolitics, and his foreign policy is reflective of his vision of what Indonesia ought to be seen as,\" Dafri said.\n\"The Foreign Ministry simply facilitates this vision that he tends toward being a solo player,\" he continued.\n'Visionary' diplomacy\nThe ministry made clear how Indonesia ought to be seen in Foreign Minister Sugiono's first annual speech in early January, with his diplomatic corps aiming to put Indonesia on the global stage \"in line with its stature as a great nation\" by, among other efforts, practicing \"anticipatory, progressive and visionary\" diplomacy.\nAnalysts previously noted that Prabowo's diplomacy had been centered on economy, like Jokowi's. But the sitting president is significantly more influenced by a nationalist ideology compared to his predecessor.\nInstead of measuring Jakarta's diplomatic effectiveness through indicators such as trade and export numbers, Prabowo has been motivated by a belief that Indonesia as a resource-rich country must be self-sufficient, respected and well-networked.\nRead also: Prabowo looks set to continue high int'l engagements in 2025\nBut such an ideology inspired Prabowo to make eyebrow-raising moves, including when he agreed through a joint statement with Chinese President Xi Jinping to kick-start joint development in so-called \"disputed\" areas of the South China Sea following a November meeting between the leaders in Beijing.\nThe statement triggered a diplomatic brouhaha for Jakarta, which later had to issue several statements underlining its unchanged position on the South China Sea, despite apparently nodding at Beijing's illegal dispute claim.\n\"The South China Sea agreement was clearly his way of using our natural resources as leverage for dealing with Beijing, all while reaping economic benefits. However, it's also impossible to ignore other crucial geopolitical contexts,\" said Yose Rizal Damuri, executive director for Jakarta-based Centre for Strategic and International Studies (CSIS).\nThe researcher called on Prabowo to be \"a little more sensitive to these issues\", while conveying his hope that the President could integrate institutional and professional knowledge of the Foreign Ministry into his diplomacy efforts.\n© 2025 the Asia News Network (Hamburg, Germany). Visit www.asianewsnet.net. Distributed by Tribune Content Agency, LLC.\n"
  },
  {
    "id": 1024,
    "title": "China Troubles US Ally in Coastal Waters for 30 Days",
    "created_at": "2025-02-03",
    "text": "\nThe Philippines on Sunday marked the 30th straight day of the Chinese coast guard's \"illegal\" deployment off Zambales, a province on the U.S. ally's heavily populated Luzon island.\nNewsweek reached out to the Philippine Coast Guard and Chinese Foreign Ministry with emailed requests for comment.\nWhy It Matters\nMultiple heavily armed Chinese coast guard ships have maintained this presence, well within the 200-nautical-mile [230-mile] exclusive economic zone (EEZ) where a country is entitled to resources under the United Nations Convention on the Law of the Sea (UNCLOS). China claims upward of 90 percent of the South China Sea within its \"10-dashed line\" map.\nThe monthlong deployment brings the long-running territorial dispute with China, typically centered on several contested rocks and reefs, closer to the Philippines proper, further fueling tensions between the two neighbors. Manila has responded with its own coast guard, keeping up the pressure on its Chinese counterpart through continuous monitoring and radio challenges.\nWhat To Know\nOne of main ships testing the Philippines in this area is China Coast Guard 5901. The ship's considerable girth—measuring 540 feet from bow to stern and displacing 12,000 tons—has earned this the nickname \"the Monster.\"\nDespite dwarfing any ship in the Philippines—and indeed any country's—coast guard, the CCG-5901, was \"pushed back\" from 54 to around 120 nautical miles [62 to 138 miles] by the Southeast Asian country's BRP Teresa Magbanua, Philippine coast guard (PCG) spokesperson Jay Tarriela wrote on X (formerly Twitter) Sunday.\nTarriela said that, by ignoring the 2016 ruling in favor of the Philippines by an international arbitral court in The Hague, Beijing has shown a \"blatant disregard for international law and the established rules-based order.\"\nThe \"Monster\" was not the only ship reinforcing Beijing's maricreated_at claims in this area, however.\nOn Sunday morning, Chinese ships bearing the hull numbers 3301 and 3304 were spotted not far away, just 34 nautical miles [39 miles] off the coast of Pangasinan, a province of Luzon's Ilocos Region, Tarriela wrote in a separate X post.\nThe Philippines dispatched a par of its own patrol vessels to \"reinforce the Philippine government's position against the normalization of illegal patrols by the People's Republic of China within the Philippine exclusive economic zone,\" the spokesman added.\nOn Friday, there was a patrol by the Chinese coast guard at Scarborough Shoal—a hotly contested feature known in the Philippines as Bajo de Masinloc and in China as Huangyan Island—Chinese state media cited the maricreated_at agency as saying.\nThe rich fishing ground, which China effectively seized control of in 2012, sits about 140 miles west of Luzon and over 600 miles from the nearest Chinese shores.\nWhat People Are Saying\nRay Powell, director of Stanford University-affiliated maricreated_at analysis group SeaLight, wrote on X: \"China Coast Guard 3104 and 3301 continue their brazen intrusive patrol against the Philippines, coming within 25nm [nautical miles] of the Luzon coastline and demonstrating China's commitment to its 10-dash-line claim over the entire South China Sea.\"\nWhat Happens Next\nThe dispute is unlikely to be resolved anycreated_at soon, with China expected to continue its patrols in the EEZs of the Philippines and other neighboring countries.\nThe administration of Philippine President Ferdinand Marcos Jr. will likely continue its pushback, supported by 84 percent of Filipinos, according to a November 2024 survey of 1,200 respondents aged 18 and above by independent consulting firm OCTA Research.\nLink to Image\n\nGraphic\n \nChina's \"Monster\" Coast Guard Ship\nPhilippine Coast Guard\nThis image shows China's \"Monster\" coast guard ship, CCG-5901 patrolling near the Philippines' Zambales Province on Sunday, within the Southeast Asian country's exclusive economic zone.\n"
  },
  {
    "id": 1026,
    "title": "Philippine Coast Guard dispatches vessels to drive away 2 Chinese ships in West PH Sea",
    "created_at": "2025-02-03",
    "text": "\n                      MANILA(Philippine Daily/ANN) - The Philippine Coast Guard (PCG) has dispatched two of its vessels to \"address the illegal presence\" of two Chinese ships in waters off Pangasinan.\nAccording to PCG spokesperson for the West Philippine Sea (WPS) Commodore Jay Tarriela, they deployed two 44-meter vessels, BRP Cabra (MRRV-4409) and BRP Bagacay (MRRV-4410).\nHe also said that PCG Island aircraft was likewise dispatched and had already issued a radio challenge against Chinese Coast Guard (CCG) vessels 3301 and 3104, which were last spotted approximately 34 nautical miles off the coast of Pangasinan through the PCG's dark vessel detection program.\n\"At around 9:30 AM today, the PCG aircraft confirmed the illegal presence of the China Coast Guard vessels, identified by bow numbers 3301 and 3104. Notably, the CCG vessels did not respond to the radio challenge issued by the PCG,\" Tarriela said.\n\"Currently, two PCG vessels, BRP Cabra (MRRV-4409) and BRP Bagacay (MRRV-4410) both 44-meter ships, have been dispatched to Bolinao, Pangasinan, to address the illegal presence of the China Coast Guard,\" he added.\nMoreover, he said the PCG vessels reminded the CCG that their presence is illegal, reinforcing the Philippine government's position against \"the normalization of illegal patrols\" within the country's exclusive economic zone.\nBeijing's continued aggression in the WPS is based on its assertion of sovereignty over almost the entire South China Sea, including most of the WPS, as it continues to reject the 2016 arbitral ruling that effectively dismissed its claims and ruled in favor of Manila.                    \n"
  },
  {
    "id": 1028,
    "title": "PHILIPPINES SAYS IT WON'T LET CHINA NORMALIZE 'ILLEGAL' SHIP DEPLOYMENTS IN EEZ",
    "created_at": "2025-02-03",
    "text": "\nThe following information was released by Radio Free Asia:\nNewly released Philippine Coast Guard videos show Chinese coast guard ships remaining in South China Sea waters within Manila's exclusive economic zone west of Luzon, where they have lingered for the past month, PCG officials said.\nIn video footage taken from a PCG airplane over the weekend and released on Monday, several Chinese coast guard ships were tracked sailing in waters near Manila-claimed Scarborough Shoal, known as Bajo de Masinloc in the Philippines, according to Filipino officials.\nOn Sunday, two China Coast Guard ships CCG 3301 and CCG 3104 were also tracked only 34 nautical miles off the coast of Pangasinan, a province on the west coast of Luzon, the main island in the northern Philippines.\nThe PCG said it immediately deployed an aircraft to identify the foreign ships and issued radio challenges but those were ignored, according to officials. The Philippine Coast Guard also dispatched two vessels to the area.\nLocated about 125 nautical miles (232 km) from Luzon, Scarborough Shoal is a traditional fishing ground for Filipino fishermen but it has been under China's de facto control since 2012.\nThe Philippine Coast Guard is committed to \"preventing the normalization of the People's Republic of China's (PRC) illegal deployment of maricreated_at forces in the region,\" the agency said in a statement.\nThe BRP Teresa Magbanua, a local coast guard ship, has been \"actively challenging the presence of China Coast Guard 5901,\" which is now about 117 nautical miles from the country's coast, according to officials.\nDubbed \"The Monster,\" the CCG 5901 is the world's largest coast ship. The Philippine coast guard statement did not say how the Teresa Magbanua was challenging its bigger foreign counterpart.\n\"Today marks the 30th consecutive day of the China Coast Guard's illegal presence in the waters off Zambales,\" the PCG said in its statement Saturday, referring to another province on Luzon's west coast.\nThe refusal of the Chinese vessel to leave the Philippine EEZ is a \"blatant disregard for international law and the established rules-based order,\" it said.\nChinese navy ships off southern Philippines\nMeanwhile, the Philippine Navy said it escorted three Chinese naval warships, including a cruiser-guided missile class vessel, out of Philippine waters on Monday. The vessels were first monitored Sunday off the coast of the southern Philippine provinces of Zamboanga and Basilan.\n\"The said PLA [People's Liberation Army] navy vessels transited without prior diplomatic coordination and maintained an unusually slow speed of four to five knots,\" said Maj. Orlando Aylon Jr., a regional military spokesman based in Zamboanga.\nThe three People's Liberation Army (PLA) Navy vessels seen by Philippine authorities included a Jianki Class Frigate II, a Renhai Class Cruiser Guided Missile and a Type 903 Fuchi Class Replenishment Oiler.\n\"This is not consistent with the principles of innocent passage which requires continuous and expeditious passage and that the vessels should not linger in archipelagic waters longer than necessary,\" said Lt. Gen. Antonio Nafarrete, chief of the Armed Forces of the Philippines' Western Mindanao Command.\nChina defended the passage of its naval vessels in the area, saying they conducted training exercises in the open sea.\n\"The Chinese naval vessels' passage through the Basilan Strait is in full compliance with ... international law and practice,\" a spokesperson for the Chinese PLA Southern Theater Command said on Monday.\nThe Philippines' \"act of smearing and hyping up the Chinese naval vessels' normal passage through the Basilan Strait has seriously undermined the normal navigation rights of other countries including China,\" the spokesperson added.\nBeijing's taking possession of Scarborough Shoal forced Manila to file a lawsuit at the world court in The Hague 13 years ago.\nIn 2016, an international arbitration tribunal ruled in Manila's favor but Beijing has never acknowledged that decision.\nGeopolitical analyst Julio Amador III, who closely monitors the South China Sea, said it was too early to determine the Chinese navy vessels' intentions but he noted that the principle of \"freedom of navigation\" applied.\nThe same could also be said about China's \"monster\" ship. As long as it maintained its distance in the periphery of Scarborough, that should not escalate the tension in the area, Amador said.\n\"But if it goes inside the lagoon and then patrols while challenging our claims, then there are grounds for protest,\" he told BenarNews.\n\"The only difference between that ship and the CCG ships in 2012 is the size.\"\nHe was referring to the first incident when Chinese vessels entered the area and unleashed an international crisis that later resulted in Manila's filing of a lawsuit against Beijing.\nThe \"monster\" ship's presence there \"is to remind us that they are making claims on Scarborough.\"\n\"They want control of the waters,\" Amador said.\nBenarNews is an RFA-affiliated online news organizations.\n"
  },
  {
    "id": 1029,
    "title": "BBCM China Watchlist 3 Feb 25",
    "created_at": "2025-02-03",
    "text": "\nStories being covered today by BBC Monitoring from Chinese broadcast, press and social media sources.\nChina opposes tariffs, says US 'root cause' of own fentanyl crisis\nChina's Ministry of Public Security is the latest government ministry to criticise President Donald Trump's announcement on the imposition of 10% additional tariffs on Chinese imports, which will take effect on 4 February.\nA spokesperson from the ministry said China expresses \"strong dissatisfaction\" and \"firm opposition\" to the tariffs \"under the pretext of fentanyl-related issues\", the official Xinhua News Agency reported shortly after midnight on 3 February.\nThe spokesperson said that China was the first country in the world to officially mark fentanyl-related substances as a class in 2019 \"out of humanitarian goodwill and at the request of the US side\", adding that since then \"there have been no reports from the US of seizures of such substances originating from China\".\n\"The root cause of the fentanyl crisis in the US lies in itself,\" the spokesperson said, and urged Washington to \"correct its wrongdoing\" and \"safeguard the hard-won progress in bilateral drug control cooperation and promote the stable, healthy, and sustainable development of China-US relations\", Xinhua reported.\nEarlier, China's Ministry of Foreign Affairs responded to the tariffs by vowing to \"take necessary countermeasures to defend its legitimate rights and interests\", while the Commerce Ministry said it will file a lawsuit with the World Trade Organisation (WTO).\nSee also: China vows 'countermeasures' against Trump tariff hikes on imports  \nChinese military, coastguard patrol disputed South China Sea reef\nThe Chinese People's Liberation Army (PLA) Southern Theatre Command and the China Coast Guard (CCG) recently conducted patrols around the disputed Scarborough Shoal and nearby areas - part of the Spratly Islands chain in the South China Sea.\nThe PLA Southern Theatre Command announced on 1 February that troops had conducted combat readiness patrols with naval and air forces in waters and airspace around the shoal the previous day, the official Xinhua News Agency reported.&#160;\nScarborough Shoal is controlled by China as Huangyan Island, but it also lies within the Philippines' 200-nautical-mile exclusive economic zone (EEZ) and is also claimed by Manila as Panatag Shoal or Bajo de Masinloc.&#160;\nShortly after the Theatre Command's announcement, the China Coast Guard also announced \"law enforcement patrols\" around Scarborough Shoal and surrounding areas on 31 January, state-run news agency China News Service reported.\nBoth the theatre command and the CCG said they had stepped up patrols and control over surrounding waters and airspace at Scarborough Shoal since the beginning of January, and were \"firmly safeguarding\" national sovereignty.\nOn 31 January, Philippine President Ferdinand Marcos Jr said China should respect the Philippines' sovereign rights and jurisdiction, and stop its \"aggressive and coercive\" behaviour in the West Philippine Sea - Manila's name for South China Sea waters that lie within its EEZ.&#160;\nOn 2 February, the Philippine Coast Guard (PCG) said the CCG's largest 5901 vessel, nicknamed the \"monster\", had maintained an \"illegal presence\" for a 30th consecutive day in waters off Zambales, a province on the west coast of Luzon, and that the PCG had successfully driven the vessel further away from the coastline. On the same day, the PCG also said it had tried to drive away two CCG vessels off the coast of Pangasinan, a province directly south of Zambales.\nSee also: Philippines notes 'illegal' presence of China ships in maricreated_at zone  \nBeijing yet to respond to Philippines arresting more Chinese for 'spying'  \nSouth Africa again requests relocation of Taiwan liaison office\nTaiwan's Foreign Ministry said it has received another request to move its liaison office in South Africa away from the administrative capital of Pretoria by the end of March.\nCiting a statement from the ministry, Taiwan's Central News Agency (CNA) reported on 2 February that the South African government has sent another letter in late January demanding the relocation and even sought to \"downgrade\" the office to a \"trade office\".\nThe foreign ministry also said that Pretoria's latest demand came at a created_at the two sides are still in talks, which shows that \"China is intensifying its suppression of Taiwan in South Africa\".\nIt added that South Africa should uphold the 1997 bilateral agreement that allows Taipei to continue to operate a liaison office in Pretoria.\nAccording to a report from CNA's English-language edition, South Africa first made an oral request for Taiwan to relocate its office in December 2023, followed by an official letter in April 2024. Another request for relocation was made in October 2024 with a deadline at the end of that month.&#160;\nHowever, the deadline was later withdrawn after the two sides began negotiations.\nThe report added that while it remains unclear why the South African government resumed its demand, it happened after the Chinese embassy in Pretoria announced sanctions on 9 January against Ivan Meyer, federal chair of South Africa's second largest party, the Democratic Alliance, for recently visiting Taiwan.&#160;\nThe embassy accused Meyer of \"blatantly violating the one-China principle\".\nSee also: Briefing: South Africa 'demands' Taiwan moves office from administrative capital (October 2024)\nBriefing: Chinese foreign ministers' new year trips to Africa over 35 years  \nTaiwan bans government use of China AI app DeepSeek\nTaiwan recently banned public sector workers from using DeepSeek, a recently-released Chinese artificial intelligence (AI) model, due to concerns over data leaks.\nOn 31 January, Taiwan's Ministry of Digital Affairs said the ban applies to employees of central and local government agencies, public schools, state-owned enterprises and other semi-official organisations, as well as those working on critical infrastructure projects and in government-endowed foundations, CNA reported.\n\"DeepSeek's AI service is a Chinese product, and its operation involves cross-border transmission and information leakage and other information security concerns, and is a product that jeopardises the country's information security,\" the ministry said in a statement.\nHowever, the ban has divided political opinion. Lee Yen-hsiu, a legislator from the opposition Kuomintang (KMT), which supports closer ties with mainland China, criticised the digital ministry for failing to clarify the scope of its ban on DeepSeek, CNA reported. She also raised concerns that the broad restrictions could affect academic research and student learning.\nSome lawmakers from the ruling Democratic Progressive Party (DPP) supported the ban. DPP legislator Wang Ting-yu warned of military, greyzone and cyber-security risks from Beijing and called on businesses and individuals in the private sector to be more vigilant about cyber-security and avoid using DeepSeek products if there are security risks, CNA reported.\nTaiwan's move comes in the wake of countries worldwide reviewing or curbing DeepSeek's use of personal data, including the US, the UK,    Australia, France, India, Italy, Ireland, Japan and South Korea due to security and privacy concerns.\nSee also: Briefing: China media link cyber-attacks on DeepSeek to US  \nBriefing: Chinese media hail DeepSeek as ushering in AI's 'China moment'  \nMigrant workers return to jobs early during Spring Festival&#160;\nChinese authorities recorded more than 4.8 billion passenger trips made across the country's public transport system halfway through the Spring Festival or Lunar New Year travel rush, national broadcaster China Central Television's (CCTV) evening news programme Xinwen Lianbo (News Hookup) reported on 2 February.\nOfficial Xinhua News Agency noted the figure represented a 7.2% increase in passenger flow from 14 January to 2 February, the first half of the 40-day seasonal travel rush. It further said there was an average of over 300 million trips daily between 31 January and 2 February, surpassing levels in 2024.\nCCTV's Xinwen Lianbo also reported that total box office takings (including pre-sales) for the 2025 Spring Festival had exceeded 5.5bn yuan as of 1 February. It said that from the first day of the Lunar New Year on 29 January to 1 February, domestic daily box office revenue had exceeded 1bn for four consecutive days. A CCTV website report said the box office revenue for the Spring Festival holiday \"had cemented China's position as a global leader in box office revenue for 2025, surpassing North America\".\nHowever, in contrast to official media highlighting bustling tourism and consumption, Hong Kong's Ming Pao newspaper on 2 February noted that some migrant workers were returning to work early due to a \"poor economic\" situation.\nTaiwan's CNA on 2 February reported that train stations appeared to be less crowded during the Spring Festival compared to previous instances because many people had already returned to their hometowns in rural areas and fourth and fifth-tier cities in the interior in the last six months as they could not find jobs in larger cities.\nSee also: Briefing: From DeepSeek to dancing robots, China touts tech at New Year  \nChina highlights global friendship in Lunar New Year celebrations  \nSource: BBC Monitoring 3 Feb 25\n"
  },
  {
    "id": 1034,
    "title": "China sees opportunities beyond threats in measures announced by Trump",
    "created_at": "2025-02-03",
    "text": "\nWhile United States President Donald Trump was sparring with Colombia's leader Gustavo Petro over the military deportation of migrants, China's ambassador to the Latin American country, Zhu Jingyang, declared that relations between Beijing and Bogotá were at their \"best moment\" in decades.\nZhu later said that his comment on social media last week, the day after Trump said he would impose tariffs on Colombia, was a coincidence. But the scope of the publication suggests that Beijing saw an opportunity to strengthen its position in the rivalry between China and the US.\nTwo weeks after Trump's inauguration ceremony, the Republican's \"America First\" foreign policy represents both a promise and a danger for Beijing.\nThe dangers have always been clear: more tariffs and the risk of a wider trade war. At the weekend, Trump imposed an additional 10% tariff on goods imported from China, saying the measure was a response to Beijing's failure to curb fentanyl exports.\nWhile the Asian country is calculating the impact of the tariffs on its fragile economy, it is also assessing the opportunities that Trump's other moves are giving Beijing.\nTrump, for example, has alienated US allies and partners, such as Canada and Mexico, by imposing high tariffs on their exports and has weakened Washington's global authority by cutting foreign aid and withdrawing from the WHO (World Health Organization) and the Paris Agreement, a UN climate pact.\nIf Trump's second term marks the sunset of Pax Americana, analysts say China will almost certainly seize the opportunity to try to reshape the world in its favor. Beijing, which has long accused Washington of using its dominance to contain Chinese growth, has been trying to create a divide between the US and its allies, including the European Union, Japan and Australia.\n\"The Chinese are well aware of the damage Trump has done and is doing to US credibility and influence globally. In fact, it's unfolding faster than even Beijing expected,\" says Evan S. Medeiros, professor of Asian studies at Georgetown University, who served as President Barack Obama's Asia affairs adviser.\nTrump's threats to seize the Panama Canal and Greenland, as well as to annex Canada as the 51st US state, could normalize a world order in which force prevails. This is a familiar approach for Beijing, even if the Chinese authorities maintain the rhetoric that they have never sought hegemony or expansion.\nIf the US pressures Panama over its waterway or forces Denmark to give up the resource-rich territory of Greenland, it will send a signal to China that when it comes to its own claims over the autonomous island of Taiwan and much of the South China Sea, for example, coercion trumps cooperation.\n\"China would certainly never give up Taiwan or the South China Sea, but with Trump doing what he's doing, it's even more determined to protect its interests there, that's for sure,\" says Henry Huiyao Wang, president of the China and Globalization Center in Beijing.\nWang says that Beijing has been encouraged by the first two weeks of the new government, despite the tariffs and the appointment of bellicose advisors such as Secretary of State Marco Rubio and national security advisor Michael Waltz.\nInstead of coming out aggressively to confront China, Trump presented himself as someone willing to negotiate and potentially close a deal with the country's leader, Xi Jinping. The Republican suggested linking tariffs to the fate of , which, according to him, .\nAnother potential area for negotiations is Ukraine, invaded by Russia almost three years ago. Trump said that China should help end the war in the Eastern European country - China, as Moscow's biggest economic supplier, could put pressure on President Vladimir Putin to sit down at the negotiating table.\n\"Trump wants China's help to end the Ukrainian war,\" said Wang. \"China is one of the best partners for him to do that.\"\nBut with so many competing interests, cooperation is difficult.\nBeijing avoids criticizing the invasion of Ukraine, for example, adopting the position that Russia has the right to protect its national security. Kiev, for its part, would not accept China as a mediator because of its pro-Russian stance, says Shi Yinhong, professor of international relations at Renmin University in Beijing. Putin, on the other hand, won't want to appear subordinate to China, he says, while Trump has no stomach for seeing Beijing praised for playing a significant role.\nOn the issue of tariffs, Beijing has to decide whether it can afford to escalate a trade war with the US. On Sunday, the country promised to respond to Trump's tariffs by filing a case with the WTO (World Trade Organization) and with other as yet unspecified measures.\nBeijing could, for example, retaliate with new tariffs. A more drastic approach, however, would be to engage in a \"supply chain war\": stopping shipments of critical materials and equipment to US industry. At the beginning of December, China stopped the export to the US of minerals such as antimony and gallium, which are needed to manufacture some semiconductors.\nThe risk for China is that a trade war will be more damaging for itself than for Washington. Exports and the construction of factories to produce them are among the few strengths in China's economy today. As a result, the country's trade surplus - the amount by which its exports exceeded imports - reached almost US$1 trillion last year.\nIn the race for global influence, some argue that the Trump administration's decision to freeze much foreign aid, which has disrupted aid programs around the world, has already benefited China.\nIn regions such as Southeast Asia, where the stance towards the US has hardened because of Washington's support for Israel in the war in the Gaza Strip, the interruption of funding has raised questions about the reliability of the US country.\n\"China doesn't need to do anything at the moment and yet somehow it looks like the good guy,\" says Jeremy Chan, senior analyst on China at Eurasia Group.\n"
  },
  {
    "id": 1035,
    "title": "2 Chinese vessels seen off Pangasinan",
    "created_at": "2025-02-03",
    "text": "\n Two Chinese coast guard vessels were spotted off Pangasinan province, the Philippine Coast Guard (PCG) said on Sunday, while Beijing's so-called 'monster ship' continued to linger near Zambales province for about a month now.\nThe PCG deployed an aircraft and two 44-meter ships, the BRP Cabra (MRRV-4409) and the BRP Bagacay (MRRV-4410), to Bolinao, Pangasinan, after it sighted China Coast Guard (CCG) vessels with bow numbers 3301 and 3104 some 65 kilometers (34 nautical miles) from the shore through Canada's satellite tracking system, PCG spokesperson for the West Philippine Sea Commodore Jay Tarriela said in a statement.\nThe deployment of the PCG vessels was meant to 'reinforce the Philippine government's position against the normalization of illegal patrols by the People's Republic of China within the Philippine Exclusive Economic Zone (EEZ),' he said.\nWithin EEZ\nHowever, the radio challenges issued by the PCG were ignored by the Chinese ships, Tarriela noted.\nThe 12,000-ton CCG-5901, or the 'monster ship,' replaced CCG-3304 operating off Zambales on Saturday.\nAlthough it was pushed further away by the PCG's BRP Teresa Magbanua (MRRV-9701) 213 km (115 nautical miles) from the coastline, it remained within the Philippines' EEZ.\n'The crew aboard BRP Teresa Magbanua demonstrated remarkable courage and resolve, remaining undeterred by the presence of the massive CCG-5901,' Tarriela said in a separate statement.\nChina's goal\n'The PCG has consistently asserted that the actions of the [CCG] are illegal and in violation of the United Nations Convention on the Law of the Sea (Unclos), to which China is a signatory,' he pointed out.\nThe massive ship was first monitored off Capones Island in the waters of Zambales on Jan. 4 after patrolling Panatag (Scarborough) Shoal and has stayed within that area since.\nSmaller Chinese vessels have also tried to move closer to the coast of the Philippines since then.\nTarriela earlier said China's goal was to normalize such deployments, which would enable them 'to alter the existing status quo' if these actions go unchallenged.\nMindoro, Lawak\n'What we're doing there is, hour by hour and day by day, we're challenging the illegal presence of the Chinese coast guard for the international community to know that we're not going to allow China to normalize the illegal deployment,' he stressed.\nAt least nine Chinese coast guard vessels were spotted within the Philippines' EEZ during the weekend, American maricreated_at security expert Ray Powell said on Saturday.\nCCG 3104 and 3301 were tracked near Cabra Island off Occidental Mindoro before heading to Pangasinan, while CCG 5202 passed within 6.5 km (3.5 nautical miles) of Philippine-occupied Lawak (Nanshan) Island, he said.\nChinese vessels have been keeping a constant presence in the West Philippine Sea-part of the South China Sea being claimed by the Philippines-to enforce Beijing's excessive maricreated_at and territorial claims.\nAn international arbitration tribunal ruled in 2016 that China's historical claims have no basis under international law, a decision Beijing has refused to recognize.\n"
  },
  {
    "id": 1036,
    "title": "Wild China - 4:00 PM GMT",
    "created_at": "2025-02-03",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nsynchronised aerial displays. More than any other place on China's coastline, Inner Deep Bay demonstrates that with help, resilient nature can still thrive, even when boxed in and overshadowed by towering cities like Shenzhen. Another successful example of man's intervention on behalf of nature can be glimpsed in the waters around Lantau Island. \nWhile egrets make the most of an easy meal, other creatures have their eye on the fishermen's catch. Chinese White dolphins are estuary specialists. Found widely in the Indian and Pacific Ocean, this species is rare in China. The young are born dark grey and become spotted as adolescents, finally turning creamy-white as adults, though on some occasions they may blush a delicate shade of pink. Three groups of dolphins live close to Lantau Island. As the tide comes in, they move with it to feed on small fish or squid which travel with the currents, using echolocation to \"see\" their prey through the murky water. They also use sound to communicate. DOLPHIN SQUEAKS But they face a deafening problem. BOAT ENGINES ROAR The Pearl Estuary has become one of the busiest shipping channels in China and the dolphins are constantly bombarded with sound. New research suggests that they may now pack more information into shorter calls in a bid to be heard. Local conservationists have now set up a protected zone near Lantau Island. So for now, China's white dolphins are holding on. South of Hong Kong lies the South China Sea, studded with more than 200 hundred islands and reefs. Potential reserves of fish, oil and gas make each one strategic and the whole region has become a political hot-spot, as territorial disputes simmer between its many neighbouring countries. The waters themselves are low in nutrients and would be poor in life if it wasn't for the other resource that's here in abundance. Sunlight. In the shallows of the coral atolls, small jellyfish point their tentacles towards the sun. Like many animals here, they depend on a close partnership with microscopic algae which turn solar power into food. The most famous of these relationships is the reef-forming corals, which provide the foundation of the sea's most dazzling ecosystem. Their branches provide shelter for a wealth of small and vulnerable creatures... many of them beautifully camouflaged. But the ultimate master of disguise has to be the octopus, able to change not only its shape and colour, but its skin texture too.\n"
  },
  {
    "id": 1037,
    "title": "Wild China - 3:15 PM GMT",
    "created_at": "2025-02-03",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nWith double-crossings and murders. Father, that's the one you delight in! Well, really? You must join us this evening! Nothing brings us together like great TV. \nSo, a TV Licence... Mm-hm. ..it gives you access to this wonderous treachery? Indeed. A TV Licence - for all TV channels and BBC iPlayer. From the eastern end of the Great Wall, China's coast spans 14,500 kilometres and more than 5,000 years of history. This is the area which shows the greatest contrast between China's past and its future. Today, China's eastern seaboard is home to 700 million people, packed into some of the most dazzling hi-tech cities on earth. Yet, these crowded shores remain hugely important for a wealth of wildlife. Now, as ancient traditions mingle with new aspirations, is there any room at all for wildlife on China's crowded shores? In northern China's Zhalong Nature Reserve, a pair of red-crowned cranes have staked out their nesting territory in the stubble of a commercially managed reed bed. For centuries, cranes have been revered in China as symbols of longevity. Their statues were placed next to the Emperor's throne. The cranes have cause to celebrate. This chick is a sign of hope in difficult created_ats. Red-crowned cranes are one of the world's most endangered species. Over the last century, China has lost nearly half of its coastal wetlands and most of what remains is managed for the benefit of people, not wildlife. A few months from now, this chick and its parents will face a long migration south to escape the harsh northern winter. Their route will take them along a coast which has been greatly affected by human activity. Along their journey, the cranes will be joined by many thousands of other migrating birds, all heading south across the Bohai Gulf and along the shores of the Yellow and East China Seas. Some even reaching as far as the South China Sea in search of a safe winter haven. The annual bird migration has been going on for thousands of years. Here at Mount Jinping, on China's northeast coast, there is surprising evidence that people have lived here almost as long. Seven thousand years ago, members of the Shao Hao tribe carved magical symbols representing significant elements of their daily lives. The petroglyphs show wheat sheaves connected by lines to human figures, the first-known recordings of cultivation in China.\n"
  },
  {
    "id": 1039,
    "title": "For China, Trump's Moves Bring Pain, but Also Potential Gains",
    "created_at": "2025-02-03",
    "text": "\nPresident Trump's tariffs hurt China, but his other actions have alienated U.S. allies, giving Beijing an opening to strengthen its global standing.\nAs President Trump was locked in a war of words with the leader of Colombia over the military deportation of migrants, China's ambassador to Colombia declared that relations between Beijing and Bogotá were at their ''best moment'' in decades. \n  Zhu Jingyang, the ambassador, later said that it was a coincidence that he posted his comment on social media last week, a day after Mr. Trump said he would slap tariffs on Colombia. But the public outreach suggested that Beijing saw an opportunity to strengthen its hand in the high-stakes superpower rivalry between China and the United States.\n  Two weeks into the second Trump administration, Mr. Trump's aggressive ''America First'' foreign policy holds both promise and peril for Beijing.\n  The perils have always been clear: more tariffs, and the risk of a wider trade war. This weekend, Mr. Trump imposed an additional 10 percent tariffs on goods imported from China, saying the tariffs were a response to China's failure to curb fentanyl exports. He could answer any retaliation from China with even higher levies.\n  But even as Beijing calculates the impact of the tariffs on China's weak economy, it is surely also taking stock of the openings that Mr. Trump's other moves are giving China.\n  Mr. Trump has alienated U.S. allies and partners like Canada and Mexico by imposing steep tariffs on their exports. He has weakened America's global authority by cutting foreign aid and withdrawing from the World Health Organization and the Paris Agreement, a U.N. climate pact.\n  If the second Trump term marks the sunset of Pax Americana, analysts say China will almost certainly use the opportunity to try to reshape the world in its favor. Beijing, which has long accused Washington of using its dominance to contain China's rise, has tried to drive a wedge between the United States and its allies, including the European Union, Japan and Australia.\n  ''The Chinese are well aware of the damage Trump has done and is doing to U.S. credibility and influence globally. In fact, it is unfolding faster than even Beijing expected,'' said Evan S. Medeiros, a professor of Asian studies at Georgetown University who served as an Asia adviser to President Barack Obama.\n  Mr. Trump's threats to take the Panama Canal and Greenland, as well as to annex Canada as America's 51st state could normalize a world order in which might makes right. That is an approach that is familiar to Beijing, even if Chinese officials rhetorically maintain that it will never seek hegemony or expansion.\n  If the United States strong-arms Panama over its crucial waterway, or forces Denmark to give up the resource-rich territory of Greenland, it sends a signal to China that when it comes to its own claims to the self-governing island of Taiwan and much of the South China Sea, coercion trumps cooperation.\n  ''China was certainly never going to give up Taiwan or the South China Sea, but with President Trump doing what he's doing, China is even more determined to safeguard its interests there, that's for sure,'' said Henry Huiyao Wang, president of the Center for China and Globalization in Beijing.\n  Mr. Wang said China has been encouraged by the first two weeks of the new administration despite the tariffs and appointment of hawkish advisers such as Secretary of State Marco Rubio and Michael Waltz, the national security adviser.\n  Rather than coming out aggressively to confront China, Mr. Trump has presented himself as someone willing to negotiate and potentially cut a deal with Xi Jinping, China's leader. Mr. Trump has floated the idea of tying tariffs to the fate of TikTok, which he has said should be half-owned by an American company.\n  Another potential area for deal making is Ukraine. Mr. Trump has said China should help end Russia's war in the Eastern European country. China, as Russia's biggest provider of economic and material support, could conceivably pressure President Vladimir V. Putin to come to the negotiation table.\n  ''Trump wants China's help to end the war in Ukraine,'' Mr. Wang said. ''China is one of the best partners for him to do that.''\n  But with so many competing interests, cooperation would be difficult. China has avoided criticizing Russia's invasion of Ukraine, for example, taking the position that Russia has a right to protect its national security. Ukraine will not accept China as a peace broker because of China's pro-Russian position, said Shi Yinhong, an international relations professor at Renmin University in Beijing. Mr. Putin, on the other hand, will not want to look subordinate to China, he said, while Mr. Trump has ''no real stomach'' to see China lauded for playing a significant role.\n  On the issue of tariffs, Beijing has to decide if it can afford to escalate a trade war with the United States. On Sunday, it vowed to respond to Mr. Trump's tariffs by filing a case with the World Trade Organization and with countermeasures to be specified later.\n  Beijing could hit back with tariffs. A more drastic approach would be for China to engage in ''supply chain warfare'': halting shipments to the United States of materials and equipment critical to U.S. industry. In early December, China stopped the export to the United States of minerals like antimony and gallium, which are needed to manufacture some semiconductors.\n  The risk to China is that a trade war would be more damaging to itself than it would be for the United States. Exports, and the construction of factories to make them, are among the few strengths now in China's economy. As a result, China's trade surplus -- the amount by which its exports exceeded imports -- reached almost $1 trillion last year.\n  China has also not yet said how it will respond to a potentially farther-reaching provision in the fine print of Mr. Trump's executive order on Saturday: the elimination of duty-free handling for packages worth up to $800 per day for each American. Factories all over China have shifted in recent years to e-commerce shipments directly to American homes, so as to bypass the many tariffs collected on clothing and other goods that are imported and sold through American stores.\n  In the race for global influence, some argue that the Trump administration's move to freeze most foreign aid, which has disrupted aid programs around the world, has already benefited China.\n  In regions like Southeast Asia, where attitudes toward the United States have hardened because of Washington's support for Israel in the Gaza war, the halt in funding has raised questions about American reliability.\n  ''China needs to do nothing in the meancreated_at, and yet, somehow, net-net, look like the good guy in all of this,'' said Jeremy Chan, a senior analyst on China at the Eurasia Group.\n  Senator Lindsey Graham, Republican of South Carolina, defended the importance of soft power to America's standing.\n  ''If you don't get involved in the world and you don't have programs in Africa, where China is trying to buy the whole continent, we're making a mistake,'' he said last month.\n\n\n\nGraphic\n \nPHOTO: President Donald Trump's freeze on foreign aid could be opening up opportunities for China to boost its standing on the global stage. (PHOTOGRAPH BY Haiyun Jiang for The New York created_ats FOR THE NEW YORK created_atS)               \n"
  },
  {
    "id": 1042,
    "title": "The Context with Christian Fraser - 8:45 PM GMT",
    "created_at": "2025-02-03",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\ncarrying the flag, people chanting Panama Premier, Panama first. This may be a short-term victory but we will see how long this will go going forward. Is it really about Panama or is it about China's influence in increasing influence in central America?\n We've got to talk about the presence of Chinese company in and around the Panama Canal. The focus has been on one company in particular, Hutchinson holdings which is at a lease to operate two key ports on either side of the canal. The concern, let's say US and China ever got into a conflict over Taiwan or the South China Sea and the US Navy needs to send some of their vessels quickly from the Atlantic onto the Pacific, the Panama Canal is the fastest way. And potentially a Chinese company could somehow disrupt the US Naval access they are. It's really not just Hutchinson holdings. There are other Chinese state owned enterprises and others that have strategic projects in and around the Panama Canal. It does behoove the US in order to try to find ways to protect their national sovereignty. Not just in Panama, you can look at other countries in that region where China has been using soft power. There is the irony, on the day whether US USAID office has been shattered and the United States is turning away from the soft power, we seen from the Panama President stating, we signed up to this Belt and Road initiative in 2017, along came the investment following that. That is what soft power is all about. It seems the administration is turning its back on that. That is right. During his press conference the President took a jab at the US to say I invited the Secretary of State here to talk about investment. And over the past few years there's been a space that the US has left really to other countries, of course China in order to invest in Panama. It will be interesting to see one, the president his created_at will end as president in a few years. Will a Panamanian president come to replace him that will be more pro-China? Like one of his predecessors who under his leadership Panama switched recognition from Taiwan to mainland China. Another issue, I want to go back to the fact that this is just one of several Chinese companies that are operating in and around the Panama Canal. So the Panamanian government said they will do a comprehensive audit of the Hutchinson operations but they need to do a more comprehensive audit of those other Chinese companies as well. What they can do, the kind of threats they can post to the Panama Canal and the potential espionage and surveillance capabilities that they could be doing in the Panama Canal. Thank you very much. Around the world and across the UK. This is BBC News. A fifteen year old boy has died after being stabbed at school in South Yorkshire. Another fifteen year boy has been arrested on suspicion of murder. It happened at lunchcreated_at at All Saints Catholic High School in Sheffield. In a press conference this afternoon South Yorkshire Police said the victim suffered serious injuries and despite the best efforts of\n"
  },
  {
    "id": 1045,
    "title": "How China Could Respond to Donald Trump's Tariffs",
    "created_at": "2025-02-03",
    "text": "\nPresident Donald Trump's tariffs on Beijing could eventually push China's leader, Xi Jinping, to target U.S. tech companies or curb the export of minerals critical to the American economy, according to an expert on China.\nNewsweek has contacted the Chinese Embassy in the U.S. for comment.\nWhy It Matters\nThe president has also imposed 25-percent levies on Canada and Mexico in a move he has linked to irregular immigration and cross-border flows of the opioid fentanyl.\nTrump's measures have sparked fears of a trade war which could hit the pockets of American consumers amid concern over how China and Mexico, will respond, with Canada having already announced retaliatory duties.\nWhat To Know\nCraig Singleton, from the Foundation for Defense of Democracies (FDD), a Washington, D.C. think tank, outlined a suite of measures that Beijing might deploy in response to Trump's 10-percent levy on its goods.\nAfter Trump's move, China's Ministry of Commerce said on Sunday that it would file a complaint with the World Trade Organization (WTO) and take countermeasures, without specifying further.\nSingleton, a senior China fellow at the FDD, told Newsweek that Xi will be weighing up how to project strength at home and abroad while avoiding exacerbating the country's economic vulnerabilities or triggering a costly escalation of the situation.\nXi is unlikely to match Trump's tariffs dollar for dollar because China's export-driven economy is more vulnerable than that of the U.S., but he might privately signal an openness to negotiation, using intermediaries for a face-saving compromise, Singleton said.\nShould Trump's tariffs cause disproportionate damage for China, Xi may target U.S. tech companies, curb rare-earth exports or economically pressure Washington's allies in Asia to weaken regional coalitions, said Singleton.\nXi might also escalate military provocations in the South China Sea or step up cyberattacks on U.S. infrastructure, to pressure Washington indirectly.\nChina also has leverage over the U.S. strategic supply chain and could target advanced batteries, semiconductors, solar components, pharmaceuticals, and agriculture which would amplify costs for rivals.\nSingleton said that China will frame Trump's tariffs as \"unilateral and destabilizing,\" which it could exploit by portraying itself as a steady hand amid U.S. volatility and so deepen partnerships with emerging markets.\nWhat People Are Saying\nSingleton said: \"At home, Xi is expected to frame tariffs as a test of China's resilience, emphasizing moral superiority and endurance.\n\"Invoking metaphors like the 'Long March,' he will likely cast economic sacrifices as necessary steps toward achieving China's long-term strategic goals.\"\nThe Long March refers to a year-long trek Mao Zedong and his revolutionary forces made in the 1930s during the war with the nationalists.\nChina's Commerce Ministry in a statement: \"The unilateral imposition of tariffs by the United States seriously violates the rules of the World Trade Organization. It is not only unhelpful in solving its own problems, but also undermines the normal economic and trade cooperation between China and the United States.\n\"China will file a lawsuit with the WTO for the wrong practices of the United States and will take corresponding countermeasures to firmly safeguard its own rights and interests.\"\nWhat happens next\nSingleton said that Chinese state media will portray Trump's tariffs as acts of external aggression, while rallying domestic support.\nBeijing's statement is less detailed than the responses from Mexico and Canada. On Saturday, Ottawa announced an initial 25-percent tariff on 155-billion Canadian dollars' worth ($106 billion) of U.S. goods.\nLink to Image\n\nGraphic\n \nDonald Trump\nThis image from September 23, 2024  in Smithton, Pennsylvania, shows Donald Trump addressing a rally about China's impact on U.S. agriculture.\n"
  },
  {
    "id": 1048,
    "title": "Tsai Ing-wen's Legacy: Taiwan's Resilience Amid Shifting Alliances",
    "created_at": "2025-02-03",
    "text": "\n In her eight years as president of Taiwan, Tsai Ing-wen led the island nation through an era of growing threats and geopolitical challenges, all while reinforcing Taiwan's democratic values and strengthening its military defenses. With the looming uncertainties surrounding Taiwan's international security, Tsai's leadership remains a focal point as she prepares for her next steps on the global stage.\nDuring her presidency, Tsai was faced with increasing pressures from China, which has long viewed Taiwan as a renegade province. Beijing's calls for reunification by force intensified, and Tsai had to skillfully manage Taiwan's international relations, especially with the United States. However, as The created_ats UK reports, one of her significant concerns today is the unpredictability of U.S. leadership, particularly with former President Donald Trump back in power.\nTrump's relationship with Taiwan had been strong during his first term, but recent statements and shifting policies have left Taipei on edge. Trump had publicly criticized Taiwan's defense spending, questioning whether the island was contributing adequately to its own defense. Tsai acknowledges these concerns, stating, 'We got that message and we'll be more than happy to talk about strengthening our defense capability.' She emphasizes Taiwan's readiness to increase investment in its defense forces to address U.S. concerns and ensure the island's security against increasing threats.\nHer diplomatic skill has been honed over years of delicate negotiations, notably with the Trump administration. Tsai recalls, 'Strong, frequent, and clear communication on national security was the foundation of my bond with the Trump administration.' This relationship helped Taiwan secure critical arms deals, including the $8 billion purchase of F-16 fighter jets. This collaboration elevated Taiwan's defense capacity at a created_at when Chinese military expansion, especially in the South China Sea and the Taiwan Strait, became increasingly concerning.\nBut while Tsai found success in maintaining a close alliance with the U.S., her leadership was also tested by the larger geopolitical landscape. The war in Ukraine provided Taiwan with an opportunity to demonstrate its strategic thinking on global security. Reflecting on Russia's invasion of Ukraine, Tsai remarked, 'I'm sure that Beijing is watching the Ukraine war very closely and trying to learn from the conflict. I hope that they draw the lesson that waging a war across the Taiwan Strait is going to cost them a lot [militarily, politically, and financially].' She firmly believes that any Chinese military adventurism against Taiwan would have dire consequences not just for the island, but for global stability.\nDespite facing these enormous challenges, Tsai's administration also focused on Taiwan's economic resilience and global standing. Taiwan has long been a critical player in the global semiconductor industry, and Tsai underscored the island's importance beyond just economic terms. 'Taiwan has gained global prominence because of the success of its semiconductor industry, but the world should know that Taiwan is much more than a leading chip manufacturer,' she stated. The country's values, including its commitment to democracy and human rights, helped set Taiwan apart on the world stage. Under her leadership, Taiwan became the first in Asia to legalize same-sex marriage, a historic moment for LGBTQ rights in the region.\nHowever, Taiwan's diplomatic isolation remains a serious challenge. Due to Chinese pressure, only 12 countries formally recognize Taiwan as a sovereign state. This has severely restricted Tsai's international engagements. In an attempt to shore up Taiwan's global alliances, she visited countries like the Czech Republic, France, and Canada. A planned visit to the United Kingdom was postponed, a casualty of the timing of the British Foreign Secretary's visit to Beijing. Despite these setbacks, Tsai remains steadfast in her belief that Taiwan's message needs to reach the world.\nOn the topic of the United Kingdom's evolving stance towards China, Tsai expressed concerns but also acknowledged that diplomacy requires balance. She commented, 'If the Labour Party gets to know the Communist authorities better, there could be possibilities for maintaining balance across the Taiwan Strait.' Taiwan is fully aware of the complexities of international politics, especially when it involves major powers like China and the U.S.\nPerhaps most telling of Tsai's leadership is her unflinching commitment to Taiwan's autonomy and defense. While maintaining a stance of strategic ambiguity on Taiwan's independence, Tsai has made it clear that Taiwan is already, in many ways, a sovereign entity. 'We are pretty much on our own,' she said, citing Taiwan's fully functional government, military, and judiciary. 'We have everything.'\nTaiwan's resilience, Tsai emphasized, is rooted not only in its ability to survive but in its unwavering commitment to uphold democratic values. 'Notext should underestimate our resolve to defend our freedom and democracy,' she said, reaffirming Taiwan's stance in the face of mounting pressures.\nDespite her formidable public role, Tsai's personal journey is equally compelling. Describing herself in her younger years as a quiet and reserved individual, she acknowledged how politics had forced her to evolve into a more public figure. 'Politics destroyed that part of my life. I used to be very quiet and didn't want to be too bothered by other people,' she reflected. Now, as a former president and an influential figure in Taiwan's Democratic Progressive Party, Tsai's voice continues to shape the island's international strategy.\nWith tensions across the Taiwan Strait unlikely to ease anycreated_at soon, Tsai's diplomatic legacy will likely serve as a critical foundation for Taiwan's continued fight for survival in an increasingly divided world. Whether or not her successor, President Lai Ching-te, will carry forward her strategies remains to be seen. However, Tsai's unyielding resolve and her careful balancing act between defense, diplomacy, and international values will undoubtedly remain a benchmark for Taiwan's future.\n"
  },
  {
    "id": 1053,
    "title": "Throw the book at them",
    "created_at": "2025-02-03",
    "text": "\nA SNAPPY salute to Philippine intelligence authorities following the arrests of five more Chinese nationals, claiming to be tourists from Taiwan, suspected of spying on coast guard and navy installations. The five – there are now six arrested and detained – have been individually identified by the authorities, and comes..."
  },
  {
    "id": 1055,
    "title": "China wants to deplete Philippine resources with sea aggression: analyst",
    "created_at": "2025-02-03",
    "text": "\n02/04/2025 The Philippine Coast Guard (PCG) on Monday said two China Coast Guard vessels off Pangasinan made Beijing’s closest deployment yet to the Philippine coastline. The PCG on February 1 detected CCG vessels 3301 and 3104 about 34 nautical miles off the coast of Pangasinan, within the Philippines’ exclusive economic zone (EEZ). They were spotted through the..."
  },
  {
    "id": 1060,
    "title": "China hitting PH on multiple fronts, says military",
    "created_at": "2025-02-03",
    "text": "\n-- THE military yesterday accused China of attacking the Philippines on several fronts, while former US officials and an incumbent senator said China’s aggressive expansionism is causing destabilization of the global order. “We are being battered across the different instruments of national power — politically, economically, socio-culturally, (and) militarily,” said Rear Admiral Roy Vincent Trinidad, the Navy’s..."
  }
]