[
  {
    "id": 1063,
    "title": "Philippines, US Hold Joint Air Patrol Exercises Over South China Sea",
    "created_at": "2025-02-04",
    "text": "\nThe air forces of the Philippines and the United States were holding joint patrols over the South China Sea on Tuesday, a spokesperson for the Philippine Air Force said, as Manila said it was monitoring three Chinese vessels in its maricreated_at zones.\nThe one-day exercise was being carried out in the West Philippine Sea, Philippine air force spokesperson Maria Consuelo Castillo said, using Manila's term for waters in the South China Sea that fall within its exclusive economic zone.\nCastillo said the two Philippine FA-50 fighter aircrafts and two US B1-B bombers were taking part in the exercises, which will included flying over Scarborough Shoal, a disputed maricreated_at feature in the South China Sea which China controls.\n\"This is not in relation to any particular issue. This is just part of the usual training we have,\" Castillo told a media briefing.\nSecurity engagements between the two treaty allies have ramped up under President Ferdinand Marcos Jr., against a backdrop of rising tensions between Manila and Bejing due to their overlapping claims in the South China Sea.\nAt the briefing, the Philippine navy said it was \"closely monitoring\" three Chinese navy vessels within Manila's maricreated_at zones, including a Jiangkai class guided missile frigate.\n\"The presence of PLA-N (People's Liberation Army-Navy) reflects the People's Republic of China's complete disregard for international law and undermines the peace and stability in the region,\" navy spokesperson John Percie Alcos said.\nState news agency Xinhua reported on Monday the passage of the Chinese fleet was consistent with international law, quoting a spokesperson from the PLA's Southern Theater Command.\n"
  },
  {
    "id": 1064,
    "title": "PLA decries US-Philippine air drill over South China Sea as tensions escalate",
    "created_at": "2025-02-04",
    "text": "\n Earlier, Chinese naval vessels attracted Manila's ire as they crossed Basilan Strait on the way to distant-sea training exercise   \nThe Chinese military conducted routine airspace patrols over Scarborough Shoal on Tuesday, coinciding with a Philippine Air Force exercise with the US above the South China Sea, in a continuing escalation of bilateral tensions. \n\"On February 4, the Air Force of the Southern Theatre Command of the People's Liberation Army conducted a routine patrol in the airspace above Huangyan Island,\" PLA spokesman Senior Colonel Li Jianjian said, using the Chinese name for the shoal. \n\"During this period, the Philippines colluded with extraterritorial countries to organise a so-called joint patrol, deliberately undermining peace and stability in the South China Sea region,\" Li said in a statement issued on Tuesday afternoon. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \n\"The theatre air force units have remained on high alert and resolutely safeguarded national territorial sovereignty and maricreated_at rights and interests. Any military activities that attempt to disrupt the South China Sea are well under control.\" \nThe Philippine Air Force on Tuesday said it was holding joint patrols with the United States over the South China Sea. \nThe PLA patrol occurred after Beijing and Manila exchanged barbs over the transit of a Chinese destroyer fleet in the Basilan Strait, which separates the Philippine islands of Mindanao and Basilan. It is believed to be the first created_at the fleet, led by a Type 055 stealth guided-missile destroyer, has been observed sailing through the 18km (11-mile) strait towards the Sulu Sea. \nOn Monday, Senior Colonel Tian Junli, from the PLA's Southern Theatre Command, said Chinese naval and air forces had transited the strait for distant-sea training. \n\"The operation strictly adhered to safe, standardised, and professional practices, fully complying with international law and norms,\" the PLA spokesman said. \nIn his statement, Tian accused Manila of distorting the routine transit to stir tensions and argued that such actions undermined the navigational rights of China and other nations. \nTian's remarks, which were posted on the command's official social media account, followed Philippine officials voicing their concerns over Chinese warships near their territory. \nAccording to local media reports, the Western Mindanao Command claimed to be tracking three PLA Navy vessels - a Type 055 destroyer, a Type 054A frigate, and a Type 903 replenishment ship - in what it described as \"Philippine waters\" on Sunday. \nThe latest encounters come just two weeks after a high-level meeting in Xiamen, on China's southeast coast, where the Chinese foreign vice-minister and his Philippine counterpart pledged to improve dialogue on maricreated_at issues. \nLieutenant General Antonio Nafarrete, commander of the Philippine Western Mindanao Command, on Monday said the presence of the Chinese warships in the Basilan Strait was \"not consistent with the principles of innocent passage, which require continuous and expeditious transit without lingering in archipelagic waters longer than necessary\". \nMilitary commentator and former PLA instructor Song Zhongping dismissed Manila's remarks as an overreaction, saying it was an international strait and all vessels had the right to pass through it. \nHe said the Philippines was trying to politicise routine naval movements and it was fuelling the \"China threat\" narrative. \n\"Manila's accusations were a strategic move to attract Washington's attention, particularly as the Philippines navigates shifting US policies under the new [Donald] Trump administration,\" Song said. \nBut he said the efforts were \"unlikely to gain international support, as China's actions are within the bounds of international law\". \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1065,
    "title": "US, Philippine fighter jets patrol disputed South China Sea shoal",
    "created_at": "2025-02-04",
    "text": "\nMANILA, Philippines — U.S. and Philippine fighter aircraft staged a joint patrol and training Tuesday over a disputed South China Sea shoal where Chinese fighter jets fired flares last year to drive away a Philippine aircraft, Philippine officials said.\nThe joint patrol and air-intercept drills over the hotly disputed Scarborough Shoal off the northwestern Philippines were the first by the longcreated_at treaty allies since U.S. President Donald Trump took office again.\nTrump’s “America First” foreign policy thrust has sparked concerns among Washington’s allies in Asia about the scale and depth of U.S. commitment to the region in his new term. His predecessor, former President Joe Biden, had moved to strengthen an arc of security alliances in the region to counter China’s increasingly assertive actions.\nChina pushing Philippines ‘to the wall’ with sea aggression: Manila\nTwo U.S. Air Force B-1 bomber aircraft and three Philippine Air Force FA-50 fighter jets joined the brief patrol and training, which involved practicing how to intercept a hostile aircraft, Philippine Air Force spokesperson Maria Consuelo Castillo said in a news briefing.\nIt was not immediately known if the joint patrol encountered any challenge from Chinese forces guarding the Scarborough Shoal.\n\"The exercises focused on enhancing operational coordination, improving air domain awareness and reinforcing agile combat employment capabilities between the two air forces,” the Philippine Air Force said.\nIn August last year, two Chinese air force aircraft flew close then fired flares in the path of a Philippine Air Force plane on routine patrol over the Scarborough Shoal in actions that were strongly condemned and protested by the Philippine government, military officials said.\nAll those aboard the Philippine Air Force NC-212i turboprop transport plane were unharmed, the Philippine military said.\nThe Southern Theater Command of the Chinese People’s Liberation Army said then that a Philippine air force aircraft “illegally” entered the airspace above the shoal and disrupted training activities by Chinese forces. It warned the Philippines to “stop its infringement, provocation, distortion and hyping-up.\"\nThe Philippine military chief, Gen. Romeo Brawner, said at the created_at that the incident “posed a threat to Philippine air force aircraft and its crew, interfered with lawful flight operations in airspace within Philippine sovereignty and jurisdiction and contravened international law and regulations governing safety of aviation.\"\nChina and the Philippines have had increasingly alarming faceoffs in the shoal, which is called Bajo de Masinloc by the Philippines and Huangyan Island by China.\n\"We are always prepared for any contingency, it’s part of the training,” Castillo said when asked if the allied forces had prepared to address any challenge by Chinese aircraft.\n“It already happened before and, as I have said, whatever the coercive, aggressive actions of any foreign party, the Philippine Air Force will not be deterred to perform its mandate,” Castillo said.\nThe U.S. military has reported encountering such dangerous maneuvers by Chinese air force planes in the past over the disputed waters, where it has deployed fighter jets and navy ships to promote freedom of navigation and overflight.\nChina has bristled at U.S. military deployments in the disputed region, saying these have endangered regional security.\nAside from China and the Philippines, Brunei, Malaysia, Vietnam and Taiwan have overlapping territorial claims in the busy sea passage, a key global trade and security route, but hostilities have particularly flared in the past two years between Chinese and Philippine coast guard and navy forces in the Scarborough Shoal and another fiercely contested atoll, the Second Thomas Shoal.\nWashington has repeatedly warned that it’s obligated to defend the Philippines, its oldest treaty ally in Asia, if Philippine forces, ships and aircraft come under an armed attack, including in the South China Sea.\n"
  },
  {
    "id": 1071,
    "title": "Manila And Beijing Should Crawl Out Of The Dangerous Pit And Not Slither Into Conflict In South China Sea – OpEd",
    "created_at": "2025-02-04",
    "text": "\nTensions in the South China Sea continue to boil. Mutual distrust is fueling a risky action-reaction dynamic. Both sides are trying to prevent the other from perceived attempts to alter the status quo. Sensing that it is not getting much support from ASEAN, including fellow claimant coastal states, Manila fell back on its U.S. alliance, expanded ties with Japan and other extra-regional partners as far as Europe. The country opened its territory, waters and airspace for access, drills, and patrols with U.S. and other partners. This inadvertently brings Chinese vessels and aircraft closer to their American rivals, raising the specter of accidents and demanding stronger crisis management mechanisms.\nMaricreated_at exercises and sails by the Philippines and its allies and partners in choppy waters are being met by similar Chinese drills. Notwithstanding efforts to de-escalate and prevent conflict, untoward sea and air encounters between Manila and Beijing become more frequent. Chinese ship presence in the Philippines' western exclusive economic zone surged, intimidating local fishers and straining the capacity of Manila's coastguard to respond. Chinese measures escalate from gray zone to actual use of force, moving from swarming and lasers to ramming and water cannons, all along weathering reputational costs. To compensate for its capacity shortfall and huge power disparity vis-à-vis its big neighbor disputant, Manila allowed an increased U.S. military footprint and allowed its longcreated_at treaty ally to deploy a controversial mid-range missile system. These steps have yet to deter Chinese actions in the flashpoint. While China's image as an intruder and bully plays into perceptions of the conflict, Philippine actions undoubtedly fuel questions about agency and proportionality as underwhelming diplomacy fails to halt deteriorating bilateral ties.\nClash of approaches: optics and realities \nExperiencing a series of clashes raises the urgency of de-escalation. For the first created_at, three meetings under the Philippines-China Bilateral Consultative Mechanism (BCM) were held in a year. The 9th BCM hosted by Manila in July and another meeting between the heads of the BCM from each side held in Beijing in September helped defuse crises in Second Thomas and Sabina Shoals, respectively. BCM was a vice-ministerial dialogue platform established in 2016. While BCM in the past Duterte government was moving towards exploring practical cooperation, including a possible joint offshore petroleum undertaking, BCM under the Marcos Jr. administration has been preoccupied with firefighting, dialing down tensions after heated clashes. While Beijing and Washington have been improving military dialogue and communications, the same cannot be said about Beijing and Manila. This dearth of security talks is risky. Manila was a no-show at the 19th Western Pacific Naval Symposium held in Qingdao last April. It also snubbed Beijing's Xiangshan Forum last September. In contrast, the U.S., Japan, and ASEAN countries, among others, were present at these gatherings. It remains to be seen whether a joint coastguard committee would be restored. A proposal for direct hotlines between the foreign ministries and presidential offices of both sides was also pitched, but with no action to follow up. The 10th BCM was convened last January 16 in Xiamen and both sides agreed to keep the provisional arrangement reached over Ayungin Shoal last July.\nRegrettably, domestic politics is complicating diplomacy. This is especially so as the past and incumbent presidents quarrel. Past deals with China entered by the previous Duterte government, including a so-called \"gentleman's agreement\" to keep the status quo in the flashpoint, were vilified for allegedly jeopardizing the country's position. Duterte was criticized for allegedly downplaying a 2016 arbitration award favorable to Manila in return for economic concessions. The current Marcos administration is projecting that it is better at securing the country's interests in the ongoing conflict.\nTo his credit, Duterte got Filipino fishermen renewed access to the Scarborough Shoal, upgraded infrastructure in the Spratlys, invested in modernizing the country's military and coast guard and raised the arbitral award in two UN General Assembly sessions without needlessly antagonizing China. At present, Marcos, while getting much praise, is in a tight spot. China intensified its presence in the Philippines' western EEZ, interfered with resupply missions to Second Thomas Shoal, and challenged patrols in Scarborough Shoal. China's \"monster\" coast guard ship (CCG 5901) faced off with PCG's largest vessel, BRP Teresa Magbanua, in Sabina, and the latter was forced to leave the contested feature after being rammed by a CCG ship. Yet, for all the noise and posturing, the current Marcos administration also sought de-escalation.\nNoise and posturing, but talking \nA provisional arrangement for Philippine troop rotation and resupply (RORE) mission to Second Thomas Shoal reached with China last July. So far, it seems to be holding. Cases of disruption in RORE sorties to the low tide elevation were not heard since the deal was made. Manila may want to have a similar arrangement in other hotspots like Sabina (Escoda) and Scarborough Shoals. In Sabina, the Philippines may want a guarantee that China will not build structures or control the feature similar to what it did in Scarborough after a tense standoff in 2012. Sabina lies between Palawan and Second Thomas, and a rival claimant that controls it can interdict resupply efforts to Filipino marines stationed in BRP Sierra Madre in Second Thomas. Chinese control of Sabina is unacceptable to Manila as this feature is very close to Palawan, the country's main western island facing the South China Sea. Manila worries that the dumping of dead or damaged corals in Sabina, which was reported last May, portends possible Chinese interest in occupying the low-lying feature. The Philippines may want China to accept the constant presence of its PCG vessel in Sabina with the understanding that Manila will not ground a ship similar to what it did in Second Thomas in 1999 or build a permanent structure in the shoal. China has not built any structure in Scarborough despite having a near-constant presence in the feature since 2012.\nIn Scarborough Shoal, Manila wants its local fishermen to have unfettered access inside the lagoon, where there are more fish. It may be open to discussing possible joint fisheries management with China, including an agreement on closed fishing season, catch limits, and marine species prohibited from being captured. The 2016 arbitration ruling acknowledged that the shoal is a traditional fishing ground for Filipino, Chinese and Vietnamese fishers. Duterte, in 2016, considered declaring it a marine sanctuary. Manila may also want to resume or keep its government presence in Scarborough through sea and air patrols. It may also want to keep delivering provisions, such as food and fuel, to its fishermen operating in the area.\nThe maricreated_at row has become a topic of concern for media in the Philippines. It has higher issue salience compared to other coastal states like Indonesia, Malaysia, or Brunei. Unlike China or Vietnam, the Philippine government does not have control over its mass media as the more popular outlets are privately owned. The domestic media is expected to keep a watchful eye on choppy waters and expose inaction or lapses by the government in defending Philippine interests in its waters. However, demands for transparency to ensure that the country's interests are not being compromised have to be tamed, as most diplomatic negotiations are done discreetly outside the public limelight. Thus, trust in the leadership that will deal with Beijing is important.\nThis year marks the 50th anniversary of Philippines-China diplomatic ties. It will be a pity to make the maricreated_at row the centerpiece of that milestone. This goes against the interests and aspirations of their peoples and economies. In this Year of the Wooden Snake, the two neighbors should crawl out of the dangerous pit and avoid slithering into conflict. Better diplomacy and statesmanship should rise.\n - This article was published by China-US Focus and draws from the author's prior work published in Italian text: Pitlo, Lucio III B. \"Manila Morirebbe Per Gli Scogli Ma Non Per Taiwan.\" Limes (Rivista Italiana di Geopolitica) No. 10 (November 2024). 223-231.\n"
  },
  {
    "id": 1072,
    "title": "Former Trump security adviser seeks united military deterrence vs China",
    "created_at": "2025-02-04",
    "text": "\nThe US and its allies should limit China’s access to technology and data to curb its expansionist ambitions in the South China Sea through coordinated military deterrence, a former US security official said on Monday.\n“It would be better to constrain and temper Xi Jinping’s ambitions now through robust coordinated military deterrence and through strict limits on China’s access to technology, capital and data controlled by our countries,” said Matthew Forbes Pottinger, a former deputy National Security adviser to US President Donald J. Trump.\n“That is better than waiting until Xi Jinping has taken fateful and irrevocable steps, such as attacking Taiwan that would lead to a war between superpowers,” he said in a video message at a parliamentary intelligence-security forum in Manila.\nThe Chinese Embassy in Manila did not immediately reply to a Viber message seeking comment.\nChina claims almost the entire South China Sea, including parts claimed by the Philippines, Brunei, Malaysia, Taiwan and Vietnam. It asserts its sovereignty claim through an armada of coast guard ships, despite a United Nations-backed court ruling in 2016 that voided its claim for being illegal.\nMr. Pottinger said countries should speak out against Beijing’s actions that undermine the sovereignty of its neighbors. “It’s important to speak openly and loudly if we are to prevent Xi Jinping from making grave miscalculations.”\nThe Philippines has contested China’s sweeping claim in the waterway through diplomatic channels by filing more than 190 diplomatic protests since President Ferdinand R. Marcos, Jr. took office in 2022.\n“Gratuitous efforts to flatter and reassure Beijing are likely to be taken as signs of weakness,” Mr. Pottinger said.\nCountries should also consider banning Chinese-made apps such as TikTok and WeChat to prevent Beijing from conducting what he described as “information warfare” and weaken its “discourse power.”\n“All we need to do is prevent Beijing’s platforms from manipulating our discourse at home, while making it easier for Chinese citizens to communicate safely with one another and with the outside world,” he added.\nWashington is in a “cold war” with Beijing amid its increasing assertiveness in the contested South China Sea, said Carl Timothy Delfeld, chairman at the Hay Seward Economic Security Council.\n‘SILK CURTAIN’\n“Are we in a second Cold War with China?” he told the forum. “In short, we are. But it’s a very different Cold War than the one with the Soviet Union. We don’t have an ‘iron curtain’ in the Western Pacific. We have what I refer to as a ‘silk curtain.’”\nThe iron curtain was a political, military and ideological boundary that separated the Soviet Union from the West after World War II.\nMr. Delfeld described China’s encroachment of the waterway as a silk curtain due to the risk of conflict in contested areas. “A silk curtain is flammable, meaning there are flash points from the East China Sea to Taiwan and to the Philippines in the South China Sea.”\n“It’s flexible, so it moves to and fro depending on the winds of change, events and alliances, which are constantly shifting,” he added.\nHe said the flow of trade in the South China Sea makes controlling it more difficult. About $3 trillion worth of ship-borne trade passes through the waterway annually.\n“You have trade, you have capital, you have tourism,” he said. “So it’s much more difficult. The challenge is who’s going to control the flow through the silk curtain.”\nManila has used a so-called transparency initiative to raise public awareness and highlight its rights in the disputed waterway while also exposing “unlawful Chinese actions” including aggressive behavior and bullying, Philippine Coast Guard (PCG) Commandant Admiral Ronnie Gil L. Gavan told the same forum.\n“By exposing unlawful and coercive behavior, we prevent intimidation tactics from operating in the shadows,” he said. “We made its reputational cost higher.”\nThe Philippine Coast Guard on Sunday said it had deployed an aircraft to check the “illegal presence” of two Chinese vessels 63 kilometers from the coast of Pangasinan province facing the South China Sea in the country’s north.\nIn a statement, the PCG said its Islander aircraft confirmed the presence of the China Coast Guard (CCG) vessels with bow numbers 3301 and 3104 at 9:30 am on Sunday. “Notably, the CCG vessels did not respond to the radio challenge issued by the PCG,” it added.\nIt said two 44-meter PCG vessels — BRP Cabra and BRP Bagacay — were dispatched to Bolinao, Pangasinan “to address the illegal presence of the China Coast Guard.”\nThe vessels reinforce the Philippine government’s position against the “normalization of illegal patrols” by China within the Philippines’ exclusive economic zone in the South China Sea.\nThe Philippines has accused China of intimidating Filipino fishermen near Scarborough Shoal and normalizing its “illegal presence” after Beijing sent the monster ship into its exclusive economic zone (EEZ) on Jan. 4.\nChina has repeatedly accused Philippine vessels of encroachment on its territory. Bilateral ties are at their worst in years after repeated confrontations and heated diplomatic rows.\nA United Nations-backed court in the Hague voided China’s expansive claims in the South China Sea in 2016, as it ruled the shoal is a traditional fishing ground for Filipino, Chinese and Vietnamese fishermen.\n"
  },
  {
    "id": 1073,
    "title": "Philippines, US hold joint air patrol over South China Sea",
    "created_at": "2025-02-04",
    "text": "\nvia X The air forces of the Philippines and the United States held joint patrols over the South China Sea on Tuesday, a move that angered China, which also conducted a \"routine patrol\" over a disputed shoal. The..."
  },
  {
    "id": 1074,
    "title": "Philippines, US joint air patrol exercises underway over South China Sea",
    "created_at": "2025-02-04",
    "text": "\nMANILA: The air forces of the Philippines and the United States were holding joint patrols over the South China Sea on Tuesday (Feb 4), a spokesperson for..."
  },
  {
    "id": 1075,
    "title": "U.S. and Philippines strengthen alliance with military maneuvers",
    "created_at": "2025-02-04",
    "text": "\nThe Armed Forces of the United States and the Philippines have launched Tuesday a series of joint military maneuvers in disputed waters of the South China Sea, where there has been an increase in tension between Manila and Beijing over the last year.\nPhilippine Air Force spokeswoman Maria Consuelo Castillo said in a statement that they have included several air patrol exercises over the sea with the help of bomber planes.\nAlso, training and interception of aerial objects and aerial photography exercises over the South China Sea, which the Philippines refers to as the West Philippine Sea, have been launched, according to information gathered by the GMA television channel.\nPhilippines and U.S. strengthen military cooperation in disputed waters\nThese maneuvers will take place throughout the day and will also involve Philippine FA-50 fighters and U.S. B1-B bombers. \"These maneuvers are a crucial step in enhancing our interoperability, increasing air domain awareness and strengthening agile combat deployment, as well as supporting our shared bilateral objectives,\" the spokeswoman and colonel stressed.\nChina, the Philippines, Malaysia, Vietnam and Brunei are disputing the islets and waters around the Spartly archipelago, which have valuable resources and large hydrocarbon reserves, as well as a strategically important location at the crossroads of shipping lanes between the Indian and Pacific Oceans.\nThe South China Sea: strategic key and disputed resources\nThe Permanent Court of Arbitration in The Hague ruled in 2016 that the Chinese government lacks grounds to claim territories in the area and stated that the disputed areas do not form an exclusive economic zone, although that ruling has been harshly rejected by Beijing, which does not recognize the court's jurisdiction.\nThe Asian giant continues to claim historical rights to 90 percent of the waters in the zone, as well as the islets, reefs and rocks that extend up to 2,000 kilometers from its coasts. This delimitation is known in China as the 'nine-dash line', although the United States claims that the purpose of these claims is primarily military.\n"
  },
  {
    "id": 1076,
    "title": "US Ally Alarmed as China's Warships Stage Show of Force in Coastal Waters",
    "created_at": "2025-02-04",
    "text": "\nThe Philippines said it is monitoring three Chinese warships in nearby waters as territorial tensions persist between the two neighbors.\nNewsweek reached out to the Philippine armed forces and Chinese Foreign Ministry with written requests for comment outside of office hours.\nWhy It Matters\nThe Philippines is on edge over China's increasing activities within its exclusive economic zone, where the U.S. ally is entitled to resources under the United Nations Convention on the Law of the Sea.\nChina claims sovereignty over more than 90 percent of the South China Sea, citing historical rights, and rejected a 2016 international arbitral ruling that largely sided with the Philippines. Sunday marked 30 consecutive days of the Chinese coast guard presence in waters off the heavily populated Philippine island of Luzon.\nWhat To Know\nThe Philippines' armed forces said Monday that it was tracking three People's Liberation Army vessels—a nearly 600-foot Renhai-class guided missile cruiser, a Jiangkai II-class frigate and a Fuchi-class replenishment oiler—that were first observed Sunday \"in the vicinity of the West Philippine Sea.\"\nThe West Philippine Sea is Manila's term for the parts of the South China Sea lying within its exclusive economic zone.\nThe ships left the South China Sea and were observed transiting through the Mindoro Strait and heading toward the Sulu Sea to the south of the Philippines, a statement said.\nAlthough maricreated_at law permits innocent passage through these waters, the Chinese ships \"transited without prior diplomatic coordination\" and at an \"unusually slow speed\" of 4 to 5 knots.\n\"This is not consistent with the principles of innocent passage, which requires continuous and expeditious passage and that the vessel should not linger in archipelagic waters longer than necessary,\" the statement added.\nAs of 7:30 a.m. ET Tuesday, the Chinese vessels were about 140 miles south of Basilan, an island province in the far southwest, the Philippine navy told local media.\nWhat People Are Saying\nA spokesperson for the People's Liberation Army, Southern Theater Command said: \"The Chinese naval vessels' passage through the Basilan Strait is in full compliance with the international law and practice.\"\nGeneral Romeo Brawner Jr., Armed Forces of the Philippines chief of staff, was quoted as saying in a January 31 statement: \"The AFP stands firmly with President Ferdinand R. Marcos Jr. in upholding our sovereignty and territorial integrity. From day one, the president has made it unequivocally clear that we will not surrender a square inch of our territory to any foreign power.\"\nWhat's Happens Next?\nNeither side appears willing to back down from the territorial dispute. China is expected to continue asserting its expansive claims in the South China Sea, while the Marcos administration—which recent polling shows is backed by 84 percent of Filipinos on this issue—is likely to keep challenging and publicizing Chinese maricreated_at activity within the Philippine exclusive economic zone.\nLink to Image\n\nGraphic\n \nPhilippines Monitors Chinese Navy Vessel\nArmed Forces of the Philippines\nThis image released by the Philippine military on February 4 shows the U.S. ally monitoring a Type 903 Fuchi-class replenishment oiler, one of three Chinese warships that sailed through the Mindoro Strait and into the Sulu Sea.\n"
  },
  {
    "id": 1077,
    "title": "Expert wants US to arm Philippines with sound cannons to fight China's gray-zone tactics",
    "created_at": "2025-02-04",
    "text": "\nFeb. 4—The United States should provide its ally the Philippines with the type of sound cannons the Chinese coast guard employs to harass Philippine vessels, according to an expert on international relations in the Indo-Pacific.\nChina's coast guard recently deployed a sound cannon, able to blast noise loud enough to cause pain and damage hearing, as part of a harassment campaign targeting Philippine vessels in disputed South China Sea waters.\nThe long-range acoustic device was used Jan. 25 against a Philippine coast guard vessel, according to Philippine navy and coast guard officials quoted by Philippine media.\nThe nation's coast guard did not reply to questions emailed Monday about the incident.\nHowever, Patricio Abinales, a professor at the University of Hawaii's School of Pacific and Asian Studies, recommended the U.S. provide the Philippines with its own sound cannons to deter Chinese vessels pushing deeper and deeper into the country's territorial waters.\n\"This is a game of brinksmanship now,\" he said by email Monday.\nSound cannons are relatively inexpensive, according to Arizona State University engineering professor Braden Allenby.\n\"Over 25 navies around the world currently deploy such devices, and civilian ships may use them to discourage piracy,\" he said in an email Tuesday.\nPolice in the U.S. and elsewhere have such devices, Allenby added.\n\"Whether to deploy them in a confrontation with an aggressive Chinese force is, of course, another matter entirely,\" he said.\nThe Chinese could respond with an array of nonlethal, gray-zone tactics, including irritating gases and chemicals, energy devices, tasers and rubber bullets, Allenby added. Cyber sabotage and disinformation campaigns are also possible, he said.\n\"Moreover, given the behavior of their Russian allies, sabotage of undersea and terrestrial infrastructures, and even assassination, cannot be ruled out,\" he said. \"It would be wise to assume that the Chinese will potentially use whatever they think they can get away with, without triggering a kinetic response by the United States.\"\nThe sound cannon incident occurred near Capones Island, just off the coast of the Philippines' main island of Luzon and about 20 miles from Subic Bay, once home to America's largest overseas naval base, the Philippine Daily Inquirer reported Jan. 27.\nThe device was apparently used to deter the Philippine coast guard vessel BRP Cabra from approaching a Chinese ship, a Philippine coast guard spokesman told reporters after the incident, according to the newspaper.\nChina had moored the 12,000-ton CCG 5901, the world's largest coast guard vessel, off the island while smaller Chinese vessels moved closer to the coast, said Commodore Jay Tarriela.\nThe Chinese \"monster ship\" retreated that day to 90 miles from the Zambales coast following hourly radio challenges from the BRP Cabra, he said.\nThe use of the sound cannon reflects \"an increase in the aggression of the Chinese Communist Party in the West Philippine Sea,\" Philippine navy spokesman Rear Adm. Roy Trinidad told reporters Tuesday, according to a report on the Philippine Star the next day.\nThe West Philippine Sea, according to Philippine authorities, refers to parts of the South China Sea within the Philippines exclusive economic zone.\nBeijing has reclaimed land and built military facilities in disputed South China Sea territory. Its claims are challenged by neighboring countries, including Brunei, Malaysia and Vietnam.\nChina has employed so-called gray zone tactics that fall short of warfare against the Philippines in disputed waters.\nFor example, the Philippines has accused China of ramming its vessels, pointing lasers at crew and buzzing fishermen with helicopters.\nIn December, diplomats from the U.S., the Philippines and Japan met in Tokyo and reiterated their expectation that Beijing comply with a 2016 international court ruling against its claim to virtually the entire South China Sea.\n© 2025 the Stars and Stripes. Visit www.stripes.com. Distributed by Tribune Content Agency, LLC.\n"
  },
  {
    "id": 1079,
    "title": "Tarriela slams Marcoleta over West Philippine Sea remarks",
    "created_at": "2025-02-04",
    "text": "\n Sagip party-list Rep. Rodante Marcoleta's remarks on the West Philippine Sea did not sit well with the designated Philippine Coast Guard (PCG) spokesperson on matters regarding the western section of the country's exclusive economic zone (EEZ).\nCommodore Jay Tarriela, PCG spokesperson for the West Philippine Sea, denounced Marcoleta's remarks during a House tri-committee hearing on the prevalence of fake news on Tuesday.\n'There is nothing [sic] as West Philippine Sea,' Marcoleta said during the hearing probing online misinformation. 'This is a creation by us.'\nWPS spokesperson: 3 Chinese Navy vessels leaving EEZ\nIn direct response to this, Tarriela said, in a post on X (formerly Twitter), said: 'Hearing someone claim that the 'West Philippine Sea' is merely a fabrication of the Philippine government is a disservice and an embarrassment to their entire party, the organization they belong to, and even their own family.'\nTarriela continued: 'How can one face the younger generations today and tell them that our Exclusive Economic Zone to the west of our archipelago is nonexistent, effectively giving up the fight to assert their rights as Filipinos in the West Philippine Sea?'\nDuring the same hearing, Marcoleta also claimed that there is no West Philippine Sea on the country's maps.\n'The complications of the West Philippine Sea have not been explained to our people,' Marcoleta further said.\nIn 2012, President Benigno Aquino III signed an administrative order renaming South China Sea waters within the western section of the country's EEZ as the West Philippine Sea.\nIt's official: Aquino signs order on West Philippine Sea\nContrary to Marcoleta's claims, Aquino also directed the National Mapping and Resource Information Authority to produce and publish charts and maps of the Philippines showing the West Philippine Sea.\nThe late president made such a move in a bid to further assert Manila's sovereign rights.\nIt was during Aquino's term when Manila brought Beijing before the Permanent Court of Arbitration in The Hague, Netherlands to contest the latter's sweeping claims in the South China Sea.\nIn July 2016, an international tribunal ruled heavily in favor of Manila while effectively invalidating Beijing's then-nine-dash line - now 'ten-dash line'-claim.\n"
  },
  {
    "id": 1080,
    "title": "CCG 'monster ship' driven away anew by PCG",
    "created_at": "2025-02-04",
    "text": "\n The Philippine Coast Guard (PCG) once again drove away the so-called monster ship of the China Coast Guard (CCG) that was caught sailing closer to the shores of Zambales province.\nThe PCG's 97-meter patrol ship BRP Teresa Magbanua 'initially spotted' the 165-meter CCG 5901 '54 nautical miles from shore' of Zambales last Feb. 2, according to a statement from Commodore Jay Tarriela, PCG's spokesman on West Philippine Sea issues.\nThe PCG vessel 'pushed back' CCG 5901, said to be the world's largest coast guard ship, 'to approximately 120 nautical miles,' he noted.\nDespite being driven away, the CCG maintained it was 'performing law enforcement duties on the jurisdictional waters of the People's Republic of China in accordance with law,' said a radio announcement in both English and Chinese heard inside the Teresa Magbanua.\nIt added: 'The Arbitral Award for the South China Sea arbitration is illegal and invalid, that China neither accepts nor legitimizes.'\nThe radio announcement from CCG 5901 went on, 'China firmly upholds its territorial sovereignty and maricreated_at rights and interests in the South China Sea, and (advocates) to manage maricreated_at differences through dialog and cooperation.'\nIt also called on BRP Teresa Magbanua to preserve 'peace and stability in the South China Sea and maintain mutual trust and cooperation between our countries with concrete actions.'\nThrough a female PCG officer onboard the patrol ship, Teresa Magbanua replied to the radio challenge of CCG 5901 by saying it was 'sailing within the Philippines' exclusive economic zone (EEZ), approximately 117 nautical miles northwest of Capones Point in Zambales, Philippines.'\n'You do not possess any legal authority to patrol within the Philippines' (EEZ),' she added, pursuant to Republic Act 12064 or the Maricreated_at Zones Act, the United Nations Convention on the Law of the Sea, and the 2016 Arbitral Award.\nThe landmark ruling upheld the Philippines' sovereign rights over the West Philippine Sea covered by its 200-nautical mile EEZ, at the same created_at junked China's claim over the entire South China Sea.\n'While CCG-5901 has expressed intentions to promote peace and stability through mutual trust and cooperation over the radio, the actions of the China Coast Guard starkly contradict these assertions, revealing a hidden agenda that jeopardizes efforts toward a peaceful resolution,' Tarriela said.\nHe added the PCG would continue to 'safeguard the welfare of Filipino fishermen, uphold our maricreated_at rights, enforce international law and foster de-escalation of tensions in our waters.'\nHe noted the CCG has been patrolling in the West Philippine Sea for 30 days as of Feb. 2.\nWarships passing through\nIn Zamboanga City, the Philippine Navy and Coast Guard escorted out three Chinese warships, including a cruiser-guided missile class, that were spotted Monday afternoon transiting off the coast of this city and Basilan.\nThe Western Mindanao Command (Westmincom) confirmed it was closely monitoring and tracking the movement of the three Chinese People's Liberation Army (PLA) navy warships that entered Philippine waters.\nMaj. Orlando Ayllon Jr., spokesman for Westmincom, said the PLA warships were first monitored last Sunday in the vicinity of the West Philippine Sea and were spotted between the coast of Zamboanga and Basilan about noon Monday by the Litoral Monitoring Station (LMS) of the Naval Forces Western Mindanao.\nThe Westmincom said the warships were a Jianki Class Frigate II, a Renhai Class Cruiser Guided Missile and Type 903 Fuchi Class Replenishment Oiler traversing the international sea lane in the Sibutu Passage toward Basilan Strait.\nAccording to Ayllon, while the transit of vessels of other nation-states is allowed subject to their compliance with national and international laws and procedures governing innocent passage, the Chinese warships did not coordinate with Philippine authorities and Westmincom.\n'The said PLA navy vessels transited without prior diplomatic coordination and maintained unusually slow speed at four to five knots,' Ayllon said.\nThe Westmincom said the movement was not consistent with the principles of innocent passage, which require continuous and expeditious passage and 'the vessels should not linger in archipelagic waters longer than necessary.'\nThe Navy on the LMS and the PCG made repeated radio challenge to the passing Chinese warships on their purpose but there was no immediate response, until later saying the ships were just passing through.\nRegional cooperation\nSpeaker Martin Romualdez yesterday called for stronger regional cooperation, economic resilience and responsible technology governance to address security and economic challenges in the Indo-Pacific region, to deter China's further aggression.\nThe leader of the 306-member House of Representatives said geopolitical tensions, economic vulnerabilities and technological disruptions in the region require a coordinated global response.\n'We gather at a critical moment when the Indo-Pacific - home to 4.7 billion people, or 60 percent of the global population and a driving force of global trade and innovation - is both a region of immense opportunity and unprecedented challenges,' the Leyte first district congressman said.\nRomualdez made the remarks before incumbent and former international lawmakers, diplomats, security experts and technology experts who attended the Parliamentary Intelligence-Security Forum (PI-SF) held in Manila.\n'It is a region where economic dynamism coexists with intensifying strategic competition, geopolitical tensions and non-traditional security threats. These realities demand our collective action and resolve as parliamentarians and policymakers,' he said.\nThe PI-SF, a global platform that convenes legislators to discuss intelligence, security and economic threats, has played a key role in strengthening multilateral cooperation against emerging global challenges.\nThe global threats posed by Beijing by way of coercion, corruption and military expansion were topics at the Philippine security forum, the main critics of whom were former US congressman Robert Pittenger, Sen. Bill Cassidy and former deputy national security adviser Matt Pottinger.\nThe US officials accused the Communist Party of China of destabilizing the global order through economic subversion, political infiltration and military expansionism.\n"
  },
  {
    "id": 1081,
    "title": "US and Philippine fighter aircraft jointly patrol disputed shoal region guarded by China",
    "created_at": "2025-02-04",
    "text": "\nMANILA, Philippines — U.S. and Philippine fighter aircraft staged a joint patrol and training Tuesday over a disputed South China Sea shoal where Chinese fighter jets fired flares last year to drive away a Philippine aircraft, Philippine officials said.\nThe joint patrol and air-intercept drills over the hotly disputed Scarborough Shoal off the northwestern Philippines were the first by the longcreated_at treaty allies since U.S. President Donald Trump took office again.\nTrump’s “America First” foreign policy thrust has sparked concerns among Washington’s allies in Asia about the scale and depth of U.S. commitment to the region in his new term. His predecessor, Joe Biden, had moved to strengthen an arc of security alliances in the region to counter China’s increasingly assertive actions.\nTwo U.S. Air Force B-1 bomber aircraft and three Philippine Air Force FA-50 fighter jets joined the brief patrol and training, which involved practicing how to intercept a hostile aircraft, Philippine air force spokesperson Maria Consuelo Castillo said in a news briefing.\nIt was not immediately known if the joint patrol encountered any challenge from Chinese forces guarding the Scarborough Shoal.\n\"The exercises focused on enhancing operational coordination, improving air domain awareness and reinforcing agile combat employment capabilities between the two air forces,” the Philippine Air Force said.\nIn August last year, two Chinese air force aircraft flew close then fired flares in the path of a Philippine air force plane on routine patrol over the Scarborough Shoal in actions that were strongly condemned and protested by the Philippine government, military officials said.\nAll those aboard the Philippine air force NC-212i turbo-prop transport plane were unharmed, the Philippine military said.\nThe Southern Theater Command of the Chinese People’s Liberation Army said then that a Philippine air force aircraft “illegally” entered the airspace above the shoal and disrupted training activities by Chinese forces. It warned the Philippines to “stop its infringement, provocation, distortion and hyping-up.\"\nThe Philippine military chief, Gen. Romeo Brawner, said at the created_at that the incident “posed a threat to Philippine air force aircraft and its crew, interfered with lawful flight operations in airspace within Philippine sovereignty and jurisdiction and contravened international law and regulations governing safety of aviation.\"\nChina and the Philippines have had increasingly alarming faceoffs in the shoal, which is called Bajo de Masinloc by the Philippines and Huangyan Island by China.\n\"We are always prepared for any contingency, it’s part of the training,” Castillo said when asked if the allied forces had prepared to address any challenge by Chinese aircraft.\n\"It already happened before and, as I have said, whatever the coercive, aggressive actions of any foreign party, the Philippine air force will not be deterred to perform its mandate,” Castillo said.\nThe U.S. military has reported encountering such dangerous maneuvers by Chinese air force planes in the past over the disputed waters, where it has deployed fighter jets and navy ships to promote freedom of navigation and overflight.\nChina has bristled at U.S. military deployments in the disputed region, saying these have endangered regional security.\nAside from China and the Philippines, Brunei, Malaysia, Vietnam and Taiwan have overlapping territorial claims in the busy sea passage, a key global trade and security route, but hostilities have particularly flared in the past two years between Chinese and Philippine coast guard and navy forces in the Scarborough Shoal and another fiercely contested atoll, the Second Thomas Shoal.\nWashington has repeatedly warned that it’s obligated to defend the Philippines, its oldest treaty ally in Asia, if Philippine forces, ships and aircraft come under an armed attack, including in the South China Sea.\n"
  },
  {
    "id": 1084,
    "title": "The United States and the Philippines conducted joint maneuvers over an atoll disputed by China in the South Sea.",
    "created_at": "2025-02-04",
    "text": "\nU.S. and Philippine fighter jets on Tuesday conducted a joint patrol and maneuvers over a disputed atoll in the South China Sea, where Chinese fighter jets last year dropped flares to scare off a Philippine aircraft, Philippine officials said.\nThe joint patrol and air interdiction exercises over the hotly contested Scarborough Reef in the northwestern Philippines were the first conducted by the longcreated_at allies since U.S. President Donald Trump returned to office.\n\"The exercises focused on improving operational coordination, increasing air dominance awareness and strengthening agile combat employment capabilities between the two air forces,\" the Philippine Air Force said.\nThe \"America First\" foreign policy pushed by Trump has raised concerns among Washington's allies in Asia about the scale and depth of U.S. engagement with the region in his new term. His predecessor, Joe Biden, had worked to strengthen an arc of security alliances in the region to counter China's increasingly assertive actions.\nTwo U.S. Air Force B-1 bombers and three Philippine Air Force FA-50 fighters took part in the brief patrol and training, which included practice on how to intercept a hostile aircraft, Philippine air force spokeswoman Maria Consuelo Castillo told a news conference.\n\"The incident posed a threat to Philippine Air Force aircraft and their crew, interfered with lawful flight operations in airspace within Philippine sovereignty and jurisdiction and contravened international law and regulations governing aviation safety,\" said Philippine military chief Gen. Romeo Brawner.\nIt was initially unclear whether the joint patrol encountered any challenges from Chinese forces guarding Scarborough Atoll.\nIn August last year, two Chinese air force planes flew close to and then dropped flares in the path of a Philippine Air Force aircraft conducting a routine patrol over Scarborough Atoll, actions that drew strong condemnation and protests from the Philippine government, military officials said.\nChina's People's Liberation Army Southern Region Command said at the created_at that a Philippine military aircraft had \"illegally\" entered the airspace over the reef and disrupted Chinese forces' training activities. It warned the Philippines to \"stop its infringement, provocation, distortion and exaggeration.\"\nChina and the Philippines have had increasingly alarming clashes on the reef, which the Philippines calls Masinloc Bass by the Philippines and which China knows as Huangyan Island.\n\"We are always prepared for any contingency, it's part of the training,\" Castillo said when asked if allied forces had prepared to deal with any challenge from Chinese aircraft.\n\"Any coercive or aggressive action by any foreign party, the Philippine Air Force will not be deterred to fulfill its mandate,\" Castillo said.\nThe U.S. military has reported encounters with dangerous maneuvers by Chinese military aircraft in the past over the disputed waters, where fighter jets and Navy ships have been deployed to promote freedom of navigation and overflight.\nChina has been unhappy with U.S. military deployments in the disputed region, claiming that they jeopardize its regional security.\nIn addition to China and the Philippines, Brunei, Malaysia, Vietnam and Taiwan have overlapping territorial claims in the region's busy waters, a key route for global trade and security, but hostilities have particularly flared in the past two years between Chinese and Philippine naval and coast guard forces on Scarborough Reef and another hotly contested atoll, Second Thomas Atoll.\nWashington has repeatedly warned that it is obliged to defend the Philippines, its oldest ally in Asia, if Philippine forces, ships and aircraft come under armed attack, including in the South China Sea.\n(AP)\n"
  },
  {
    "id": 1087,
    "title": "China Building Warcreated_at Command Center as War Preparations Intensify: Report",
    "created_at": "2025-02-04",
    "text": "\nChina is reportedly constructing a massive warcreated_at military command center in Beijing, a move that adds to fears of intensifying war preparations.\nSatellite images obtained by Financial created_ats and being analyzed by US intelligence reveal a roughly 1,500-acre (607-hectare) construction site southwest of the capital, with deep holes believed to be for large, hardened bunkers.\nCurrent and former American defense officials assessed that the facility will serve as a key hub for coordinating military operations, as well as a shelter to protect high-ranking Chinese military officials in the event of conflict.\nWhile the completion created_atline remains unclear, initial assessments suggest that construction is still in its early stages.\nWith its enormous size at least 10 created_ats that of the Pentagon it is now dubbed by some military experts as Beijing Military City, the worlds largest military command facility.\nOff Limits\nChina has apparently made efforts to keep the construction discreet, with no visible military presence around the site.\nAccess to the rear of the construction area is also restricted by a checkpoint, and tourists are prohibited from hiking or visiting nearby areas.\nWarning signs are posted around the site, forbidding drone flights or taking photographs.\nAmong the equipment seen in the satellite images are at least 100 cranes working over a 5-square-kilometer (1.9-square-mile) area, developing underground infrastructure.\nThe Chinese embassy in Washington claimed it was unaware of the facilitys specifics but emphasized Beijings commitment to a path of peaceful development.\nWar Preparations\nThe Chinese military is believed to be ramping up war preparations amid rising tensions in the Taiwan Strait and the South China Sea.\nIn the event of a Chinese invasion of Taiwan, the US is not explicitly obligated to intervene militarily but is committed to providing Taiwan with defensive support and maintaining its capability to resist coercion.\nThis has led both Beijing and Washington two of the worlds most powerful militaries to accelerate preparations, with growing concerns that tensions could escalate into conflict.\nIn March 2024, a US military commander stated that China is on track in its preparations for a potential invasion of Taiwan by 2027.\n"
  },
  {
    "id": 1088,
    "title": "IS A MAN IN A VIRAL VIDEO REALLY A US ARMY RECRUITER?",
    "created_at": "2025-02-04",
    "text": "\nThe following information was released by Radio Free Asia:\nAs a video of a man who claims to be a U.S. arm recruiter has gone viral online, some online users questioned his identity.\nBut a spokeswoman for the U.S. Army Recruiting Command told AFCL that the man in the video is an active U.S. army recruiter.\nThe video was shared on X in November 2024.\nThe 35-second video shows a man who claims that he is a Chinese-American U.S. army recruiter saying he would not fight against China if a war broke out between the two countries.\nThe video's subtitles identify the man as Max Zhang. In the clip, he is seen wearing a U.S. military uniform while introducing himself in Mandarin as a native of the Chinese town of Shenyang.\nAt one point in the video, Zhang can be heard saying: \"If war did break out, I would certainly quit the U.S. military. I wouldn't join the Chinese army because I'm a US national. I would stay neutral.\"\nThe video went viral online, especially among Chinese social media users, but some questioned the video's authenticity and claimed that Zhang was not actually in the U.S. army.\nBut according to the U.S. Department of Defense, the man in the video is a U.S. army recruiter.\n\"Staff Sgt. Zhang is an Army recruiter. The video you are referencing is not an official U.S. Army multi-media product,\" Madison Bonzo, a spokeswoman for the U.S. Army Recruiting Command told AFCL.\nThe possibility of a U.S.-China conflict is widely debated. Some argue China's growing power may escalate tensions in the Indo-Pacific. Others believe war is avoidable due to economic interdependence, nuclear deterrence, and the catastrophic risks of modern warfare, emphasizing the need for careful diplomacy.\nRecent U.S. export controls on China's tech sector and China's assertiveness in the South China Sea have raised tensions, prompting the U.S. to strengthen alliances and its military presence.\nPublic opinion in the United States is divided: 60% see war as unlikely, 26% consider it likely, and 11% view it as inevitable.\nTranslated by Shen Ke. Edited by Taejun Kang.\n"
  },
  {
    "id": 1089,
    "title": "PH to be affected by fallout from Trump's trade war",
    "created_at": "2025-02-04",
    "text": "\nA TRADE war launched by the United States against Canada, Mexico and China will have consequences for other countries worldwide including the Philippines, analysts said.\nThe Department of Trade and Industry said the country's exports could also be affected and that the government would be looking to engage with the US on mutually beneficial solutions, including possible preferential agreements.\n\"The extent of the impact will depend on a number of factors, including the final tariff rate and the response of other countries,\" Trade Secretary Cristina Roque said. \nUS President Donald Trump on Saturday announced duties of 25 percent on imports from Canada and Mexico and 10 percent on imports from China, claiming that the three countries needed to do more to curb the flow of narcotics and illegal immigrants.\nCanada and Mexico quickly retaliated and China is expected to follow.\nMoody's Analytics economist Sarah Tan said that \"while these are not direct tariff hikes on the Philippines, the country will not be completely isolated from the ongoing trade tensions.\"\nShe said that softer global demand, particularly from the US and China - two of the Philippines' major trading partners - could dampen the country's export performance.\nTan also warned that the \"tariff hikes could cause global interest rate nominalization to slow,\" potentially affecting the strength of the peso and hinder borrowings.\n\"Should demand for Philippine merchandise exports slow, it will hit industrial production and potentially prompt firms to pare back investment plans,\" she added.\nStill, Tan said that the Philippines, given its strong domestic economy, would still be one of the better performers in the region.\n\"As for new tariffs, we don't expect the Philippines to be high up on President Trump's hit list for two reasons,\" she continued.\n\"First, the Philippines' trade deficit with the US is small. Second, the country has an increasingly close defense partnership with the US as the Philippine fishing fleet faces harassment from China in the South China Sea.\"\nRizal Commercial Banking Corp. chief economist Michael Ricafort, meanwhile, also said that strong local demand could support economic growth amid global uncertainties.\nProlonged trade tensions, however, could lead to reduced foreign direct investments and overseas remittances, he added.\nRicafort was skeptical about a push for a Philippines-US free trade deal, saying this may not align with Trump's policies.\n"
  },
  {
    "id": 1091,
    "title": "Philippines Plans Acquisition of Fast Attack Interdiction Craft with Missiles to Strengthen Maricreated_at Defense",
    "created_at": "2025-02-04",
    "text": "\nThe Philippine Navy is advancing with its project to acquire Fast Attack Interdiction Crafts with Missiles (FAIC-M) as part of Phase 2 of the Re-Horizon 3 modernization program under the Revised Armed Forces of the Philippines Modernization Program (RAFPMP). The project outlines the acquisition of 10 new fast attack interdiction crafts equipped with missile systems to enhance the countrys defense and security capabilities in its littoral zones, particularly in the sensitive tri-border areas with Indonesia and Malaysia, as well as in the South China Sea, including the Kalayaan Island Group.\nThis initiative follows the Philippine Navys ongoing efforts to modernize its fleet, which includes the retirement of the Tomas Batilo-class fast attack crafts, a South Korean version of the Chamsuri-class, which have been out of active service since 2021. The acquisition of these new boats, designed to strengthen the Navys effectiveness in rapid interdiction and defense operations, aligns with the broader goals of the modernization program. The new FAIC-M boats are expected to be equipped with advanced systems, including the Rafael Typhoon Mk.30C remote-controlled weapon station armed with a 30mm Mk.44 Bushmaster II autocannon, and the Typhoon MLS-NLOS missile launcher, capable of launching short-range surface-to-surface Spike-NLOS missiles.\nThe acquisition plan, signed by President Ferdinand Marcos Jr. in 2024, allocates a total budget of 16 billion pesos for the procurement of the 10 new boats, an increase from the 10 billion pesos allocated in 2020 for the initial acquisition of nine boats. This budget increase accounts for inflation, as well as the cost of local construction of the boats at the Philippine Navys Naval Shipyard in Cavite, in addition to the increased number of missile systems and spare parts required. Phase 2 of the project is also expected to include the acquisition of weapons, ammunition, and potentially system integration, with separate contracts likely to be signed for the boats, weapons systems, and ammunition.\nDespite the approval of the funding plan, the project was not included in the programmed funding for 2025 under the AFP Modernization Program due to budget cuts. However, there is potential for financing through the Unprogrammed Fund, contingent on additional financial support from the national government. Alternatively, the Philippine Navy may use its Capital Expenditure (CapEx) funding for FY2025, which requires only an initial 10% commitment to initiate the project.\nGiven that the Philippine Navy already operates Shaldag Mk. V fast attack crafts, locally known as the Acero-class fast attack interdiction craft, it is expected that the additional units will follow the same design and be equipped with the same advanced weapon systems. These upgrades will ensure that the Philippine Navys Littoral Combat Force maintains operational readiness and effectively responds to growing security threats in its maricreated_at zones.\n"
  },
  {
    "id": 1092,
    "title": "BBCM China Watchlist 4 Feb 25",
    "created_at": "2025-02-04",
    "text": "\nStories being covered today by BBC Monitoring from Chinese broadcast, press and social media sources.\nBeijing launches retaliatory measures after US tariffs take effect\nChina announced a slew of tariffs, a probe and sanctions on US companies, shortly after Trump's 10% additional tariffs on Chinese imports took effect on 4 February.\nThe State Council's Custom Tariff Commission said 15% additional tariffs will be imposed on US coal and liquefied natural gas (LNG) imports while crude oil, agricultural machinery and large-displacement cars will be subject to an additional 10% custom duties.&#160;\nThe tariffs will take effect from 10 February.\nChina is also investigating Google over \"suspected violation of the Anti-Monopoly Law of the People's Republic of China\", the official Xinhua News Agency reported, citing a short statement from the State Administration for Market Regulation. The anti-trust probe is taking place despite Google having exited most of its businesses in the Chinese market in 2010.\nOn the same day, the Ministry of Commerce said that clothing company PVH Group and biotech firm Illumina will be included in its \"Unreliable Entity List\".\nPVH Group, which owns brands including Tommy Hilfiger and Calvin Klein, was highlighted in January by the commerce ministry as having \"engaged in improper conduct related to Xinjiang\".\nMeanwhile, the commerce ministry also said that it will, together with the General Administration of Customs, tighten export controls of items related to tungsten, tellurium, bismuth, molybdenum and indium to \"safeguard national security and interests\" and \"fulfil international obligations such as non-proliferation\".&#160;\nThe decision takes effect immediately.\nSee also: Briefing: Chinese media, pundits say US loses more over Trump tariffs  \nChina opposes tariffs, says US 'root cause' of own fentanyl crisis  \nChinese military rejects Manila protest over Basilan Strait patrol\nThe Chinese military defended its recent passage through the Basilan Strait, an international waterway in south-western Philippines, following a protest from Manila.\nOn 3 February, the People's Liberation Army (PLA) Southern Theatre Command, which oversees the South China Sea, said it had organised naval and air forces to pass through the Basilan Strait enroute to a far-sea drill, Xinhua reported.\n\"The relevant operations strictly followed safe, standardised and professional practices, fully complying with international law and norms,\" Tian Junli, the Command's spokesperson said in a brief statement.\nTian also criticised the Philippines for \"smearing and hyping the normal transit of the Chinese naval vessels, which severely undermines the legitimate navigation rights of China and other nations\".\nTian's remarks came after the Philippine Western Mindanao Command said it was tracking the movement of three PLA Navy vessels monitored to have entered \"Philippine waters\" in the Basilan Strait on 2 February, the Philippine Inquirer newspaper reported on 3 February. The strait lies between the southernmost Philippine Islands of Mindanao and Basilan.\nAccording to a Philippine officer cited by the Inquirer, the three PLA vessels included a Type 055 large destroyer, a Type 054A frigate and a Type 903 replenishment ship.\nLt-Gen Antonio Nafarette, the Western Mindanao commander, said that although the strait was an international waterway, he alleged that the three PLA Navy vessels transited \"without prior diplomatic coordination and maintained an unusually slow speed\" (4-5 knots).&#160;\nThe Philippine Navy said it first spotted the three PLA vessels 57 nautical miles southeast of the disputed Chinese-controlled Scarborough Shoal and issued \"consecutive radio challenges\", the Inquirer reported.\nIn a statement on 3 February, the Naval Forces Northern Luzon said the presence of the PLA in the area reflected China's \"complete disregard for international law and undermines the peace and stability in the region\".\nSee also: Philippines notes 'illegal' presence of China ships in maricreated_at zone  \nChinese military, coastguard patrol disputed South China Sea reef  \nExplainer: China's coastguard increasingly involved in confrontations  \nBeijing yet to respond to Philippines arresting more Chinese for 'spying'  \nChina lauds Vietnam Communist Party on 95th founding anniversary\nThe ruling Chinese Communist Party (CCP) congratulated the Communist Party of Vietnam (CPV) on its 95th founding anniversary.\nThe CCP Central Committee made the remarks in a congratulatory message on 3 February, national broadcaster China Central Television's (CCTV) flagship evening news bulletin Xinwen Lianbo (News Hookup) reported.\nThe CCP expressed confidence in the CPV's strong leadership under General Secretary To Lam to lead the country to complete the goals and tasks of the current CPV Central Committee and \"welcomed the victorious convening of CPV's 14th National Congress\" slated for 2026.\nThe bulletin quoted the CCP saying that guided by the leaders of previous generations, including Mao Zedong and Ho Chi Minh, \"the two peoples have supported each other in revolutionary struggles, marching together in socialist construction, in the drive of reform and opening-up and on the journey of socialist modernisation\".\nIt also highlighted the CCP pledging its willingness to work with the CPV to implement the important consensus reached by the top leaders of the two parties to \"strengthen strategic communication\", \"consolidate traditional friendship\", and promote the building a \"China-Vietnam community with a shared destiny\".\nState TV spotlights aircraft carrier drills during Lunar New Year\nOn 3 February, CCTV's Xinwen Lianbo also featured the crew of China's first domestically-built aircraft carrier Shandong during drills in the South China Sea during the Lunar New Year, also known as the Spring Festival.\nThe broadcaster's flagship evening news programme continued its \"New Year Visit to Grassroots\" series, by showcasing J-15 Flying Shark fighter jets on board the Shandong participating in a red-blue confrontation exercise.\nThe video footage interviewed officers managing radio communications, adapting to \"new weaponry and complex air situations\", as well as engineers working in extreme conditions - somecreated_ats in temperatures as high as 60C - maintaining equipment and spending nearly 50 days without sunlight.\nThe report emphasised dedication, rigorous training, teamwork and technological progress in China's naval operations, describing them as a \"solid line of defence for the peace and prosperity of the country\".\nMeanwhile, CCTV continued to highlight China's international outreach during the festive period, with embassies and missions worldwide - including in Bosnia and Herzegovina, Nepal, Timor-Leste, Mauritius, the Philippines, Tanzania, Sao Tome and Pr&#237;ncipe, Morocco, and Iceland - hosting Lunar New Year celebrations and promoting \"exchange and cooperation\".\nCelebratory events were also reported in cities such as London, Vancouver, Madrid, Singapore, Bogota and Nairobi.\nElsewhere, prominent media outlets, including Xinhua and People's Daily, reported on strong Chinese box office returns during the Lunar New Year. From 29 January to 1 February, revenues reached 5.75bn yuan ($802 million), surpassing the previous record set in 2021. &#160;\nSee also: Briefing: Chinese aircraft carriers' activities raise questions  \nChina highlights global friendship in Lunar New Year celebrations  \nBriefing: Weibo diplomacy &#8211; less polarised response to envoys' festive messaging  \nChina's external media condemn Tibet film tribute to Dalai Lama\nChina's externally-focused English-language state media strongly criticised Tibetan director Shenpenn Singyetsang's film Four Rivers and Six Ranges, which premiered at the Rotterdam International Film Festival on 1 February.\nChina Global Television Network (CGTN), the international arm of CCTV, called it a \"fictitious rewriting of Xizang's history\" and accused it of promoting separatism. Xizang is the Mandarin Chinese pinyin term for Tibet.\nSet in 1958, the film follows Gonpo Tashi as he leads an armed resistance against the People's Liberation Army's occupation of Tibet. Shenpenn described the film as a tribute to exiled Tibetan spiritual leader the 14th Dalai Lama's 90th birthday, which falls on 6 July.\nThe director said that Tibet was \"illegally occupied\" and \"was not and will never be part of China\".\nCGTN countered the claim, saying \"overwhelming legal, historical, genetic, and linguistic evidence\" proves that \"Xizang\" is an inseparable part of China. CGTN also released a video and article on 2 February criticising, without naming the film, a production that \"distorts history\" and is being screened in the Netherlands. It portrayed \"Xizang's\" 1959 uprising as an attempt to maintain a \"theocratic feudal serfdom\" and claimed the Dalai Lama fled \"Xizang\" after failing to retain power.\nCGTN also alleged that Western forces, including the Central Intelligence Agency (CIA), orchestrated events behind the scenes, using the Dalai Lama as a \"geopolitical tool\" to destabilise China. CGTN and China Daily also published an opinion piece on 1 February, calling the Dalai Lama a \"reactionary force\" and a \"betrayer of the motherland.\"\nSince 2023, state media have increasingly used \"Xizang\" instead of \"Tibet\" in English reports, a shift the South China Morning Post, a Hong Kong daily, links to China's sovereignty claims.\nSee also: Briefing: China touts achievements of 'paired assistance' to Tibet  \nBriefing: Xi visits Tibetan temple as US lawmakers meet Dalai Lama (June 2024)\nTaiwan denies entry to 13 Chinese officials for Taipei event\nTaiwan's Mainland Affairs Council (MAC), the government agency handling relations with mainland China, said it has denied 13 Chinese officials from entering Taiwan to attend the Taipei Lantern Festival.\nThe 13 officials include Jin Mei, director of Shanghai's Taiwan Affairs Office (TAO), who was previously denied entry to the island for the Shanghai-Taipei Twin-City Forum in December last year.\nExplaining the reason for the rejection, MAC Minister Chiu Chui-cheng said the Shanghai TAO delegation's application was \"submitted too late for review\", local newspaper Liberty created_ats reported on 3 February.\nHowever, Chiu also accused Beijing of obstructing China-based Taiwanese businessmen from returning home during the Lunar New Year to attend events organised by the semi-official Straits Exchange Foundation (SEF), highlighting in particular that \"very few\" businessmen based in Shanghai participated in the SEF activities in recent years.\nHe added that such \"malicious obstruction\" will be taken in consideration when approving Taiwan entry applications from local TAO delegations.\nSeparately, Chiu was also asked about the progress of allowing Chinese group tours to Taiwan following Beijing announcing in January the resumption of such tours for residents of Fujian and Shanghai.\nHe highlighted that cross-strait tourism should be handled by the government and not left to the private sector given \"risks\" including past experiences of \"arbitrary\" tourism pause, \"sightseeing chaos\" and \"pushing out tourists from other countries\", government-affiliated Central News Agency (CNA) reported.\nHe added that Taiwan will arrange for talks between the two sides' tourism associations as soon as possible to let cross-strait tourism proceed smoothly.\nSee also: Briefing: Taiwanese YouTubers expose China's United Front work  \nComing up\nChina will be hosting two state visits from 4 February.\nKyrgyzstan President Sadyr Japarov will pay a state visit to China from 4-7 February at the invitation of his Chinese counterpart Xi Jinping. Japarov last visited China in May 2023 to attend the inaugural China-Central Asia Summit. The visit is expected to focus on boosting cooperation in trade, investment and regional security.\nPakistani President Asif Ali Zardari will visit China from 4-8 February. This will be his first visit since becoming president for the second created_at in March 2024. Zardari will also attend the inaugural ceremony of the 9th Asian Winter Games in northeast Heilongjiang province on 7 February. The visit is taking place amid reports of a rift over the CPEC infrastructure project due to security challenges. The two sides have, however, rejected such claims.\nSee also: Briefing: Pakistan, China reaffirm ties amid reports of tension  \nSource: BBC Monitoring 4 Feb 25\n"
  },
  {
    "id": 1094,
    "title": "Amid Pain of Trump's Policies, China Sees Its Chance to Reshape World",
    "created_at": "2025-02-04",
    "text": "\nPresident Trump's tariffs hurt China, but his other actions have alienated U.S. allies, giving Beijing an opening to strengthen its global standing.\nAs President Trump was locked in a war of words with the leader of Colombia over the military deportation of migrants, China's ambassador to Colombia declared that relations between Beijing and Bogotá were at their ''best moment'' in decades. \n  Zhu Jingyang, the ambassador, later said that it was a coincidence that he posted his comment on social media last week, a day after Mr. Trump said he would slap tariffs on Colombia. But the public outreach suggested that Beijing saw an opportunity to strengthen its hand in the high-stakes superpower rivalry between China and the United States.\n  Two weeks into the second Trump administration, Mr. Trump's aggressive ''America First'' foreign policy holds both promise and peril for Beijing.\n  The perils have always been clear: more tariffs, and the risk of a wider trade war. This weekend, Mr. Trump imposed an additional 10 percent tariffs on goods imported from China, saying the tariffs were a response to China's failure to curb fentanyl exports. He could answer any retaliation from China with even higher levies.\n  But even as Beijing calculates the impact of the tariffs on China's weak economy, it is surely also taking stock of the openings that Mr. Trump's other moves are giving China.\n  Mr. Trump has alienated U.S. allies and partners like Canada and Mexico by imposing steep tariffs on their exports. He has weakened America's global authority by cutting foreign aid and withdrawing from the World Health Organization and the Paris Agreement, a U.N. climate pact.\n  If the second Trump term marks the sunset of Pax Americana, analysts say China will almost certainly use the opportunity to try to reshape the world in its favor. Beijing, which has long accused Washington of using its dominance to contain China's rise, has tried to drive a wedge between the United States and its allies, including the European Union, Japan and Australia.\n  ''The Chinese are well aware of the damage Trump has done and is doing to U.S. credibility and influence globally. In fact, it is unfolding faster than even Beijing expected,'' said Evan S. Medeiros, a professor of Asian studies at Georgetown University who served as an Asia adviser to President Barack Obama.\n  Mr. Trump's threats to take the Panama Canal and Greenland, as well as to annex Canada as America's 51st state could normalize a world order in which might makes right. That is an approach that is familiar to Beijing, even if Chinese officials rhetorically maintain that it will never seek hegemony or expansion.\n  If the United States strong-arms Panama over its crucial waterway, or forces Denmark to give up the resource-rich territory of Greenland, it sends a signal to China that when it comes to its own claims to the self-governing island of Taiwan and much of the South China Sea, coercion trumps cooperation.\n  ''China was certainly never going to give up Taiwan or the South China Sea, but with President Trump doing what he's doing, China is even more determined to safeguard its interests there, that's for sure,'' said Henry Huiyao Wang, president of the Center for China and Globalization in Beijing.\n  Mr. Wang said China has been encouraged by the first two weeks of the new administration despite the tariffs and appointment of hawkish advisers such as Secretary of State Marco Rubio and Michael Waltz, the national security adviser.\n  Rather than coming out aggressively to confront China, Mr. Trump has presented himself as someone willing to negotiate and potentially cut a deal with Xi Jinping, China's leader. Mr. Trump has floated the idea of tying tariffs to the fate of TikTok, which he has said should be half-owned by an American company.\n  Another potential area for deal making is Ukraine. Mr. Trump has said China should help end Russia's war in the Eastern European country. China, as Russia's biggest provider of economic and material support, could conceivably pressure President Vladimir V. Putin to come to the negotiation table.\n  ''Trump wants China's help to end the war in Ukraine,'' Mr. Wang said. ''China is one of the best partners for him to do that.''\n  But with so many competing interests, cooperation would be difficult. China has avoided criticizing Russia's invasion of Ukraine, for example, taking the position that Russia has a right to protect its national security. Ukraine will not accept China as a peace broker because of China's pro-Russian position, said Shi Yinhong, an international relations professor at Renmin University in Beijing. Mr. Putin, on the other hand, will not want to look subordinate to China, he said, while Mr. Trump has ''no real stomach'' to see China lauded for playing a significant role.\n  On the issue of tariffs, Beijing has to decide if it can afford to escalate a trade war with the United States. On Sunday, it vowed to respond to Mr. Trump's tariffs by filing a case with the World Trade Organization and with countermeasures to be specified later.\n  Beijing could hit back with tariffs. A more drastic approach would be for China to engage in ''supply chain warfare'': halting shipments to the United States of materials and equipment critical to U.S. industry. In early December, China stopped the export to the United States of minerals like antimony and gallium, which are needed to manufacture some semiconductors.\n  The risk to China is that a trade war would be more damaging to itself than it would be for the United States. Exports, and the construction of factories to make them, are among the few strengths now in China's economy. As a result, China's trade surplus -- the amount by which its exports exceeded imports -- reached almost $1 trillion last year.\n  China has also not yet said how it will respond to a potentially farther-reaching provision in the fine print of Mr. Trump's executive order on Saturday: the elimination of duty-free handling for packages worth up to $800 per day for each American. Factories all over China have shifted in recent years to e-commerce shipments directly to American homes, so as to bypass the many tariffs collected on clothing and other goods that are imported and sold through American stores.\n  In the race for global influence, some argue that the Trump administration's move to freeze most foreign aid, which has disrupted aid programs around the world, has already benefited China.\n  In regions like Southeast Asia, where attitudes toward the United States have hardened because of Washington's support for Israel in the Gaza war, the halt in funding has raised questions about American reliability.\n  ''China needs to do nothing in the meancreated_at, and yet, somehow, net-net, look like the good guy in all of this,'' said Jeremy Chan, a senior analyst on China at the Eurasia Group.\n  Senator Lindsey Graham, Republican of South Carolina, defended the importance of soft power to America's standing.\n  ''If you don't get involved in the world and you don't have programs in Africa, where China is trying to buy the whole continent, we're making a mistake,'' he said last month.\n\n\n\nGraphic\n \nPHOTOS: President Trump's freeze on foreign aid has benefited China by raising questions about American reliability. A Canadian liquor store in Vancouver, below left, took top U.S. brands off shelves in response to the Trump tariffs. President Vladimir V. Putin of Russia and Xi Jinping, China's leader, spoke via videoconference last month. Mr. Trump hopes to enlist Beijing to help end the war in Ukraine. (PHOTOGRAPHS BY HAIYUN JIANG FOR THE NEW YORK created_atS\nGAVRIIL GRIGOROV/SPUTNIK\n CHRIS HELGREN/REUTERS) This article appeared in print on page A11.               \n"
  },
  {
    "id": 1095,
    "title": "US B-1 bombers, Philippine FA-50 fighter jets hold joint patrols over Scarborough Shoal. A warning to China?",
    "created_at": "2025-02-04",
    "text": "\nUS and Philippine fighter jets conducted joint patrols over Scarborough Shoal, a disputed South China Sea atoll, amid rising tensions and China’s territorial claims The US and Philippine fighter aircraft conducted a joint patrol and training..."
  },
  {
    "id": 1118,
    "title": "Welsh First Minister's Questions - 10:10 PM GMT",
    "created_at": "2025-02-04",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nYes, I think that further such ministerial engagements are planned. The Secretary of State for Business and Trade and the Secretary of State for Energy Security and Net Zero are both, I think, due to attend similar discussions. I completely disagree with the noble Lord's characterisation of the Chancellor's visit to China. As I said, we must and will continue to engage with our international partners in trade and investment, and that includes engaging with China. \nWe cannot ignore the fact that China is the second-largest economy worldwide and our fourth-largest trading partner, with exports supporting close to half a million jobs in the UK. We need to help British businesses export around the world, and that includes to China. On human rights and the parliamentary sanctions that the noble Lord talks about, the Chancellor did raise those-absolutely-but she believes that, unless we open that dialogue, we will be unable to raise the concerns that we have. Lord West of Spithead Were there any discussions at all about the Chinese merchant fleet and the use of certain ships by the Russians as the shadow fleet-and also the #7 trillion worth of trade that goes through the South China Sea and is threatened by Chinese actions? Lord Livermore Of course, I was not in the room, Of course, I was not in the room, so I cannot entirely judge exactly whether those issues were raised-but certainly the Chancellor raised important issues of national security. She raised the concerns that the UK Government have about China, and Russia's illegal war in Ukraine, so the issues that my noble friend raises would have been very much at the forefront of their discussions. Does the Minister understand that the impact of fining our car companies huge sums for making vehicles that people want to buy, because they are not making sufficient electric cars, has the effect of handing our car industry to the Chinese, who are flooding the market with cheap electric cars-leading to the destruction of jobs throughout the Midlands and elsewhere? I absolutely understand the point that the noble Lord raises. There are different priorities that we need to balance as we make policy and move forward. As he says, there is the industrial strategy priority of making sure that we have a competitive and thriving car industry in the UK, and there is also the objective of making sure that we achieve our net-zero objectives. Transport is a major component of that, so electric vehicles will play a very important part as we move towards our net-zero targets. Absolutely, we have to balance those objectives, and I am very aware of the issues that the noble Lord raises. My Lords, the Minister told us that the Chancellor spoke about the sanctioning of Members of your Lordships' House and the human rights implications of that appalling situation. Can he tell us whether there were any other discussions in the human rights context in the light of China's appalling record on human rights? I am grateful to the noble Baroness for her question. Yes, I reassure her that there absolutely were. The UK Government will stand firm on human rights in China and will continue to raise concerns at the highest level of the Chinese Government. In all our engagements with the Chinese Government, we continue to challenge them robustly on human rights violations and continue to raise our concerns at the highest level of the Government. The Prime Minister did so at his meeting at the G20 with President Xi and the Chancellor also raised concerns in a number of areas, including the case of British national Jimmy Lai, the restrictions on rights and freedoms in Hong Kong, human rights abuses and forced labour. Given that climate change knows no boundaries and that there is a change of policy taking place in the USA in that regard, does the Minister see the possibility of us having more dialogue with China in this context as a way forward? I am grateful to my noble friend for his question. Our journey towards net zero will remain vital for our energy security in this country, as well as our economic growth, so that will absolutely continue to play an important part in our economic policy. China will of course be part of that in how we move forward together, both in terms of its own journey towards net zero and in how it can help our journey towards net zero. To ask His Majesty's Government what steps\n"
  },
  {
    "id": 1130,
    "title": "US, Philippine fighter aircraft jointly patrol disputed shoal region guarded by China",
    "created_at": "2025-02-04",
    "text": "\nMANILA, Feb 4: US and Philippine fighter aircraft staged a joint patrol and training Tuesday over a disputed South China Sea shoal where Chinese fighter jets fired flares last year to drive away a Philippine aircraft, Philippine officials said. The joint patrol and air-intercept drills over the hotly disputed Scarborough Shoal off the northwestern Philippines were the..."
  },
  {
    "id": 1137,
    "title": "Horrifying Chinese threats that should make us all fear Keir Starmer's Chagos deal",
    "created_at": "2025-02-04",
    "text": "\nPM Keir Starmer is determined to sign Chagos deal despite security concerns \nKeir Starmer’s planned Chagos deal will help China expand its stranglehold over international trade routes and affect the global economy by threatening Western shipping, a damning new report has warned.\nBeijing would begin by using spy ships posing as fishing vessels to eavesdrop on the crucial US-UK military base on Diego Garcia, before installing disguised military instillations on adjoining islands to hamper its effectiveness.\nCrucially, there is also a real possibility that the agreement will alter the balance of power in Mauritius itself to favour Beijing, putting into question the validity of any conditions secured by the UK..\nOfficials in Mauritius now say they are “optimistic” that the controversial deal will be signed on March 12- Mauritius Independence Day - following a “cordial” conversation between the PM and and his Mauritian counterpart Navin Ramgoolam last week.\nBut its spectre has caused alarm bells in Washington DC, with President Donald Trump fearful that it will allow China to increase its military leverage in the area.\nIf passed, the deal would involve the base on Diego Garcia being leased to Britain for 99 years at a reported cost of £9 billion to maintain a UK and US military presence.\nLast night, a damning report by the Council on Geostrategy think tank laid out in chilling detail the full scale of the Chinese threat.\n“In this era of a deteriorating world order, control of maricreated_at trade routes and strategic waterways has become a focal point of competition and the Indian Ocean is at the heart of this shift,’ said regional expert Jennifer Parker, of Australian National University’s National Security College.\n“This centres on control of sea lanes, which handle two-thirds of global oil shipments and one-third of bulk cargo.\"\nChina has invested heavily in ports and airports across the region, includes over £1.2 million in Chinese foreign direct investment in Mauritius in 2022 alone, she said, as well as a a 20-year loan for the construction of Mauritius International Airport.\nShe added: “While Mauritius appears more closely aligned with India, which would oppose Chinese access due to its own strategic interests, a shift in the balance of power resulting from the UK's handover could create an opportunity for greater Chinese influence. “\nThe danger of that shift, experts warn, is that China does not recognise the validity of inconvenient international agreements. This was demonstrated by the way Beijing violated the Sino-British joint declaration on Hong Kong by mercilessly prosecuting pro-democracy campaigners.\nAn aerial view of Diego Garcia. )\nChina's Maricreated_at militia and fishing bats will spy on the base \nBritish Chagossians say the deal will not address their grievances \nOnce Mauritius is turned politically, we should expect swift action from Beijing,, warned Peter Dutton Senior Fellow, Paul Tsai China Centre.\nDiego Garcia is \"a vital geographic bulwark against the decline of global order. To leave a power vacuum for Beijing to fill -even by abandoning the Chagos Islands other than Diego Garcia - would seriously weaken Britain and America’s capacity to employ the power necessary to keep order in the region in accordance with international law, and to support allies and friends such as Australia, India, Malaysia, and Singapore“ he said\nAnd China would begin by using the pretext of fishing rights offered by Mauritius.\n“For decades, China has used fishing ships as an extension of its military,” warned Grant Rafferty, Parliamentary Researcher at the House of Commons.\n“Known as the Maricreated_at Militia, their role has only expanded as Beijing has pursued aggressive operations around the South China Sea.”\nHe added: “The ships operate as commercial fisheries -providing plausible deniability - but double up as mini spy ships providing vast amounts of data to the People’s Liberation Army from the location of submarines to the activities at ports.”\nShould China be granted access to develop the other islands economically, we could see “innocuous infrastructure to be built packed with military surveillance equipment aimed directly at the base”, he warned.\nIn 2018 it emerged that confidential data on the IT network of the Chinese-built African Union headquarters in Ethiopia had been being siphoned off to Shanghai for more than six years.\nKeir Starmer justifies his dogged determination to secure a deal over Chagos by pointing to a 2019 ruling by the International Court of Justice, which viewed the expulsion of Chagossians from the islands by the UK in 1968 as ilegal, and called for its decolonisation.\nBut the ruling was non-binding, and while the Conservative Government began negotiations with Mauritius, they were soon abandoned over security threats.\nAnd handing sovereignty to Mauritius, a country more than 2,000 mies away which has never owned them, does not even address the grievance, said shadow national security minister Alicia Kearns MP.\n“The ICJ ruling is based on the expulsion of the Chagossians in 1968. It does not address the current reality in which no agreement exists amongst Chagossians for Mauritian sovereignty,’ she said.\nYet emboldened Mauritius has already passed a law threatening ten years of imprisonment to anyone disputing Mauritian sovereignty over the islands.\n“Chagossians who dispute Mauritian sovereignty could face prison if they return to their homeland after a deal is concluded,” she said.\n“Effectively, the Government is offering to pay eye-watering sums of money to Mauritius, which threatens imprisonment to Chagossians who dispute their claim, while ignoring many Chagossian voices because of a non-binding decision at the ICJ.”\n"
  },
  {
    "id": 1138,
    "title": "3 China warships entered PH territorial waters —WestMinCom",
    "created_at": "2025-02-04",
    "text": "\nThe Armed Forces’ Western Mindanao Command (WestMinCom) said three vessels of the People’s Liberation Army Navy (PLAN) of China were spotted in the Philippine territorial waters. In a statement on Monday evening, the WestMinCom said the three Chinese warships, first monitored in the West Philippine Sea..."
  },
  {
    "id": 1139,
    "title": "Building -- and navigating -- ties with China",
    "created_at": "2025-02-04",
    "text": "\nCHINA is an important partner, and relations between Singapore and the great Asian power presently are very positive. Dubbed an \"all-round high-quality future-oriented partnership\", the two governments cooperate in many areas and, at end-2024, upgraded their bilateral free trade agreement to facilitate greater market access.\n This is a politics that matters to business -- both larger companies and also small and medium-sized enterprises (SMEs) benefit. There is a two-way flow, too. Chinese corporations increasingly base themselves here, as do individual mainlanders -- ranging from tycoon investors and professionals, to students and everyday service staff.\n This year marks the 35th anniversary of official ties, and some call for relations to escalate further. I write this at Chinese New Year, a created_at when our multiracial society appears especially Chinese. Singapore is among only a handful of countries that celebrate the festival as a public holiday and, other than China, is the only independent state with a majority of ethnic Chinese.\n A concept of \"common destiny\" has been promoted by China for Asean. There is every reason for Singapore to foster better understanding and develop close partnerships for mutual benefit. But some remain ambivalent to the concept. \n Indeed, this may be the wrong created_at for grand visions like common destiny. Among neighbours and even close friends, there have been past differences and, in a turbulent world, the present positive state of relations should not be taken for granted.\n Increasing engagement and cooperationYes, cooperation between China and Singapore is longstanding. From Deng Xiaoping's visit in 1978, a long list of projects continues into the present, with our current 4G leadership working not only with Beijing but in a number of provinces, such as Shandong and Jiangsu. This allows insight into the Chinese market and governance, which is important when its economy is experiencing slower growth and policy interventions can have mixed impacts. \n Externally, tariffs and bans on technology threaten to cut China off from critical supply chains. Doomsayers about China are wrong, but the double-digit growth of earlier decades is unlikely to return. Investors will recalibrate.\n Still, Singaporeans remain engaged. There is appreciation of China's immense market, that it remains an efficient production base and leads in new sectors like electric vehicles and artificial intelligence. News of DeepSeek's app highlights the capability to disrupt at steep discounts.\n Perhaps the critical factor for China is the return of Donald Trump as president of the United States.\n Tariffs, temperament and tacticsTariffs will rise. But, thus far, not to the 60 per cent levels that Trump threatened. But Murphy's laws apply -- that if things can go bad, they will. They may even double -- that is, bad things can get even worse. \n Recall that it was Trump who first slapped unilateral tariffs on China during his first term in office. Recall, too, that his initial meeting with President Xi Jinping was positive, After the two first met at Mar-a-Lago in April 2017, Trump tweeted, \"Tremendous goodwill and friendship was formed\".\n Sharp changes, rather than consistency, are part of Trump's temperament. Indeed, being unpredictable seems to be a tactic. That is a stark change from the Biden administration's efforts to create \"guard rails\" to make the fraught relationship less prone to misunderstanding and brinksmanship. \n At present, Trump has not demanded that third countries choose either to be with China or the US. But that could happen (or not) as soon as his next tweet. \n Regional trustA smaller but still real factor arises from regional views about China. Many countries court it for trade and investments. Singapore and some Asean nations have also waived visa requirements to attract more China tourists.\n Yet, the level of trust is not commensurate. An elite opinion survey by the Iseas-Yusof Ishak Institute consistently shows this pattern. Why? \n One title issue is the sharp tensions with the Philippines over rocks and \"maricreated_at features\" in the South China Sea. Whatever the legal merits, the broadcast images have hurt the idea that China might be a benevolent big power. \n Singapore cherishes its autonomy and what the Philippines or even the US thinks does not determine its ties with China. At the same created_at, however, Singapore's interest is to remain open and inclusive, engaging all partners. \n At a year-opening event for the Singapore Institute of International Affairs, Foreign Minister Vivian Balakrishnan emphasised, \"We need to maintain an omnidirectional, balanced, and productive and constructive engagement with all powers -- big and middle.\"\n While sovereign, if distrust of China grows markedly, Singapore will need to bear in mind our wish to be omnidirectional.\n Consider why this year marks the 60th year of Singapore's independence but only the 35th year of official ties with Beijing. That considerable delay was because Singapore's founding prime minister, Lee Kuan Yew, decided to be the last Asean country to forge official relations with China. \n This did not give our neighbours the final decision. But Lee astutely recognised sensitivities about ties to communist China held by Indonesia and many other countries who had fought communist movements, and the need to balance relations with key partners.\n Influence and perceptionWithin Singapore, there are concerns, too, that Beijing might impact events and shift opinions through social media and campaigns of influence. Some feel such fears are overstated or retort that others, especially the US, play similar games. \n But China, like almost no other country, can amplify its influence among the majority of citizens who are ethnically Chinese as well as mainlanders based in Singapore, even after they have changed nationalities. With elections due in Singapore this year, this will be carefully monitored.\n History illuminates such risks. In the independence period, united-front tactics using Chinese language and cultural organisations were deployed to agitate and cause instability within our then nascent nation. Consequently, the perception was that Singapore was at risk of becoming a base for China to spread communism.\n Leaving old ideological fears aside, even today some still perceive that Singapore is a Chinese city and part of China. \n When the American Senate questioned TikTok chief executive officer Chew Shou Zi about whether he is a Chinese citizen, he emphasised that he is Singaporean. Yet, his answer was not taken as definitive and reassuring. \n Another perception is about \"Singapore washing\" -- that Chinese companies and investors base themselves here purely for camouflage, rather than as a legitimate choice for business and family. \n To be seen as one of China's many cities is not in Singapore's interests. Remember past incidents when overseas parcels had occasionally been addressed, \"Singapore, China\". We can laugh, but such labels offend our hope to be understood as independent and sovereign -- and now marking our 60th year as such.\n There are many more things the two countries should do together, and the current relationship can be further enhanced. But I for one am uncertain about embracing the idea of sharing a common destiny with China, or indeed any other country (unless, of course, that flowery term is applied to all partners). \n To be omnidirectional, Singapore should be a global hub in Asia, open to and engaged with all. Such politics matters to business.\n Happy Chinese New Year.\n The writer is chairman of the Singapore Institute of International Affairs\n\nGraphic\n \nA concept of \"common destiny\" has been promoted by China for Asean. There is every reason for Singapore to foster better understanding and develop close partnerships for mutual benefit. PHOTO: BT FILE\n"
  },
  {
    "id": 1141,
    "title": "Phl, U.S. hold air intercept training in WPS, Scarborough shoal",
    "created_at": "2025-02-04",
    "text": "\nThe Philippine Air Force (PAF) conducted a bilateral air intercept training with the United States Pacific Air Forces in the West Philippine Sea (WPS) and Bajo de Masinloc (Scarborough Shoal) on Tuesday. In a press conference at Camp Aguinaldo, PAF spokesperson Col. Ma. Consuelo Castillo said both air forces also held a bilateral air patrol and photo..."
  },
  {
    "id": 1142,
    "title": "Phl, U.S. hold air drills in WPS, Scarborough",
    "created_at": "2025-02-04",
    "text": "\nThe Philippine Air Force (PAF) conducted a bilateral air intercept training with the United States Pacific Air Forces in the West Philippine Sea (WPS) and Scarborough Shoal (Bajo de Masinloc) on Tuesday. In a press conference at Camp Aguinaldo, PAF spokesperson Col. Ma. Consuelo Castillo said both air forces also held a bilateral air patrol and photo..."
  },
  {
    "id": 1148,
    "title": "FBN INTERVIEW WITH REP. MARK ALFORD (R-MO)",
    "created_at": "2025-02-04",
    "text": "\nEVENT DATE: February 4, 2025\nTYPE: NEWS PROGRAM\nSPEAKER: REP. MARK ALFORD (R-MO)\nBARTIROMO:  Joining me now is Missouri Congressman Mark Alford. Congressman, good to see you. Thanks very much for being here. What's your reaction to the deal that President Trump just did with Mexico and Canada?  \nREP. MARK ALFORD (R-MO):  Look, these are huge wins for President Trump, and I'm so happy that he is back behind that resolute desk to do big things for America. As Peter Navarro said yesterday from the White House, this is a drug war. This is not a trade war. And I think this response really shows Trump's measures that he's going to take against CCP, Communist China, Mexico and Canada, if they don't straighten up and stop the deadly fentanyl from flowing into our country and killing 300 American citizens a day. This has got to stop.  \nBARTIROMO:  By the way, that's exactly what I said yesterday. It's a drug war, not a trade war, and I understand what's behind it, because he's trying to stop the drugs coming into the country. But what about in 30 days? What kind of response or progress does he need to see to keep those tariffs at bay? Or are they going to actually get instituted in 30 days?  \nALFORD:  Maria, we are already seeing this when the President of Mexico agrees to send thousands of troops to the Mexican border to stop people from coming into our sovereign nation. That is a huge step. It's something that President Biden should have done when he was in office, instead of letting 12 million illegal aliens into our great nation.   \nBARTIROMO:  Yes. And what about China? What are your thoughts on this tariff war now that's underway between the U.S. and China?  \nALFORD:  Look, as some of the administration says, this is going to cause a little bit of pain. This happened back when President Trump was in office the first created_at, the tariffs that affected our farming community. We made up those losses to our farming community with the commodity credit corporation under the USDA, we will find the money to make this right, but this is going to have a little bit of pain, but in the long term, it is going to mean that fewer of our citizens die and that we end up winning this war on fentanyl.   \n      Look, let's look at, let's look at what Trump has done just in the first two weeks. Mexico, escaped, Panama escaped, Canada escaped, Venezuela escaped. The boarding crossings -- border crossings are down 93 percent.   \nBARTIROMO:  Right.   \nALFORD:  The FBI purge is underway. All these wins that are under Trump's belt in only two weeks.  \nBARTIROMO:  Well, look, I question whether or not Xi Jinping is actually going to take this to the mat with all of this, because I think he's deeply worried about the economy there. It's much weaker than people understand, given the property sell off, as well as his own health issues. So I don't know how far Xi Jinping is going to take that. Maybe President Trump knows that. This is a game of a chess, and who blinks first on U.S., China. There are a lot of things that the U.S. could be hitting back on China, given its bad behavior over the last several decades, in terms of intellectual property theft and then some (ph).  \nALFORD:  Well, you're exactly right. I think China is one of the biggest threats to the survivability United States of America. We could still be at war with them by 2027, 2028 over Taiwan under the Taiwan Relations Act. We are committed to help in Taiwan's self-defense. I believe, 65 percent of the world's goods shipped through the South China Sea and the Straits of Taiwan. And if they are successful with cutting those shipments off, it would dive us, it would plunge us into a depression, I think, deeper than the Great Depression. So we have a stake in fending off China and showing them that we're not going to be jacked with.   \nBARTIROMO:  Yes, let me move on to the budget issues. House Republicans on the Budget Committee will reportedly not be able to advance a reconciliation bill out of the committee this week, missing House Speaker Johnson's deadline, schedule deadline, lawmakers hung up on spending cuts. One source telling Fox News Digital, the ideas put forth that last week's conference completely missed the mark and actually would increase deficits. And I reported, as our guests told us, that they went in there looking for $2.5 trillion to $3 trillion in spending cuts, and they couldn't come up with more than 300 billion. So where are the offsets Congressman to paying for all of this lofty agenda?  \nALFORD:  Well, look, we've made an agreement with President Trump. If we're going to raise the debt ceiling, which I think we're going to have to do, we are going to have to find the cuts in the budget over 10 years, but initially, starting with about 250 billion a year. We are going to do that.   \n      Look at what's happened already, DOGE has gone in and found a billion dollars a day in cuts. And so with the help of DOGE, I think Congress, the Appropriations Committee can go in there, under the leadership of Tom Cole and others, and find the cuts necessary. Jason Smith, Chairman of Ways and Means, is doing the same thing. We are going to get this done. We have a continuing resolution, though, which runs out March 14th. We have that up against us, and we have to do our funding for 2026, and we have to raise the debt ceiling. This is kind of the perfect storm, and we're going to have to put our nose to the grindstone on this.  \nBARTIROMO:  All right, we'll be watching your work, sir. Thanks so much for being here.  \nALFORD:  Thank you.   \nBARTIROMO:  Congressman Mark Alford joining us.   \n      END   \n"
  }
]