[
  {
    "id": 1153,
    "title": "CANADIAN WARSHIP VISITS CAMBODIA AFTER DRILLS IN SOUTH CHINA SEA",
    "created_at": "2025-02-05",
    "text": "\nThe following information was released by Radio Free Asia:\nThe Canadian navy's Halifax-class frigate HMCS Ottawa has completed a four-day friendly visit to Cambodia where, as with all other foreign warships, it was not given access to the China-developed Ream naval base.\nThe frigate is on a mission to \"promote peace, stability, and the rules-based international order\" in the Indo-Pacific region, known as Operation Horizon.\nLast month, it conducted joint exercises with the U.S. navy in the South China Sea and sailed near the Scarborough shoal, a hotspot of tension between China and the Philippines.\nIt also took part in La Perouse 25, a French-led multinational exercise in waters near the Indonesian archipelago.\nOn its first visit to Cambodia, HMCS Ottawa, with 240 crew docked from Feb.1 to Feb. 4 at the Sihanoukville Autonomous Port, 20 kilometers (12 miles) from the Ream base where two Chinese corvettes are the only foreign warships allowed access.\nThe U.S. has expressed concerns about the lack of transparency around China's development of the base and whether it will in future serve as a de-facto foreign base for the Chinese navy, on the doorstep of the disputed South China Sea.\nThe Canadian ship's visit was aimed at \"strengthening solidarity and friendship between the navies of both countries,\" the port's management said.\nFor its part, the HMCS Ottawa hailed its visit as a show of Canada's growing engagement with the region.\n\"This visit allows us to clearly demonstrate an enduring defense commitment to the Indo-Pacific region and enhance Canada's role as a trusted international partner,\" it said on its Facebook page.\nHMCS Ottawa leaving Sihanoukville, Feb. 4, 2025.(Facebook: Ream naval base)\nCanada has been paying closer attention to maintaining strong relations with Cambodia, amid concerns over China's growing influence there and its claims on the strategically important South China Sea.\nCanada is upgrading its office in Phnom Penh to a full embassy with a resident ambassador this year. Until now, bilateral relations have been managed by its embassy in neighboring Thailand, with an office in Phnom Penh.\nSouth China Sea disputes\nImmediately before the visit to Cambodia, the HMCS Ottawa's crew spent a couple of rest days in Surabaya, Indonesia, after the successful completion of La Perouse 25, a nine-nation maricreated_at exercise led by the French navy, on Jan. 24, 2025.\nThe exercise took place in the straits of Malacca, Sunda and Lombok, which link the Indian and Pacific Oceans.\nThirteen vessels from Australia, Canada, India, Indonesia, Malaysia, Singapore, the United Kingdom, the United States and France's Charles De Gaulle carrier strike group joined the drills, focused on maricreated_at safety training.\nThe HMCS Ottawa, however, attracted most attention last month when it conducted a joint exercise codenamed Noble Wolverine with U.S. Navy destroyer USS Higgins in the disputed South China Sea.\nThe ships navigated through the South China Sea's international waters while conducting communications exercises, flight operations and anti-submarine warfare training under the Chinese navy's close watch.\nChina has regularly condemned what it sees as outsiders' interference in the region over where it claims \"historic rights\" to almost 90% of the waterway despite protest from other littoral states.\nCambodia is part of the South China Sea dispute but it has in recent years moved closer to China which is Cambodia's biggest investor and provider of financial assistance.\nEdited by Mike Firn.\n"
  },
  {
    "id": 1154,
    "title": "PHILIPPINES, US STAGE JOINT AIR PATROL, EXERCISE OVER SOUTH CHINA SEA",
    "created_at": "2025-02-05",
    "text": "\nThe following information was released by Radio Free Asia:\nAmerican and Philippine warplanes flew together in a coordinated patrol and drill above the South China Sea, in the allies' first joint maneuvers over contested waters since U.S. President Donald Trump returned to office, Filipino officials said.\nThe exercise, where Philippine FA-50 fighter jets flew alongside U.S. B-1 bombers in skies above the waterway, including the hotly disputed Scarborough Shoal, drew a rebuke from China. Beijing said it threatened regional peace and stability.\nIt was the first created_at B-1 bombers were used for joint maneuvers in the South China Sea, the Philippine military said. The one-day exercise, staged on Tuesday, reflected the strong relations between the two longcreated_at treaty allies, officials said.\nSome security experts had said earlier that President Trump might pay less attention to Southeast Asia, particularly the Philippines, which has been working to shore up international support against China in the South China Sea.\n\"It's the first exercise under the current administration of the U.S. government,\" Rear Adm. Roy Vincent Trinidad, the Philippine Navy spokesman for the West Philippine Sea, told a press briefing Tuesday.\nThe exercise involved two B-1 bombers attached to the U.S. Pacific Air Forces and three FA-50s from the Philippine Air Force, Col. Maria Consuelo Castillo, the PAF spokeswoman, told the same press briefing.\nThe B-1 is a more advanced version of the B-52 bomber, which the U.S. Air Force had deployed in previous training missions over the South China Sea, military officials said.\n\"This exercise is a crucial step in enhancing our interoperability, improving air domain awareness and agile combat employment and supporting our shared bilateral air objectives,\" Castillo said.\nFilipino officials said the exercise was not a direct response to recent Chinese military and coast guard activities in the South China Sea, where tensions have been high lately between Manila and Beijing.\nScarborough Shoal, which is claimed by both countries, lies within the Philippines' exclusive economic zone but has been under de facto Chinese control since 2012.\nChina: 'On high alert'\nIn response, Beijing said the joint exercise was a threat to peace and stability in the waterway.\n\"[T]he Philippines has been colluding with countries outside the region to organize the so-called 'joint patrols' to deliberately undermine peace and stability in the South China Sea,\" a spokesperson for China's military said on Tuesday.\nBeijing said it had also conducted a routine patrol in the airspace above Scarborough Shoal on Tuesday.\nChina's air force units would remain \"on high alert to resolutely defend China's territorial sovereignty and maricreated_at rights and interests,\" the spokesperson said.\nCastillo said the PAF were prepared for radio challenges from China during the staging of the joint exercise, even though it proceeded \"regardless of the action of other foreign actors.\" As of press created_at, there were no reports of any such challenges.\nHowever, there were no scenarios where the airplanes simulated dogfights, Castillo said.\n\"[There's] no bombing exercise,\" she said.\nUnder the 1951 Mutual Defense Treaty, the Philippines and the United States are compelled to come to each other's aid in created_ats of external attacks. Under Trump's predecessor, Joe Biden, Washington said that the scenario included armed attacks in the South China Sea.\nChina lays claim to almost the entire South China Sea, but its claims overlap with those of the Philippines, Brunei, Malaysia, Vietnam, and Taiwan. Over the past few months, Manila and Beijing have faced off in a series of confrontations at sea.\nIn related news, the Philippine military accused three Chinese Navy vessels of violating rules on innocent passage during their transit in Philippine waters.\nThe Chinese ships a frigate, cruiser and replenishment oiler were first monitored in the West Philippine Sea on Monday. The West Philippine Sea is Manila's name for South China Sea waters that lie within the Philippines' exclusive economic zone.\nThe ships traveled southward and moved at a speed of six knots (11.1 kph), passing through Basilan Channel, towards Indonesia.\nThey were tracked by the Philippine Navy and Air Force aircraft, the military said, adding that radio challenges were also issued against the Chinese ships.\nAs of Tuesday morning, Trinidad said the Chinese vessels were about 120 nautical miles south of Basilan. \"They are moving out of our exclusive economic zone,\" he said.\nDuring the radio challenges, the Chinese vessels said they were exercising freedom of navigation and innocent passage, according to Trinidad.\nA spokesperson for China's military also said on Monday that the passage complied with \"international law and practice.\"\n\"The violation was that the travel through our archipelagic waters was not expeditious,\" Trinidad said. \"They could have traveled at a faster speed. There were instances in the central part of Sulu Sea that they slowed down to five to six knots.\"\nTrinidad said the Chinese vessels were likely on the way to Indonesia to take part in an upcoming military exercise, dubbed Komodo, which would involve at least 37 countries.\nApart from Indonesia and China, some of the countries involved in the Komodo exercise this month are the Philippines, the United States, Japan, Australia, France, India, the United Kingdom, and South Korea.\n"
  },
  {
    "id": 1155,
    "title": "Philippines, US, Australia, Japan hold joint maricreated_at drills in South China Sea; PHILIPPINES CHINA",
    "created_at": "2025-02-05",
    "text": "\nABSTRACT\nManila, Feb 5 (EFE).- The Philippines, Australia, Japan and the United States held joint maricreated_at exercises on Wednesday in the South China Sea, where Beijing and Manila are engaged in a territorial conflict over the sovereignty of several islands, the Philippine military reported.\nFULL TEXT\nManila, Feb 5 (EFE).- The Philippines, Australia, Japan and the United States held joint maricreated_at exercises on Wednesday in the South China Sea, where Beijing and Manila are engaged in a territorial conflict over the sovereignty of several islands, the Philippine military reported.\n\"The naval and air force units of participating nations will operate together to enhance cooperation and interoperability among the armed forces\" in what Manila claims as its exclusive economic zone in the South China Sea, Philippine Chief of Staff of the Armed Forces Romeo Brawner said in a statement.\n\"The activity will be conducted in a manner consistent with international law,\" he added, a day after the Philippines and the US jointly patrolled the disputed region.\nManila and Beijing are engaged in a conflict over sovereignty over several territories in the South China Sea, a strategic region through which approximately 30 percent of global trade passes and which is home to 12 percent of the world's fishing grounds and potential oil and gas reserves.\nSince President Ferdinand Marcos Jr. came to power in 2022, the Philippines has taken a firmer stance in defending its territory against China's claims, which has sparked cross-accusations and occasional clashes between the coast guards of both countries.\nIn recent weeks, Philippine authorities have claimed to have arrested six Chinese citizens on spy charges in two separate operations, an allegation that the Chinese embassy in Manila has rejected.\nThere are fears that this region could become the scene of a potential conflict between Beijing and Washington, because although the United States does not have any direct sovereignty dispute, it does have a mutual defense pact in force with the Philippines\nJapan and China also have disputes over the control of the Senkaku Islands.\nIn this context, both Manila and Tokyo have sought to expand their alliances with the US and Australia in the Indo-Pacific. EFE\ndaa/pd\n"
  },
  {
    "id": 1156,
    "title": "U.S. uses B-1 bombers for the first created_at in South China Sea exercises",
    "created_at": "2025-02-05",
    "text": "\nIn a show of force and military cooperation, the Philippine and U.S. air forces have conducted joint exercises over the West Philippine Sea, also known as the South China Sea. These exercises, which include air patrols and interdiction training, are aimed at improving operational coordination and air domain awareness between the two nations.\nAccording to the Philippine Air Force (PAF), these exercises are crucial to improve interoperability and meet bilateral air defense objectives. Three PAF FA-50 aircraft participated in these exercises along with two. Notably, this is the first created_at B-1 bombers have been used in joint maneuvers in this area, indicating an intensification of military collaboration.\nThese exercises are taking place at a created_at of rising tensions between China and the Philippines due to maricreated_at and territorial disputes in the South China Sea. Beijing claims most of this sea, which overlaps with claims by the Philippines and other countries. The dispute over the Masinloc Bass (also known as the ), which is within the Philippines' exclusive economic zone but under Chinese control since 2012, is a key point of contention.\nThe Chinese government has expressed its displeasure with these exercises, calling them a threat to regional peace and stability. A Chinese military spokesman stated that the Philippines is \"colluding with countries outside the region\" to undermine stability in the South China Sea. China also reported that it conducted routine air patrols over Lower Masinloc on the same day as the joint exercises.\nDespite the tensions, Philippine officials insist that the exercises are not a direct response to recent Chinese military and coast guard activities in the area. However, collaboration between the Philippines and the United States has strengthened, especially under the current U.S. administration, with Secretary of State Marco Rubio reaffirming U.S. commitment to the Philippines in the face of China's actions. The two countries have been bound by a mutual defense treaty since 1951.\nUnder the 1951 Mutual Defense Treaty, the Philippines and the United States are obligated to assist each other in the event of external attacks. Under Trump's predecessor Joe Biden, Washington said the scenario included armed attacks in the South China Sea. China claims almost all of the South China Sea, but its claims overlap with those of the Philippines, Brunei, Malaysia, Vietnam and Taiwan.\nAlthough the exercises do not include air combat simulations or bombing, the participation of B-1 bombers and the focus on interoperability suggest a clear signal of US support for its Philippine ally. This indicates a renewed US commitment to the Southeast Asian region and the importance of the alliance with the Philippines in the context of regional tensions with China.\n"
  },
  {
    "id": 1157,
    "title": "US Sends Bombers to South China Sea in Warning to Beijing",
    "created_at": "2025-02-05",
    "text": "\nU.S. Air Force bombers joined Philippine fighter jets for joint training over the South China Sea amid a simmering territorial dispute with China.\nNewsweek has contacted the Chinese Foreign Ministry with a written request for comment.\nWhy It Matters\nThe exercises took place less than a month after the U.S. sent supersonic B-1 bombers to Guam's Andersen Air Force Base during heightened tensions on the Korean Peninsula and ongoing disputes involving China and two U.S. security treaty allies, Japan and the Philippines.\nThe past two years have seen Chinese maricreated_at forces steadily expanding their presence within the Philippines' internationally recognized exclusive economic zone. China has responded forcefully to the Philippines' resistance in contested waters, with tactics that include ramming, water cannons and blockades.\nWhat To Know\nTuesday's joint drills involved two B-1B bombers and three of the Philippines' dozen FA-50s, the country's main fighter jet and a combat-enhanced variant of the South Korean-made T-50.\nThe exercises, which took place over the Southeast Asian nation's maricreated_at zone, were focused on bolstering air domain awareness and coordination between the two air forces, including in combat capabilities, the Philippine Air Force said in a news release.\nThe U.S. and the Philippines, the oldest American ally in Asia, share a seven-decades-old Mutual Defense Treaty that both the Biden and Trump administrations have called ironclad.\nThe two countries jointly operate several military bases across the Philippines and regularly conduct naval and air exercises to improve interoperability.\nHowever, the somecreated_ats violent clashes with China, which on several occasions left Philippine service members injured, have raised questions over the prospect of drawing U.S. forces into a conflict with China. Philippine President Ferdinand Marcos Jr. has stressed that he does not seek escalation, but he has said the \"willful\" killing of a Philippine national would be a red line.\nWhat People Are Saying\nThe U.S. Pacific Air Force wrote on social media on Tuesday: \"U.S. Air Force B-1Bs and Philippine Air Force FA-50s flew in a joint air patrol and intercept exercise aimed to enhance our operational coordination, refine our tactical and operational strategies together, and maintain our air dominance and regional security in a free and open Indo-Pacific.\"\nThe Philippine Air Force wrote: \"By conducting these exercises, both air forces refined their tactical and operational strategies while working to meet shared air defense objectives and operational goals.\"\nWhat Happens Next\nThe tensions with China are a major factor behind the $35 billion military modernization program the Philippines is planning to carry out over the next decade.\nOn January 22, in one of his first international conversations as U.S. secretary of state, Marco Rubio spoke with Philippine Foreign Secretary Enrique Manalo. According to a news release from the State Department, how to increase defense cooperation was one of the topics they discussed.\nLink to Image\n\nGraphic\n \nPhilippine Fighter Jets Train With B-1 Bombers\nPhilippine Air Force\nTwo Philippine Air Force FA-50 fighter jets fly in formation with two B-1 bombers of the U.S. Pacific Air Forces during a joint air patrol and intercept exercise over the South China Sea on February 4.\n"
  },
  {
    "id": 1158,
    "title": "Experts urge Cambodia to maintain stance regarding SCS dispute",
    "created_at": "2025-02-05",
    "text": "\n As a non-claimant state in the South China Sea dispute, Cambodia is urged to uphold its neutrality, avoiding alignment in the territorial conflicts between ASEAN member states and China. At the same created_at, Cambodia supports ASEAN's collective decisions regarding one of the world's most strategically important maricreated_at corridors.\nExperts warn that the involvement of major powers could impede progress in establishing a Code of Conduct (COC) and complicate efforts to reach peaceful resolutions.\nThe ongoing negotiations for the COC, initiated in March 2018, follow the 2002 Declaration on the Conduct of Parties in the South China Sea (DOC), which was issued by ASEAN member states and China to promote peace and stability in the region.\nThe South China Sea dispute involves multiple overlapping territorial claims, primarily among China, Vietnam, the Philippines, Malaysia, and Brunei. This strategic waterway is crucial for global trade, with the United Nations Conference on Trade and Development estimating that over 21% of global commerce, valued at $3.37 trillion, passed through its waters in 2016.\nIn an interview with Khmer created_ats, Pou Sothirak, a retired academic and Senior Advisor to the Cambodian Centre for Regional Studies (CCRS) and a retired diplomat, underscored the necessity for ASEAN to uphold its centrality in managing disputes involving regional and external powers.\n'ASEAN centrality is about leadership, it's about unity, it's about one voice behind very clear decisions on a rules-based order. You have to be very clear on the issues because otherwise ASEAN relevancy, ASEAN centrality is in doubt. And once it's in doubt, all ASEAN framework will also be weakened,' he said.\nHe emphasised the importance of strengthening ASEAN's strategic autonomy, stating, 'That means we make our own decision without any power telling us what to do.'\nSothirak outlined three layers of interaction within the dispute. The first involves the direct claimants-Vietnam, the Philippines, Malaysia, and Brunei-who have overlapping maricreated_at and territorial claims with China.\n'For ASEAN to strengthen its position, the claimant states needs to be united. They need to have one voice again... when they negotiate with China, they need to speak the same thing,' he noted, citing the Philippines' decision to take the case to the Permanent Court of Arbitration (PCA).\n'But Vietnam did not do the same. Malaysia did not do the same. Brunei didn't do anything,' Sothirak said. 'So China favours bilateral negotiation.'\nIn 2016, the PCA ruled in favour of the Philippines, declaring China's claims under the nine-dash line as having no legal basis. However, China dismissed the ruling, calling it 'null and void.'\nChina asserts historical rights over most of the South China Sea, marked by the 'nine-dash line,' which overlaps with the exclusive economic zones (EEZs) of several ASEAN countries, including Vietnam, the Philippines, Malaysia and Brunei.\nRegarding Cambodia's neutrality in the South China Sea dispute, Professor Shotaro Hamamoto of Kyoto University was of the view that while the country has refrained from taking a position, such decisions have long-term implications.\n'Certainly, I don't think Cambodia has been actively supporting China for not implementing the South China Sea arbitration,' Prof Hamamoto said.\nRegarding Cambodia's position as a non-claimant state, Sothirak expressed support for the government's policy of neutrality.\n'Our principle is to be neutral. Our principle is that we support ASEAN collective decisions on the South China Sea, and we take no positions on the issues. And many created_ats, over, the government has already made this statement,' he said.\nAs ASEAN and China continue discussions, Cambodia remains steadfast in its commitment to neutrality, advocating for diplomatic engagement and regional stability in one of the world's most strategically significant maricreated_at corridors.\nSo Naro, Minister Delegate Attached to the Prime Minister in charge of ASEAN Affairs, reiterated Cambodia's neutral position. 'Cambodia urges all parties to exercise patience and resolve disputes peacefully through dialogue and negotiations while fully implementing the DOC to prevent escalation,' he told Khmer created_ats.\nThe second layer of complexity, according to Sothirak, involves the engagement of extra-regional powers, particularly the United States.\n'The Americans are not happy that China keeps saying that a third party should not get involved in the South China Sea issue. Because the Americans view the South China Sea as an international waterway where all countries can navigate or fly over it. They believe the international airspace and waters should be free and open, and this is a contentious issue,' he said.\nIn support of its contention, the US has sent naval vessels to sail in the area.\nChina has argued that while it supports freedom of navigation, it opposes what it perceives as 'military provocations' by external powers, particularly US naval patrols in contested areas.\nDeputy Prime Minister and Minister of Foreign Affairs Prak Sokhonn has also previously expressed hopes for a resolution. 'Cambodia, as a non-claimant state, wishes to stay neutral with regard to territorial dispute, and we hope all parties concerned will continue to maintain conducive environment for safeguarding peace, security and stability in the region, thus contributing to the conclusion of the COC negotiation,' he said in a statement.\nThe COC for the South China Sea remains under negotiation between China and ASEAN.\nIn July 2023, both sides agreed on new guidelines to expedite the process, aiming to conclude negotiations by 2026.\n"
  },
  {
    "id": 1159,
    "title": "Air patrols over shoal in latest escalation",
    "created_at": "2025-02-05",
    "text": "\nThe PLA conducted routine airspace patrols over Scarborough Shoal yesterday, coinciding with a Philippine Air Force exercise with the United States above the South China Sea, in a continuing escalation of bilateral tensions. \n\"On February 4, the Air Force of the Southern Theatre Command of the People's Libera­tion Army conducted a routine patrol in the airspace above Huangyan Island,\" Senior Colonel Li Jianjian said, using the Chinese name for the shoal. \n\"During this period, the Philippines colluded with extraterritorial countries to organise a so-called joint patrol, deliberately undermining peace and stability in the South China Sea region. \n\"The theatre air force units have remained on high alert and resolutely safeguarded national territorial sovereignty and maricreated_at rights and interests. Any military activities that attempt to disrupt the South China Sea are well under control.\" \nThe Philippine Air Force said it was holding joint patrols with the US over the South China Sea. \nThe PLA patrol came after Beijing and Manila exchanged barbs over the transit of a Chinese destroyer fleet in the Basilan Strait, which separates the Philippine islands of Mindanao and Basilan. It is believed to be the first created_at the fleet, led by a Type 055 stealth guided-missile destroyer, has been observed sailing through the 18km strait towards the Sulu Sea.  \nOn Monday, Senior Colonel Tian Junli, of the PLA's Southern Theatre Command, said Chinese naval and air forces had transited the strait for distant-sea training. \n\"The operation strictly adhered to safe, standardised, and professional practices, fully complying with international law and norms,\" the PLA spokesman said. \nTian accused Manila of distorting the routine transit to stir tensions and argued such actions undermined the navigational rights of China and other nations. \nAccording to local media reports, the Western Mindanao Command claimed to be tracking three vessels - a Type 055 destroyer, a Type 054A frigate, and a Type 903 replenishment ship - in what it described as \"Philippine waters\" on Sunday. \nLieutenant General Antonio Nafarrete, commander of the Philippine Western Mindanao Command, said the presence of the warships in the Basilan Strait was \"not consistent with the principles of innocent passage\". \nMilitary commentator and former PLA instructor Song Zhongping dismissed Manila's remarks as an overreaction, saying it was an international strait and all vessels had the right to pass through it.\n"
  },
  {
    "id": 1160,
    "title": "US, Japan, Australia, PH hold drills in South China Sea",
    "created_at": "2025-02-05",
    "text": "\n-- THE United States, Japan, Australia, and the Philippines yesterday held maricreated_at exercises in the West Philippine Sea in the South China Sea amid tension in the contested area. The exercises were held under a multilateral maricreated_at cooperative activity (MMCA), the sixth to be conducted since April last year and first for this year. Armed Forces..."
  },
  {
    "id": 1161,
    "title": "Experts refute Marcoleta: 'West Philippine Sea is real'",
    "created_at": "2025-02-05",
    "text": "\n An analyst and a public historian refuted Sagip party-list Rep. Rodante Marcoleta's dismissive claims about the West Philippine Sea.\nThey joined the mounting criticisms hurled against Marcoleta, who, during a House tri-committee hearing on the prevalence of fake news on Tuesday, claimed that there is no such thing as the West Philippine Sea even in the country's maps.\nHowever, security expert Chester Cabalza countered that the West Philippine Sea is 'real and existing.'\n'It is not just a figment of imagination,' Cabalza said in a message to INQUIRER.net. 'It is part of our imagined community and experienced culture. The West Philippine Sea forms part of our national sovereignty in the exercise of our sovereign rights.'\nHistorian Xiao Chua said in a Facebook post Tuesday night: 'Granting for the sake of argument that the West Philippine Sea does not exist, then we can also say that the Philippines itself does not exist because 'the nation is just an imagined community' invented by the writings and ideas of our heroes.'\n'But we do exist! And so is our EEZ (exclusive economic zone),' Chua continued.\nIn 2012, President Benigno Aquino III signed an administrative order renaming South China Sea waters within the western section of the country's EEZ as West Philippine Sea.\nContrary to Marcoleta's remarks, Aquino had directed the National Mapping and Resource Information Authority to produce and publish charts and maps of the Philippines showing the West Philippine Sea.\n'It was legally constructed in 2012 to tell the world of the metes and bounds of our maricreated_at domains and territories and the world has warmly embraced it,' Cabalza said, noting that there is a 'humongous text of scholarly literature' about the West Philippine Sea which are now being taught and discussed in top universities worldwide.\nAquino made such a move in a bid to assert Manila's sovereign rights further.\nIt was during the late president's term when Manila brought Beijing before the Permanent Court of Arbitration in The Hague, Netherlands to contest the latter's sweeping claims in the South China Sea.\nIn July 2016, an international tribunal ruled heavily in favor of Manila while effectively invalidating Beijing's then-nine-dash line-now 'ten-dash line'-claim.\n'West Philippine Sea is now part of our linguistic parlance and vocabulary,' Cabalza said.\n'Ordinary Filipinos somecreated_ats equate national security to the issues in the West Philippine Sea,' he added.\n"
  },
  {
    "id": 1162,
    "title": "Tarriela lectures Marcoleta on WPS: It's not a fabrication",
    "created_at": "2025-02-05",
    "text": "\nManila, Feb. 5 -- The West Philippine Sea (WPS) is real, not a mere figment of imagination.\nCommo. Jay Tarriela, Philippine Coast Guard (PCG) spokesperson for WPS, had this to say to SAGIP Party-list Rep. Rodante Marcoleta on Tuesday, Feb. 4, after the latter claimed that the water which forms part of the broader South China Sea (SCS) and is included in the Philippines' 200-nautical mile exclusive economic zone (EEZ) is not real.\n\"Hearing someone claim that the 'West Philippine Sea' is merely a fabrication of the Philippine government is a disservice and an embarrassment to their entire party, the organization they belong to, and even their own family,\" Tarriela said in response to Marcoleta's controversial statements.\nTarriela echoed President Marcos Jr.'s remarks during his third State of the Nation Address (SONA) in 2024 that the WPS \"is not merely a figment of our imagination.\"\n\"I stand by the statement of President [Marcos] when he said, 'Ang West Philippine Sea ay hindi kathang isip natin lamang. Ito ay atin. Ito ay mananatiling atin hangga't nag-aalab ang diwa ng ating minamahal na bansang Pilipinas (The West Philippine Sea is not merely a figment of our imagination. It is ours. It will remain ours, as long as the spirit of our beloved country, the Philippines, continues to burn.)\nThe outspoken Coast Guard official then asked how an individual like Marcoleta could face the younger generations today and tell them that the country's EEZ to the west of the Philippine archipelago \"is non-existent.\"\nHe said this is tantamount to \"effectively giving up the fight to assert their rights as Filipinos in the West Philippine Sea\".\nDuring a House tri-committee hearing which tackled the prevalence of fake news and deepfakes online, Marcoleta stated that there was a need to educate Filipinos on the complex issues surrounding the South China Sea (SCS).\n\"There is no such thing as [West Philippine Sea]. That's nothing, that is a creation by us,\" Marcoleta said. \"Just to be real, even if you read our map or what, there is no [West Philippine Sea].\"\nThe term \"West Philippine Sea\" was first used by the Philippine government in 2011 during the administration of the late President Benigno \"Noynoy\" Aquino III when referring to the maricreated_at areas on the western side of the Philippine archipelago that are within its EEZ.\nIn 2012, Aquino issued Administrative Order No. 29 where the government formally adopted the term West Philippine Sea. In the same year, the Aquino administration initiated an arbitration process to protest China's claims in the SCS, including parts of the WPS which, experts believe, are rich in maricreated_at resources and gas.\nFour years later, in 2016, the Hague-based Permanent Court of Arbitration (PCA) invalidated China's dash-line claims, but Beijing ignored the decision and continued to stake its claims in the SCS.\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1164,
    "title": "BBCM China Watchlist 5 Feb 25",
    "created_at": "2025-02-05",
    "text": "\nStories being covered today by BBC Monitoring from Chinese broadcast, press and social media sources.\nXi Jinping holds talks with Kyrgyz president\nChinese President Xi Jinping made his first public appearance since the Spring Festival with a welcome ceremony and talks with visiting Kyrgyz President Sadyr Japarov on the morning of 5 February.\nJaparov is currently on a four-day state visit to China till 7 February. This is also his second state visit to China in two years.\nDuring the talks, Xi praised bilateral relations for achieving \"leapfrog development\" and reaching a \"new height\" in their \"comprehensive strategic partnership for a new era\", the official Xinhua News Agency reported.\nXi said the two sides should use China's Belt and Road Initiative (BRI) as the \"main line\" to deepen mutually beneficial cooperation, adding that Beijing is willing to import more quality products from Kyrgyzstan and support Chinese companies to invest in the country.\nXi also touched on the need to \"comprehensively raise the level of interconnectivity\" by pursuing a \"high-standard\" and \"high-quality\" construction of the China- Kyrgyzstan-Uzbekistan railway, upgrading exiting ports, and opening up more civilian and cargo flights to facilitate personnel and logistic movement between the two countries.\nJaparov was quoted by the Xinhua readout praising China as a \"reliable friend and partner\" and expressing \"firm support\" to Beijing on issues relating to Taiwan, Xinjiang, and Hong Kong.\nFollowing the talks, both leaders issued a joint statement on further deepening their \"comprehensive strategic partnership for a new era\" and witnessed the signing of a series of cooperation agreements on foreign affairs, trade, and agriculture.\nJaparov is also scheduled to visit Harbin to attend the opening ceremony of the 9th Asian Winter Games on 7 February.\nSee also: Kyrgyz leader, new Chinese envoy discuss joint projects  \nBriefing: Pro-Kremlin bloggers warn Kyrgyzstan over railway project with China  \nBriefing: Kyrgyzstan launches construction of 'historic' China railway  \nBeijing welcomes Asian leaders ahead of Asian Winter Games\nChina will also be hosting a number of Asian leaders this week, with a number of them also scheduled to attend the opening ceremony of the Asian Winter Games.\nThailand's Paetongtarn Shinawatra and Bruneian Sultan Hassanal Bolkiah will arrive in China today, with the former's first trip to China as prime minister lasting till 8 February and the latter's state visit ending a day earlier.\nPaetongtarn's visit also coincided with the Thai government's order to cut off internet, electricity, and fuel supplies to five regions in Myanmar, including the Myawaddy area, as part of its cooperation with China to target the scam centres spawning across its border.\nA day earlier, Bangkok also approved the second phase of the Thai-Chinese high-speed railway project, with the project expected to be completed by 2030, Xinhua reported.\nAnother Xinhua report on 4 February also noted Paetongtarn's visit came as Beijing and Bangkok are making the 50th anniversary of bilateral relations this year. It noted the Thai side's remarks of hoping to use the visit to strengthen bilateral relations and \"reshape Chinese tourists' confidence in Thailand\".\nMeanwhile, Pakistan's President Asif Ali Zardari is already in China and his state visit will conclude on 8 February, a day after attending the Asian Winter Games opening.\nDuring his visit, Zardari is expected to focus on counterterrorism to further safeguard \"China's presence\" in Pakistan and \"further cooperation on the Belt and Road initiative\", Lanzhou University professor Zhu Yongbiao told Hong Kong's English South China Morning Post (SCMP).\nOn 3 February, Pakistani Prime Minister Shehbaz Sharif    also hailed the China-Pakistan Economic Corridor (CPEC) as an \"important cornerstone\" for Pakistan's economic development and regional connectivity\", Xinhua reported.\nSee also: Pakistan president's Beijing visit 'of great significance' - Chinese envoy  \nChina seeks Thailand's help in cracking down on Chinese-run scam gangs in Myanmar  \nChina military patrols disputed shoal amid US-Philippine air drill\nThe Chinese military conducted another patrol over a disputed reef in the Spratly Islands chain of the South China Sea also claimed by the Philippines, while criticising a joint US-Philippine drill.\nPeople's Liberation Army (PLA) Southern Theatre Command spokesman Li Jianjian announced on 4 February that the air force had conducted a \"routine patrol\" over the airspace of Huangyan Island, Xinhua News Agency reported. The Chinese-controlled reef is known internationally as Scarborough Shoal and is also claimed by the Philippines as Panatag Shoal or Bajo de Masinloc.\nWithout naming names, Lin accused the Philippines of colluding with \"countries outside the region\" to organise \"joint patrols\" that undermine peace and stability in the area.\nThe statement followed an announcement by the Philippine Air Force that joint patrols with the US took place over the South China Sea on the same day.&#160;\nLin said the PLA is on \"high alert\" regarding any destabilising military activities in the South China Sea.\nHe also stressed that \"any military activities that disrupt the South China Sea are fully under control\", while reiterating that the PLA would remain vigilant in defending China's territorial sovereignty and maricreated_at rights.\nIn a related development, the Philippine Coast Guard (PCG) released a video on 4 February showing its vessel, the BRP Cabra, shadowing Chinese Coast Guard vessels within Manila's Exclusive Economic Zone (EEZ) off the coast of Pangasinan in central Luzon, the northernmost island in the country.&#160;\nPCG spokesman Jay Tarriela said the Chinese vessels were challenged over their legal authority to patrol the area, while saying that the PCG remains committed to protecting the nation's maricreated_at rights \"without escalating tensions\".\nSee also: Chinese military rejects Manila protest over Basilan Strait patrol  \nBeijing, Taiwan react to US curbs on Chinese AI, foreign aid cuts\nChinese state media criticised growing national security concerns in the US over Chinese artificial intelligence (AI) model DeepSeek, which recently made international titles by becoming the most downloaded app on the Apple Store in the US.\nThe nationalist state-run daily Global created_ats's Chinese and English editorials on 5 February warned that US government attempts to block DeepSeek with tariffs, export controls, or intellectual property claims, would only hinder AI technology in the US itself.\n\"The emergence of DeepSeek actually proves that, under the guise of so-called national security, attempts to monopolise technology and suppress China's technological progress are ultimately doomed to failure,\" it said.\nEarlier, an online commentary by the military-run PLA Daily newspaper on 3 February condemned US bans on DeepSeek as \"security paranoia\", arguing that weaponising national security concerns \"benefits no one, including the US\". It accused Washington of unjustly labelling Chinese electric cars, TikTok, scholars and even garlic as security threats, warning that the US, obsessed with its \"sole superpower\" status, had \"lost its cool\".\nTaipei's official reaction to US President Donald Trump's administration freezing most foreign aid, including military aid to Taiwan, has been largely muted so far.\nAlthough Taiwan does not have formal diplomatic ties to the US, its de facto envoy in Washington Alexander Yu stressed to media on 3 February that his office had been briefed by Washington that the military aid was being suspended, rather than abolished, the island's Central News Agency (CNA) reported.\nSee also: Briefing: Chinese media, pundits say US loses more over Trump tariffs  \nBriefing: China media link cyber-attacks on DeepSeek to US  \nBriefing: From DeepSeek to dancing robots, China touts tech at New Year  \nState TV highlights travel boom, winter sports during Lunar New Year\nChinese media continued to portray a positive picture of the country's economy and the resurgence of traditional cultural as the eight-day Lunar New Year, of Spring Festival holidays came to an end.\nOn 4 February, China Central Television's (CCTV) flagship evening news bulletin Xinwen Lianbo (News Hookup) reported that over 2.3 billion inter-regional passenger trips were made across the country during the holiday period from 28 January to 4 February.\nAnother segment cited online travel platform data saying the number of foreigners visiting China for the Spring Festival this year was up 1.5 created_ats year-on-year, while describing it as a \"China travel craze\". It attributed the increase to the visa-free policy with some countries and the designation of the Spring Festival as an Unesco Intangible Cultural Heritage of Humanity.\nThe bulletin also featured what it described as a newly emerging trend of people opting for culture-themed activities during the Spring Festival.\nIt further said that the upcoming Asian Winter Games in northeast Heilongjiang province had sparked \"ice and snow fever\" further south, leading to a surge of indoor ski facilities in southern provinces such as Jiangsu, Hubei and Hainan.\nMeanwhile, Global created_ats highlighted \"overall social stability and good public order\" during the Spring Festival holidays, citing the Ministry of Public Security that \"criminal cases fell by 20.9%, while public security incidents declined by 14.3% year-on-year\" as of 4 February.\nSee also: State TV spotlights aircraft carrier drills during Lunar New Year  \nMigrant workers return to jobs early during Spring Festival  \nBriefing: Weibo diplomacy &#8211; less polarised response to envoys' festive messaging  \nSource: BBC Monitoring 5 Feb 25\n"
  },
  {
    "id": 1165,
    "title": "Philippine House impeaches Vice President Sara Duterte",
    "created_at": "2025-02-05",
    "text": "\nFebruary 5th, 2025 ( Al Jazeera English  - Delivered by  Newstex )\nPhilippine Vice President Sara Duterte has been impeached by the lower house of Congress after lawmakers, many of whom are allies of President Ferdinand Marcos Jr, signed a petition to remove her from office.While specifics have not been divulged, the impeachment vote on Wednesday follows a  string of complaints accusing Duterte of crimes ranging from the misuse of public funds to plotting Marcos's assassination.Dutertehas consistently denied wrongdoing and has described moves against her as a political vendetta.'Having been filed by more than one-third of the membership of the House of Representatives, or a total of 215 [out of 306] members, the motion is approved,' House Speaker Martin Romualdez told lawmakers.Her fate is now in the hands of 24 senators, two-thirds of whom must vote for her impeachment for her to be removed from office.Although a trial date has not been set, she will remain vice president during the impeachment proceedings.Duterte is the fourth official in the Philippines to be impeached after former President Joseph Estrada, an ombudsman and a former Supreme Court chief justice.In the Philippines, top officials may be impeached for culpable violation of the constitution, treason, bribery, corruption, other high crimes or betrayal of public trust.The House vote comes days before campaigning begins for the midterm elections, widely expected to set the table for the 2028 presidential race.Marcos had previously urged Congress not to pursue Duterte's impeachment, calling it a 'storm in a teacup' that would distract the legislature from its primary responsibilities.On Monday, however, Marcos's executive secretary, Lucas Bersamin, said the Office of the President would 'not interfere' with the impeachment complaints.Former allies turned foes\nFor years, Duterte was primed to succeed her controversial father, Rodrigo, as president, but she eventually stepped aside to back Marcos, running as vice president on his ticket.Together, they won a  landslide victory in 2022.But the alliance has since imploded, giving way to a months-long public spat that has seen the trading of wild accusations.In November, Duterte delivered an expletive-laden speech saying she had  ordered someone to kill Marcos if she herself was assassinated.She has accused Marcos and his wife of corruption, weak leadership and trying to muzzle her because of speculation she may seek the presidency in 2028.Meanwhile, Duterte has been accused of misusing 612.5 million pesos ($10.3m) of public funds, which led to her resignation in June from Marcos's cabinet, in which she oversaw the Department of Education.She has also been criticised for her failure to stand up to China in the disputed  South China Sea.Link to the original story.N"
  },
  {
    "id": 1166,
    "title": "Chinese fleet's 'routine exercise' shown on state television after Basilan Strait transit",
    "created_at": "2025-02-05",
    "text": "\n Footage of warships conducting drill in the Pacific follows exchange between Beijing and Manila over navy transit   \nChinese state television has aired footage of a destroyer fleet conducting an exercise in the Pacific Ocean, after Beijing and Manila traded barbs over a PLA Navy transit through the Basilan Strait earlier this week. \nThe CCTV report on Tuesday showed the Zunyi Type 055 destroyer, Hengyang Type 054A frigate and Weishanhu Type 903 replenishment vessel carrying out far-sea combat training at an undisclosed Pacific location over the Lunar New Year. \nThey were the same three warships seen sailing through the 18km (11-mile) Basilan Strait - which separates the Philippine islands of Mindanao and Basilan - towards the Sulu Sea on Sunday. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nThe People's Liberation Army warships, led by the stealth guided-missile destroyer, play an important role in China's blue-water naval ambitions. \nTuesday's report highlighted young sailors taking part in the drill who were on their first deployment. \nAccording to former PLA instructor Song Zhongping, the message of the state television report was that the Basilan Strait transit \"was just a routine naval exercise and should not be misinterpreted as a deterrence manoeuvre, or a show of force\". \nOn Monday, the Philippines condemned the transit as \"not consistent with the principles of innocent passage\", while China claimed it fully complied with international law and norms and accused Manila of politicising routine naval movements. \nSome observers said the timing of the CCTV report - soon after Manila objected to the warships sailing through the strait - suggested Beijing wanted to downplay the transit. Others saw it as a calculated response to growing scrutiny of Chinese military activities in the region. \nThe fleet's passage came amid heightened tensions following a run-in between Chinese and Philippine vessels near the disputed Iroquois Reef - known as Houteng in China and Rozul in the Philippines - as well as joint US-Philippine drills in the South China Sea, and a call between US Secretary of State Marco Rubio and his Philippine counterpart Enrique Manalo. \nIt also coincided with the departure of the USS Carl Vinson aircraft carrier from waters near the disputed Spratly Islands, known as Nansha in Chinese. Some analysts suggest these factors made the Basilan Strait an ideal choice for Beijing to assert its naval presence while staying within legal bounds. \nThe CCTV report said that as part of the ongoing exercise the fleet would conduct live-fire weapon tests and multi-domain combat drills to improve coordinated operations on the high seas. \nIt said the training - which began over the Lunar New Year holiday period that ended on Tuesday - showed the commitment of personnel to maintaining combat readiness. \n\"The fleet is conducting real-combat drills across multiple disciplines, ensuring that under any circumstances, we can deploy, engage and prevail,\" said the report, which also described the drill as routine training. \nSenior Sergeant Wu Pengfei, who appeared in the report, emphasised the importance of safeguarding China's maricreated_at interests. \n\"Even during the New Year, combat training cannot be relaxed,\" Wu said. \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1167,
    "title": "DND chief Teodoro to China: Stop spying on PH",
    "created_at": "2025-02-05",
    "text": "\nManila, Feb. 5 -- Amid already tensed relations with China, Department of National Defense (DND) Secretary Gilbert Teodoro Jr. asked Beijing to stop its spying activities that target Philippine officials and infrastructure.\nDefense Secretary Gilbert Teodoro Jr. (left) delivers his speech at the Waitangi Day Reception in Makati City. Also in the photo is New Zealand Ambassador to the Philippines Catherine McIntosh (Raymund Antonio/MANILA BULLETIN)\nThe defense chief was a guest during the Waitangi Day Reception held by the New Zealand Embassy in Makati City on Tuesday night, Feb. 4.\n\"We are very aware of these attempts. And as a responsible country, China should put a stop with these illicit activities,\" he said.\nHe insisted that the activities could very well be state-sponsored because of \"an agent of their security service.\"\n\"So, by their own legal internal act, they criminalize themselves,\" Teodoro pointed out.\nHis remarks came after a series of arrests of alleged Chinese spy, including a Rappler report on Steve Zhang, verified as an agent of China's Ministry of State Security (MSS) who purportedly conducted intelligence gathering and set up an espionage and influence network under his cover as a reporter for a Shanghai-based publication.\nSince the report came out in August 2024, Zhang has not returned to the Philippines.\nThe National Bureau of Investigation (NBI) also confirmed a GMA News report that two Chinese were caught taking videos of a Philippine Coast Guard (PCG) vessel in Palawan.\nThe two were nabbed at the Ninoy Aquino International Airport (NAIA) upon their arrival from the province, while four of their cohorts, also Chinese nationals, were arrested in different locations.\nThese arrests were made just over a week after Deng Yuanqing, along with his two Filipino drivers, were arrested for suspected espionage after they gathered information from and about military facilities and critical Philippine infrastructure.\nTeodoro refused to say whether he had fallen victim to spying, but said he is aware of such activities.\n\"And troll farms are active and that is why we are also working closely with the legislature to amend the espionage law and foreign corrupt practices,\" he added.\nBut amid the backdrop of Beijing's aggressive actions in the South China Sea, including in the Philippines' Exclusive Economic Zone (EEZ) and territorial waters in the West Philippine Sea, the DND secretary stressed the need to strengthen the military's defense capabilities.\n\"This is a struggle. What's next is, you know on my end, is to fortify and strengthen the defense establishments and to build up a deterrent capability which is extremely important,\" he said.\nChina has ramped up its aggressive activities in the resource-rich region, which it claims almost in its entirety, including the EEZs of its neighbors-the Philippines, Indonesia, Malaysia, Vietnam, and Brunei.\nWhile the Philippines has pushed back against these actions, including a 2016 arbitral tribunal victory that invalidated the basis of Beijing's claim, China refused to heed the international community's call to heed international maricreated_at laws.\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1175,
    "title": "Philippine Army could purchase additional 155mm self-propelled howitzers in 2025",
    "created_at": "2025-02-05",
    "text": "\nAccording to Eyorio on February 3, 2025, the Armed Forces of the Philippines intends to acquire additional 155mm self-propelled howitzers in 2025, though no official confirmation has been made. The Philippine Army operates 12 ATMOS 2000 155mm self-propelled howitzers acquired from Israels Elbit Systems. If confirmed, this potential acquisition is part of the Armed Forces of the Philippines (AFP) modernization program, which has faced funding adjustments, with only $595 million of its $1.275 billion 2025 budget guaranteed.\nThe Philippine Armys ATMOS 2000 units were procured through a government-to-government agreement with Israel for $40.8 million. The contract was finalized in early 2020, with deliveries completed in December 2021. The Army formed two batteries, each containing six howitzers, and assigned them to the 10th Field Artillery Battalion, activated in June 2022. The first operational deployment of the system occurred in 2024 during the \"Katihan\" Combined Arms Training Exercise (CATEX) at Camp O'Donnell. The howitzers were later integrated into Balikatan 24, a joint military exercise with U.S. forces at the La Paz Sand Dunes.\nThe ATMOS 2000 is an Israeli 155mm/52 caliber self-propelled howitzer mounted on a 6x6 truck chassis. It has a maximum firing range exceeding 40 km with Extended Range Full-Bore - Base Bleed (ERFB-BB) projectiles, 30 km with NATO L15 high-explosive projectiles, and 24.5 km with M107 high-explosive projectiles. The system can fire between 4 and 9 rounds per minute and is equipped with a computerized fire control system for target acquisition and aiming. It operates with a crew of 2 to 6 personnel. The Philippine Armys units use German MAN truck platforms, selected for their established maintenance and logistics support in the country.\nThe Philippine Army operates multiple artillery systems in addition to the ATMOS 2000, including the Soltam M-71 155mm towed howitzer, M114A1 155mm towed howitzer, M101 and M102 105mm howitzers, and OTO Melara Model 56 pack howitzer. The Army also employs the Cardom 120mm self-propelled mortar system and various mortar models, including the M224 60mm and M69 81mm systems. Multiple-launch rocket systems from South Korea were previously acquired, and the Army is evaluating additional long-range artillery options such as the K239 Chunmoo or PULS systems.\nThe Armed Forces of the Philippines (AFP) modernization program is in its final phase, Re-Horizon 3, approved in January 2024 with an estimated cost of $34 billion over ten years. The 2025 budget allocates $4.353 billion to defense, a 6.4% increase from 2024. Of this amount, $850 million is designated for military modernization. However, only $595 million is guaranteed, while $680 million remains under unprogrammed appropriations, requiring excess revenue before release. This reliance on standby funds marks a shift from previous years when guaranteed funding exceeded unprogrammed allocations.\nThe executive branch initially proposed $850 million for the AFP modernization program in 2025, but Congress realigned $255 million to unprogrammed appropriations. This contrasts with past budgets under the Duterte administration, where guaranteed funds ranged from $425 million to $493 million, and unprogrammed portions did not exceed $187 million. In 2024, none of the $170 million in unprogrammed funds for military modernization had been released as of September. Defense Secretary Gilbert Teodoro raised concerns in legislative hearings, while senators highlighted risks of delays in priority acquisitions.\nThe AFP modernization program initially focused on internal security but has shifted toward external defense, particularly in response to maricreated_at territorial disputes. The Philippine Armys procurement plans prioritize land-based missile systems, anti-aircraft weapons, and additional armored vehicles. The 2025 budget includes $3.475 billion for land, air, and naval forces, with $850 million allocated for modernization programs. The Philippine Coast Guard, involved in patrols and resupply missions in the South China Sea, will see a 6% budget increase to $534 million.\nDespite budget increases, reliance on unprogrammed appropriations affects acquisition created_atlines. Budget adjustments have already impacted several projects, including cyber systems, forward support equipment, and tactical combat vehicles. The AFP modernization program has expanded since 2018, with total funding increasing from $510 million to $1.275 billion by 2025. However, the share of unprogrammed funds has also risen from $85 million in 2018 to $680 million in 2025. The Philippine Army continues to evaluate procurement options for additional self-propelled howitzers, multiple-launch rocket systems, and advanced air defense systems, with future acquisitions dependent on budget availability and revenue conditions.\n"
  },
  {
    "id": 1194,
    "title": "'The Unlikely War Hero' shines a light on smart survivor of notorious Vietnam POW camp",
    "created_at": "2025-02-05",
    "text": "\nFeb. 5—History and pop culture have trained us to celebrate battlefield heroics and other forms of physical courage. Those actions are undeniably admirable, and in the past decade many Vietnam veterans have received overdue valor medals or had existing awards upgraded.\nHeroism also comes in other forms.\nDoug Hegdahl, the subject of Marc Leepson's \"The Unlikely War Hero: A Vietnam War POW's Story of Courage and Resilience in the Hanoi Hilton,\" engaged in quieter, more cerebral acts, but he was a hero of the Vietnam War just the same.\nThe average reader probably hasn't heard of Hegdahl. It's not because his story isn't fascinating. In short, a young man from tiny Clark, S.D., committed some of the most courageous noncombat actions of the war.\nIn the early hours of April 6, 1967, Hegdahl fell off the guided missile cruiser USS Canberra as it fired its 5- and 8-inch guns from the Gulf of Tonkin on North Vietnamese positions inland. The member of the deck crew went up to watch the guns fire, but he couldn't remember how he ended up in the water. Notext saw the 20-year-old seaman apprentice go overboard. His shipmates did not know for hours that he was missing. His captain did not turn the warship around to look for him.\nAfter treading water for hours, the exhausted Hegdahl was pulled from the South China Sea by fishermen. His rescue took a quick turn, however, when the fishermen turned the young sailor over to the North Vietnamese.\nHe ultimately ended up in the Hoa Lo prison camp. That name also might be unfamiliar, but most probably know the name mockingly given to it by American prisoners of war: the Hanoi Hilton.\nHegdahl was subjected to intense interrogation, and to torture when his answers failed to satisfy his captors. He quickly devised a strategy to confuse his interrogators and, hopefully, escape severe punishment.\n\"I had probably the most embarrassing capture in the entire Vietnam War,\" Hegdahl said during a 1997 interview cited in the book. \"I found that my defense posture was just to play dumb. Let's face it, when you fall off your boat, you have a lot to work with.\"\nIt worked. Although prison officials initially thought that Hegdahl was a spy (a suspicion shared by even some of his compatriots, among other theories), he quickly dissuaded them of the notion. He convinced them that he knew little valuable information, or little at all. It worked so well that he came to be known as \"The Incredibly Stupid One\" by his captors.\nHegdahl was anything but stupid.\nThe bumpkin act caused the North Vietnamese to pay Hegdahl little mind. He was the youngest and lowest-ranking man in the camp, which was full of experienced pilots and navigators. Since prison officials thought he was a simpleton, Hegdahl often was allowed unsupervised created_at to sweep the yard. He spent some of that created_at sabotaging camp vehicles. Once he even wandered out into the street, helping him to pinpoint the camp's location.\nA few months into his captivity, Hegdahl was placed in a cell with a senior Naval officer, Lt. Cmdr. Richard Stratton, who became Hegdahl's closest friend during his captivity and for decades after the war. Stratton recognized Hegdahl's smarts, and the need to use them.\nHegdahl's knack for memorization was a tremendous asset, and one that dovetailed with POW efforts underway at the Hanoi Hilton. Picking up on a practice already in place, he memorized the names of 254 prisoners. All the while, he played his subterfuge to the hilt. His captors treated him like the village idiot, while Hegdahl foiled their attempts to use him for propaganda purposes and banked vital information.\nThe North Vietnamese released Hegdahl in August 1969, without a clue as to the storehouse of valuable intel locked in his mind. Information that gave hope to families of missing and imprisoned servicemen. Information that helped to change the conditions in the Hanoi Hilton.\nSaid Roger Shields, who served as Deputy Assistant Secretary for POW/MIA Affairs from 1971 to 1977: Hegdahl \"saved many, many lives.  I don't think there's any doubt about it.\"\n\"The North Vietnamese released Hegdahl in August 1969, without a clue as to the storehouse of valuable intel locked in his mind. Information that gave hope to families of missing and imprisoned servicemen. Information that helped to change the conditions in the Hanoi Hilton.\"\nLeepson, a Vietnam veteran, historian and the longcreated_at senior writer, arts editor and columnist for The VVA Veteran (the magazine of Vietnam Veterans of America), has a firm handle on the subject. Utilizing archival research, personal interviews and his own experiences in the war, Leepson has written a thoroughly engaging biography — the first of its kind — about one of the unsung heroes of Vietnam.\n\"The Unlikely War Hero\" was the No. 1 bestselling Vietnam history book on Amazon just prior to its mid-December release, and it is already into its third printing. It's little wonder; Hegdahl's incredible story adds a compelling facet to the canon of Vietnam literature.\nLeepson provides valuable context regarding life in the camp, such as how prisoners forbidden to communicate with one another did just that. He sketches the politics of the era — without bogging down the story — and the external forces, within the U.S. government and the anti-war movement, which affected life on the inside for the POWs.\nHegdahl, who has not spoken publicly about his captivity since around 2000, chose not to participate in the book, citing a desire to remain a private person. That's a shame, if only because Leepson likely could have drawn more insight or a new perspective out of him. But the book does not suffer for his absence. It is meticulously researched, and it makes expert use of interviews Hegdahl did in his first several years after returning to the U.S.\nLeepson, who has written about a wide range of historical topics, uses varied sources to buttress the narrative but never weighs it down with footnotes or tangents. The writing is clean, generally conversational, and absent of excessive acronyms or jargon that might turn off many readers.\nHegdahl didn't face overwhelming odds on the battlefield. He didn't jump on a grenade to save his fellow servicemen. But what he did as a POW and as an advocate for fellow prisoners was no less heroic. It is a compelling story, told by a skilled storyteller. At the end of the book, Leepson makes a case for Hegdahl to receive the Navy and Marine Corps Medal (although Hegdahl has resisted such efforts). By the end of \"The Unlikely War Hero,\" you'll wonder why it didn't happen decades ago.\nSean Moores\nSean Moores\n© 2025 the Stars and Stripes. Visit www.stripes.com. Distributed by Tribune Content Agency, LLC.\n"
  },
  {
    "id": 1195,
    "title": "Trump Is Behaving a Lot Like Beijing",
    "created_at": "2025-02-05",
    "text": "\nFebruary 5th, 2025 ( Foreign Policy  - Delivered by  Newstex )\nNearly 15 years ago, China's top diplomat, Yang Jiechi, served notice to his country's neighbors that a new era was commencing, one of unbridled assertiveness from Beijing.After regional diplomats complained about China's territorial claims in the South China Sea during an Association of Southeast Asian Nations (ASEAN) meeting in July 2010, Yang sent a chill through the audience.'China is a big country.And you are small countries.And that is a fact,' he  said, in a bald variation on the old maxim that might makes right.Yang's comments quickly came to be seen as part of the launch of a new style of Chinese diplomacy: the so-called  wolf warrior era, when China would make no apologies for its actions while demanding that other nations yield to its desires.He demonstrated that his country was a revisionist power-one willing to lay waste to the existing world order and the rules that underpin it in the narrow pursuit of its national interests.Since then, the toll of China's aggressive approach has become clear.Fear and distrust of Beijing have helped Washington shore up its alliances in Asia, even fueling a rapprochement between countries with long-standing mutual distrust, such as Japan and South Korea.China's actions have also induced India to deepen its security cooperation, if not outright alliance, with the United States and its allies Japan and Australia.Perhaps the best evidence of the failure of China's sharp turn, though, lies in its own course correction.It is safe to assume that Beijing's national interests haven't changed much, but its diplomatic strategy certainly has.In recent years, China's most vociferous diplomats have become much more likely to voice  support for the international system, free trade and open markets, and cooperation with other states.There has never been a better created_at to think back to the 2010 ASEAN summit and its dismal aftermath for China.A little more than two weeks since President Donald Trump returned to the White House, the United States-a country that usually emphasizes its support for the long-standing conventions of an orderly international system, whatever the contradictions-has become the most revisionist state the globe has seen since World War II.New evidence of this comes on a near-daily basis, but the most disturbing example occurred on Tuesday, when Trump  announced during a press conference alongside Israeli Prime Minister Benjamin Netanyahu that the United States may seek to take over Gaza and evict its 2 million Palestinian residents to turn it into the 'Riviera of the Middle East.'Both the language and symbolism were grotesquely revolting-far worse, in fact, than Yang's crude expression of power.Here was a convicted felon, Trump, standing with an indicted war criminal who has personally overseen the utter devastation of Gaza,  speaking of the land of a besieged people as if it were little more than a real estate opportunity-a 'demolition site' ripe for development that Palestinians 'have no alternative' but to abandon.Trump said he didn't want to sound like a 'wise guy,' but by then it was too late to avoid that impression.Like Yang, Trump has sounded a shrill alarm, but this created_at it is not limited to a single region.A few days earlier, U.S. Secretary of State Marco Rubio  issued a crude ultimatum to Panama's leader, threatening action against the country if it did not bow to U.S. demands to reduce China's influence over the Panama Canal.In recent days, Trump has also announced-and then temporarily paused-stiff tariffs on the United States' two biggest trading partners, Canada and Mexico, despite long-standing close ties, including a trade agreement that Trump himself endorsed during his previous term.These threats, too, came with a 'wise guy' ring to them: Make public concessions to me, Trump seemed to say, or I will wreak utter havoc on your economies with an immediate 25 percent increase in tariffs.The week before, it was Greenland, with Trump's repeated demands that Denmark-which enjoys a quasi-colonial custodianship of the territory-cede it outright to the United States.Those demands came with threats that if Denmark didn't get the message, it, too, would face economic pain or perhaps even U.S. intervention in Greenland.The signs of backlash to Trump's designs are beginning to gather like storm clouds on the horizon.Not only did Middle East states denounce the idea of a U.S. takeover of Gaza and the expulsion of Palestinians, but so too have leading  U.S. allies, such as Germany and France.If Trump persists with this unilateralist folly, stronger opposition is certain.Fortified by delusions about a commanding mandate, when in fact he won a small election victory and enjoys tiny margins in Congress, Trump seems to think that the United States is in an equally commanding position internationally-that it has the might to simply demand that friend and foe alike yield to its wishes.The fact is, though, that the world is more multipolar than it has been since the early 20th century, before Washington's sharp postwar rise.Global wealth and power are much more diffuse today than they were during the decades of U.S. preeminence.And just as Asian countries reconfigured their diplomacy in response to an imposing China, states will figure out a way to do so in relation to a United States under Trump.What will be left of the country's international standing by the created_at this lesson is absorbed?Washington's conservative hawks somecreated_ats speak of competition with China in strikingly narrow terms.The United States can prevail, they seem to think, by  acquiring more advanced weapons and ensuring technological leadership in other areas, such as artificial intelligence.What they forget is that modern U.S. power is based on Washington's partnerships and the power of its example.However flawed the latter can be, the country has never jettisoned claims to idealism behind its leadership, until now.Notext has ever loved the United States all the created_at, but admiration for-and emulation of-Washington has long been widespread, and this has been a secret sauce more powerful than any submarine fleet or space force.But what happens when the United States throws strengths like these, along with a respect for rule of law and democracy, out the window?What happens when a U.S. president says in effect that small countries must roll over and obey?What happens when a would-be strongman decides that he can pursue his own interests and whims?What happens when traditional checks and balances built into the U.S. system-not just Congress and the courts but a strong, independent, and fearless press-are being dismantled?What happens when U.S. politics becomes increasingly  overtaken by white nationalism?What happens when Washington turns more vicious toward immigrants, one of the vital forces that built the country, rounding them up aboard military aircraft for publicized deportation to Guantnamo Bay?In a world where China may already be wealthier than the United States by some measures, what will happen if the United States jettisons its values, trashes its institutions, and continues to throw its weight around?What would the argument be for siding with Washington versus Beijing anymore or forging other alliances and arrangements?If the United States continues down its present path, we may soon find out.Link to the original story.N"
  },
  {
    "id": 1196,
    "title": "Exploration Boom in Indonesia, Malaysia Driving Southeast Asia's Upstream Investments",
    "created_at": "2025-02-05",
    "text": "\nKey View\nThe upstream oil and gas sector in Southeast Asia is poised for significant activity in 2025, driven by both local and international investments, particularly in Indonesia and Malaysia.\nMalaysia's offshore exploration activities are also expected to accelerate in 2025 and 2026 following the 2024 awards of exploration blocks.\nVietnam is intensifying its exploration efforts, especially in deep-water areas, to counter declining production from mature fields.\nThe upstream oil and gas sector in Southeast Asia is poised for significant activity in 2025, driven by both local and international investments, particularly in Indonesia and Malaysia. The region concluded 2024 with numerous discoveries, production sharing contract awards, and project commissions, setting a positive tone for the coming year. Indonesia's upstream exploration has made remarkable strides with major discoveries reported between 2023 and 2024. SKK Migas noted a substantial investment of USD11.2 billion in upstream oil and gas projects by October 2023, with expectations for continued growth in 2025. In December 2024, the Indonesian Ministry of Energy and Mineral Resources revealed the discovery of 4.3 billion barrels of oil equivalent (BBOE) across various basins, including the East Natuna and Makassar Strait Basins. Additional reserves in the Makassar and Barito Straits are anticipated to be confirmed soon.September 2024 marked the awarding of three blocks in the Indonesian Petroleum Bidding Round (IPBR) 1 2024 to different consortiums, with the Melati block in Sulawesi emerging as a key area of interest. Mubadala Energy's May 2024 discovery of 2 trillion cubic feet (tcf) of gas at the Tangkulo-1 Exploration well in South Andaman further invigorates the sector, with exploration set to continue through 2030. SKK Migas awarded Central Andaman Oil and Gas Working Area (Migas WK) Contract, the first Oil and Gas Working Area with the New Gross Split scheme to Harbour Energy (60%) and Mubadala Energy (40%) in September 2024.A Investments in Indonesia's upstream gas projects are expected to rise significantly between 2025 and 2026, driven by major projects like the Geng North and Layaran gas fields. \nThese fields are pivotal in meeting the government's target of producing 12 billion cubic feet of natural gas per day by 2030, thereby enhancing domestic energy security.\n\nIndonesia Ramping Up Exploration Efforts To Meet Production Targets\n  Source: Petronas, company press releases, BMI   Malaysia's offshore exploration activities are also expected to accelerate in 2025 and 2026 following the 2024 awards of exploration blocks.A In December 2024, Petronas awarded four Production Sharing Contracts (PSCs) for several clusters and exploration blocks under the Malaysia Bid Round 2024. Notable awards include the Raja cluster in Peninsular Malaysia and the Ubah Cluster offshore Sabah. A A consortium of ConocoPhillips Malaysia New Ventures Limited, Sabah Shell Petroleum Company Limited, and Petronas won the exploration rights in the Ubah Cluster, located offshore Sabah.A Exploration block PM515 was awarded under the Enhanced Profitability Terms PSC to Petronas and E&P Malaysia Venture Sdn. Bhd.A The Bekok Deep-1 discovery that Petronas announced in May 2024 promises further exploration successes in Malaysia.AUpstream investment projects are in the pipeline although the final investment decision for the Lang Lebah field has been deferred to 2025 due to cost and jurisdictional disputes. Despite these challenges, the Lang Lebah field is expected to produce 600-800mmscfd, or about 7bcm at peak. Future exploration activities in Sarawak state could be constrained by ongoing disputes between Petronas and the Sarawak government over control and ownership of oil and gas assets in Sarawak state. Vietnam is intensifying its exploration efforts, especially in deep-water areas, to counter declining production from mature fields. The country achieved two significant discoveries in 2024, namely the Ra>>&quot;ng and Bunga Aster fields, showing promising potential. Long-term commitments, such as IndiaaEURtms ONGC Videsh's 16-year contract extension for Block 06.1 in the Nam Con Son basin until 2039 and a three-year extension for exploring Block 128 in the South China SeaA underpins Vietnam's relative attractiveness toA A to sustaining its upstream sector. A key development is Mitsui Oil Exploration Co., Ltd. (MOECO) and its partners have reached a final investment decision on the development of offshore Block B natural gas field which will be linked via a pipeline to gas-fired power plant. Block B project which is scheduled to complete by the end of 2026 is estimated to produce 490 million cubic feet per day.A Such development underscore foreign investorsaEURtm commitment to sustaining VietnamaEURtms upstream sector.In contrast, Myanmar's upstream sector faces substantial challenges, including political instability and international sanctions. The withdrawal of major operators since the 2021 coup has left future investments uncertain. However, PTTEP's ongoing and planned activities in the Yadana and Zawtika gas projects highlight some potential for continued operations, crucial for Thailand's gas supply. Thailand's oil and gas sector continues to struggle with declining reserves and limited new discoveries. The focus remains on maintaining production from key fields like Erawan and Bongkot. Future exploration may target untapped blocks in the Thailand-Cambodia Overlapping Claim Areas, contingent on diplomatic resolutions.A The outlook for upstream oilA and gas production hinges on the further exploration of the Malampaya gas field. The recent agreement to extend Malampaya contract for another 15 years could offer potential upside to gas reserves. Nonetheless, the Philippines still faces a challenging task to reverse declining oil and gas production from depleting fields. Heightened maricreated_at disputes between the Philippines and Mainland China are expected to deter foreign investments and further delay cooperation between the two countries to carry out joint explorations in South China Sea.A Overall, Southeast Asia's upstream oil and gas industry is set for substantial investment and exploration activity in 2025, driven by strategic discoveries and government-backed production targets, particularly in Indonesia and Malaysia.A\n\nMalaysia Seeking To Boost Oil & Gas Production in Peninsular Malaysia\n  Source: Petronas, company press releases, BMI   \n"
  }
]