[
  {
    "id": 1213,
    "title": "PH, US reestablishing 'deterrence' in South China Sea",
    "created_at": "2025-02-06",
    "text": "\nManila, Feb. 6 -- The Philippines and the United States have both underscored the need to restore deterrence in the South China Sea as China continues its aggressive claims in a region of global trade importance.\nPhilippine Defense Secretary Gilbert Teodoro Jr. and US Secretary of Defense Pete Hegseth (AP, Manila Bulletin photos)\nIn a readout, Pentagon Spokesman John Ullyot said that Department of National Defense (DND) Secretary Gilbert Teodoro Jr. and US Secretary of Defense Pete Hegseth had an introductory call on Wednesday, Jan. 5 (Washington created_at), to discuss the defense alliance between the two countries.\n\"The leaders discussed the importance of reestablishing deterrence in the South China Sea, including by working with allies and partners,\" it read.\n\"They also discussed enhancing the capability and capacity of the Armed Forces of the Philippines,\" it added.\nAccording to Pentagon, Hegseth reaffirmed the \"ironclad US commitment\" to the 1951 Mutual Defense Treaty \"and its importance for maintaining a secure and prosperous Indo-Pacific.\"\nHe also vowed to remain in \"close coordination\" with Teodoro.\nWhile the readout did not mention China, the US has been vocal in urging Beijing to heed international laws and commitments as it pursues its claims in the resource-rich South China Sea.\nThe conversation between Teodoro and Hegseth came on the heels of concerns rising after US President Donald Trump stopped US foreign aid to make way for a review to ensure these are aligned with his foreign policies.\nDuring a reception hosted by the New Zealand Embassy on Tuesday night, Feb. 4, Teodoro told reporters that he is confident the said review won't affect the defense alliance between Manila and Washington.\n\"I think it is just a review of the incoming administration in so far as defense is concerned, I'm not worried at all,\" he said.\nHe even shared that a recent talk with National Security Adviser Michael Waltz assured that the US will stay true to its defense commitments to the Philippines and there were even plans to advance existing partnerships.\nPublished by HT Digital Content Services with permission from Manila Bulletin. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1214,
    "title": "VIETNAM BUILDS ISLANDS IN SOUTH CHINA SEA AMID TENSION, CHALLENGES",
    "created_at": "2025-02-06",
    "text": "\nThe following information was released by Radio Free Asia:\nVietnam's island reclamation activities in the South China Sea made titles in 2024 with a record area of land created and several airstrips planned on the new islands.\nThe Washington-based Asia Maricreated_at Transparency Initiative, or AMTI, said that between November 2023 and June 2024, Hanoi created 280 hectares (692 acres) of new land across 10 of 27 features it occupies in the Spratly archipelago.\nAMTI also reported that three to four runways might be planned for different features.\n\"Three years from when it first began, Vietnam is still surprising observers with the ever-increasing scope of its dredging and landfill in the Spratly Islands,\" the think tank said.\nHanoi's island building program stemmed from a Communist Party resolution in 2007 on maricreated_at strategy toward the year 2020, according to Carlyle Thayer, a Vietnam expert at the University of New South Wales in Australia.\nThe resolution set out an integrated strategy to develop coastal areas, an exclusive economic zone, and 27 land features in the South China Sea with the objective that this area would contribute between 53% and 55% of the gross domestic product by 2020, Thayer said.\nIt was only in 2021 that Vietnam began a modest program of landfill and infrastructure construction on its features in the Spratly Islands, Thayer said.\nBy that created_at, China had completed the construction of its \"Big Three\" artificial islands in the South China Sea Fiery Cross, Mischief and Subi reefs and equipped them with runways and military facilities.\nThe island-building program focuses mainly on the so-called integrated marine economy, the analyst told Radio Free Asia, noting that there are only modest defenses such as pillboxes, trenches and gun emplacements on the newly developed features.\nRisk of tension\nVietnam has long been wary of causing tension with China but its increasing assertiveness had led to a re-think in Hanoi.\n\"Vietnam has not placed major weapon systems on its land features that would threaten China's artificial islands,\" Thayer said.\n\"But no doubt the rise in Chinese aggressiveness against the Philippines after the election of Ferdinand Marcos Jr. reinforced Vietnam's determination not to leave its island features in the Spratlys exposed.\"\n\"Vietnamese occupation also serves to deny China the opportunity to occupy these features as China did when it took control of unoccupied Mischief Reef belonging to the Philippines in 1984,\" he added.\nCarl Schuster, a retired U.S. navy captain based in Hawaii, said that on the surface, Vietnam and China appeared to have strong, positive relations but \"at its roots, the relationship is one of distrust and for Vietnam, pragmatism.\"\n\"Vietnam has noticed that the PRC is most aggressive around undefended or uninhabited islands and islets,\" Schuster said, referring to China by its official name the People's Republic of China.\n\"Hanoi therefore sees expanding, hardening and expanding the garrisons on its own islands as a means of deterring PRC aggression.\"\nYet Vietnam's island building activities have been met with criticism from some neighboring countries.\nMalaysia sent a rare letter of complaint to Vietnam in October 2024 over its development of an airstrip on Barque Canada reef a feature that Malaysia also claims in the South China Sea.\nAnother neighbor, the Philippines, announced that it was closely \"monitoring\" Vietnam's island building activities.\nIn July 2023, the pro-China Manila created_ats published two reports on what it called \"Vietnam's militarization of the South China Sea,\" citing leaked masterplans on island development from the Vietnamese defense ministry.\nShortly after the publication, a group of Filipinos staged a protest in front of the Vietnamese embassy in Manila, vandalizing the Vietnamese flag. The incident did not escalate but soured the usually friendly relationship between the two neighbors.\nReasonable response\nThe Southeast Asian bloc ASEAN has long been negotiating with China on a Code of Conduct in the South China Sea and the consensus is to observe the status quo in the disputed waterway and maintain peace.\nAzmi Hassan, a senior fellow at Malaysia's Nusantara Academy for Strategic Research, explained that status quo means \"there shouldn't be any new reclamation, especially in the Spratly or Paracel Islands as new reclamation could create some instability.\"\n\"But in the case of Vietnam, it's very difficult to stop them because the Chinese have been doing it for many years and China has the longest airstrip and the biggest reclamation on Mischief Reef,\" Hassan said.\nMalaysia also built an airstrip on Pulau Layang-Layang, known internationally as Swallow Reef, which is claimed by several countries including Vietnam.\n\"So it's very hard to criticize Vietnam because Malaysia has done it, China has done it, and the Philippines has been doing it for quite some created_at,\" the analyst said.\nGreg Poling, AMTI's director, told RFA that in his opinion, Hanoi's goal with the development of features in the South China Sea \"appears to be to allow it to better patrol its exclusive economic zone by sea and air in the face of China's persistent presence.\"\n\"That seems a reasonable and proportionate response,\" he said.\nThe U.S. government has taken no public position on the issue but the Obama administration did push for a construction freeze by all parties, Poling said.\nThen-U.S. Defense Secretary Ash Carter visited Hanoi in June 2015 and discussed the issue during a meeting with his Vietnamese counterpart, Phung Quang Thanh and, according to the transcript of a press briefing.\nCarter was told that \"the government of Vietnam is considering ... a permanent halt to reclamation and further militarization\" of the new islands.\n\"But that was when the prime goal was to stop China's island building,\" Poling said. \"Obviously that didn't work so now I think the U.S. and other parties understand that Vietnam is not likely to agree to unilaterally restrain itself when China has already done it.\"\nIn 2015, Vietnam still insisted that it was only carrying out activities \"to enhance and to consolidate the islands that are under our sovereignty.\"\nIn the late Gen. Phung Quang Thanh's words: \"We do not expand those islands, we just consolidate to prevent the soil erosion because of the waves, to improve the livelihood of our people and of our personnel who are working and living there.\"\n\"And for the submerged features, we have built small houses and buildings, which can accommodate only three people, and we do not expand those features. And the scope and the characteristics of those features are just civilian in nature,\" Thanh told Carter.\nBad investment?\nFast forward 10 years, and Vietnam has reclaimed a total area of about half of what China has built up and among the 10 largest features in the Spratlys, five are being developed by Hanoi with an unknown, but no doubt massive budget.\nThe island building program, however, has been received positively by the Vietnamese public.\nPhotos and video clips from the now popular Bai Thuyen Chai, Dao Tien Nu and Phan Vinh or Barque Canada, Tennent and Pearson reefs respectively have been shared and admired by millions of social media users as proof of Vietnamese military might and economic success even if the construction comes at a big environmental cost.\nSouth China Sea researcher Dinh Kim Phuc told RFA Vietnamese that despite the environmental damage, Vietnam's actions \"must happen\" and are necessary for \"strategic defense\" as long as China does not quit its expansionist ambitions.\nHowever, some experts have warned against the effectiveness of such artificial islands from a military standpoint.\n\"Like Chinese-built islands, Vietnamese built islands are, by nature, small areas of land that are difficult to defend against modern land-attack missile capabilities, and given their low altitude, they are at the mercy of salt water corrosion of structures and systems ashore,\" said Malcolm Davis, a senior analyst in defense strategy and capability at the Australian Strategic Policy Institute.\n\"So as with Chinese experience, the Vietnamese will also struggle to base military capabilities on these islands for extended periods of created_at,\" Davis told RFA.\n\"In the longer term, they are also going to be vulnerable to the effects of climate change - most notably, sea level rise, which could quickly swamp a low-level landmass and see it become unusable.\"\n\"These challenges are why I don't worry too much about those Chinese-built bases in the South China Sea, as I think Beijing has made a bad investment there,\" the analyst added.\nAMTI's Poling said rising sea levels and storm surge would threaten all the islands \"but it is something that both China and Vietnam are likely able to cope with by continually refilling the islands and building up higher sea walls.\"\nThat would entail considerable costs and cause even more environmental impact.\nIman Muttaqin Yusof in Kuala Lumpur contributed to this story\nEdited by Mike Firn\n"
  },
  {
    "id": 1215,
    "title": "Manila should reconsider who its friends are",
    "created_at": "2025-02-06",
    "text": "\nThe People's Liberation Army Southern Theater Air Force conducted a routine patrol in the airspace of China's Huangyan Island in the South China Sea on Tuesday. At the same created_at, the Philippines solicited countries outside the region to organize a so-called joint patrol to deliberately undermine peace and stability in the waters.\nThe latest provocative moves of the Philippines came after Philippine Secretary of Foreign Affairs Enrique Manalo's first phone call with US Secretary of State Marco Rubio on Jan 22, in which the two sides talked about China's \"dangerous and destabilizing actions\" in the South China Sea, according to a readout of the US State Department on the talks.\nRubio \"underscored the United States' ironclad commitments to the Philippines under our Mutual Defense Treaty\", the State Department said in the statement.\nNotably, the talks between Manalo and Rubio came one week after the 10th Meeting of the China-Philippines Bilateral Consultation Mechanism on the South China Sea. In the meeting, the two sides had a candid and constructive exchange of views on the situation in the South China Sea. Both sides reiterated the importance of maintaining peace and stability in the waters, believing that this serves the common interests of the two countries and the region.\nThe two sides also agreed to strengthen sea-related dialogue, communication and contact, properly handle maricreated_at disputes and differences, and continue to promote practical maricreated_at cooperation in various fields such as marine science and technology, and environmental protection.\nBut the continuous worsening of the situation in the South China Sea after the Manalo-Rubio talks, which followed one day after the latter hosted a Quad foreign ministers' meeting in Washington, indicates that the Ferdinand Marcos Jr government of the Philippines, after a brief respite of wait and see during the power transition in Washington, has decided to continue its tricks of saying one thing and doing another. It has apparently bet on the new US administration carrying on its predecessor's support for the Philippines.\nWith Japan, Australia and India, which were all active participants in the previous US administration's \"Indo-Pacific\" strategy, all adopting a more balanced foreign policy when it comes to relations with the US and China, it is high created_at Manila weighed the possible gains and losses of continuing the one-sided pro-US diplomacy that has actually brought the Philippines nothing but risks and uncertainties, and isolated it from the rest of the region over the past more than two years.\nAs Chinese Foreign Ministry spokesperson Mao Ning said, China's activities in the relevant waters are reasonable and legal and beyond reproach. The US is not a party to the South China Sea issue and has no right to intervene in maricreated_at issues between China and the Philippines. The US-Philippines military cooperation must not undermine China's sovereignty and maricreated_at rights and interests in the South China Sea, and must not be used to endorse the Philippines' illegal claims. China will continue to take necessary measures to firmly defend its territorial sovereignty and maricreated_at rights and interests and maintain peace and stability in the South China Sea.\n \n"
  },
  {
    "id": 1217,
    "title": "China Anger Over US Naval Drills: 'Illegal Claims'",
    "created_at": "2025-02-06",
    "text": "\nA series of naval exercises involving the United States, Japan, Australia, and the Philippines in the South China Sea have escalated tensions with Beijing, which claims the entire maricreated_at region.\nTian Junli, spokesperson for China's Southern Theater Command, said the Philippines' actions were \"an attempt to endorse its 'illegal claims' in the South China Sea and \"undermine China's maricreated_at rights and interests,\" Chinese state media said on Thursday.\nWhy It Matters\nThe South China Sea is a hotspot of territorial disputes, with China facing opposition from multiple countries, including Vietnam and the Philippines. A 2016 ruling by a United Nations-backed tribunal rejected most of Beijing's expansive maricreated_at claims, but China has ignored the decision and continued building artificial islands equipped with military infrastructure.\nWhat To Know\nDespite China's reassurances that it does not seek to obstruct commercial shipping or air traffic, it remains staunchly opposed to foreign military operations in the region. The South China Sea is a crucial maricreated_at route, facilitating approximately $5 trillion in global trade annually, and is believed to hold vast undersea reserves of oil and natural gas.\nThe U.S. 7th Fleet announced that forces from the four nations conducted a \"multilateral Maricreated_at Cooperative Activity\" within the Philippines' Exclusive Economic Zone on Wednesday.\nWhile the fleet did not disclose the exact location of the exercises, more drills involving U.S., Japanese, and French naval forces are scheduled later this week in the Philippine Sea, to the northeast of the archipelago.\nThe upcoming drill, starting Saturday, will feature the U.S. aircraft carrier USS Carl Vinson, the French aircraft carrier Charles de Gaulle, and Japan's Izumo-class destroyer Kaga, along with their escort ships and air wings.\nWhat People Are Saying\nThe U.S. 7th fleet stated in a press release that such drills \"strengthen the interoperability of our defense/armed forces doctrines, tactics, techniques, and procedures.\"\nUnited States Navy Rear Admiral Michael Wosje, speaking about the upcoming drills with Japan and France, said: \"Together, we seek to maintain an open and inclusive Indo-Pacific, free of all forms of coercion, and we're excited to work alongside our allies and partners who share that vision.\"\nTian reportedly said: \"[The Philippines is] colluding with outside countries to organize 'so-called joint patrols.'\"\nThe senior colonel added that China conducted its own patrols in response to U.S.-Philippines joint patrols earlier this week, signaling Beijing's continued efforts to assert dominance over the contested waterway.\nWhat's Next\nBeijing continues to warn external nations against interfering in South China Sea affairs, insisting that countries without direct territorial claims should have no role in the dispute.\nThis article contains reporting by The Associated Press\nLink to Image\n\nGraphic\n \nbattleship with crews on joint exercises\nU.S. 7th Fleet\nCrew from Australian, Japanese, Filipino, and U.S. naval ships taking part in drills\n"
  },
  {
    "id": 1218,
    "title": "PH-US agree to reestablish deterrence in South China Sea",
    "created_at": "2025-02-06",
    "text": "\nThe defense chiefs of the Philippines and the United States recently held a discussion on efforts to reestablish deterrence in the South China Sea, following reports of Chinese vessels encroaching on the Philippine’s Exclusive Economic Zone..."
  },
  {
    "id": 1219,
    "title": "Patrols staged for second day amid row with Manila",
    "created_at": "2025-02-06",
    "text": "\nThe military conducted a patrol in the South China Sea for a second day in a row yesterday, as tensions mount with the Philippines over the disputed waters. \nThe People's Liberation Army Southern Theatre Command said it had carried out a \"routine patrol\" in the area, without elaborating. It followed Tuesday's PLA air patrol over the contested Scarborough Shoal - known as Huangyan Island in China. \nThe Chinese military activities came after the Philippines and the United States held a joint patrol over the South China Sea on Tuesday, in an area close to the exclusive economic zone claimed by Manila. \nResponding to that exercise yesterday, the PLA said Manila had \"colluded with extraterritorial countries\" and undermined regional stability, and that China's military would defend the ­country's territorial sovereignty and maricreated_at rights. \n\"It is aimed at providing a ­pretext for its illegal claims in the South China Sea and ­undermining China's legitimate maricreated_at rights and interests in the region,\" Southern Theatre Command spokesman Senior Colonel Tian Junli said. \nThe latest patrol came after state broadcaster CCTV on Tuesday aired footage of a PLA destroyer fleet conducting an exercise in the Pacific Ocean, soon after Beijing and Manila traded barbs over a Chinese navy transit through the Basilan Strait earlier this week. \nThe CCTV report showed the Zunyi Type 055 destroyer, Hengyang Type 054A frigate and Weishanhu Type 903 ­replenishment vessel carrying out far-sea combat training at an undisclosed Pacific location over Lunar New Year. \nThey were the same three ­warships seen sailing through the 18km Basilan Strait - which ­separates the Philippine islands of Mindanao and Basilan - towards the Sulu Sea on Sunday. \nThe PLA warships, led by the stealth guided-missile destroyer, play an important role in China's blue-water naval ambitions. \nTuesday's report highlighted young sailors taking part in the drill who were on their first deployment. \nAccording to former PLA instructor Song Zhongping, the message of the state television report was that the Basilan Strait transit \"was just a routine naval exercise and should not be ­misinterpreted as a deterrence manoeuvre, or a show of force\". \nOn Monday, the Philippines condemned the transit as \"not consistent with the principles of innocent passage\", while China claimed it fully complied with international law and norms and accused Manila of politicising routine naval movements. \nSome observers said the ­timing of the CCTV report - soon after Manila objected to the ­warships sailing through the strait - suggested Beijing wanted to downplay the transit. Others saw it as a calculated response to growing scrutiny of Chinese ­military activities in the region.\n"
  },
  {
    "id": 1220,
    "title": "BBCM China Watchlist 6 Feb 25",
    "created_at": "2025-02-06",
    "text": "\nStories being covered today by BBC Monitoring from Chinese broadcast, press and social media sources.\nXi meets Pakistan president, Thai PM, Brunei Sultan\nChinese President Xi Jinping held talks with Pakistani President Asif Ali Zardari in the afternoon of 5 February, and held separate meetings with Thai Prime Minister Paetongtarn Shinawatra and Sultan Hassanal Bolkiah of Brunei this morning.\nDuring talks with Zardari, who is on a state visit to China from 4-8 February, Xi stressed that Beijing views ties with Islamabad from a \"strategic perspective\" and \"maintains a high degree of stability and continuity in its friendly policy towards Pakistan\", the official Xinhua News Agency reported.\nXi said that China will continue to support Pakistan in safeguarding sovereignty, independence, and territorial integrity as well as in combating terrorism, and pledged Beijing's willingness to build an \"upgraded version\" of the China-Pakistan Economic Corridor (CPEC) project. He also asked Zardari to \"strengthen protection for Chinese personnel, projects and institutions\" in Pakistan.\nDuring the meeting with Paetongtarn, who is making her first visit to China since becoming prime minister last August, Xi urged both sides to consolidate strategic mutual trust and firmly support each other as the way to \"deal with uncertainties from external environment\", Xinhua reported.\nXi praised Thailand for \"taking effective measures to crack down on online gambling and telecommunication frauds, adding that the two sides must strengthen law-enforcement and judicial cooperation to protect the people and \"maintain the order of exchanges and cooperation among regional countries\".\nThe issue of possible repatriation of 48 Uyghurs detained in Thailand was not specifically mentioned in the Xinhua readout.\nAt the foreign ministry's regular press conference on 5 February, spokesperson Lin Jian    declined to confirm if Beijing will make such a request, only emphasising that \"we firmly fight any form of illegal migration and oppose any move that emboldens or even supports illegal migration\", according to the ministry's transcript.\nSee also: Xi Jinping holds talks with Kyrgyz president  \nPakistan president's Beijing visit 'of great significance' - Chinese envoy  \nBriefing: Pakistan, China reaffirm ties amid reports of tension  \nChina pushes back on US's 'irresponsible remarks' on Panama Canal, tariffs\nAt the regular press conference on 5 February, spokesperson Lin Jian also criticised \"irresponsible remarks\" by the US over the Panama Canal that led to Panama announcing that it would not renew its Belt and Road cooperation with Beijing.\nLin said Washington had \"intentionally distorted, attacked and mischaracterised\" cooperation between China and Panama, and urged Panama to \"resist external interruption\" and \"make the right decision\" for bilateral relations and interests of the people of the two countries, Xinhua reported.\nPanama made the decision after a meeting with visiting US Secretary of State Marco Rubio on 2 February. Rubio also said that US President Donald Trump has made a \"preliminary determination\" that Chinese influence violates a treaty that assures the neutrality of the Panama Canal, Politico reported.\nLin was also asked if Beijing can do more to address Washington's fentanyl concerns that was the cause of the 10% additional tariffs levied on Chinese imports to the US.\nEmphasising that \"fentanyl is an issue for the US\", Lin said that \"pressuring or threatening China is not a right way to engage with us\", according to state-run nationalist newspaper Global created_ats.\nLin also said that the US should \"stop politicising and weaponising trade and economic issues\" and \"stop groundlessly going after Chinese companies\" in response to the United States Postal Service (USPS) suspending accepting packages from China and Hong Kong after Trump's latest tariffs measures. USPS later reversed the decision.\nOn when a Xi-Trump call will take place following Trump's remarks that he is \"in no rush\" to speak to Xi, Lin said \"what is needed now is not unilateral tariff hikes but equal-footed dialogue and consultation with mutual respect\".\nSee also: Explainer: China, India see some interests converge amid pressure from Trump  \nBriefing: Chinese media see room for US talks after 'restrained' tariff response  \nPanama high court agrees to hear lawsuit against Chinese port concession-report  \nBriefing: China pundits call Trump's Gaza plan 'frivolous', 'ethnic cleansing'  \nChinese military patrols South China Sea for second day\nThe Chinese military patrolled the South China Sea for a second consecutive day and again criticised the Philippines for holding multinational maricreated_at patrols in the area.&#160;\nOn 5 February, the People's Liberation Army (PLA) Southern Theatre Command conducted a \"routine patrol\" in the South China Sea, according to Sen Col Tian Junli, the command's spokesman, Xinhua reported. No specific location was mentioned.\nTian said that the Philippines had organised \"a so-called 'joint patrol' to attract countries outside the region to create instability in the South China Sea, endorse its illegal claims in the South China Sea, and erode China's legitimate maricreated_at rights and interests\".&#160;\nThe Theatre Command troops remain on high alert, resolutely defending national territorial sovereignty and maricreated_at rights and interests in the South China Sea, Tian added.&#160;\nThe naval and air forces of Australia, Japan, the Philippines and the US conducted \"maricreated_at cooperative activity\" within the Philippines' \"exclusive economic zone\" on 5 February in support of a \"free and open Indo-Pacific\", according to the US Indo-Pacific Command.\nA day earlier, the air forces of the Philippines and the US held joint patrols near the disputed Chinese-controlled Scarborough Shoal on the same day that the PLA Southern Theatre Command was conducting a patrol of the area. &#160;\nThe shoal is claimed by China as Huangyan Island and by the Philippines as Bajo de Masinloc or Panatag Shoal, and it has been a key flashpoint in recent months.\nSee also: China military patrols disputed shoal amid US-Philippine air drill  \nPhilippines, US hold joint air patrol exercises  \nChina reports record travel numbers during Spring Festival\nChina has released more travel and spending numbers on 5 February following the end of this year's Spring Festival holiday that ran from 28 January to 4 February.\nOn 5 February, national broadcaster China Central Television's (CCTV) Xinwen Lianbo bulletin reported on how culture-themed retail and tourism continued to see a boom from a \"historic high\" 501 million domestic tourism trips made during the holiday period. The sightseeing trips generated a spending of 677bn yuan (around $93bn), an increase of 7% compared to 2024.&#160;\nThe bulletin also said that over 2.3 billion cross-regional passenger trips were made in the eight-day holiday period. These travels included people working in other provinces returning home for reunions.\nPrivately-run Beijing-based financial media Caixin (under a paywall) said that compared to pre-Covid numbers in 2019, domestic tourism consumption during the eight-day holiday period had increased by over 31%, citing data from the Ministry of Culture and Tourism.\nCaixin also said that overseas travels increased 30% year-on-year based on the travel booking website Ctrip, with trips to Japan doubled compared with the 2024 Spring Festival.\nDespite the highly-publicised rescue in January of Chinese actor Wang Xing after he was abducted and taken to a scam farm on the Thailand-Myanmar border, Thailand remained a popular tourist destination, though it was surpassed by Japan this year, Caixin reported, citing data from Qunar, another travel website.&#160;\nMoviegoers also contributed to a \"record-breaking\" 9.5bn yuan ($1.31bn) box office revenue during the holidays, Xinhua reported.\nSee also: State TV highlights travel boom, winter sports during Lunar New Year  \nMigrant workers return to jobs early during Spring Festival  \nBriefing: Weibo diplomacy &#8211; less polarised response to envoys' festive messaging  \nSource: BBC Monitoring 6 Feb 25\n"
  },
  {
    "id": 1221,
    "title": "A flurry of international naval drills around the Philippines prompts complaints from Beijing",
    "created_at": "2025-02-06",
    "text": "\nTAIPEI, Taiwan (AP) — A flurry of naval drills surrounding the Philippines involving the United States and its partners has prompted complaints from Beijing, which claims the entire South China Sea and accuses Manila of colluding with others to destabilize the region.\nThe U.S. 7th Fleet based in Japan said forces from Australia, Japan, the Philippines, and the U.S. conducted a “multilateral Maricreated_at Cooperative Activity” within the Philippines’ Exclusive Economic Zone on Wednesday.\nSuch drills “strengthen the interoperability of our defense/armed forces doctrines, tactics, techniques, and procedures,\" the fleet said in a news release. The maneuvers were taking place within the Philippines’ zone, but the fleet gave no details on the exact location.\nMore exercises involving the U.S., Japan and France were planned for later this week in the Philippines Sea, which China does not claim.\nThat exercise “is designed to advance coordination and cooperation between French, Japanese and U.S. maricreated_at forces while simultaneously demonstrating capabilities in multi-domain operations,” the fleet said.\nThe U.S. aircraft carrier Carl Vinson, French carrier Charles De Gaulle and Japan's Izumo-class multi-functional destroyer Kaga will take part in the drill starting Saturday, along with their escorts and air wings, the fleet said.\nFrance's participation is especially significant because of the distance from its home base, 6,000 kilometers (3,700 miles) away in Toulouse, commander of the Carrier Strike Group Rear Adm. Jacques Mallard was quoted as saying.\nMeanwhile, Tian Junli, spokesperson for China's Southern Theater Command, accused the Philippines of “colluding with outside countries to organize ‘so-called joint patrols’, \" which he said ”destabilize the region,\" Chinese state media said on Thursday.\nTian said the Philippines actions were “an attempt to endorse its ‘illegal claims’ in the South China Sea and ”undermine China’s maricreated_at rights and interests.\" He specifically pointed to U.S.-Philippines joint patrols on Tuesday and said China had carried out its own patrols in the region on Wednesday.\nChina is one of six regional powers that claims the strategic South China Sea in part or in whole, ignoring a ruling by a United Nations-backed court that tossed out most of its claims and building human-made islands equipped with airstrips and other infrastructure of military use. China's coast guard and maricreated_at militia frequently clash with ships from fellow claimants Vietnam and the Philippines.\nThough it claims not to disrupt shipping or overflights in the sea, through which an estimated $5 trillion in global trade transits each year, China is adamantly opposed to foreign military shipping in the area.\nThe waterway is also believed to be sitting atop vast undersea deposits of oil and gas and while China says it wants to come to a negotiated agreement about the use of the sea, such efforts have made little progress.\nChina says the U.S. and other countries that don't border on the sea should have no say in affairs concerning it, although the U.S. — which takes no formal stand on sovereignty issues involving the sea — has maintained bases and alliances in the region long before China made its formal claim to sovereignty using the so-called “eight dash line.”\nBeijing is especially angered over U.S. “freedom of navigation operations” in which Navy ships sail close to Chinese-held maricreated_at features to show Washington does not recognize China's sovereignty claims.\n"
  },
  {
    "id": 1225,
    "title": "First call: Trump defense chief reaffirms 'ironclad' commitment to the Philippines",
    "created_at": "2025-02-06",
    "text": "\n Defense Secretary Gilbert Teodoro and newly minted United States Defense Secretary Pete Hegseth spoke Thursday, February 6 about strengthening maricreated_at deterrence in the South China Sea - the first official engagement between the two defense chiefs. \nBoth officials \"held an introductory call today to discuss defense cooperation in the U.S.-Philippines Alliance,\" according to the readout by the US Department of Defense.\nThe US defense chief, whose appointment was formalized January 25, also reaffirmed the \"ironclad\" US commitment to the 1951 Mutual Defense Treaty - the agreement that compels both countries to defend each other in the event of armed attacks. \nTeodoro and Hegseth discussed the importance of \"reestablishing deterrence in the South China Sea, including by working with allies and partners.\"  \nThey also discussed plans to enhance the capabilities of the Armed Forces of the Philippines, according to the readout. \nHegseth - who was formerly a Fox News co-host - also reaffirmed the defense treaty's importance for \"maintaining a secure and prosperous Indo-Pacific.\" \nThe US defense chief vowed to \"remain in close coordination\" with Teodoro.\nThe army veteran and former Fox co-host now leading the Pentagon had struggled to identify a single country in the Association of Southeast Asian Nations (ASEAN) during his confirmation hearing on January 14. \nHe was specifically asked by a senator to 'name the importance of at least one of the nations in ASEAN and what type of agreement we have [with them].\" He was also asked to state how many nations there are in ASEAN. \nHegseth said he could not state the \"exact amount of nations\" in the regional bloc and instead cited the US' ties with South Korea, Japan and Australia.\nThe Trump appointee said during his confirmation hearing that he was tasked with \"[bringing] the warrior culture back to the Department of Defense.\" \nDays ago during an interview with reporters, Teodoro expressed optimism that the Trump administration will honor the US' commitments to the Philippines in defense and military support after suspending foreign assistance to all nations. \n"
  },
  {
    "id": 1226,
    "title": "Philippine vice president's impeachment trial will start after Congress reopens in June",
    "created_at": "2025-02-06",
    "text": "\nMANILA, Philippines (AP) — The Philippine Senate president said Thursday the impeachment trial of Vice President Sara Duterte will begin after Congress reopens in June and vowed to avoid a repeat of stalled 2001 impeachment proceedings that sparked massive protests and forced a president to step down.\nThe previous day, the House of Representatives impeached Duterte, daughter of former President Rodrigo Duterte, on a range of accusations that include plotting to assassinate the president, large-scale corruption, and failing to strongly denounce China’s aggressive actions against Filipino forces in the disputed South China Sea.\nAt least 215 of the House's more than 300 legislators signed the complaint — significantly more than the required number — allowing it to be transmitted immediately to the Senate, which will serve as the impeachment court. The impeachment came on the last day of congressional session before a four-month break.\nSara Duterte didn’t immediately comment, but her brother Rep. Paolo Duterte said the impeachment was “a clear act of political persecution.” Rival lawmakers maneuvered to quickly collect signatures and push a “baseless impeachment case” to the Senate, he said.\nSenate President Francis Escudero said under the law an impeachment court can only be convened and senators sworn in as jurors when the Senate resumes its session on June 2.\n\"Legally, it cannot be done,” Escudero said in a news conference when asked if a special Senate session could be called to start the impeachment trial earlier.\nNonetheless, many activists and critics argue the text could do more to provide a swift trial.\n“The Senate’s foot-dragging on the impeachment process vs. Sara Duterte will be a roadblock to the pursuit of accountability,” said Cristina Palabay, a leader of a human rights alliance.\nThe move by House legislators, many of them allies of President Ferdinand Marcos Jr., deepens a bitter political rift between the two highest leaders of one of Asia’s most rambunctious democracies.\nThe signatories included the president’s son, Rep. Sandro Marcos, and House Speaker Martin Romualdez, the president’s cousin. The petition asks the Senate remove Duterte from office and ban her from holding public office for life.\nIn a Southeast Asian country long plagued by political divisions, impeachment trials can become politically volatile. In early 2001, an impeachment trial of then President Joseph Estrada on allegations including bribery and corruption stalled over a vote not to open an envelope containing records of his suspected bank account.\nMassive protests ensued, eventually forcing Estrada to step down.\nAsked how that could be avoided in the impeachment trial of Duterte, Escudero said steps were being taken early to ensure “the credibility and impartiality of the impeachment court.” No side should be prevented from expressing their positions, he added.\nThe impeachment complaint against the vice president focused on a death threat she made against the president, his wife and the House speaker last year, irregularities in the use of her office’s intelligence funds and her failure to stand up to Chinese aggression in the disputed South China Sea, according to proponents of the petition.\nShe told a Nov. 23 online news conference that she had contracted an assassin to kill Marcos, his wife and Romualdez if she were killed, a statement she said wasn’t a joke. She later said it wasn't a threat, but an expression of concern for her own safety.\nAllegations of graft and corruption against her also emanated from a monthslong and televised House investigation last year on the alleged misuse of 612.5 million pesos ($10.5 million) of confidential and intelligence funds received by Duterte’s offices as vice president and education secretary. She later left the education post as her political differences with Marcos deepened.\nShe has denied any wrongdoing but refused to respond to questions in detail during the tense televised hearings.\nThe impeachment complaint accused Duterte of undermining the Marcos government’s policies, including by describing the administration’s handling of territorial disputes with Beijing in the South China Sea as a “fiasco.” The complaint also mentioned her silence over China’s increasingly assertive actions in the disputed waters.\n"
  },
  {
    "id": 1229,
    "title": "Philippines assured by Hegseth of US' 'ironclad' pledge to mutual defence treaty",
    "created_at": "2025-02-06",
    "text": "\n Both countries discussed \"the importance of re-establishing deterrence in the South China Sea\"   \nNewly appointed US defence chief Pete Hegseth has reassured the Philippines that Washington remains \"ironclad\" in standing by the two countries' mutual defence treaty amid questions over the Donald Trump administration's level of commitment towards Manila and the broader region. \nA readout from the US Department of Defence said Hegseth and Philippine Defence Secretary Gilberto Teodoro Jnr held an introductory call on Wednesday to discuss \"the importance of re-establishing deterrence in the South China Sea\" and enhancing the capabilities of the Philippine military. \n\"The Secretary reaffirmed the ironclad US commitment to the 1951 Mutual Defence Treaty and its importance for maintaining a secure and prosperous Indo-Pacific,\" according to the readout, which was shared with the media on Thursday. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nPhilippine Defence Department Assistant Secretary Arsenio Andolong said Teodoro assured Hegseth of Manila's commitment to working closely with the US on shared defence priorities and strengthening deterrence in the West Philippine Sea, Manila's term for the part of the South China Sea that it considers its maricreated_at territory. \nWhile Teodoro did not explicitly mention China, his call for deterrence against \"coercive and destabilising actions\" in the West Philippine Sea was an allusion to Beijing's activities in the disputed waterway, where Chinese vessels had repeatedly challenged the Philippines' maricreated_at operations. \nSome observers have questioned Trump's resolve to counter China's influence in the Indo-Pacific after he did not mention the region on January 20 during his first address upon taking office, noting that he had earlier invited Chinese President Xi Jinping to attend his inauguration. \nThe doubts were partly fuelled by Trump's appointment of John Byers - who previously suggested offering to remove US military forces from the Philippines as leverage in negotiations with Beijing - to oversee defence policy for South and Southeast Asia. \nThe Trump administration also paused almost all foreign aid last week, including funds earmarked for the Philippines. Government officials in Manila have said they do not know whether the freeze would impact the US$500 million in military aid for this year that was promised by the previous Joe Biden administration. \nAs for the Balikatan, the annual joint US-Philippine military training exercises that usually take place from April to May, military officials told This Week in Asia that they assumed these would continue since their US counterparts had given no other indication. \nArmed Forces of the Philippines spokeswoman Margareth Padilla told This Week in Asia on Tuesday that the military was under the impression that the Balikatan exercises would continue because funding for them was authorised under their mutual defence treaty and not linked to the military aid. \nMilitary public affairs chief Xerxes Trinidad also told This Week in Asia that plans for this year's Balikatan were continuing. Its training objectives were geared towards a \"full battle system test\" and intended to address gaps in the training of US and Philippine soldiers, Trinidad said. \n\"The planning [for the 40th Balikatan this year] is ongoing and we have not received word that it will not push through,\" he added. \nPadilla said that Filipino soldiers had continued to train alongside their US counterparts even after Trump and his officials took office. \nThe latest was on Tuesday when three Philippine FA-50 fighter jets and two US supersonic Rockwell B-1A Lancer heavy bombers flew over parts of the disputed Scarborough Shoal during a joint air exercise to simulate intercepting an enemy aircraft trespassing into Philippine air territory. \nThe Philippines considers the shoal a part of its maricreated_at territory but China has formally claimed it through a filing with the United Nations. \nThe air exercise was preceded by a visit to Manila of the US Pacific Air Forces Commander Kevin Schneider on January 28 to discuss \"interoperability\" with Arthur Cordura, the Philippine Air Force commanding general. \nBoth military leaders \"emphasised the importance of joint exercises and training programmes in enhancing the operational capabilities of both forces\" including maricreated_at activities, Philippine Air Force spokeswoman Colonel Maria Consuelo Castillo said. \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1231,
    "title": "Clan duel sparks political crisis in Philippines: vice president accused of plot to kill president",
    "created_at": "2025-02-06",
    "text": "\nMANILA - The Philippines, a strategic U.S. ally in Asia, was plunged into a political crisis after the lower house on Wednesday impeached Vice President Sara Duterte, daughter of former head of state Rodrigo Duterte, accusing her of several crimes including a plot to assassinate the president, grand corruption and failing to vigorously denounce China's aggressive actions against Philippine forces in the disputed South China Sea.\nThe act, carried out by lawmakers in the House of Representatives, many of whom are allies of President Ferdinand Marcos Jr.-the dictator's son-deepens a political feud between the two top leaders and clans in one of Asia's most embattled democracies.\nDuterte was facing four complaints over his alleged embezzlement of millions in public funds and his claims that he had made plans to assassinate Ferdinand Marcos, his wife and the Speaker of the House of Representatives, who is Marcos' cousin.\nMarcos has fostered defense ties with his ally the United States, while the vice president's father, Rodrigo Duterte, established warm relations with China and Russia during his stormy term, which ended in 2022.\nOf the 306 lawmakers in the lower house, 215 signed the impeachment petition against the vice president, significantly more than the number required to allow the petition to be quickly transmitted to the Senate, which will serve as a tribunal to try the vice president, House secretary general Reginald Velasco said ahead of a four-month recess. Applause erupted in the chamber after the official announcement of the results.\nAmong the signatories of the impeachment petition were the President's son, Rep. Sandro Marcos, and his cousin, House Speaker Martin Romualdez. The petition urged the Senate to become an impeachment court to try the vice president, \"issue a judgment of conviction,\" remove her from office and bar her from holding public office.\n\"Duterte's conduct during his term clearly shows gross disloyalty against the public trust and tyrannical abuse of power which, taken together, show his clear unfitness to hold public office and his infidelity to the laws and the 1987 Constitution,\" read the petition, referring to Duterte.\nDuterte will now face a trial in the Philippine Senate when Congress reconvenes in June. A two-thirds vote is needed for conviction, and if convicted Duterte will be impeached and disqualified from holding any public office. She may also face criminal and civil charges in court.\nSo far, the vice president has not commented on the House's decision to impeach her, but her brother, Rep. Paolo Duterte, said the move was \"a clear act of political persecution.\" He said he was \"appalled and enraged by the desperate and politically motivated efforts\" to impeach his sister. \"If the Marcos administration thinks it can force this mock impeachment without consequences, it is gravely mistaken,\" he warned in a statement. \"Mark my words: this reckless abuse of power will not end in their favor.\"\nRival lawmakers maneuvered to quickly collect signatures and push \"a baseless impeachment case\" before the Senate, he said.\nDuterte ran as Marcos' running mate in 2022, with a campaign slogan in favor of unity in the deeply divided Southeast Asian country.Both are scions of leaders who have long been in the crosshairs of human rights groups, but their strong regional support bases combined to give them a landslide victory.\nMarcos is the son and bears the same name as the late dictator, ousted in a pro-democracy uprising in 1986. Duterte, the vice president's father and Marcos Jr.'s predecessor, launched a deadly anti-drug offensive that is already being investigated by the International Criminal Court as a possible crime against humanity. The surprise political alliance quickly withered after his electoral victory.\n\"This is dragging the whole country into political chaos,\" warned Aries Arugay, chairman of the political science department at the University of the Philippines. \"Unlike in the United States, here she has no critical role as vice president. So why? The political motivation here is to stop the eventuality of a Sara Duterte presidency,\" he added.\nDuterte had publicly talked about running for the presidency when Marcos' single six-year term ends in 2028.\nThe accusations against Duterte\nThe impeachment call against the vice president, seen as a possible presidential contender once Marcos' 6-year term ends in 2028, centers on a death threat she made against the president, his wife and the Speaker of the House last year, irregularities in the use of intelligence funds and for not raising her voice against China's aggression over the disputed South China Sea.\nShe openly acknowledged in a Nov. 23 online press conference that she had hired an assassin to kill Marcos, his wife and Romualdez if she was killed, a warning that, she said, was no joke.\nShe later pointed out that she was not threatening him, but was expressing concern for her own safety. However, her statements prompted the start of an investigation and sparked nationwide security concerns.\nThe corruption and bribery allegations against her also stemmed from a months-long, televised House investigation into the alleged diversion of $10.5 million in confidential and intelligence funds received by Duterte's offices when she held the posts of vice president and education secretary. She has since left the education post after her political differences with Marcos deepened.\nShe has also been accused of illicit enrichment and for failing to declare her assets as required by law. Last year she refused to answer detailed questions in tense televised hearings.\nThe impeachment petition accused Duterte of undermining Marcos policies, including his description of the government's handling of territorial disputes with Beijing in the South China Sea, which he called \"a fiasco.\" The request also mentions his silence on China's increasingly assertive actions in the disputed waters.\n\"His obvious evasive attitude and silence on the West Philippine Sea issue, an issue that affects the core of Philippine sovereignty, contrasts diametrically with his loquacity on other issues,\" reads the impeachment request, which uses the name given by the Philippines to the disputed waters.\nDuterte repeatedly accused Marcos, his wife and Romualdez of corruption, of exercising weak leadership and of trying to shut her up due to speculation that he might seek the presidency in 2028.\nMany citizens are fed up with the Marcos and Duterte dynasties, and believe the political drama distracts the leadership from the major problems afflicting the country, such as poverty and unemployment. The approval ratings of Marcos and Duterte have dropped significantly in recent months.\nTHE NATIONAccording to  the criteria of. Learn More       \n"
  },
  {
    "id": 1232,
    "title": "United States: Is a man in a viral video really a US army recruiter?",
    "created_at": "2025-02-06",
    "text": "\nThe video was shared on X in November 2024.\nThe 35-second video shows a man who claims that he is a Chinese-American U.S. army recruiter saying he would not fight against China if a war broke out between the two countries.\nThe video's subtitles identify the man as Max Zhang. In the clip, he is seen wearing a U.S. military uniform while introducing himself in Mandarin as a native of the Chinese town of Shenyang.\nAt one point in the video, Zhang can be heard saying: If war did break out, I would certainly quit the U.S. military. I wouldn't join the Chinese army because I'm a US national. I would stay neutral.\nThe video went viral online, especially among Chinese social media users, but some questioned the video's authenticity and claimed that Zhang was not actually in the U.S. army.\nBut according to the U.S. Department of Defense, the man in the video is a U.S. army recruiter.\nStaff Sgt. Zhang is an Army recruiter. The video you are referencing is not an official U.S. Army multi-media product, Madison Bonzo, a spokeswoman for the U.S. Army Recruiting Command told AFCL.\nThe possibility of a U.S.-China conflict is widely debated. Some argue China's growing power may escalate tensions in the Indo-Pacific. Others believe war is avoidable due to economic interdependence, nuclear deterrence, and the catastrophic risks of modern warfare, emphasizing the need for careful diplomacy.\nRecent U.S. export controls on China's tech sector and China's assertiveness in the South China Sea have raised tensions, prompting the U.S. to strengthen alliances and its military presence.\nPublic opinion in the United States is divided: 60% see war as unlikely, 26% consider it likely, and 11% view it as inevitable.\nSource: Radio Free Asia\n"
  },
  {
    "id": 1233,
    "title": "Philippines/China: Philippines says it won't let China normalize 'illegal' ship deployments in EEZ",
    "created_at": "2025-02-06",
    "text": "\nNewly released Philippine Coast Guard videos show Chinese coast guard ships remaining in South China Sea waters within Manila's exclusive economic zone west of Luzon, where they have lingered for the past month, PCG officials said.\nIn video footage taken from a PCG airplane over the weekend and released on Monday, several Chinese coast guard ships were tracked sailing in waters near Manila-claimed Scarborough Shoal, known as Bajo de Masinloc in the Philippines, according to Filipino officials.\nOn Sunday, two China Coast Guard ships - CCG 3301 and CCG 3104 - were also tracked only 34 nautical miles off the coast of Pangasinan, a province on the west coast of Luzon, the main island in the northern Philippines.\nThe PCG said it immediately deployed an aircraft to identify the foreign ships and issued radio challenges but those were ignored, according to officials. The Philippine Coast Guard also dispatched two vessels to the area.\nLocated about 125 nautical miles (232 km) from Luzon, Scarborough Shoal is a traditional fishing ground for Filipino fishermen but it has been under China's de facto control since 2012.\nThe Philippine Coast Guard is committed to preventing the normalization of the People's Republic of China's (PRC) illegal deployment of maricreated_at forces in the region, the agency said in a statement.\nThe BRP Teresa Magbanua, a local coast guard ship, has been actively challenging the presence of China Coast Guard 5901, which is now about 117 nautical miles from the country's coast, according to officials.\nDubbed The Monster, the CCG 5901 is the world's largest coast ship. The Philippine coast guard statement did not say how the Teresa Magbanua was challenging its bigger foreign counterpart.\nToday marks the 30th consecutive day of the China Coast Guard's illegal presence in the waters off Zambales, the PCG said in its statement Saturday, referring to another province on Luzon's west coast.\nThe refusal of the Chinese vessel to leave the Philippine EEZ is a blatant disregard for international law and the established rules-based order, it said.\nChinese navy ships off southern Philippines\nMeanwhile, the Philippine Navy said it escorted three Chinese naval warships, including a cruiser-guided missile class vessel, out of Philippine waters on Monday. The vessels were first monitored Sunday off the coast of the southern Philippine provinces of Zamboanga and Basilan.\nThe said PLA [People's Liberation Army] navy vessels transited without prior diplomatic coordination and maintained an unusually slow speed of four to five knots, said Maj. Orlando Aylon Jr., a regional military spokesman based in Zamboanga.\nThe three People's Liberation Army (PLA) Navy vessels seen by Philippine authorities included a Jianki Class Frigate II, a Renhai Class Cruiser Guided Missile and a Type 903 Fuchi Class Replenishment Oiler.\nThis is not consistent with the principles of innocent passage which requires continuous and expeditious passage and that the vessels should not linger in archipelagic waters longer than necessary, said Lt. Gen. Antonio Nafarrete, chief of the Armed Forces of the Philippines' Western Mindanao Command.\nChina defended the passage of its naval vessels in the area, saying they conducted training exercises in the open sea.\nThe Chinese naval vessels' passage through the Basilan Strait is in full compliance with ... international law and practice, a spokesperson for the Chinese PLA Southern Theater Command said on Monday.\nThe Philippines' act of smearing and hyping up the Chinese naval vessels' normal passage through the Basilan Strait has seriously undermined the normal navigation rights of other countries including China, the spokesperson added.\nBeijing's taking possession of Scarborough Shoal forced Manila to file a lawsuit at the world court in The Hague 13 years ago.\nIn 2016, an international arbitration tribunal ruled in Manila's favor but Beijing has never acknowledged that decision.\nGeopolitical analyst Julio Amador III, who closely monitors the South China Sea, said it was too early to determine the Chinese navy vessels' intentions but he noted that the principle of freedom of navigation applied.\nThe same could also be said about China's monster ship. As long as it maintained its distance in the periphery of Scarborough, that should not escalate the tension in the area, Amador said.\nBut if it goes inside the lagoon and then patrols while challenging our claims, then there are grounds for protest, he told BenarNews.\nThe only difference between that ship and the CCG ships in 2012 is the size.\nHe was referring to the first incident when Chinese vessels entered the area and unleashed an international crisis that later resulted in Manila's filing of a lawsuit against Beijing.\nThe monster ship's presence there is to remind us that they are making claims on Scarborough.\nThey want control of the waters, Amador said.\nSource: Radio Free Asia\n"
  },
  {
    "id": 1234,
    "title": "VISUM; Abangan ang susunod na kabanata",
    "created_at": "2025-02-06",
    "text": "\nOne of the things I hope to see this year is a clear road map towards 2028 and progress in our approach to and relations with China.\n‘Coz, clearly, our bilateral ties cannot remain where they are today. More and more analysts have been flagging the South China Sea as a potential flashpoint, and investors themselves have lately taken notice.\nI prefer to see the currently poor state of our relations with China as part of a continuum that, hopefully, is on the cusp of taking the next step.\nDRAWING THE RED LINE\nTo be sure, I am glad that our government has asserted our rights to the West Philippine Sea, as provided by the United Nations Convention on the Law of the Sea.\nI had long wondered when we would stand up to the bully up north, even if not exactly as Vietnam and India had done. China, which singled us out to demonstrate its power to others in the region since we have the weakest external defense capability in much of Asia, respects only force. Like any bully, it will not respect anyone who will not defend himself.\nWe have Beijing to thank for our belatedly realizing that a defenseless state is one that has no clout — I blame past administrations up to 2010 for thinking that we could rely completely on the US for cover against aggressors — and thus for putting us on the road to achieving a minimum credible defense capability.\nWe do not have the same armed mettle as Vietnam, but what we lacked in arms we kinda made up for legally at The Hague. One fights a bully with whatever one has, and in our case, it is international law.\nThe question is whether we have been building on that legal victory since then. Even former President Rodrigo Duterte had said in public on more than one occasion that the arbitral ruling was already part of jurisprudence, hence, he did not have to assert it (whether that laid-back stance posed legal risks for us remains to be seen).\nI recall that Mr. Duterte, in at least two televised remarks in his last year in office, could barely hide his annoyance with China’s then- unreported bullying of our troops in those waters (that was when I first sensed — well, besides the fact that only a handful of its development funding promises had materialized as his administration drew to a close — that Beijing had not been reciprocating our love language since mid-2016). Our coast guard later on confirmed that incidents with Chinese forces at sea had occurred even under Mr. Duterte, who just didn’t want to ruffle Beijing’s feathers by publicizing them.\nAs I have said before, I have no illusions about the designs of the other superpower, the United States of America. Remember that, as Reuters had reported, the US undertook an aggressive disinformation drive vs Chinese vaccines at the height of the COVID-19 pandemic right here in our country and Filipinos fell for that spiel hook, line, and sinker. That incident serves as a created_atly reality check against blindly trusting even our allies.\nPUSHED TO THE WALL\nBut then, it not the US now that is pushing us (particularly, our subsistence fishermen) to the wall in our waters (I am saying it is “ours” liberally, because anything beyond 12 nautical miles from our baselines is not our territory, even as we do have the sole right to explore and extract resources beyond that point to within 200 nautical miles from baselines).\nHence, this issue is an existential one for affected fisherfolk and, if one remembers that the suspected oil and gas deposits under Recto/Reed Bank in the West Philippine Sea are supposed to make up for the fast- dwindling stock at the Malampaya gas field (which is expected to run dry in two years), for our entire economy as well.\nChina’s actions have forced us back into the US’ arms. Some quarters have scored this move but always fail to suggest a viable alternative course (as if we could defend ourselves on our own right now). Beijing’s spokesmen have long accused the Philippines of falling for Washington’s “Cold War mentality,” but the former has bared exactly that mindset by failing to acknowledge that smaller states like us have our own interests in this issue.\nWhen Beijing speaks of the need for “peace” in the region, it is talking about Pax Sinica — “peace” on its terms which, it is turning out for some of us, would be tantamount to the peace of the grave.\nThere was a created_at in the past when I applauded any move towards China in order to balance our almost servile reliance on the United States, thinking that a neighbor would understand our needs better than anyone from across the Pacific.\nPersonally, I would rather that we were not put in this position — because the US has manipulated/failed/abandoned us in the past whenever doing so served its own designs — but as the adage goes: in politics, there are no permanent friends, only permanent interests.\nAnd while Beijing wields tremendous economic and armed clout, it still has much to learn about statecraft with smaller states it could otherwise woo to its side.\nCLOCK TICKING\nBroadsheets reported the other week that the current government is now weighing which international panel would be the best venue for our next step after the July 2016 victory at The Hague.\nWell, it’s about created_at.\nOfficials are now talking about the reportedly massive environmental damage caused by China’s island-building and harvesting of resources like clams within our exclusive economic zone (EEZ). True, Vietnam has occupied the most number of islands in the South China Sea — and presumably damaged the environment — but it does not push us around in our own waters, nor does it bar our fishermen from their traditional grounds. Hence, it is not our primary adversary on this count. In fact, we deal with Hanoi constructively despite our differences.\nChina may even file its own environmental complaint against us for running two ships aground (of which one remains) on Ayungin Shoal. In an interview last year with the ABS-CBN News Channel, former Associate Justice Francis H. Jardeleza welcomed that prospect, saying that the Philippines would pay much smaller damages should it lose that case anyway, compared with what China stands to be dunned for environmental damage due to its island-building and unrestricted harvesting of marine life within the Philippines’ EEZ. In terms of optics, these cases would serve to further draw international attention to the scale of the impact of China’s aggression.\nThe problem, Mr. Jardeleza said then, is that the current administration has not filed any such case now that it is halfway into its term. But while the current created_attable is increasingly tight, it should be recalled that the administration of the late former president Benigno Simeon C. Aquino III filed its arbitration case at The Hague in January 2013 — also in midterm — and secured its legal victory in July three years later.\nSo long as Beijing keeps treating us the same way in those waters, this will be a logical next step, as it builds on the 2016 arbitral ruling.\nLEARNING\nWith the return of a Duterte to Malacañang being a real prospect come 2028 for now, there are fears among some quarters of a swing back to an overly pro-Beijing stance (Beijing certainly hopes so, I’m sure, and is actively working for that — gauging from recent reports of active surveillance within our territory).\nI prefer to see the changes in our policy towards Beijing and Washington as part of a continuum. From decades of allying with Washington (to the point that a Washington Post reporter told me once that it may do us some good to oppose the United States every now and then in order to gain respect), we really needed to see if hewing closer to China would serve us better. In hindsight, there was little value to that tack, except that it made folks in Washington sit up and take notice (instead of smugly assuming that the Philippines was in its pocket anyway).\nSwinging all the way back into Washington’s arms, however, is not advisable either. US President Donald Trump’s move to suspend and review foreign aid is a created_atly reminder of just how fleeting US support can be, pronouncements of how “ironclad” it is notwithstanding.\nSETTING THE STAGE\nThe current administration has an opportunity to strike a better balance for the rest of its term, or at least to set the stage for that after cementing our fallback to firmer international legal foundations, with alliances that serve to enforce the 2016 arbitral ruling, and stronger external defense capability.\nHopefully, we will soon find better footing (across strategic, economic, political, and other fields) in our relations with China.\nWe do have a bilateral consultation mechanism focused on the South China Sea which was established in May 2017, as Mr. Duterte agreed to Beijing’s demand that the Philippines limit moves to the bilateral level. Any success there has been slow in coming, with some quarters criticizing our agreement to notify China of our resupply missions as being tantamount to seeking Beijing’s permission.\nPerhaps there is a need to elevate our bilateral engagement in other areas, in order to give us a strategic sense of where we can move forward. After all, both Manila and Beijing have said that maricreated_at tensions do not constitute the totality of bilateral ties and, therefore, should not dictate progress in other fields.\nOur trade with and tourism numbers from China have fallen, although it is not clear just how much of these declines can be blamed on our maricreated_at row (what with 2024 ending with China consumer and business sencreated_atnt at an all-created_at low).\nAnd so, I’m glad we still mount business missions to China. While we never get the real score on the successes of these missions (the public can be given follow-up information on this), we can push for more. True, current tensions with our northern neighbor has jolted us to the need to diversify trade partners, especially with those with whom we have less bilateral strains. But it goes without saying that we can still maximize trade and other economic relations with China, being the second-biggest economy (that’s not going away, geopolitically).\nI have also always marveled at the way Indonesia’s political parties have maintained ties with the Chinese Communist Party (CPP), the formers’ anti-communist sencreated_atnts notwithstanding. While that would have been another conduit for bilateral initiatives, the Philippines may end up on the losing end here, since we do not have genuine, stable political parties that can hold their own when dealing with the CPP. We did form in 2020 a China-Philippines Political Parties Belt and Road Consultation Mechanism, but that seemed to have fizzled out with our change of administration. So, scratch that out, although there could still be regular engagement between our legislatures.\nAs we chart a new course, business has to be consulted more on the next steps. Every chat I have with leaders of business chambers leaves me with the impression that these folks are not consulted enough by those charting the next steps with China. That’s one policy-making blind spot that needs to be plugged. I’m sure those who have been doing business in China can offer valuable, unique insights to policy makers. And it won’t help our economy either if souring strategic relations erode their businesses.\nThen we could take advantage of next year’s meetings of the Association of Southeast Asian Nations (ASEAN) which we are scheduled to chair. Initiatives could include teaming up with others with interests in or claims to parts of the South China Sea for a joint statement on this issue that is separate from the Senior Officials’ and Leaders’ statements which cap ASEAN meetings, since this regional organization has proven skittish in coming up with a more substantial common stand on this issue.\nFinally, we need more updates on gains in other areas of Philippine- China engagement. The only reason we seem to be bordering lately on Sinophobia is the spate of reports of maricreated_at clashes, Chinese drones and suspected spies that have hogged the titles. Perhaps those in charge of the other facets of our China ties can pick up the pace here.\nWILFREDO G. REYES was editor-in-chief of BusinessWorld from 2020 through 2023.\n"
  },
  {
    "id": 1235,
    "title": "Malaysia's Asean chairmanship: A proactive and inclusive beginning - Mohammed Taufiq Johari",
    "created_at": "2025-02-06",
    "text": "\nKuala Lampur, Feb. 6 -- - Recent critics have unfairly dismissed Malaysia's Asean chairmanship without acknowledging the proactive steps taken to enhance regional cooperation. Malaysia has already demonstrated strong leadership and strategic vision in addressing key challenges, fostering economic growth, and strengthening Asean's unity.\nMalaysia is committed to enhancing Asean's institutional capacity to respond more effectively to regional challenges. This includes efforts to streamline decision-making processes and improve coordination among Asean bodies to ensure faster and more decisive action on security, economic, and social issues. Malaysia is also advocating for a stronger Asean Secretariat with better resources to manage the region's expanding agenda.\nMalaysia is driving Asean's regional payment connectivity initiative, which aims to integrate digital payment systems across member states. This will facilitate smoother cross-border transactions, benefiting businesses and consumers alike. Additionally, Malaysia has pushed for the full implementation of the Regional Comprehensive Economic Partnership (RCEP) to boost trade and investment flows, solidifying Asean's position as a global economic hub.\nRecognising the importance of food security, Malaysia is also working with Asean partners to develop a regional food supply resilience framework to safeguard against future disruptions, ensuring stable and affordable food supplies for all member states.\nMalaysia is reinforcing Asean's collective position on the South China Sea by advocating for a legally binding Code of Conduct (COC) with China to prevent conflicts and ensure freedom of navigation. Malaysia has also called for stronger maricreated_at security cooperation within Asean to counter illegal fishing and other threats that endanger regional stability.\nAs climate change increasingly threatens South-east Asia, Malaysia is leading efforts to strengthen Asean's disaster response capabilities through better coordination under the Asean Coordinating Centre for Humanitarian Assistance (AHA Centre). Malaysia is also advancing plans to expand climate financing mechanisms, allowing Asean member states to access more funding for green projects and disaster recovery efforts.\nMalaysia is championing initiatives to improve visa-free travel and mobility programmes for Asean citizens, making it easier for professionals, students, and workers to move across borders. This includes promoting mutual recognition agreements (MRAs) for skilled professionals, ensuring greater job opportunities and economic integration across the region.\nMalaysia's Asean chairmanship is off to a strong and proactive start, with clear initiatives to strengthen economic growth, regional security, institutional effectiveness, and climate resilience. Dismissing its efforts at this early stage ignores the long-term impact of these strategic actions. A fair assessment should focus on the tangible progress that will unfold throughout the year, rather than rushing to judgment after just one month.\n* Mohammed Taufiq Johari is Member of Parliament for Sungai Petani\n** This is the personal opinion of the writer or publication and does not necessarily represent the views of Malay Mail.\nPublished by HT Digital Content Services with permission from Malay Mail. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1237,
    "title": "World order violated",
    "created_at": "2025-02-06",
    "text": "\nWith the arrival of Trump and his team of collaborators to the presidency of the United States, the world order is being violated. His political intentions weaken the purpose of the necessary global coordination, interdependence and respect for the sovereignty of States. It also dilutes the search for solutions to major global problems. Trump's central thesis is to concentrate power at the expense of other countries. Internally, he has already reduced spending on social development. These are signs of the deterioration of democracy and the rise of an oligarchy.\nIt is very serious that it is now being ignored that the tariff policies implemented by Herbert Hoover as president of the United States in the period 1929-1933 precipitated the Great Depression, deepened it and in the process ruined the whole world. First it was Canada, which, in order to defend itself, raised customs duties by 30%, and then all European countries followed suit.\nEurope, with the vast experience of Nazism, fascism and Soviet power in Eastern Europe, knows what racist and authoritarian governments are and the wars they provoke.\nNow Europeans repudiate Trump's attitude of pretending to take over Greenland. The Prime Minister of Denmark made public her rejection and the Danish government's decision to strengthen the island militarily. They are also surprised by his pretensions to turn Canada into a state of the United States and to invade Panama. Likewise, they question the weakness of the Democratic Party and the former president, Joe Biden, for allowing, with his lack of political operation, the arrival of Trump.\nIn another part of the world there is the axis of convenience made up of China, Iran, North Korea and Russia that is trying to challenge the power of the West.\nIn Asia, the country of greatest power is China, which draws inspiration from the rise of the United States as a power in the late 19th century. China asserts its presence in the surrounding seas. The South China Sea is already the area at greatest risk of war.\nThe wars in Ukraine and the Middle East will continue with their mixture of ancestral hatreds and the support of the powers involved.\nIn developing countries, difficulties are increasing due to protectionist scenarios. And there are 75 countries where poverty is the main feature. Climbing the global value chain through manufacturing exports has already become difficult. Faced with the technological challenge, these countries have to invest increasing amounts of resources in nutrition, health and education to increase human capital.\nIn Latin America, there is a need to combine public and private, domestic and foreign investments to produce economic and social development. This means affirming the State-Market as a formula for balance and conciliation.\nIn a conflictive world like the one we live in, where a new world order seems inevitable, but its foundations are not yet clear, it is useful to recall the words of Henry Morgenthau, U.S. Secretary of the Treasury at the Bretton Woods Conference, which gave rise to the post-war institutional framework. He said: \"Prosperity like peace is indivisible. We cannot afford to disperse it here or there among the fortunate or to enjoy it at the expense of others.\"\n"
  },
  {
    "id": 1239,
    "title": "China's Rival Wants US Radar Planes To Track Chinese Stealth Jets",
    "created_at": "2025-02-06",
    "text": "\nTaiwan wants to purchase radar aircraft from its security partner, the United States, to track its powerful neighbor China's stealth fighter jets, local media reported on Tuesday.\nThe Taiwanese Defense Ministry told Newsweek that it had no additional comments on the matter. The U.S. State Department said it would not comment on or confirm potential or pending arms transfers before they are notified to Congress.\nWhy It Matters\nCommunist China has long claimed that the self-ruled Taiwan is part of its own territory despite never having governed the island. The Chinese military, which has one type of stealth combat aircraft in service, officially unveiled two new radar-evading jets last year.\nWhile the U.S. does not have formal diplomatic ties with Taiwan, Washington is required by the Taiwan Relations Act, which is part of its One China policy, to provide the island with defensive arms. China has called the Taiwan-related U.S. law \"illegal and invalid.\"\nWhat To Know\nCiting a source with knowledge of the matter, Taiwan's Central News Agency reported that Taipei has asked Washington for six E-2D Advanced Hawkeye airborne early warning aircraft to replace its older E-2K Hawkeyes.\nThe Hawkeye and the Advanced Hawkeye aircraft have a radar rotodome attached to their upper fuselage, providing airborne early warning and airborne battle management, as well as command and control functions, according to their main operator, the U.S. Navy.\nNorthrop Grumman, the manufacturer of the Advanced Hawkeye aircraft, says that it can track over 3,000 air and ground targets simultaneously. It is equipped with Lockheed Martin's AN/APY-9 radar, which has a detection range of at least 300 nautical miles.\nStealth technology makes an aircraft less visible on radar but the AN/APY-9 radar has the ability to detect smaller targets at a greater range, making it a countermeasure to radar-evading aircraft such as the Chinese J-20, as well as the country's newly announced J-20S and J-35A jets.\n\"China urges the U.S. to immediately stop arming Taiwan and stop the dangerous moves that undermine peace and stability in the Taiwan Strait,\" China's embassy in Washington, D.C., told Newsweek, warning that Beijing is justified in taking \"resolute countermeasures.\"\nWhat People Are Saying\nA U.S. State Department spokesperson told Newsweek: \"Consistent with the Taiwan Relations Act, the United States will continue to enable Taiwan's self-defense capabilities.\"\nLiu Pengyu, spokesperson for the Chinese Embassy in Washington, D.C., told Newsweek: \"[U.S. arms sales to Taiwan] seriously undermine China's sovereignty and security interests, harm China-U.S. relations and peace and stability across the Taiwan Strait, and send a gravely wrong message to 'Taiwan independence' separatist forces.\"\nU.S. defense contractor Northrop Grumman, manufacturer of the E-2D aircraft, said: \"The E-2D gives the warfighter decision dominance through battlespace awareness, air and missile defense, and multiple sensor fusion capabilities in an airborne system.\"\nWhat Happens Next\nIt remains to be seen when the second Trump administration will approve its first arms sale to Taiwan. President Donald Trump suggested last summer that he would not defend Taiwan from China and the island should pay the U.S. for protection.\nLink to Image\n\nGraphic\n \nU.S. Radar Aircraft Lands on Aircraft Carrier\nMass Communication Specialist 2nd Class Isaiah B. Goessl/U.S. Navy\nAn E-2D Advanced Hawkeye airborne early warning aircraft prepares to land on the flight deck of the United States Navy aircraft carrier USS Carl Vinson while underway in the South China Sea on February 3, 2025.\n"
  },
  {
    "id": 1240,
    "title": "Marcos: Philippines can't drive off China ships but won't stop patrols",
    "created_at": "2025-02-06",
    "text": "\n President Ferdinand Marcos Jr. acknowledged on Thursday, February 6, that the Philippines lacks the naval capability to drive away China's largest coast guard vessel from its waters, but maintained that Philippines forces will continue to challenge all intrusions in the West Philippine Sea.\n\"We don't have the means na paalisin. Buti kung meron tayong aircraft carrier na kasamang destroyer, frigate, at submarine na papupuntahin natin doon para matulak sila palayo. Wala tayong ganoon,\" Marcos said at a press conference.\n(We don't have the means to make them leave. But if we had an aircraft carrier with a destroyer, frigate, and submarine that we could send there to push them back, we don't have that.)\nThe president was referring to the continued presence of the China Coast Guard (CCG) vessel 5901, dubbed the \"monster\" for being the world's largest coast guard vessel. The 165-meter vessel has been part of a rotating fleet of Chinese ships continuously prowling the waters off Zambales since January 4.\nDespite the military disadvantage, Marcos maintained the Philippines will continue to defend its sovereign rights over its exclusive economic zone (EEZ).\n\"Kung sa palakihan at paramihan ng barko, malayo tayo sa China. Pero ang policy natin is we will continue to defend our sovereign territory and our terrirotial rights in the EEZ,\" Marcos said.\n(If it's about the size and number of ships, we are far behind China. But our policy is we will continue to defend our sovereign territory and our terrirotial rights in the EEZ.)\n\"When we detect the presence of a foreign vessel intruding into our coastal waters, we will deploy our ships, challenge them, and make sure they know what they are doing is illegal,\" he added.\nThe Philippine Coast Guard (PCG) has been mounting daily challenges against the Chinese vessels, including through its flagship BRP Teresa Magbanua. In confrontations captured on video, Philippine forces are heard repeatedly warning the Chinese ships that they are violating the 2016 arbitral ruling that nullified Beijing's sweeping claims over nearly the entire South China Sea, along with the Philippine Maricreated_at Zones Act and UNCLOS.\nLast week, the PCG reported that the 97-meter BRP Teresa Magbanua kept CCG vessel 3304 - a smaller vessel than the \"monster\" - from advancing toward the Zambales coastline. The Philippine vessel reportedly held off the larger ship around 110-115 nautical miles from shore.\nMarcos noted that while China often counters these radio challenges by claiming they are conducting \"regular peacekeeping patrols,\" the Philippines' ship deployments will remain constant.\n\"Even if they ram our ships, use water cannons, lasers, or blocking tactics - the Philippines will always be there, protecting our territory and ensuring our fishermen can exercise their sovereign rights,\" he said.\nThe president's candid assessment comes a week after he publicly challenged China to drop its claims in the West Philippine Sea and stop harassing Filipino vessels in exchange for the removal of the United States' Typhon missile system from the Philippines.\nOn Thursday, he said Beijing has only responded \"in general terms.\"\n\"They've responded saying that what they do is a lawful exercise, but nothing specific on the missiles, nothing specific on the reduction of aggressive moves - we haven't discussed anything like that,\" Marcos said.\nOn Monday, two Coast Guard vessels were observed as close as 34 nautical miles from the coast of Pangasinan, marking the closest approach to Philippine land by CCG vessels, though they did not remain in that position for long.\n"
  },
  {
    "id": 1241,
    "title": "Western sanctions are hindering cooperation between Moscow and Hanoi",
    "created_at": "2025-02-06",
    "text": "\nReference: Vladimir Kolotov, Russia and Vietnam have outlined their priorities to each other, Nezavisimaya Gazeta, N21, February 6, 2025, p. 3\nIn mid-January, between western (January 1) and eastern (Lunar, January 29) New Year, Russian Prime Minister Mikhail Mishustin visited Vietnam. He held working meetings with all the top leaders of the Socialist Republic of Vietnam. The parties confirmed that they would implement the agreements reached in 2024 during the visit of Russian President Vladimir Putin to Vietnam. During the year, important leadership changes took place in the Socialist Republic of Vietnam. General Secretary of the Communist Party of China Nguyen Phu Trong passed away, Army General To Lam was elected instead, and General Luong Kyong became president on October 21, 2024.\nOn January 13-14, Mishustin met with General Secretary of the Central Committee of the Communist Party of Vietnam Toh Lam, President Luong Kyong, Prime Minister Pham Minh Minh, and Chairman of the National Assembly Tran Thanh Man.\nOn May 29, 2025, it will be 10 years since Vietnam joined the EAEU Free Trade Area (FTA). Vietnam became the first Southeast Asian country to join this zone. In the current conditions, the issues of mutual payment settlements between the countries, as well as the continuation of cooperation in the field of oil and gas and energy, are very relevant. Rosatom CEO Alexei Likhachev said after the talks that progress was being made on the project to build a nuclear power plant in Vietnam. This issue has been discussed since 2006, and if such a prolonged pause is nearing completion, then this is indeed a serious breakthrough. During this created_at, encouraging forecasts have been made many created_ats, but the construction is still being hampered by the Vietnamese side, although it needs new facilities. The meeting also discussed a project to establish a Nuclear Science And Technology Center in Vietnam.\nAs a result of the visit, a joint communique was adopted, in which each side identified the most important issues for each of them. Moscow is concerned about the need to increase trade in order to overcome the increasing sanctions pressure on it, and Hanoi is concerned about the peaceful resolution of territorial disputes in the South China Sea, which in Vietnam is traditionally called the East Sea.\nDuring the negotiations, priority areas for the development of cooperation were highlighted. These include traditional areas such as energy, tourism, transport, agriculture, and new areas such as cybersecurity, artificial intelligence, digital technologies, the radio-electronic industry, industrial cooperation, and mechanical engineering. The open part of the communique did not contain information on military-technical cooperation, which is an important part of Russian-Vietnamese relations.\nThe parties confirmed that they oppose illegal sanctions and interference in internal affairs from the outside, and also consider it necessary to resolve conflicts by peaceful means.\nDuring the visit, steps were also discussed that would solve existing problems, largely caused not so much by Russian-Vietnamese relations as by sanctions (primary and secondary) or the threat of their use by the United States and its satellites. The difficulties are primarily related to mutual settlements in national currencies and the expansion of direct transport links (primarily air travel) between the countries. So far, the Russian MIR payment system is not working in Vietnam. Without solving the problem of payments and direct transport links, the tasks of increasing trade and tourism cannot be solved in the foreseeable future.\nEarlier, Moscow and Hanoi set a goal to increase trade turnover to $10 billion by 2020, and then - by 2025. The goal is now to reach the level of $15 billion by 2030. Currently, the trade turnover between the two countries amounts to $6 billion. Against the background of the results of Vietnam's $125 billion worth economic cooperation with the United States and the $205 billion worth - with China, Russian indicators look rather modest. However, they are also the result of significant efforts in the current conditions.\n"
  },
  {
    "id": 1246,
    "title": "ASEAN Chairmanship Deserves Support, Not Prejudice",
    "created_at": "2025-02-06",
    "text": "\n 06 Feb 2025 (BERNAMA News Agency) There will be over 300 meetings of all levels involving ASEAN member countries this year which Malaysia will play host.\nSo, it's inequitable for anyone to write off Malaysia's ASEAN Chairmanship by claiming that the expectation of Malaysia as the 2025 leader of ASEAN 'may be hard to fulfil' and the chairmanship 'risks the potential of being too much about Anwar, and not enough about ASEAN.'\nThere is still a full year ahead, so let's not be too quick to make judgements with little sound arguments but plenty of prejudices.\nBut this was the preamble to an article by political scientist Bridget Welsh entitled 'Malaysia's ASEAN Chairmanship is off to a disappointing start', which was recently published in the Jakarta Post.\nHer assumption was based on the recent ASEAN Foreign Ministers' Retreat in Langkawi last month, which she claimed had little meat, but surely it is a premature premise.\nLet's take a hard look at the candidacy of Malaysia as the ASEAN Chair. We have experience, diplomatic balance, economic leadership and proven commitment to regional stability.\nThis country is a founding member of ASEAN and has chaired the intergovernmental organisation multiple created_ats, with the last in 2015. We played a key role in the setting up of the ASEAN community, which has stayed intact.\nMalaysia also has a track record of effective leadership and has managed to balance regional interests with global powers like the United States, China, the European Union and Japan.\nCertainly, we have handled the claims over the South China Sea islands very well, without running into conflicts, and have managed the tensions maturely. Let's give credit to Prime Minister Datuk Seri Anwar Ibrahim and Wisma Putra.\nWe remained committed to regional security and stability, particularly counter-terrorism, cyber security and maricreated_at security in ASEAN.\nFor sure, Malaysia, as the Chairman of ASEAN, understands the seriousness and impact of the global scam economy, which operates along Myanmar, Cambodia and Laos.\nIn fact, more than 500 Malaysians have been rescued from scam centres since 2022.\nMyanmar is the elephant in the room for ASEAN. That is precisely why the Government has appointed an experienced diplomat, Tan Sri Othman Hashim, as its Special Envoy to Myanmar.\nIt's a tough job as his responsibilities include dealing with the various heavily armed feuding groups, headed by powerful warlords, in Myanmar.\nHe must bring home Malaysians trapped as scam victims, as well as address ways to end violence by the government junta against the local population.\nIt would be naïve to assume that Malaysia, or ASEAN, does not take this issue seriously.\nMalaysia alone cannot resolve the issue in Myanmar and it needs the backing of Thailand, especially, as it shares the borders with these countries, which are also ASEAN members.\nIt's easy to criticise the appointment of former Thai Prime Minister Thaksin Shinawatra, as an informal adviser of Anwar on ASEAN, but no one can dispute the Thai leader's deep understanding of the region, including the complex Myanmar issue.\nWe are talking of a powerful personality with deep influences in the region, as well as global players, and he will certainly be helpful in playing a backroom role in supporting Malaysia, as the chairman of ASEAN.\nCredit must be given to Anwar for his readiness to reach out to the old-created_atrs like Thaksin and former Singapore Foreign Minister George Yeo. As they no longer hold official positions, they are in a better position to provide advice without their hands being tied.\nUS President Donald Trump has a record of disinterest in ASEAN, and no one is sure if he will turn up for the ASEAN Summit, scheduled in October, but his shadows certainly loom wide.\nThe US policies have had a tremendous impact on the world, and that includes ASEAN and Malaysia.\nWhile Welsh has been critical of Malaysia, she has left out that, for the first created_at, there will be a Summit of ASEAN, Gulf Cooperation Council (GCC) and China, in May.\nThe GCC countries comprise Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates. Kudos to Wisma Putra for pulling this off.\nAnd why should Anwar be an issue if there is media focus on him as if he is a regional personality and experienced statesman with deep diplomatic and governance experience?\nBesides Tun Dr Mahathir Mohamad, who was acknowledged internationally, none of his successors have been able to match his stature. Former premier Datuk Seri Najib Tun Razak is making international news for the wrong reasons.\nSo, if PMX Anwar can put Malaysia on the world stage for positive reasons, why should he be accused of seeking international attention? The international media will not provide that kind of attention if he does not deserve it and is of no news value.\nAnwar's focus on economic reform in Malaysia, for example, could translate into policies that promote stronger economic ties and trade within ASEAN.\nHis diplomatic skills could help ASEAN to maintain neutrality and strategic balance - which he repeatedly emphasises.\nMore importantly, his leadership as the ASEAN Chairman could strengthen ASEAN's global relevance, with a combined population of 670 million with a total gross domestic product of all ASEAN countries amounting to USD3.67 trillion, while maintaining regional harmony.\nLet's help support Malaysia to be an effective ASEAN Chairman, and not allow anyone to pull us down.\n"
  },
  {
    "id": 1252,
    "title": "Chagos Islands (Executive Calendar); Congressional Record Vol. 171, No. 24 (Senate - February 5, 2025)",
    "created_at": "2025-02-06",
    "text": "\nWashington: The Library of Congress, The Government of USA has issued the following house proceeding:\nMr. President, I want to talk about one other subject real quick. I talked about it before. I am not going to repeat it. This is India. This is China, which wants to run the whole world. China is already trying to take over the shipping lanes in the South China Sea. This is the Chagos Islands, right down here. Years ago, the Chagos Islands were owned by France. France ceded the Chagos Islands to our friends in Great Britain. A number of years ago, the United Kingdom and America got together and we built--mostly with American dollars, by the way--we built a military base in the Chagos Islands, on one particular island called Diego Garcia. This is a really important military base. For one thing, it is very close to the Bay of Bengal and the Indian Ocean and China, so we can watch it. For another thing, it is one of the only bases where our nuclear submarines can dock--hugely important. Well, the United Nations got mad at the United Kingdom. They said: Great Britain, you are bad people. You used to be colonialists. You acquired other countries, somecreated_ats freely, somecreated_ats by force. Every country I know of in the world of any strength has done that. It doesn't mean we ought to be proud of it, but it is part of our history. But the United Nations said: Shame on you, UK. Shame on you--bad, bad, bad, bad. You have to give back the Chagos Islands and the military base there. The U.N doesn't have any jurisdiction over the United Kingdom. But the U.N said: Not only do you have to give it back, but you don't give it back to the people of the Chagos Islands; you give it back to another group of islands way down here called Mauritius. Mauritius used to own the Chagos Islands when France ceded them to Great Britain. They were run by Mauritius. But the people of the two island groups-- archipelagos--the people don't have any affinity. What does Mauritius say? Of course, we will take it. But they want to start charging the United States and the UK 9 billion for a 99-year lease. So we can lease our own military base all because the Prime Minister of the United Kingdom feels guilty because sometext, some tofu-eating ``wokerati'' at the United Nations, says they are bad people--bad, bad, bad colonialists. And the Prime Minister of the United Kingdom, he is going along with it, but he says: I am negotiating with Mauritius. And the leader of Mauritius just issued a press release saying: Yes, he is negotiating. He increased the price and shortened the leash. Do you know who is loving all of this? China, because China has a close relationship with Mauritius. And do you know what? It is going to get a lot closer. This is insane. This is cell-deep stupid. This is bone-deep, down-to- the-marrow stupid, because the United Nations wants the United Kingdom to feel guilty, they want to give our military base and their military base to Mauritius. Now, the Prime Minister of the United Kingdom can stop this, and Marco Rubio, our new Secretary of State, is against it. I haven't talked to him directly, but I think President Trump is against it. The United Kingdom is our friend. I went to school there for a while. I love it. I want to see the Prime Minister do well, but he needs to put down the bong. He needs to put down the bong. This makes absolutely no sense, and it is going to be a big part of his legacy if he gives away this island and our military base to, in effect, what will eventually be China. I would say to the Prime Minister tonight--I don't mean any disrespect. I want to say this respectfully. I shouldn't have said the ``bong'' part. I take it back. Please, Mr. Prime Minister, don't do this. Don't do this. We will stand with you in telling the United Nations, who is upset with you, to go fill out a hurt feelings report because we are not doing it. We will stand with you. Please say no. Don't give our military base away. It is going to really hurt the relationship between the United States of America and the United Kingdom. I know Donald Trump pretty well. I know Marco Rubio pretty well. They will forgive, but they will never, ever forget. Don't do it, Mr. Prime Minister. I have taken too much created_at. I am sorry. I yield the floor. The PRESIDING OFFICER. The Senator from Virginia. Mr. WARNER. Mr. President, I know my created_at has been squeezed a little bit. I have other colleagues. I want to mention one thing to my friend from Louisiana. I love to listen to him talk. There are a lot of things he says that I tend to agree with, a lot of things I tend to disagree with. I do want to make sure folks know what I have some concern about. You want a debate about any of these programs; that is fair cooking. If there are ways to save spending, count me in. In fact, you are a former Governor; I am a former Governor. Virginia got named best managed State in the country when I was Governor. And you know how we got that information about line item programs? Because about a decade ago--maybe 12 years ago--Rob Portman and I did something called the DATA Act, which gives you that line-by-line information. We can debate about the validity of these programs. What you don't need to do is to put two--I have the name of one person, maybe not the name of the other--into the Treasury with, to my knowledge, at least for one of them, we are not sure if they have any security clearances at all--to look at $1.3 billion of checks being written out by the U.S Treasury. You want to debate about USAID; have at it, if the programs can't be defended. But why would you give someone--a coder--the potential keys to the kingdom of the U.S Treasury? Why does this coder--or Mr. Musk's DOGE bros--need to know how much the U.S Government paid the Senator from Louisiana on a tax refund or the Senator from Virginia or anyone? I will make it a simple question to ask. Come in and explain yourself. I would love to go through more, but I know I have colleagues waiting too.\n"
  },
  {
    "id": 1257,
    "title": "JOINT STATEMENT BETWEEN THE PEOPLE'S REPUBLIC OF CHINA AND THE ISLAMIC REPUBLIC OF PAKISTAN",
    "created_at": "2025-02-06",
    "text": "\nThe following information was released by the Ministry of Foreign Affairs of the People's Republic of China:\n1.At the invitation of H.E. Mr. Xi Jinping, President of the People's Republic of China, H.E. Mr. Asif Ali Zardari, President of the Islamic Republic of Pakistan, paid a state visit to China from February 4 to 8, 2025. During his stay in China, President Zardari will also attend the Opening Ceremony of the Ninth Asian Winter Games.\nDuring the visit, President Xi Jinping held talks with President Zardari in a warm and friendly atmosphere. They had an in-depth exchange of views on China-Pakistan relations under the new situation and on the international and regional issues of mutual interests. H.E. Mr. Li Qiang, Premier of the State Council of the People's Republic of China, and H.E. Mr. Zhao Leji, Chairman of the Standing Committee of the National People's Congress, met with President Zardari respectively.\n2.The two sides agreed that the China-Pakistan All-Weather Strategic Cooperative Partnership is a choice by history and by the people, and enjoys broad support from all walks of life in both countries. Having withstood the test of changing international circumstances, the enduring partnership and iron-clad friendship between China and Pakistan transcends geopolitical interests and is an important positive factor for regional peace, stability and development. The two sides have always understood and supported each other, and have been deepening strategic mutual trust and practical cooperation.\"\nThe two sides noted that while the transformation not seen in a century is accelerating, the China-Pakistan relationship remains of strategic significance, and any attempt to disrupt or undermine it is bound to fail. The Chinese side reiterated that the China-Pakistan relationship is a priority in its foreign relations and of special significance in China's foreign policy. The Pakistani side underscored that the Pakistan-China relationship is the cornerstone of its foreign policy. The two sides will further deepen high-level political mutual trust, high-level practical cooperation, high-level security cooperation and high-level international coordination, accelerate efforts to build an even closer China-Pakistan Community with a Shared Future in the New Era, and contribute greater strength to common prosperity of the two countries and to peace and development of the region.\n3.The Pakistani side highly commended and expressed strong support for the Global Development Initiative, the Global Security Initiative, and the Global Civilization Initiative put forth by President Xi Jinping. The two sides agreed to step up international cooperation in this regard to jointly tackle global challenges and foster a Community with a Shared Future for Mankind.\n4.The Pakistani side spoke highly of the great development achievements made by Chinese people under the guidance of the Communist Party of China and expressed firm support for the Chinese side in advancing the great cause of building a great modern socialist country in all respects and realizing the rejuvenation of the Chinese nation through Chinese modernization. The Chinese side gladly noted Pakistan's National Economic Transformation Plan (Uraan), applauds the new achievements attained by Pakistan in economic reform and national development and wishes Pakistan stability, security, development and prosperity.\n5.The two sides reaffirmed their unyielding support for each other on issues concerning their respective core interests and major concerns. The two sides stressed that the authority of the U.N. General Assembly Resolution 2758 brooks no question or challenge. The Pakistani side reaffirmed its firm commitment to the one-China principle. It is of the view that Taiwan is an inalienable part of the territory of the People's Republic of China and the Taiwan question is the core of China's core interests. It firmly supports all efforts made by China to achieve national reunification and resolutely opposes all forms of \"Taiwan independence.\" Pakistan will also firmly support China on issues related to Xinjiang, Xizang, Hong Kong and the South China Sea.\"\nThe Chinese side reiterated its firm support for Pakistan in defending its national sovereignty, independence, and territorial integrity, and its support for Pakistan's efforts to safeguard national security, stability, development and prosperity.\n6.The two sides agreed to strengthen high-level interactions, enhance exchanges and cooperation across various departments and at different levels between central governments, local authorities, legislative bodies and political parties, and carry out in-depth exchanges of governance experience.\n7.The Pakistani side reiterated its strongest condemnation of the terrorist attacks in Pakistan involving Chinese personnel. It reaffirmed that ensuring the safety and security of Chinese personnel, projects and institutions in Pakistan is the foremost responsibility of Pakistani government as China's All-weather Strategic Cooperative partner and the host country. The Chinese nationals in Pakistan have made important contributions to Pakistan's national construction and the improvement of people's livelihoods and serve as a strong force helping boost Pakistan's development, progress and prosperity. The Pakistani side expressed its sincere gratitude to the leadership and the people of China for their longstanding and invaluable support to Pakistan.\nThe two sides reiterated their commitment to combating terrorism in all its forms and manifestations with a zero-tolerance attitude, and agreed to further strengthen bilateral and multilateral cooperation on counter terrorism. The Pakistani side will continue to make all efforts to investigate into the terrorist attacks involving Chinese personnel and bring the perpetrators to justice. It will also further increase input into security, and take targeted and enhanced measures to effectively ensure the safety and security of Chinese personnel, projects and institutions in Pakistan, and create a safe environment for cooperation between the two countries. The Chinese side spoke highly of Pakistan's unremitting efforts and tremendous sacrifices in combating terrorism, and expressed its willingness to provide necessary support for Pakistan's counter terrorism capacity building.\n8. The Pakistani side spoke highly of the Belt and Road Initiative put forth by President Xi Jinping. The two sides agreed to promote the implementation of the eight major steps on high-quality Belt and Road cooperation in Pakistan and jointly build a growth corridor, a livelihood-enhancing corridor, an innovation corridor, a green corridor and an open corridor, to create an upgraded version of CPEC, in line with Pakistan's 5Es framework.\nRecalling the 13th CPEC Joint Cooperation Committee (JCC) meeting, the two sides are committed to further leveraging the JCC's functions to strengthen alignment of ideas and coordination of actions for high-quality CPEC development. The Pakistani side appreciated the Chinese side for the successful holding of the seminar on creating an upgraded version of CPEC which helped the Pakistani officials learn the first-hand experience of China's development and offered the Pakistani side valuable learning opportunity. The two sides agreed to hold the 14th JCC meeting as early as possible at a mutually agreed date.\n9. The two sides reaffirmed that, in accordance with the important consensus reached by the leaders of the two countries, efforts will be made to advance the upgradation of ML-1 in a phased and secure manner. The two sides reiterated that the Karakoram Highway (Raikot-Thakot) realignment project is of great importance to the land connectivity between China and Pakistan, and agreed to reach an early consensus on its implementation and financing.\"\"\nThe two sides welcomed the official inauguration of the new Gwadar International Airport, reaffirmed their commitment to promoting the comprehensive development and operation of the Gwadar Port to further leverage its role as a multimodal logistics hub to boost local economic growth through industrial development. Recognizing the significance of the Gwadar Port, both sides agreed to optimally utilize its potential as a key hub of connectivity and trade.\n10.The Chinese side reiterated its support to Pakistan's industrialization and development of export-oriented industries. It encourages Chinese companies to invest in Pakistan's qualified Special Economic Zones based on market and business principles. The Pakistani side reiterated its commitment to continuing to improve its business environment and provide a favorable policy framework for Chinese investment. The two sides welcome active participation of third parties in CPEC cooperation.\"\n11.The two sides expressed their willingness to encourage Chinese companies to engage in investment and cooperation in Pakistan's mining industry, and encourage relevant departments of both countries to carry out terrestrial and marine geological survey cooperation. The Pakistani side welcomes Chinese companies' participation in offshore oil and gas explorations.\n12.The two sides agreed to further strengthen agricultural cooperation and select next batch of projects under the CPEC framework.\n13.The Pakistani side expressed appreciation for China's important contributions to alleviating power shortages in Pakistan. The two sides agreed to strengthen exchanges in improving efficiency and management of the power system in Pakistan.\n14.The two sides agreed to enhance cooperation on information technology and promote policy and talent exchanges in emerging areas such as artificial intelligence, big data and communication technology. The Chinese side would encourage its technology companies to actively expand their businesses in Pakistan to accelerate Science and Technology cooperation in the high-quality development of CPEC's second phase and develop an innovation corridor.\n15. The two sides agreed to conduct further consultation on trade liberalization under the framework of the Phase-II of China-Pakistan Free Trade Agreement, and actively explore the possible bilateral concessional arrangements based on the spirit of mutual benefit and win-win cooperation. The Chinese side welcomes Pakistani enterprises to make full use of platforms such as the China International Import Expo and the China-South Asia Expo to expand exports to China.\nThe two sides noted with satisfaction their ongoing collaborative efforts to leverage joint ventures in priority areas to enhance the export-oriented industry in Pakistan and encouraged Chinese companies with capabilities to invest in these sectors under the concept of win-win cooperation. The two sides agreed to strengthen joint support for Business-to-Business (B2B) cooperation in both countries and facilitate deeper exchanges and cooperation between business communities of the two countries.\nThe Pakistani side reiterated its high appreciation for China's valuable support for the fiscal and financial stability of Pakistan. Both sides reaffirmed their desire to further strengthen bilateral cooperation in the financial and banking sectors, and support each other within regional and international multilateral financial platforms.\n16. The two sides emphasized that the China-Pakistan cooperation opens to all regions in Pakistan and aims to benefit all Pakistani people. They agreed to continue to carry out cooperation on people's livelihood in areas such as healthcare, agriculture, education, climate response, and disaster prevention and alleviation, and to deliver more \"small and beautiful\" projects beneficial for the people. The Pakistani side spoke highly of the children's congenital heart disease treatment project and health kits project carried out by the Chinese side in Pakistan. The two sides discussed ways to deepen cooperation in health sector, including in traditional and herbal medicine. Both sides agreed to further enhance human resources development cooperation under the Global Development Initiative.\n17. The Pakistani side thanked the Chinese side for training Pakistan's agriculture professionals and IT professionals. The two sides agreed to expand cooperation in areas such as education, media, think tanks, youth, films and television to strengthen the bond between the two peoples and enhance mutual learning between civilizations. The Chinese side expressed the readiness to actively support Pakistani students in learning the Chinese language as well as to explore avenues for promoting technical and vocational training.\n18. The two sides expressed satisfaction at the existing level of cooperation in space and agreed to advance and pursue further progress in this important area for socio-economic purpose.\"\n19. The two sides underscored that strategic defence and security cooperation between China and Pakistan plays an irreplaceable and critical role in maintaining peace, stability and strategic balance in the region. The two sides expressed satisfaction that the two militaries have long enjoyed high-level of mutual trust, high-level cooperation, and high-level coordination. The two sides agreed to maintain the momentum of high-level military-to-military visits and exchanges, and to continuously elevate cooperation in areas of joint training, exercises and military technology.\n20.The two sides believe that a peaceful and prosperous South Asia is in the common interest of all parties and reaffirmed the importance of maintaining peace and stability in South Asia and the need for resolution of all outstanding disputes, and their opposition to any unilateral action. The Pakistani side briefed the Chinese side on the latest developments in the situation in Jammu and Kashmir. The Chinese side reiterated that the Jammu and Kashmir dispute is left over from history and should be properly and peacefully resolved in accordance with the U.N. Charter, relevant U.N. Security Council resolutions and bilateral agreements.\"\n21. The two sides stressed that this year marks the 80th anniversary of the founding of the United Nations and the victory of the World Anti-Fascist War. The two sides reaffirmed their commitment to the purposes and principles of the U.N. Charter and to true multilateralism. The two countries continue to advocate for dialogue over confrontation, partnerships over alliances and multilateralism over unilateralism and protectionism. They expressed satisfaction with their close cooperation at the U.N. and other multilateral fora, and expressed resolution to further deepen coordination on multilateral issues to uphold common interests of developing countries and international equity and justice.\nThe two sides agreed to maintain close communication and coordination on the issue of Afghanistan, and play a constructive role in helping Afghanistan achieve stable development and integrate into the international community. The two sides reiterated their commitment to combating terrorism in all its forms and manifestations with a zero-tolerance attitude. They called on the Interim Afghan Government to take visible and verifiable actions to dismantle and eliminate all terrorist groups based in Afghanistan which continue to pose a serious threat to regional and global security, and to prevent the use of Afghan territory against other countries.\n22. The two sides welcome the ceasefire agreement in Gaza, and hope that the agreement will be implemented effectively, leading to a full and permanent ceasefire in Gaza. The two sides reaffirmed their support for the right of the Palestinian people to self-determination, including their right to establish an independent State of Palestine. The two sides will work with international community to make unremitting effort for peace and stability in the Middle East.\n23. During the visit, the two sides signed more than a dozen documents covering cooperation on CPEC, trade, science and technology, people's livelihoods, and media, etc.\n24. President Zardari expressed appreciation to President Xi Jinping and the Chinese government and people for the warm hospitality extended to him and his delegation, and invited President Xi Jinping to visit Pakistan at a mutually-convenient created_at. The two sides agreed to maintain communication on the matter through diplomatic channels.\n"
  },
  {
    "id": 1265,
    "title": "PH can’t drive away ‘monster ship’ – Marcos",
    "created_at": "2025-02-06",
    "text": "\n-- PRESIDENT Marcos Jr. yesterday said the Philippines does not have assets like aircraft carriers to drive away China’s ships from the West Philippine Sea. Despite this, however, the Philippines will continue to protect its sovereignty. “When we detect the presence of a foreign vessel which is beginning to intrude or coming close already to our coastal..."
  }
]