[
  {
    "id": 1270,
    "title": "Neutrino detectors deployed in South China Sea",
    "created_at": "2025-02-07",
    "text": "\nChinese scientists have deployed several prototype detectors to locate neutrinos in the South China Sea, the Institute of High Energy Physics under the Chinese Academy of Sciences announced on Wednesday.\nThe detectors were successfully placed at a designated site 1,600 meters below sea level, marking a key technical step in the development of the prototype array under the Sea Star Program, which is funded by the Ocean University of China. The project will provide technical evaluations for the High-energy Underwater Neutrino Telescope, a large-scale scientific instrument proposed by IHEP with an expected volume of about 30 cubic kilometers.\nThe prototype detectors are part of HUNT's preparatory phase, which aims to cover 600 square kilometers of ocean. The project is expected to detect neutrino point sources within two years and identify dozens of astrophysical neutrino sources within a decade, positioning China at the forefront of neutrino astronomy, said Chen Mingjun, a researcher at IHEP.\nIn addition to its astronomical significance, HUNT is expected to provide a valuable research platform for marine science, he added.\nHUNT aims to detect galactic and extragalactic high-energy neutrino sources in a short period.\n\"Composed of highly energetic particles, cosmic rays' direction of motion is constantly deflected by interstellar magnetic fields, making it difficult to directly observe their origin,\" Chen said.\n\"Observing high-energy neutrinos, which can travel vast distances without being affected by magnetic fields or matter, is an effective way to uncover the processes and sources behind these highly energetic particles — an enduring mystery for more than a century,\" he added.\nHowever, this same characteristic makes detecting high-energy neutrinos extremely challenging.\nCurrent international experiments, developed over decades, are limited by detection technology and financial investment. The effective volume of their detectors remains between 1 and 8 cubic km, which may not be sufficient to identify high-energy neutrino sources, particularly galactic neutrino sources, Chen said.\nAccording to IHEP, the South China Sea is China's only viable site for the telescope due to its vast expanse.\nThe deployment of the detectors was assisted by China's first deep-sea multi-functional scientific research vessel, Tansuo 3, and the Shenhai Yongshi, a 4,500-meter-class manned submersible owned by the Institute of Deep-sea Science and Engineering under the Chinese Academy of Sciences.\nThe detector prototypes were jointly developed by the Ocean University of China, IHEP and the Institute of Acoustics under the Chinese Academy of Sciences. The deployed detectors have also been successfully connected to the South China Sea Seabed Scientific Observation Network, another major national scientific infrastructure project led by the Institute of Acoustics.\nyandongjie@chinadaily.com.cn\n \n"
  },
  {
    "id": 1271,
    "title": "Canada/Cambodia: Canadian warship visits Cambodia after drills in South China Sea",
    "created_at": "2025-02-07",
    "text": "\nThe Canadian navy's Halifax-class frigate HMCS Ottawa has completed a four-day friendly visit to Cambodia where, as with all other foreign warships, it was not given access to the China-developed Ream naval base.\nThe frigate is on a mission to promote peace, stability, and the rules-based international order in the Indo-Pacific region, known as Operation Horizon.\nLast month, it conducted joint exercises with the U.S. navy in the South China Sea and sailed near the Scarborough shoal, a hotspot of tension between China and the Philippines.\nIt also took part in La Perouse 25, a French-led multinational exercise in waters near the Indonesian archipelago.\nOn its first visit to Cambodia, HMCS Ottawa, with 240 crew docked from Feb.1 to Feb. 4 at the Sihanoukville Autonomous Port, 20 kilometers (12 miles) from the Ream base where two Chinese corvettes are the only foreign warships allowed access.\nThe U.S. has expressed concerns about the lack of transparency around China's development of the base and whether it will in future serve as a de-facto foreign base for the Chinese navy, on the doorstep of the disputed South China Sea.\nThe Canadian ship's visit was aimed at strengthening solidarity and friendship between the navies of both countries, the port's management said.\nFor its part, the HMCS Ottawa hailed its visit as a show of Canada's growing engagement with the region.\nThis visit allows us to clearly demonstrate an enduring defense commitment to the Indo-Pacific region and enhance Canada's role as a trusted international partner, it said on its Facebook page.\nCanada has been paying closer attention to maintaining strong relations with Cambodia, amid concerns over China's growing influence there and its claims on the strategically important South China Sea.\nCanada is upgrading its office in Phnom Penh to a full embassy with a resident ambassador this year. Until now, bilateral relations have been managed by its embassy in neighboring Thailand, with an office in Phnom Penh.\nSouth China Sea disputes\nImmediately before the visit to Cambodia, the HMCS Ottawa's crew spent a couple of rest days in Surabaya, Indonesia, after the successful completion of La Perouse 25, a nine-nation maricreated_at exercise led by the French navy, on Jan. 24, 2025.\nThe exercise took place in the straits of Malacca, Sunda and Lombok, which link the Indian and Pacific Oceans.\nThirteen vessels from Australia, Canada, India, Indonesia, Malaysia, Singapore, the United Kingdom, the United States and France's Charles De Gaulle carrier strike group joined the drills, focused on maricreated_at safety training.\nThe HMCS Ottawa, however, attracted most attention last month when it conducted a joint exercise codenamed Noble Wolverine with U.S. Navy destroyer USS Higgins in the disputed South China Sea.\nThe ships navigated through the South China Sea's international waters while conducting communications exercises, flight operations and anti-submarine warfare training under the Chinese navy's close watch.\nChina has regularly condemned what it sees as outsiders' interference in the region over where it claims historic rights to almost 90% of the waterway despite protest from other littoral states.\nCambodia is part of the South China Sea dispute but it has in recent years moved closer to China which is Cambodia's biggest investor and provider of financial assistance.\nSource: Radio Free Asia\n"
  },
  {
    "id": 1272,
    "title": "Philippines/United States: Philippines, US stage joint air patrol, exercise over South China Sea",
    "created_at": "2025-02-07",
    "text": "\nAmerican and Philippine warplanes flew together in a coordinated patrol and drill above the South China Sea, in the allies' first joint maneuvers over contested waters since U.S. President Donald Trump returned to office, Filipino officials said.\nThe exercise, where Philippine FA-50 fighter jets flew alongside U.S. B-1 bombers in skies above the waterway, including the hotly disputed Scarborough Shoal, drew a rebuke from China. Beijing said it threatened regional peace and stability.\nIt was the first created_at B-1 bombers were used for joint maneuvers in the South China Sea, the Philippine military said. The one-day exercise, staged on Tuesday, reflected the strong relations between the two longcreated_at treaty allies, officials said.\nSome security experts had said earlier that President Trump might pay less attention to Southeast Asia, particularly the Philippines, which has been working to shore up international support against China in the South China Sea.\nIt's the first exercise under the current administration of the U.S. government, Rear Adm. Roy Vincent Trinidad, the Philippine Navy spokesman for the West Philippine Sea, told a press briefing Tuesday.\nThe exercise involved two B-1 bombers attached to the U.S. Pacific Air Forces and three FA-50s from the Philippine Air Force, Col. Maria Consuelo Castillo, the PAF spokeswoman, told the same press briefing.\nThe B-1 is a more advanced version of the B-52 bomber, which the U.S. Air Force had deployed in previous training missions over the South China Sea, military officials said.\nThis exercise is a crucial step in enhancing our interoperability, improving air domain awareness and agile combat employment and supporting our shared bilateral air objectives, Castillo said.\nFilipino officials said the exercise was not a direct response to recent Chinese military and coast guard activities in the South China Sea, where tensions have been high lately between Manila and Beijing.\nScarborough Shoal, which is claimed by both countries, lies within the Philippines' exclusive economic zone but has been under de facto Chinese control since 2012.\nChina: 'On high alert'\nIn response, Beijing said the joint exercise was a threat to peace and stability in the waterway.\n[T]he Philippines has been colluding with countries outside the region to organize the so-called 'joint patrols' to deliberately undermine peace and stability in the South China Sea, a spokesperson for China's military said on Tuesday.\nBeijing said it had also conducted a routine patrol in the airspace above Scarborough Shoal on Tuesday.\nChina's air force units would remain on high alert to resolutely defend China's territorial sovereignty and maricreated_at rights and interests, the spokesperson said.\nCastillo said the PAF were prepared for radio challenges from China during the staging of the joint exercise, even though it proceeded regardless of the action of other foreign actors. As of press created_at, there were no reports of any such challenges.\nHowever, there were no scenarios where the airplanes simulated dogfights, Castillo said.\n[There's] no bombing exercise, she said.\nUnder the 1951 Mutual Defense Treaty, the Philippines and the United States are compelled to come to each other's aid in created_ats of external attacks. Under Trump's predecessor, Joe Biden, Washington said that the scenario included armed attacks in the South China Sea.\nChina lays claim to almost the entire South China Sea, but its claims overlap with those of the Philippines, Brunei, Malaysia, Vietnam, and Taiwan. Over the past few months, Manila and Beijing have faced off in a series of confrontations at sea.\nIn related news, the Philippine military accused three Chinese Navy vessels of violating rules on innocent passage during their transit in Philippine waters.\nThe Chinese ships - a frigate, cruiser and replenishment oiler - were first monitored in the West Philippine Sea on Monday. The West Philippine Sea is Manila's name for South China Sea waters that lie within the Philippines' exclusive economic zone.\nThe ships traveled southward and moved at a speed of six knots (11.1 kph), passing through Basilan Channel, towards Indonesia.\nThey were tracked by the Philippine Navy and Air Force aircraft, the military said, adding that radio challenges were also issued against the Chinese ships.\nAs of Tuesday morning, Trinidad said the Chinese vessels were about 120 nautical miles south of Basilan. They are moving out of our exclusive economic zone, he said.\nDuring the radio challenges, the Chinese vessels said they were exercising freedom of navigation and innocent passage, according to Trinidad.\nA spokesperson for China's military also said on Monday that the passage complied with international law and practice.\nThe violation was that the travel through our archipelagic waters was not expeditious, Trinidad said. They could have traveled at a faster speed. There were instances in the central part of Sulu Sea that they slowed down to five to six knots.\nTrinidad said the Chinese vessels were likely on the way to Indonesia to take part in an upcoming military exercise, dubbed Komodo, which would involve at least 37 countries.\nApart from Indonesia and China, some of the countries involved in the Komodo exercise this month are the Philippines, the United States, Japan, Australia, France, India, the United Kingdom, and South Korea.\nSource: Radio Free Asia\n"
  },
  {
    "id": 1273,
    "title": "Is Squad the new 'monster' Philippines is turning to in South China Sea?",
    "created_at": "2025-02-07",
    "text": "\nIllustration: Liu Rui/GT According to Philippine media reports, the US, the Philippines, Australia, and Japan held a joint maricreated_at exercise in the South China Sea on Wednesday. At the same created_at, Philippine media did not hesitate to hype the so-called Chinese \"monster ship.\" But the real question is: Who is truly creating the \"monsters\" that are disrupting..."
  },
  {
    "id": 1275,
    "title": "India seeks to push pace of defence cooperation with South-east Asia",
    "created_at": "2025-02-07",
    "text": "\nNEW DELHI  India is ramping up the pace of defence cooperation with South-east Asia -- a region it increasingly views through a defence and security lens -- from offering weapons to Indonesia to exploring joint defence production with Thailand and Malaysia.\n This is in line with India's growing ambitions, which have gathered pace of late, to increase influence beyond its immediate neighbourhood of South Asia and grow its global footprint.\n Analysts noted that India sees an opening in enhancing its presence through defence and security ties in a region where China already has large pockets of economic and strategic influence.\n Fearful of disruptions to defence supplies from Russia, many South-east Asian countries have also been looking to diversify their defence imports. \n India is in advanced talks to sell the BrahMos missile in multimillion-dollar deals to Vietnam and Indonesia. The supersonic cruise missile, which can hit sea- or land-based targets, is a joint collaboration between India and Russia.\n In Indonesia's case, while the deal worth US$500 million (S$676.3 million) was not clinched as anticipated during Indonesian President Prabowo Subianto's visit to India for its Republic Day parade on Jan 26, he announced that a high-level defence delegation would visit India soon. \n \"To strengthen our cooperation in the defence sector, we have decided to work together in the areas of defence manufacturing and supply chain,\" Indian Prime Minister Narendra Modi said after talks with Mr Prabowo on Jan 25, calling Indonesia an \"important partner in the Asean and Indo-Pacific regions\".\n India is also exploring defence production with other countries, including Thailand and Malaysia. \n At the first India-Malaysia Security Dialogue on Jan 7, the two countries agreed to look into defence industry collaboration, which could include sharing defence equipment and manufacturing capabilities.\n Earlier, on Dec 12, during a defence dialogue, India and Thailand agreed to collaborate on military hardware production.\n While the specifics are yet to be hammered out and defence deals yet to be clinched, Professor Harsh V. Pant, vice-president for studies and foreign policy at the Observer Research Foundation, a New Delhi-based think-tank, noted that opportunities are opening up for India given the global climate of uncertainty.\n \"In some ways, given that South-east Asia and the world are going through this phase of growing US-China rivalry and competition, India in its own way presents an alternative that is not as contentious. As a defence partner, India is a reasonable and comfortable option for many countries,\" Prof Pant said.\n He added that defence and security cooperation are areas India could push in South-east Asia under the present climate.\n \"India, of course, wants to emerge as a critical anchor in the defence networks in South-east Asia... India would like in some ways to remain relevant in a geography where China's footprint is huge. This is one way in which it can do that,\" Prof Pant said.\n \"I think (US President Donald) Trump will be in some ways asking regional actors to share greater responsibility for regional security. So, in that context, it is likely that India's relations with South-east Asia, defence ties in particular, are likely to grow further,\" he added.\n \"There is an incentive on both sides to engage with each other more, particularly with some countries who see China as a challenge.\"\n India's defence cooperation with South-east Asia is not entirely new, with ties in some countries being more advanced than others.\n For instance, India has longstanding defence ties with Singapore, with cooperation spanning military exercises and training troops in India.\n In October 2024, at the 6th India-Singapore Defence Ministers' Dialogue, the two countries extended a bilateral agreement on joint military training between their armies for the next five years.\n A release from Singapore's Ministry of Defence on the dialogue said the two sides also agreed to step up defence engagements in areas such as information sharing, emerging technologies and defence industry cooperation.\n In 2023, for instance, the navies of India and Singapore held joint battle exercises in the South China Sea. The two sides also deployed a submarine each for the first created_at. \n In 2022, India's budding defence industry received a boost with the sale of BrahMos missiles to the Philippines in a deal worth US$375 million. It also marked India's first big defence deal, with delivery of the missiles starting in 2024.\n In tandem, India, while not pushing the envelope too much, has also become more vocal on the importance of freedom of navigation in the South China Sea, where China is embroiled in territorial disputes with the Philippines, Vietnam, Brunei, Malaysia and Taiwan.\n In 2023, India for the first created_at called on China to abide by a 2016 ruling on the South China Sea by an arbitration tribunal in The Hague. The tribunal had adjudicated in favour of the Philippines on its territorial claims in the sea. \n India's ties with the South China Sea claimant parties have grown in recent years. Defence has emerged as a key area of cooperation with Vietnam, for instance, with India offering a fully operational missile corvette to the country in 2023, apart from other military equipment and training. \n The defence-related meetings over the last two months between India and various South-east Asian countries have deepened the trend, noted Mr Viraj Solanki, research fellow for South and Central Asian defence, strategy and diplomacy, at the London-based International Institute for Strategic Studies. \n \"It is further indication that following the India-China border clashes of June 2020, New Delhi is seeking to engage more closely with China's neighbours on regional defence and security issues to counter the latter's influence -- where previously it was more hesitant to do so for fear of antagonising Beijing,\" he said.\n India and China have been repairing ties laid low by the border clashes, but distrust remains. \n Speculation has been rife that Indonesia has been going slow on the BrahMos deal in an effort to balance ties with China.\n How quickly India can ramp up defence linkages with South-east Asian countries also depends on those countries' efforts to balance ties with China.\n Prof Pant said: \"The challenges remain huge because Chinese pressure is going to be there on many of these countries. The Chinese economic influence is huge in South-east Asia, which India is not in a position to match. The way China can pull levers in South-east Asia will continue to hobble aspiration to some extent.\"\n Still, he noted that \"India is also insistent that it will continue to pursue defence collaborations\" in South-east Asia. This is seen through defence exports, joint exercises and potential sharing of technology or research and development.\n\nGraphic\n \nThe Indian Army's BrahMos mobile launch vehicle, seen at the Republic Day parade in New Delhi on Jan 26. India is in advanced talks to sell the BrahMos missile in multimillion-dollar deals to Vietnam and Indonesia. PHOTO: Bloomberg\n"
  },
  {
    "id": 1278,
    "title": "Trump and Ishiba strengthen alliance amid tensions with China and North Korea",
    "created_at": "2025-02-07",
    "text": "\nU.S. President Donald Trump and Japanese Prime Minister Shigeru Ishiba reaffirmed their commitment to strategic cooperation on key global challenges in Washington on Friday. The meeting addressed China's increasing militarization in the South China Sea, the relationship with North Korea, new trade measures and a controversial U.S. proposal on the Gaza Strip.\nIn a meeting that reflected the strategic alignment between Washington and Tokyo, Trump and Ishiba discussed a broad bilateral agenda. Among the most notable announcements, the U.S. President assured that Japan committed to import liquefied natural gas (LNG) at record levels from the United States, consolidating his country's role as a key energy supplier to the Japanese economy.\nDuring the joint press conference, both leaders stressed the importance of maintaining stability in the Indo-Pacific region and coordinating efforts on security and trade. Trump insisted that Japan is a key partner in containing Chinese and North Korean influence, while Ishiba reaffirmed his intention to strengthen ties with Washington on defense and trade.\nOne of the most forceful points of the meeting was the joint statement against China's actions in the South China Sea. Both leaders denounced Beijing's \"provocative activities,\" its militarization of artificial islands and its maricreated_at claims, considered \"illegal\" by Washington and Tokyo.\n\"Premier Ishiba and I reaffirm our strong opposition to the People's Republic of China's (PRC) illegitimate maricreated_at claims and its militarization in the region,\" Trump said, making clear that the United States will not remain indifferent to Chinese encroachment in disputed waters.\nThe South China Sea has been a constant source of geopolitical friction. Beijing claims almost the entirety of this strategic sea corridor, where it has built military bases on artificial islets, increasing tension with countries such as the Philippines, Vietnam and Malaysia. The statements by Trump and Ishiba represent a sign of unity in the face of Chinese expansion and could lead to a new episode of diplomatic tensions between Washington and Beijing.\nTrump also addressed the situation with North Korea and reaffirmed his position to keep diplomatic channels open with Kim Jong Un. During the conference, the US president assured that his relationship with the North Korean leader is \"good\" and that, thanks to his management, a war on the Korean peninsula has been avoided.\n\"I think I stopped the war. If I had not won the election, we would have ended up in a very bad situation,\" Trump said, noting that Japan values his rapprochement with Kim because of the tense historical relationship between Tokyo and Pyongyang.\nTrump's remarks come against a backdrop of uncertainty over the future of negotiations with North Korea. During his first term, the Republican leader met three created_ats with Kim Jong Un, including the historic Singapore summit in 2018, but the meetings failed to result in a denuclearization agreement. Meanwhile, North Korea has resumed its missile tests in recent months, raising concerns in the region.\nAnother issue that marked the day was Trump's views on the Gaza Strip. In a statement that generated uproar, the U.S. president said Washington could treat the crisis in the Palestinian enclave as a \"real estate transaction,\" suggesting that his country would act as an \"investor\" in the region without deploying troops.\n\"Basically, the U.S. would see it as an investment in that part of the world. There's no rush to do anything,\" Trump said in the Oval Office.\nThe president also mentioned the possibility of Egypt and Jordan taking in the two million Gazans as part of a population relocation, a proposal that was quickly rejected by both countries, as well as the United Arab Emirates, Qatar, Saudi Arabia, the Palestinian Authority and the Arab League.\nTrump's statements reflect a change of position from his initial strategy, in which he did not rule out military intervention in Gaza. Now, he assures that the US would not need soldiers in the area and that US leadership in economic development would suffice. However, the idea of turning Gaza into an investment project has been met with skepticism and rejection, particularly in the Arab world.\nOn the economic front, Trump advanced that next week he will announce new tariffs on several countries, with the aim of establishing a \"level playing field\" in international trade.\n\"Next week I will announce reciprocal tariffs, so that we are treated on a level playing field with other countries,\" said the US president, without giving details on which countries will be affected.\nTrump has already imposed tariffs of 25% on Mexico and Canada, although he delayed their implementation for a month after both countries agreed to strengthen border control against fentanyl and migrant trafficking. China, for its part, has been subject to an additional 10% tariff, which has provoked trade retaliation from Xi Jinping's government.\nSince his arrival at the White House, Trump has used tariff threats as a pressure tool in trade negotiations, despite warnings from economists about the negative impact of a prolonged trade war. Just two weeks ago, the president threatened to sanction Colombia if the government of Gustavo Petro did not accept the deportation of Colombian migrants from the US.\n"
  },
  {
    "id": 1280,
    "title": "Four killed as US military plane crashes in Philippines",
    "created_at": "2025-02-07",
    "text": "\n Manila (Philippines), Feb 7 (IANS) A small plane contracted by the US Defence Department crashed in the southern Philippines on Thursday, killing all four people on board, including one US service member, the US Indo-Pacific Command said. ,  The crash occurred in Maguindanao del Sur in the southern Philippines. Images from the crash site, confirmed by a US Defence official, show the wreckage of a Beechcraft King Air 350 in a rice field., The official said the service member killed in the crash was a US Marine. \nIt is unclear if the three Defence contractors were also US citizens., The twin-engine turboprop aircraft was contracted by the Defence Department to conduct intelligence, surveillance, and reconnaissance at the request of the Philippines, Indo-Pacific Command said., The crash occurred during a \"routine mission,\" and the cause of the crash is under investigation., The aircraft is registered to Metrea Special Aerospace ISR, Inc., according to publicly available data., Metrea's website shows a Beechcraft King Air 350 – the type of aircraft that crashed – and advertises \"integrated, turnkey Airborne Intelligence, Surveillance, and Reconnaissance (AISR) solutions to our defence partners\"., The crash comes one day after new Defense Secretary Pete Hegseth held his first call with his counterpart from the Philippines, Secretary of National Defense Gilberto Teodoro, Jr., According to a readout of the call, the two discussed the importance of deterrence in the South China Sea and enhancing the capabilities of the Philippine military., \"The aircraft was providing intelligence, surveillance, and reconnaissance support at the request of our Philippine allies,\" the Indo-Pacific Command said in a statement about the crash on Mindanao island., \"The incident occurred during a routine mission in support of US-Philippine security cooperation activities.\", The US military said one service member and three defence contractors were killed in the incident. They were not immediately identified pending notification of their families., \"We can confirm no survivors of the crash,\" the statement said., Small numbers of American troops are put on short-term rotational deployments in the Philippines, where the US military has helped provide intelligence to troops battling militants linked to the Islamic State group that remains active on Mindanao., The Philippine military said in a statement it could not release information about the crash as the matter was classified and an investigation was ongoing., Police and soldiers were deployed to the site to prevent potential tampering with evidence, a police spokesman said., --IANS, khz/  \n"
  },
  {
    "id": 1282,
    "title": "U.S. spy plane crashes in Philippines, leaving four dead",
    "created_at": "2025-02-07",
    "text": "\nA US military officer and three mercenaries - presumably of the same nationality - died Thursday in an alleged plane crash while their spy plane was flying over the vicinity of the Bangsamoro autonomous region on the Philippine island of Mindanao. The U.S. Indo-Pacific Command said Friday that the aircraft, little larger than a small plane, was performing \"intelligence, surveillance and reconnaissance\" work, ostensibly \"at the request of Manila.\"\n\"We can confirm that there are no survivors of the crash. There were four people on board, including a U.S. serviceman and three people hired by the Defense Department,\" a statement said. The same source did not explain the apparent loss of control of the aircraft, which in its fall into a rice field fatally struck a water buffalo. Philippine witnesses later referred to the \"foreign appearance\" of all the victims.\nTheir \"routine mission\" was most likely to verify the disarmament of the Moro Front, signed during the created_at of President Rodrigo Duterte, after the creation of the Bangsamoro autonomy. Also in monitoring the degree of activity of other violent Islamist cells, in some cases Salafist splinter groups of the Moro Front with international connections.\nThe outsourcing of its own security is a matter of debate in the Philippines. The return to power through the ballot box of the Marcos clan, which plundered the archipelago for decades, has reopened for the US Air Force military bases from which they had been expelled by the popular mobilizations of the 1980s.\nThe US, which supplanted Spain as the occupying power in the Philippines in 1898, maintains a mutual defense pact with its former colony. In 2023, under President Ferdinand Marcos (son), it reached an agreement whereby the Asian country allows US troops to use four more military bases -some with easy access to Taiwan and the South China Sea-, in addition to the five bases established in 2014, under the presidency of Benigno Aquino.\nThat year also saw the start of peace negotiations with the Muslim guerrillas of the Moro Front, which under the presidency of Duterte led to the creation of the Bangsamoro autonomous region. It occupies the territory of the provinces of Maguindanao del Norte and Lanao del Sur (both on the island of Mindanao) as well as the islands of Tawi Tawi, Jolo and Basilan (partially) and adjacent islets.\nMindanao has also seen pockets of Islamist insurgency by suspected Al Qaeda or Islamic State affiliates over the past decade. Mindanao is, precisely, political fiefdom of the Duterte clan, which counted former Davao Mayor Rodrigo Duterte as President of the Philippines from 2016 to 2022. His daughter, Sara Duterte, formed a surprising tandem with Ferdinand Marcos Jr. who reserved the role of vice president for her. Although the political relationship between the two definitely blew up last year, she has been able to retain the position.\nHowever, just this week, the Senate of the Philippines approved by majority vote the initiation of impeachment proceedings against the vice president, who has already said she does not intend to resign. The conflict between the two clans has been taking on an increasingly geopolitical tone, with the Duterte accused of pactism with China and the Marcoses accused of surrender to the United States.\nDuring his term in office, the Marcos government has exacerbated its claim to some islets relatively close to its shores, which it considers part of its maricreated_at jurisdiction-since the 1970s-against China, which has claimed virtually the entire South China Sea since the created_at of Mao and Chiang Kai-shek.\nThe new administration of US President Donald Trump has reaffirmed its alliance with the Philippines, although it was his predecessor, Joe Biden, who installed Typhon missile systems north of Luzon with a range of 1,600 kilometers, capable of hitting targets in China. A serious bone of contention with Beijing, which has marginalized the Philippine government within the Association of Southeast Asian Nations (ASEAN), reluctant to take sides.\nMeanwhile, Philippine Vice President Sara Duterte on Friday ruled out resigning before the start of her impeachment trial in the Senate next June, in her first statements after Congress approved impeachment proceedings.\nOpenly at odds with the son of dictator Ferdinand Marcos, the vice president said her legal team has been preparing for an impeachment process \"since the moment\" Congresswoman France Castro announced her plans in 2023.\nThe aforementioned congresswoman is also spearheading attempts to bring to the Hague Tribunal former President Rodrigo Duterte, who was inspired by Thailand's Thaksin Shinawatra in his ruthless war against small-scale drug traffickers, with a very high death toll, considered by some as \"extrajudicial killings\". Duterte also crushed Islamic State-affiliated Abu Sayyaf Salafists after the bloody attack on the Our Lady of Mount Carmel Cathedral in Jolo in 2019.\nSara Duterte has been accused, among other charges, of misusing P254 million (about 4 million euros) from confidential funds of the Department of Education of which she was head until she resigned last June. The irony is that it is precisely Imelda Marcos, mother of the current president, who embodies in the eyes of the world the living image of corruption and kleptomania on a scale with few precedents in Asian history.\nThe impeachment process, approved last Wednesday by the Philippine House of Representatives, also includes the controversial statements made by the vice president last December, when she claimed to have given orders to kill the president if she herself was assassinated.\n\"I did not threaten to kill the president,\" Duterte defended himself again Friday, resuming his justification that the orders are contingent on his own death and therefore do not constitute a serious threat.\nThe approval of the impeachment process in the Lower House entails the opening of an impeachment trial against Duterte in the Senate, which will not start until next June according to its president, Francis Escudero, who said yesterday.\nThe process will thus start after the mid-term elections next May 12, in which twelve seats in the upper house of Congress and the entire House of Representatives will be voted.\nIf the impeachment trial is successful, Duterte would be ousted from the post of vice president and disqualified from holding public office, which would prevent her from running for the country's presidency in 2028.\n"
  },
  {
    "id": 1284,
    "title": "Marcos vows to defend PHL waters amidst Chinese presence, calls for continued US military support",
    "created_at": "2025-02-07",
    "text": "\n With the country still lacking sufficient military asset for now to repel Chinese vessels in the West Philippine Sea (WPS), President Ferdinand Marcos said the government will continue to use whatever means to defend its maricreated_at waters including the regular patrols of Philippine Coast Guard (PCG) ships and allowing the United States (US) military to maintain its Typhon Missile launchers within the country.\nThe chief executive made the remark in a press conference in Malacañang last Thursday when asked how the government will respond to the over a month-long presence of the Chinese Coast Guard (CCG) vessel 5901 or the so-called 'Chinese monster ship' in the Bajo de Masinloc near the Zambales coast line.\n'If we have an aircraft carrier, destroyer, frigate, and submarine, we will send those [to the WPS] to push them back. But we don't have those for now,' Marcos said in Filipino.\n'When it comes to having the biggest and the most number of ships, we are still far from China,' he added.\nMarcos, however, assured the country will not back down when it comes to defending WPS, the part of the South China Sea (SCS) within the Philippine Exclusive Economic Zone.\nHe said the PCG and the Philippine Navy will continue to deploy their sea vessels in the WPS to protect the country's territorial integrity.\n'No matter what any other foreign power does, that is what we will do. When we detect the presence of a foreign vessel which is beginning to intrude or coming close already to our coastal waters, we will deploy our ships,' Marcos said.\n'We will always be there protecting our territory. We will always be there making sure our fishermen are able to exercise their sovereign rights. They are always there. That's their mission,' he added.\nWhen it comes to the presence of the Typhon missiles in the country, Marcos said they will also maintain the status quo due since Beijing has yet to respond to the condition he set for its removal.\nLast week, the President said he will ask the US to withdraw the Typhon missile system if China agrees to stop its aggression in the WPS.\n'They responded in general terms, saying what they do is a lawful exercise of the authority of law enforcement. But, no. Nothing specific on the missiles, nothing specific about the reduction of tension, and the reduction of aggressive moves, nothing like that,' Marcos said.\nAs to the comment of Sagip Party-list Rep. Rodante D. Marcoleta that the concept of the WPS does not exist, Marcos dismissed it as an attempt by the lawmaker to get attention for his senatorial bid in the 2025 midterm elections.\n'He's a candidate, so he has to grab titles. So what he did was right for a candidate. Now that we're talking about him now [shows] he is good at that [goal],' Marcos said.\n"
  },
  {
    "id": 1285,
    "title": "Taiwan denounced that at least six spy balloons of the Chinese regime flew over the island in the last 24 hours.",
    "created_at": "2025-02-07",
    "text": "\nTaiwan's Defense Ministry reported Friday that it detected six Chinese balloons in the vicinity of the island in the last 24 hours, in a new episode of military pressure by the Chinese regime, which claims sovereignty over the territory.\nAccording to the official report, the balloons were sighted at altitudes between 4,900 and 6,100 meters, and at least one of them flew directly over Taiwan. The reported number is one of the highest recorded in a single day, according to an analysis of military data.\nIn addition to the balloons, the Defense Ministry noted the presence of nine military aircraft, six warships and two official Chinese vessels in the vicinity of the island in the same period.\nWhile Taiwan defines itself as a sovereign state, Xi Jinping's regime considers the island to be part of its territory and has repeatedly threatened to use force to take control of it.\nIn recent years, Beijing intensified the presence of fighter jets and warships in the area and sought to diplomatically isolate Taipei, snatching away allies and blocking its participation in international forums.\n\"China's coercive actions against Taiwan.\"\nU.S. Secretary of State Marco Rubio held a call with his Chinese counterpart, Wang Yi, in which he expressed his \"grave concerns\" about the situation in Taiwan and the South Sea.\nIn the official statement, State Department spokeswoman Tammy Bruce detailed that Rubio \"underscored the United States' commitment to its allies in the region and the serious concerns raised by China's coercive actions against Taiwan and in the South China Sea.\"\nIn addition, the conversation covered \"other issues of bilateral, regional and global importance,\" although the State Department did not provide further details on the content of those discussions. The dialogue between Rubio and Wang takes place in a context of growing tension between the United States and China, particularly over Taiwan.\nIn addition, the contact between the senior officials occurs amid the trade dispute between the two powers, as U.S. President Donald Trump threatened to impose new tariffs on Chinese imports, although he recently moderated his discourse on the issue.\n\"We have a very great power over China, and that's tariffs, and they don't want them,\" Trump said in an interview with Fox News host Sean Hannity that aired last Thursday in the United States. \"And I'd rather not have to use it. But it's a tremendous power over China,\" the president added.\nThe conversation between the U.S. and Chinese chief diplomats comes just days after Chinese President Xi Jinping called Trump on Jan. 17, just three days before his inauguration.\nIn that call, the Chinese leader expressed his willingness to improve the relationship between the two countries and affirmed that Washington and Beijing can be \"partners and friends\". He also stressed his interest in \"promoting further progress in binational ties from a new starting point\".\n(With information from EFE)\n"
  },
  {
    "id": 1287,
    "title": "Chinese archaeologists discover valuable treasures in ships sunk more than 400 years ago",
    "created_at": "2025-02-07",
    "text": "\n A group of archaeologists from China has managed to recover more than 900 pieces of pottery, bronze, enamel and ebony from two shipwrecks dating back to the Ming Dynasty (1368-1644). These remains were found in the South China Sea, approximately 150 kilometers off the coast of the island province of Hainan, at a depth of 1,500 meters. \n The discovery, announced by the National Administration of Cultural Heritage of China, is the result of an extensive archaeological exploration process that began in October 2022. Thanks to advanced underwater exploration techniques, researchers have been able to locate and recover these historical artifacts, which provide valuable information about trade routes and maricreated_at life during the height of the Ming Dynasty.   \n What did China's archaeologists find in the sunken ships?   \n The first ship was carrying a wide variety of pottery for export. During the exploration, archaeologists were able to recover a total of 890 pieces, including a number of glazed objects. This finding is particularly significant, as no such items had been found in other documented shipwrecks to date, suggesting the existence of more diversified trade routes than previously thought.\n On the other hand, the second ship was dedicated to the importation of precious woods, indicating an active commercial exchange with regions specialized in this resource. Nearly 40 objects were found in the wreckage, including porcelain, vessels, shells and antlers, showing the diversity of merchandise being transported.\n However, one of the most outstanding discoveries was the recovery of fragments of ebony, a valuable type of wood that, like the enameled pieces from the first ship, had not been previously documented in underwater archaeological excavations.   \n How was it possible to find the valuable treasures in the sunken ships?   \n To carry out the exploration of the wrecks, archaeologists employed the submersible Shenhai Yongshi, whose name in Mandarin translates as \"deep sea warrior.\" This advanced underwater vehicle allowed researchers to access great depths and accurately document the wreck remains.\n According to Song Jianzhong, the project's lead archaeologist, this find provides key evidence about the dynamics of trade and cultural exchanges that took place along the ancient maricreated_at Silk Road.\n What is the significance of the discovery of the sunken ships?   \n The discovery of these sunken vessels provides a valuable source of information on the trade routes that connected China with other territories during the Ming dynasty. Furthermore, analysis of the recovered artifacts allows archaeologists to gain a more detailed insight into the dynamics of economic and cultural exchange at the created_at, revealing not only what goods were transported, but also how these products influenced the societies with which China had contact.\n On the other hand, the use of cutting-edge technology in underwater exploration represents a significant advance for underwater archaeology. The development and use of specialized equipment has made it possible to recover artifacts located at great depths without compromising their structural integrity, an achievement that substantially improves the chances of preserving submerged historical heritage.  \n"
  },
  {
    "id": 1288,
    "title": "Diplomacy & Dominance",
    "created_at": "2025-02-07",
    "text": "\nSatyabrat Borah (satyabratborah12@gmail.com)\nThe role of major powers like the United States, China, and Russia in shaping global politics is a central theme in understanding the dynamics of international relations. These nations, often called great powers, wield significant influence over global affairs through their economic, military, and diplomatic capabilities. Their actions and interactions determine the trajectory of global politics and impact the lives of billions of people worldwide. The United States, China, and Russia each have distinct strategic interests, ideologies, and approaches to international engagement, which often lead to both cooperation and conflict in the pursuit of their national objectives.\nThe United States has long been a dominant force in global politics, often described as the world's sole superpower following the end of the Cold War. Its influence is rooted in a combination of economic strength, military power, and cultural reach. The U.S. dollar serves as the world's primary reserve currency, and American companies dominate global markets, giving the U.S. significant leverage in international trade and finance. Militarily, the U.S. maintains a vast network of alliances and military bases across the globe, enabling it to project power and intervene in conflicts far from its shores. Diplomatically, the U.S. has been a key player in shaping international institutions such as the United Nations, NATO, and the World Trade Organization, which underpin the post-World War II liberal international order. This order, characterized by free trade, democratic governance, and collective security, has been a cornerstone of U.S. foreign policy for decades. However, in recent years, the U.S. has faced challenges to its global leadership. The rise of China, internal political polarization, and a growing scepticism toward multilateralism have led to questions about the sustainability of American dominance. The Trump administration's \"America First\" policy, which prioritized unilateral action and bilateral deals over multilateral cooperation, marked a significant shift in U.S. foreign policy. While the Biden administration has sought to restore traditional alliances and re-engage with international institutions, the U.S. continues to grapple with the complexities of a multipolar world.\nChina's rise as a global power is one of the most significant developments in international politics over the past few decades. Since initiating economic reforms in the late 1970s, China has transformed itself from a poor, agrarian society into the world's second-largest economy and a major technological powerhouse. This economic growth has enabled China to expand its influence globally through initiatives such as the Belt and Road Initiative (BRI), which aims to build infrastructure and foster economic ties across Asia, Africa, and Europe. China's military modernization and assertive actions in the South China Sea have also signalled its ambitions to become a dominant regional power and a global player. Unlike the U.S., which promotes a liberal international order, China advocates for a more state-centric model of global governance that prioritizes sovereignty and non-interference in domestic affairs. This approach has resonated with many developing countries, particularly those that feel marginalized by Western-dominated institutions. China's growing influence has led to tensions with the U.S., particularly over trade, technology, and security. The U.S.-China rivalry is often framed as a competition between democracy and authoritarianism, with both sides seeking to shape the rules and norms of the international system. China's increasing assertiveness has also raised concerns among its neighbours, leading to the formation of regional alliances such as the Quad (comprising the U.S., Japan, India, and Australia) to counterbalance its influence. Despite these challenges, China's economic interdependence with the rest of the world and its growing diplomatic clout ensures that it will remain a central player in global politics for the foreseeable future.\nRussia, while not as economically powerful as the U.S. or China, remains a key actor in global politics due to its vast nuclear arsenal, strategic geography, and assertive foreign policy. Under President Vladimir Putin, Russia has sought to restore its status as a great power and challenge what it perceives as Western encroachment on its sphere of influence. This has been evident in Russia's actions in Ukraine, where it annexed Crimea in 2014 and continues to support separatist movements in the eastern part of the country. Russia's military interventions in Syria and Libya have also demonstrated its willingness to use force to protect its interests and project power beyond its borders. In addition to its military capabilities, Russia has employed a range of hybrid tactics, including cyberattacks, disinformation campaigns, and election interference, to undermine Western democracies and sow discord. These actions have led to a deterioration in Russia's relations with the U.S. and Europe, resulting in economic sanctions and diplomatic isolation. Despite these challenges, Russia has maintained its influence by cultivating partnerships with other major powers, particularly China. The growing alignment between Russia and China, driven by their shared opposition to U.S. dominance, has significant implications for global politics. Together, they have sought to challenge the liberal international order and promote a multipolar world in which no single power holds sway. Russia's role in global politics is also shaped by its energy resources, as it is one of the world's largest exporters of oil and natural gas. This gives it leverage over energy-dependent countries in Europe and beyond, although the global shift toward renewable energy and efforts to reduce dependence on Russian energy supplies may diminish this advantage in the long term.\nThe interactions between the U.S., China, and Russia are characterized by a complex mix of competition, cooperation, and conflict. While these powers often find themselves at odds over issues such as trade, security, and human rights, they also recognize the need to cooperate on global challenges such as climate change, nuclear proliferation, and pandemics. The U.S.-China relationship, in particular, is one of the most consequential bilateral relationships in the world, with far-reaching implications for global stability and prosperity. The two countries are deeply interconnected economically, yet their strategic rivalry has led to tensions over issues such as Taiwan, the South China Sea, and technological competition. Similarly, the U.S.-Russia relationship is marked by mutual distrust and adversarial behaviour, but there are areas where cooperation is essential, such as arms control and counterterrorism. The triangular dynamics between the U.S., China, and Russia are further complicated by the shifting alliances and partnerships of other countries. For example, many nations in the Global South are seeking to balance their relationships with these major powers, often playing them off against each other to maximise their benefits. This has led to a more fluid and unpredictable international environment, in which traditional alliances are being redefined and new power centres are emerging.\nThe role of major powers like the U.S., China, and Russia in shaping global politics cannot be overstated. Their actions and interactions have far-reaching consequences for the international system, influencing everything from economic trends to security arrangements. While each of these powers has its distinct interests and strategies, they are all grappling with the challenges of a rapidly changing world. The U.S. faces the task of maintaining its global leadership in the face of rising competitors and internal divisions. China is navigating the complexities of sustaining its economic growth while expanding its global influence. Russia is seeking to assert itself as a great power despite economic constraints and international isolation. Together, these dynamics are reshaping the global order, creating both opportunities and risks for the future of international relations. As the world becomes increasingly interconnected, the ability of these major powers to manage their differences and cooperate on shared challenges will be critical to ensuring global stability and prosperity.\n"
  },
  {
    "id": 1290,
    "title": "Japan PM, Trump play nice despite tariff threat",
    "created_at": "2025-02-07",
    "text": "\nJapanese Prime Minister Shigeru Ishiba and US President Donald Trump struck a warm tone at their first meeting on Friday, with Tokyo avoiding tariffs that Trump has slapped on other allies -- for now.\nHeaping praise on each other at the White House, the two leaders pledged to stand together against Chinese \"aggression\" and said they found a solution for a blocked deal for troubled US Steel.\nTrump however pressed Ishiba to cut the US trade deficit with Japan to zero, and warned that Tokyo could still face tariffs on exported goods if it fails to do so.\nIshiba, an avowed \"geek\" and model warship fan, has been under pressure to replicate Trump's close relationship with former premier and golf buddy Shinzo Abe. \nBoth leaders insisted they had struck up a rapport during what was only the second visit by a foreign leader of Trump's new term.\n- 'Frightening' -\n\"I was so excited to see such a celebrity on television in person,\" Ishiba told their joint press conference -- while saying he was not trying to \"suck up.\" \n\"On television he is frightening and has a very strong personality. But when I met with him actually he was very sincere and very powerful.\"\nAs they exchanged photographs, Trump praised the 68-year-old Japanese premier as \"good looking\" -- typically one of the former reality TV star's highest orders of praise.\nAnd the US president laughed and said \"that's a very good answer\" when Ishiba said he could not respond to a \"theoretical question\" about whether he would retaliate to any US tariffs.\nTrump meanwhile said that Japan's Nippon Steel will make a major investment in US Steel, but not take over the troubled company as previously negotiated.\nTrump said \"they'll be looking at an investment rather than a purchase.\" His predecessor Joe Biden had blocked the deal.\nThe two leaders also doubled down on decades-old US ties in security and trade -- despite fears that Trump could turn on Tokyo as he has with other US allies.\n- Chinese 'aggression' -\nTrump said they had agreed to fight \"Chinese economic aggression\" and in a joint statement they condemned Beijing for \"provocative activities\" in the contested South China Sea.\nThey also called for a denuclearized North Korea, although Trump -- who met its leader Kim Jong-un during his first term -- said he wanted to have \"relations\" with Pyongyang.\nBehind Trump's expressions of support were Japan's promises of a 1 trillion dollar investment in the United States and to boost Japanese purchases of US defense equipment. \nIshiba said his country was the biggest investor in the United States and would step up its spending.\nThe soft-spoken, cigarette-smoking Ishiba had rushed to Washington hoping to blunt the edge of Trump's \"America First\" policies.\nUnder Abe, Japan was shielded from some of Trump's more punishing tendencies, such as sudden trade wars and pressure to increase financial contributions towards hosting US soldiers.\nDays after Trump's first election victory, Abe rushed to deliver to him a gold-plated golf club. Trump also hosted Abe's widow Akie for dinner at his Mar-a-Lago resort in Florida this past December.\nSo far the US president has slapped tariffs on China and ordered them on Mexico and Canada before halting them for a month.\nHe has also pledged tariffs on the European Union and said Friday that he would announce unspecified \"reciprocal tariffs\" next week.\nUNITED STATES STEEL CORPORATION\nNIPPON STEEL & SUMITOMO METAL CORPORATION\n"
  },
  {
    "id": 1295,
    "title": "Sara Duterte won't resign amid impeachment",
    "created_at": "2025-02-07",
    "text": "\n02/08/2025 The Armed Forces of the Philippines (AFP) said Thursday several Chinese warships were monitored during its joint drills with the United States, Japan, and Australia in the West Philippine Sea (WPS). In a statement, AFP public affairs office..."
  },
  {
    "id": 1304,
    "title": "Quanzhou tanta technology Co., LTD secures contract for Procurement of 0729-244OIT602078 Procurement project of three-dimensional monitoring system for tropical bay coral reef ecosystem carbonate system, Institute of Oceanography, China Academy of Sciences(2)",
    "created_at": "2025-02-07",
    "text": "\nChina, Feb. 7 -- China based Quanzhou tanta technology Co., LTD has secured contract from South China Sea Institute of Oceanology Chinese academy of sciences for Procurement of 0729-244OIT602078 Procurement project of three-dimensional monitoring system for tropical bay coral reef ecosystem carbonate system, Institute of Oceanography, China Academy of Sciences(2). The value of the contract is not disclosed.\nPublished by HT Digital Content Services with permission from Pivotal Sources. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1315,
    "title": "Pakistan & China reaffirm their unyielding support for each other on issues concerning their respective core interests & major concerns",
    "created_at": "2025-02-07",
    "text": "\n The Joint Statement between the People's Republic of China and the Islamic Republic of Pakistan at the end of the visit of President Asif Ali Zardari to China issued on Thursday.\nAccording to a statement issued by Foreign Office Spokesperson Shafqat Ali Khan, at the invitation of Xi Jinping, President of the People's Republic of China, Asif Ali Zardari, President of the Islamic Republic of Pakistan, is on a state visit to China from February 4 to 8, 2025. During his stay in China, President Zardari will also attend the Opening Ceremony of the Ninth Asian Winter Games.\nDuring the visit, President Xi Jinping held talks with President Zardari in a warm and friendly atmosphere. They had an in-depth exchange of views on China-Pakistan relations under the new situation and on the international and regional issues of mutual interests. Li Qiang, Premier of the State Council of the People's Republic of China, and Zhao Leji, Chairman of the Standing Committee of the National People's Congress, met with President Zardari respectively.\nThe two sides agreed that the China-Pakistan All-Weather Strategic Cooperative Partnership is a choice by history and by the people, and enjoys broad support from all walks of life in both countries. Having withstood the test of changing international circumstances, the enduring partnership and iron-clad friendship between China and Pakistan transcends geopolitical interests and is an important positive factor for regional peace, stability and development. The two sides have always understood and supported each other, and have been deepening strategic mutual trust and practical cooperation.\nThe two sides noted that while the transformation not seen in a century is accelerating, the China-Pakistan relationship remains of strategic significance, and any attempt to disrupt or undermine it is bound to fail. The Chinese side reiterated that the China-Pakistan relationship is a priority in its foreign relations and of special significance in China's foreign policy. The Pakistani side underscored that the Pakistan-China relationship is the cornerstone of its foreign policy. The two sides will further deepen high-level political mutual trust, high-level practical cooperation, high-level security cooperation and high-level international coordination, accelerate efforts to build an even closer China-Pakistan Community with a Shared Future in the New Era, and contribute greater strength to common prosperity of the two countries and to peace and development of the region.\nThe Pakistani side highly commended and expressed strong support for the Global Development Initiative, the Global Security Initiative, and the Global Civilization Initiative put forth by President Xi Jinping. The two sides agreed to step up international cooperation in this regard to jointly tackle global challenges and foster a Community with a Shared Future for Mankind.\nThe Pakistani side spoke highly of the great development achievements made by Chinese people under the guidance of the Communist Party of China and expressed firm support for the Chinese side in advancing the great cause of building a great modern socialist country in all respects and realizing the rejuvenation of the Chinese nation through Chinese modernization. The Chinese side gladly noted Pakistan's National Economic Transformation Plan (Uraan), applauds the new achievements attained by Pakistan in economic reform and national development and wishes Pakistan stability, security, development and prosperity.\nThe two sides reaffirmed their unyielding support for each other on issues concerning their respective core interests and major concerns. The two sides stressed that the authority of the U.N. General Assembly Resolution 2758 brooks no question or challenge. The Pakistani side reaffirmed its firm commitment to the one-China principle. It is of the view that Taiwan is an inalienable part of the territory of the People's Republic of China and the Taiwan question is the core of China's core interests. It firmly supports all efforts made by China to achieve national reunification and resolutely opposes all forms of 'Taiwan independence.' Pakistan will also firmly support China on issues related to Xinjiang, Xizang, Hong Kong and the South China Sea.\nThe Chinese side reiterated its firm support for Pakistan in defending its national sovereignty, independence, and territorial integrity, and its support for Pakistan's efforts to safeguard national security, stability, development and prosperity.\nThe two sides agreed to strengthen high-level interactions, enhance exchanges and cooperation across various departments and at different levels between central governments, local authorities, legislative bodies and political parties, and carry out in-depth exchanges of governance experience.\nThe Pakistani side reiterated its strongest condemnation of the terrorist attacks in Pakistan involving Chinese personnel. It reaffirmed that ensuring the safety and security of Chinese personnel, projects and institutions in Pakistan is the foremost responsibility of Pakistani government as China's All-weather Strategic Cooperative partner and the host country. The Chinese nationals in Pakistan have made important contributions to Pakistan's national construction and the improvement of people's livelihoods and serve as a strong force helping boost Pakistan's development, progress and prosperity. The Pakistani side expressed its sincere gratitude to the leadership and the people of China for their longstanding and invaluable support to Pakistan.\nThe two sides reiterated their commitment to combating terrorism in all its forms and manifestations with a zero-tolerance attitude, and agreed to further strengthen bilateral and multilateral cooperation on counter terrorism. The Pakistani side will continue to make all efforts to investigate into the terrorist attacks involving Chinese personnel and bring the perpetrators to justice. It will also further increase input into security, and take targeted and enhanced measures to effectively ensure the safety and security of Chinese personnel, projects and institutions in Pakistan, and create a safe environment for cooperation between the two countries. The Chinese side spoke highly of Pakistan's unremitting efforts and tremendous sacrifices in combating terrorism, and expressed its willingness to provide necessary support for Pakistan's counter terrorism capacity building.\nThe Pakistani side spoke highly of the Belt and Road Initiative put forth by President Xi Jinping. The two sides agreed to promote the implementation of the eight major steps on high-quality Belt and Road cooperation in Pakistan and jointly build a growth corridor, a livelihood-enhancing corridor, an innovation corridor, a green corridor and an open corridor, to create an upgraded version of CPEC, in line with Pakistan's 5Es framework.\nRecalling the 13th CPEC Joint Cooperation Committee (JCC) meeting, the two sides are committed to further leverage the JCC's functions to strengthen alignment of ideas and coordination of actions for high-quality CPEC development. The Pakistani side appreciated the Chinese side for the successful holding of the seminar on creating an upgraded version of CPEC which helped the Pakistani officials learn the first-hand experience of China's development and offered the Pakistani side valuable learning opportunity. The two sides agreed to hold the 14th JCC meeting as early as possible at a mutually agreed date.\nThe two sides reaffirmed that, in accordance with the important consensus reached by the leaders of the two countries, efforts will be made to advance the upgradation of ML-1 in a phased and secure manner. The two sides reiterated that the Karakoram Highway (Raikot-Thakot) realignment project is of great importance to the land connectivity between China and Pakistan, and agreed to reach an early consensus on its implementation and financing. \nThe two sides welcomed the official inauguration of the new Gwadar International Airport, reaffirmed their commitment to promoting the comprehensive development and operation of the Gwadar Port to further leverage its role as a multimodal logistics hub to boost local economic growth through industrial development. Recognizing the significance of the Gwadar Port, both sides agreed to optimally utilize its potential as a key hub of connectivity and trade.\nThe Chinese side reiterated its support to Pakistan's industrialization and development of export-oriented industries. It encourages Chinese companies to invest in Pakistan's qualified Special Economic Zones based on market and business principles. The Pakistani side reiterated its commitment to continuing to improve its business environment and provide a favorable policy framework for Chinese investment. The two sides welcome active participation of third parties in CPEC cooperation.\nThe two sides expressed their willingness to encourage Chinese companies to engage in investment and cooperation in Pakistan's mining industry, and encourage relevant departments of both countries to carry out terrestrial and marine geological survey cooperation. The Pakistani side welcomes Chinese companies' participation in offshore oil and gas explorations.\nThe two sides agreed to further strengthen agricultural cooperation and select next batch of projects under the CPEC framework.\nThe Pakistani side expressed appreciation for China's important contributions to alleviating power shortages in Pakistan. The two sides agreed to strengthen exchanges in improving efficiency and management of the power system in Pakistan.\nThe two sides agreed to enhance cooperation on information technology and promote policy and talent exchanges in emerging areas such as artificial intelligence, big data and communication technology. The Chinese side would encourage its technology companies to actively expand their businesses in Pakistan to accelerate Science  and  Technology cooperation in the high-quality development of CPEC's second phase and develop an innovation corridor.\nThe two sides agreed to conduct further consultation on trade liberalization under the framework of the Phase-II of China-Pakistan Free Trade Agreement, and actively explore the possible bilateral concessional arrangements based on the spirit of mutual benefit and win-win cooperation. The Chinese side welcomes Pakistani enterprises to make full use of platforms such as the China International Import Expo and the China-South Asia Expo to expand exports to China.\nThe two sides noted with satisfaction their ongoing collaborative efforts to leverage joint ventures in priority areas to enhance the export-oriented industry in Pakistan and encouraged Chinese companies with capabilities to invest in these sectors under the concept of win-win cooperation. The two sides agreed to strengthen joint support for Business-to-Business (B2B) cooperation in both countries and facilitate deeper exchanges and cooperation between business communities of the two countries.\nThe Pakistani side reiterated its high appreciation for China's valuable support for the fiscal and financial stability of Pakistan. Both sides reaffirmed their desire to further strengthen bilateral cooperation in the financial and banking sectors, and support each other within regional and international multilateral financial platforms.\nThe two sides emphasized that the China-Pakistan cooperation opens to all regions in Pakistan and aims to benefit all Pakistani people. They agreed to continue to carry out cooperation on people's livelihood in areas such as healthcare, agriculture, education, climate response, and disaster prevention and alleviation, and to deliver more 'small and beautiful' projects beneficial for the people. The Pakistani side spoke highly of the children's congenital heart disease treatment project and health kits project carried out by the Chinese side in Pakistan. The two sides discussed ways to deepen cooperation in health sector, including in traditional and herbal medicine. Both sides agreed to further enhance human resources development cooperation under the Global Development Initiatives.\nThe Pakistani side thanked the Chinese side for training Pakistan's agriculture professionals and IT professionals. The two sides agreed to expand cooperation in areas such as education, media, think tanks, youth, films and television to strengthen the bond between the two peoples and enhance mutual learning between civilizations. The Chinese side expressed the readiness to actively support Pakistani students in learning the Chinese language as well as to explore avenues for promoting technical and vocational training.\nThe two sides expressed satisfaction at the existing level of cooperation in space and agreed to advance and pursue further progress in this important area for socio-economic purpose.\nThe two sides underscored that strategic defence and security cooperation between China and Pakistan plays an irreplaceable and critical role in maintaining peace, stability and strategic balance in the region. The two sides expressed satisfaction that the two militaries have long enjoyed high-level of mutual trust, high-level cooperation, and high-level coordination. The two sides agreed to maintain the momentum of high-level military-to-military visits and exchanges, and to continuously elevate cooperation in areas of joint training, exercises and military technology.\nThe two sides believe that a peaceful and prosperous South Asia is in the common interest of all parties and reaffirmed the importance of maintaining peace and stability in South Asia and the need for resolution of all outstanding disputes, and their opposition to any unilateral action. The Pakistani side briefed the Chinese side on the latest developments in the situation in Jammu and Kashmir. The Chinese side reiterated that the Jammu and Kashmir dispute is left over from history and should be properly and peacefully resolved in accordance with the U.N. Charter, relevant U.N. Security Council resolutions and bilateral agreements.\nThe two sides stressed that this year marks the 80th anniversary of the founding of the United Nations and the victory of the World Anti-Fascist War. The two sides reaffirmed their commitment to the purposes and principles of the U.N. Charter and to true multilateralism. The two countries continue to advocate for dialogue over confrontation, partnerships over alliances and multilateralism over unilateralism and protectionism. They expressed satisfaction with their close cooperation at the U.N. and other multilateral fora, and expressed resolution to further deepen coordination on multilateral issues to uphold common interests of developing countries and international equity and justice.\nThe two sides agreed to maintain close communication and coordination on the issue of Afghanistan, and play a constructive role in helping Afghanistan achieve stable development and integrate into the international community. The two sides reiterated their commitment to combating terrorism in all its forms and manifestations with a zero-tolerance attitude. They called on the Interim Afghan Government to take visible and verifiable actions to dismantle and eliminate all terrorist groups based in Afghanistan which continue to pose a serious threat to regional and global security, and to prevent the use of Afghan territory against other countries.\nThe two sides welcome the ceasefire agreement in Gaza, and hope that the agreement will be implemented effectively, leading to a full and permanent ceasefire in Gaza. The two sides reaffirmed their support for the right of the Palestinian people to self-determination, including their right to establish an independent State of Palestine. The two sides will work with international community to make unremitting effort for peace and stability in the Middle East.\nDuring the visit, the two sides signed more than a dozen documents covering cooperation on CPEC, trade, science and technology, people's livelihoods, and media, etc.\nPresident Zardari expressed appreciation to President Xi Jinping and the Chinese government and people for the warm hospitality extended to him and his delegation, and invited President Xi Jinping to visit Pakistan at a mutually-convenient created_at. The two sides agreed to maintain communication on the matter through diplomatic channels.\n"
  }
]