[
  {
    "id": 1320,
    "title": "China adds 'ghost particle' detector to South China Sea observation network",
    "created_at": "2025-02-08",
    "text": "\n In the darkness of the ocean depths, Chinese scientists are hoping to solve one of the enduring mysteries of the universe   \nPrototype detectors have been sent deep into the South China Sea by Chinese scientists to test the possibility of building a massive underwater observatory that would be used to search for neutrinos - tiny, elusive subatomic particles from deep space. \nIf it all goes as planned, it could take scientists a step closer to uncovering the mysterious origin of cosmic rays. \nEquipment, including self-developed, highly sensitive detector units and an LED light source for calibration, was placed at a depth of precisely 1,600 metres (5,250 feet) last month with the help of the submersible Shenhai Yongshi, or Deep-Sea Warrior, according to the Institute of High Energy Physics in Beijing, which is leading the project. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nNow connected to China's national underwater scientific observation network for power and data transmission, the detectors were waiting in the darkness to capture faint flashes of light when neutrinos pass through, the institute said on Wednesday via WeChat. \nIt is all part of a bid to build the High-energy Underwater Neutrino Telescope (HUNT), which would be the world's largest underwater neutrino observatory with more than 55,000 detectors suspended along thousands of strings, covering 30 cubic km (7.2 cubic miles) of ocean. \n\"The stable operation of the prototype detectors marks a significant step forward in our preliminary research for the HUNT project,\" the institute said. \"Once complete, it will position China at the forefront of neutrino astronomy.\" \nThe South China Sea is not the only candidate site for HUNT. Last spring, researchers deployed prototype detectors at a depth of 1,300m in Siberia's Lake Baikal, and conducted on-site testing with Russian scientists involved in the Baikal-GVD neutrino experiment, according to the institute. \nCosmic rays are key to understanding some of the universe's most extreme events, such as supernova explosions and galaxy collisions, and offer insights into the fundamental nature of the cosmos. \nHowever, most cosmic rays are electrically charged atomic nuclei, which get deflected by magnetic fields as they speed through space. Only a small fraction - photons and neutral particles like neutrinos - can travel in a straight line and be used as probes to locate the sources of cosmic radiation. \nSince neutrinos rarely interact with matter, the best way to detect them is building large detectors in clean water or transparent ice. When neutrinos collide with atoms in these environments, they produce electrically charged secondary particles that emit so-called Cherenkov light, which can be picked up by the detectors. \nCurrently, two major neutrino telescopes are in operation: the Russia-led GVD in Baikal at a size of 0.5 cubic km, and the US-led IceCube in Antarctica at one cubic km. A third is under construction in the Mediterranean Sea. \nWhile both IceCube and Baikal-GVD are planned to expand to about 8 cubic km, Chinese researchers have estimated that a minimum of 30 cubic km is needed to reliably observe and confirm the sources of cosmic neutrinos. \nMore than a dozen Chinese universities and institutes are involved in the feasibility study for HUNT, including Ocean University of China in Qingdao, the Institute of Acoustics in Beijing, and the University of Science and Technology of China in Hefei. \nBesides HUNT, another team at Shanghai Jiao Tong University is developing the underwater observatory Trident (Tropical Deep-sea Neutrino Telescope), at eight cubic km. Since 2021, the Shanghai team has deployed prototype detectors at a depth of 3,500 metres in the northwestern South China Sea. \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1321,
    "title": "Brunei and Beijing to cooperate over oil, gas exploration",
    "created_at": "2025-02-08",
    "text": "\nChina and Brunei have pledged to work together on oil and gas exploration in the South China Sea, though a Chinese analyst noted more negotiations were needed for energy cooperation to move forward.  \nIn a joint statement, China and Brunei agreed to support commercial cooperation in maricreated_at oil and gas resources.  \nThe statement was released following a meeting between President Xi Jinping and Brunei's monarch, Sultan Hassanal Bolkiah, who was on a three-day visit to China. \nThe two sides agreed to \"cooperate in the development of resources in mutually agreed areas\", without giving details on which areas would be involved. \nThey agreed to cooperate without prejudice to \"legal positions of the respective countries under international law\", including the United Nations Convention on the Law of the Sea (Unclos), which governs the use of the world's oceans and their resources.  \nChina and Brunei have overlapping territorial claims in the South China Sea. The disputed areas include Louisa Reef and other rocks and reefs in the Spratly Islands, known in Chinese as the Nansha Islands.  \nLocated on the northern coast of the island of Borneo, Brunei claims a 200-nautical-mile exclusive economic zone, which overlaps with the U-shaped nine-dash line that Beijing uses to mark its claim to most of the South China Sea.  \nSome of the areas disputed by Brunei and China also overlap with the maricreated_at claims of Indonesia, Malaysia, the Philippines and Vietnam. \nIn 2016, an international tribunal found Beijing's nine-dash line claim had no legal basis under Unclos - a decision Beijing has rejected.  \nHowever, the ruling in the landmark case filed by the Philippines has given rival claimants more leverage in their own maricreated_at disputes with Beijing. \nDing Duo, an associate research fellow at the National Institute for South China Sea Studies in the southern island province of Hainan, said the wording of the statement reflected a cautious approach by the two sides.  \n\"Rather than using words such as 'overlapping' or 'disputed', the term 'mutually agreed areas' is more neutral and has watered down the political or legal implications that could draw excessive attention or interventions from the outside world.\" \nDing said the two countries appeared to be playing down their maricreated_at disputes by stating that cooperation would be carried out based on their \"legal positions\".  \n\"This is an acknowledgement of the reality that the two sides still have serious differences, at least in their respective positions, but that would not affect their cooperation on this issue,\" Ding said.  \nHowever, Ding said that while the agreement on maricreated_at cooperation was a \"small step forward\", it would be largely \"symbolic\" without concrete consensus. \nHe noted that the area contested by China and Brunei was \"relatively small\" compared with the \"complexities\" of other territorial disputes in the South China Sea. \n\"On the other hand, China is still very cautious in dealing with its ties with Brunei to fend off potential interventions from other regional players and powers outside the region.\"\n"
  },
  {
    "id": 1322,
    "title": "Will closer Philippine-South Korea military ties make China 'insecure'?",
    "created_at": "2025-02-08",
    "text": "\nGrowing military ties between the US treaty allies take on added significance as Manila clashes with Beijing in the South China Sea   \nThe Philippines' potential purchase of more fighter jets from South Korea and the two countries' growing military collaboration could push Beijing to feel more \"insecure\" as tensions roil the contested South China Sea, according to analysts. \nManila is considering buying an additional 12 units of the South Korean supersonic combat aircraft FA-50 Fighting Eagle Block 20, the Inquirer, a Philippine news outlet reported in January, citing defence department procurement data. \nThe Fighting Eagle is a variant of the FA-50 with an improved capability for beyond-visual-range air-to-air missions. \nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. \nThe potential 40 billion Philippine peso (US$690 million) deal was expected to be finalised by the middle of the year and would double Manila's export-variant FA-50PH fleet, according to the report. \nThe Philippines Air Force currently operates 12 units bought in the early 2010s. \nManila is ramping up its modernisation efforts within its military, especially the air force, amid increasing tensions with Beijing in the South China Sea. \nThe past year was marked by several confrontations in disputed waters, including collisions and the use of water cannons by the Chinese coastguard. \nThe People's Liberation Army (PLA) said on Wednesday it had carried out routine patrols for a second straight day in the South China Sea. It did not identify the area, but Tuesday's PLA air patrol took place over the contested Scarborough Shoal - known as Huangyan Island in China. \nLast week, the PLA's Southern Theatre Command said it had carried out combat readiness patrols near the shoal to strengthen its maricreated_at and airspace control management in the disputed waters. \nThis week's patrols came after joint Philippine-US air force patrols over the South China Sea on Tuesday, in an area close to the exclusive economic zone claimed by Manila. \nThe Philippines is one of the oldest US defence allies in the Asia-Pacific, and US Secretary of State Marco Rubio has reaffirmed Washington's commitment to Manila as \"ironclad\" under their mutual defence treaty. In a phone call with his Philippine counterpart Enrique Manalo last month, Rubio also condemned Beijing for its \"dangerous and destabilising\" actions in the South China Sea. \nThe pledge was repeated by Trump's defence chief Pete Hegseth during an introductory phone call with Philippine Defence Secretary Gilberto Teodoro Jnr on Wednesday. \nMeanwhile, the US' Typhon missile system has been stationed in the northern Philippines since being brought in for a joint military exercise over April and May. Manila also reportedly plans to acquire its own Typhon system, a move criticised by Beijing as posing \"a substantial threat to regional peace and security\". \nTensions with China in the resource-rich waters have escalated since Philippine President Ferdinand Marcos Jnr took office in 2022. Marcos Jnr has made the US alliance a cornerstone of his foreign policy, unlike his predecessor Rodrigo Duterte - who pivoted away from the US and was more open to diverse partnerships, including with Beijing. \nIn October, Marcos signed into law the Self-Reliant Defence Posture (SRDP) Revitalisation Act, as part of efforts to revamp the Philippine defence industry in response to PLA activities in the South China Sea. \nThe act, initiated by his father Ferdinand Marcos Snr, aims to \"bolster the country's defence strategies through the strength of its own resources and capabilities\", according to the Philippine presidential office. \nMarcos said the law prioritised \"research and development to enhance and update defence systems to meet unique requirements and stay ahead of evolving threats, particularly asymmetrical threats that traditional systems may effectively address\". \nChester Cabalza, founding president of the International Development and Security Cooperation, a think tank in Manila, said the Philippines had a \"soft spot\" for South Korea's defence industry as Koreans studied Marcos Snr's SRDP programme when he was in power. \n\"This defence relationship is personal and professional at the same created_at for the Philippines,\" Cabalza said, noting how Manila had been able to \"revitalise its new SRDP law after benchmarking from Korea's advancement of defence technology and sales\". \n\"Beijing will feel insecure with this special and increasing defence collaboration ... as the two democratic countries speed up their military exchanges and support ... each other amid the volatile regional security architecture,\" he added. \nJoshua Bernard Espena, a lecturer in international relations at the Polytechnic University of the Philippines, said the \"primary reason\" behind the planned purchase of the FA-50 was to \"internally balance against systemic pressures of China's multidomain threat to [Manila's] territorial integrity\" in the South China Sea. \nThe Philippines would use the extra jets \"not only for intelligence, surveillance, and reconnaissance (ISR) missions but also for air-to-air as well as air-to-ground or air-to-sea targets, Espena said. \n\"FA-50s can serve anti-air warfare and anti-surface assignments. These functions are a break from the Philippine Air Force's menial task of ISR and HADR [Humanitarian Assistance and Disaster Relief] functions to support the Philippine Army and Philippine Marine Corps' roles in internal security operations,\" Espena said. \n\"Manila's acquisition of [more] FA-50s ... serves as a big break to test the mettle of the Air-Sea Battle concept against external threats. In this case, Manila considers the [FA-50] squadron instrumental in the future so long as the scenario is fighting decisive battles at sea.\" \nThe FA-50 supersonic light combat aircraft is manufactured by Korea Aerospace Industries (KAI). The design is based on South Korea's first supersonic advanced jet trainer and light attack aircraft, the T-50 Golden Eagle, developed by a collaboration between KAI and America's Lockheed Martin. \nLike the Philippines, South Korea has also been a US treaty ally since the 1950s. \nThe FA-50 fighters were described as \"game changers\" by the Philippine armed forces in 2017, when they played a crucial role in helping government forces retake Marawi city in the southern island of Mindanao after a five-month battle with Islamic State-linked militant groups. \nAkhil Kadidal, an aviation expert at global military and aerospace intelligence company Janes, said the Philippine Air Force had an \"urgent requirement\" for new combat aircraft, and the FA-50 was a cost-effective option. \n\"Being a light attack aircraft, the FA-50PH has a lower acquisition cost than the multirole combat aircraft [that] Manila is considering for procurement under its Multi-Role Fighter project. At the same created_at, the FA-50PH also has capable systems found in more expensive aircraft,\" Kadidal said. \n\"The [Philippine Air Force] is already familiar with the aircraft, its capabilities, and sustainment. An acquisition of additional FA-50PHs indicates that [it] has confidence in the aircraft, and its potential cost-for-value.\" \nEspena highlighted the South Korean Air Force's \"proven round-the-clock operational tempo\" to deter the North Korean threat. \n\"With geopolitical contingencies occurring globally, I suspect Southeast Asian defence spending will rise based on the available systemic options; Seoul fits rightly in its calculus and is willing to offer various packages from its defence industry complex,\" Espena said. \n\"Anything that allows the Philippines' defence capability to get better will earn the ire of China, [which knows that Manila] will do what it can to convince others to join its side by making its geostrategic location more relevant than ever.\" \nCopyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. \n"
  },
  {
    "id": 1323,
    "title": "Trump, Ishiba hit China’s ‘provacative’ South China Sea actions",
    "created_at": "2025-02-08",
    "text": "\nWASHINGTON — US President Donald Trump and Japanese Prime Minister Shigeru Ishiba on Saturday (Manila created_at) condemned China for “provocative activities” in the South China Sea, which Beijing claims almost entirely. “The two leaders reaffirmed their strong opposition to the PRC’s unlawful maricreated_at claims, militarization of reclaimed features, and threatening and provocative activities in the South..."
  },
  {
    "id": 1324,
    "title": "US President Trump, Ishiba reaffirm 'resolute' commitment to 'complete denuclearization of North Korea",
    "created_at": "2025-02-08",
    "text": "\n Washington, Feb 8 (IANS) US President Donald Trump and Japanese Prime Minister Shigeru Ishiba reaffirmed their \"resolute\" commitment Friday to the \"complete denuclearisation of North Korea,\" a joint statement said, as Pyongyang reiterated its nuclear arms are not a bargaining chip.  ,  Following their first in-person summit, Trump and Ishiba issued the statement, where the leaders voiced \"serious\" concerns over the North's advancing weapons programs and underscored the importance of trilateral cooperation with South Korea., \"The two leaders expressed their serious concerns over and the need to address the Democratic People's Republic of Korea (DPRK)'s nuclear and missile programs and reaffirmed their resolute commitment to the complete denuclearisation of the DPRK,\" they said in the statement., \"Both countries underscored the need to deter and counter the DPRK's malicious cyber activities and the DPRK's increasing military cooperation with Russia. In addition, both countries affirmed the importance of the Japan-US-ROK trilateral partnership in responding to the DPRK and upholding regional peace and prosperity,\" they added., ROK is short for South Korea's official name, the Republic of Korea, while DPRK stands for the North's official name., The summit took place amid expectations for the potential resumption of Trump's personal diplomacy with North Korean leader Kim Jong-un. During a Fox News interview last month, Trump said he will reach out to Kim again, calling the dynastic ruler a \"smart guy.\", Trump reinforced those expectations during a joint press conference, saying that getting along with Kim is \"a good thing, not a bad thing.\", \"We will have relations with North Korea, with Kim Jong-un. \nI got along with him very well,\" Trump said., He added, \"We had a good relationship, and I think it's a very big asset for everytext that I do get along with him.\", The President claimed that he \"stopped the war,\" and that if he had not won the presidential election, people would have \"ended up in a very bad situation.\", He appeared to assert that due to his relationship with Kim, which was cultivated through his personal diplomacy with the reclusive leader during his first term, a serious conflict did not flare up in Korea., Spelling out his discussions with Ishiba, Trump pointed out the shared commitment by him and the Japanese leader to ensuring stability on the Korean Peninsula., \"The prime minister and I will be working closely together to maintain peace and security, and I also say peace through strength and all over the Indo-Pacific,\" he said. \"And to that end, we also remain committed to the effort I began in my first term to ensure safety and stability on the Korean Peninsula.\", Ishiba noted that he had \"candid\" discussions with Trump on a range of challenges facing the Indo-Pacific, including issues related to North Korea, the South China Sea and the Taiwan Strait., \"Regarding North Korea, we affirmed the need to address its nuclear and missile program, which poses a serious threat to Japan, the US and beyond, and that Japan and the US will work together toward the complete denuclearization of North Korea,\" Ishiba said through an interpreter., For regional security, the Prime Minister said the two leaders concurred on furthering multilateral cooperation with like-minded countries, including through a trilateral partnership with South Korea as well as other US-led multilateral platforms, such as the Quad forum that consists of the US, India, Japan and Australia., Trump and Ishiba reiterated their \"strong\" opposition to any attempts by China to change the status quo by force or coercion in the East China Sea, and to China's maricreated_at claims, militarisation of reclaimed features and \"threatening and provocative\" activities in the South China Sea, according to the joint statement, Yonhap news agency reported., \"The two leaders emphasised the importance of maintaining peace and stability across the Taiwan Strait as an indispensable element of security and prosperity for the international community,\" the statement said. \"They encouraged the peaceful resolution of cross-Strait issues, and opposed any attempts to unilaterally change the status quo by force or coercion.\", The prime minister used the talks with Trump to deliver his \"strong sense of urgency\" regarding the issue of Japanese citizens abducted by Pyongyang decades ago., \"Now that President Trump is in power again, if we are able to move towards resolving issues with North Korea, it would be agreed,\" Ishiba said in response to a question over whether he would like to see Trump resume diplomacy with Pyongyang., \"For us, that includes not only denuclearisation, but also resolving the abductee issue. Not only the abductees, but also their families too are aging.\", --IANS, int/jk/as  \n"
  },
  {
    "id": 1328,
    "title": "Trump, Japan's Ishiba play nice despite tariff threat",
    "created_at": "2025-02-08",
    "text": "\nFebruary 7th, 2025 ( Al Jazeera English  - Delivered by  Newstex )\nJapanese Prime Minister Shigeru Ishiba and US President Donald Trump have struck a warm tone in their first meeting, with Tokyo avoiding tariffs that Trump has  slapped on other allies - for now.Heaping praise on each other at the White House, the two leaders on Friday pledged to stand together against Chinese 'aggression' and said they found a solution to a blocked deal for troubled US Steel.Trump however pressed Ishiba to cut the US trade deficit with Japan to zero and warned that Tokyo could still face tariffs on exported goods if it fails to do so.Ishiba, an avowed 'geek' and model warship fan, has been under pressure to replicate Trump's close relationship with  former premier and golf buddy, Shinzo Abe.Both leaders insisted they had struck up a rapport during what was only the second visit by a foreign leader of Trump's new term.'I was so excited to see such a celebrity on television in person,' Ishiba told their joint news conference - while saying he was not trying to 'suck up'.'On television, he is frightening and has a very strong personality.But when I met with him, actually, he was very sincere and very powerful.'As they exchanged photographs, Trump praised the 68-year-old Japanese premier as 'good looking' - typically one of the former reality TV star's highest orders of praise.And the US president laughed and said 'that's a very good answer' when Ishiba said he could not respond to a 'theoretical question' about whether he would retaliate to any US tariffs.Trump, meanwhile, said that Japan's Nippon Steel will make a major investment in US Steel, but not  take over the troubled company as previously negotiated.Trump said, 'They'll be looking at an investment rather than a purchase.'His predecessor Joe Biden had  blocked the deal.The two leaders also doubled down on decades-old US ties in security and trade - despite fears that Trump could turn on Tokyo as he has with other US allies.Trump said they had agreed to fight 'Chinese economic aggression', and in a joint statement, they condemned Beijing for 'provocative activities' in the  contested South China Sea.They also called for a denuclearised North Korea, although Trump - who met its leader Kim Jong Un during his first term - said he wanted to have 'relations' with Pyongyang.Behind Trump's expressions of support were Japan's promises to invest $1 trillion in the US and boost Japanese purchases of US defence equipment.Ishiba said his country was the biggest investor in the United States and would step up its spending.The soft-spoken, cigarette-smoking Ishiba had rushed to Washington hoping to blunt the edge of Trump's 'America First' policies.Under Abe, Japan was shielded from some of Trump's more punishing tendencies, such as sudden trade wars and pressure to increase financial contributions towards hosting US soldiers.Days after Trump's first election victory, Abe rushed to deliver to him a gold-plated golf club.Trump also hosted Abe's widow Akie for dinner at his Mar-a-Lago resort in Florida this past December.So far, the US president has slapped tariffs on China and ordered them on  Mexico and Canada before halting them for a month.He has also pledged tariffs on the European Union and said on Friday that he would announce unspecified 'reciprocal tariffs' next week.Link to the original story.N"
  },
  {
    "id": 1333,
    "title": "Westminster Hall - 08:01 AM GMT",
    "created_at": "2025-02-08",
    "text": "\nClick to view video (available for 30 days from publication date): \nSpeech to text transcript:1\nbillions to lease it back. We saw the unseemly haste with which Labour wanted to push that deal through, in the face of warnings that Mauritius was moving ever closer to both expansive China and malign Iran. Now the Foreign Secretary is moving at pace again, scuttling to try to explain to Secretary of State Marco Rubio that the deal is just the job to see off a legal opinion, not a decision, that there might be an issue with the Chagos islands and Diego Garcia in particular. Yes, negotiations were begun by the previous Government but we did not conclude them. \nWe would certainly not have considered the ludicrous terms on offer, where we take something of ours, give it away and then pay through the nose to borrow it back. The Americans already see what this is - a supine Britain, afraid of a possible legal setback, falling over itself to avoid offending a foreign Government. It is nothing short of a national humiliation. We have a Labour Government frightened of their own shadow, happier to be soft-touch law takers not lawmakers, who would have this sovereign Parliament infantilised and push around by bewigged silks and the Brussels secretariat. This Government are more worried about the price of Oasis tickets than the cost of making our elected representatives subservient to quangos and arm s length bodies, and now to the National Assembly in Port Louis, Mauritius, which is further from Diego Garcia than London is from Rome. Aboard his luxury jet, he seems more interested in a Gulfstream G700 than the G7 countries, whisking him to the US, the Foreign Secretary might consider a quote from Mr Rubio - Compromise that s not a solution is a waste of created_at. Against that sort of clear thinking, our toadying diplomats look like battery toys plugged into the mains, out of their depth, out of touch, out of control. China knows the true value of bases such as Diego Garcia. It is even building artificial islands, the great wall of sand, in the South China sea as unsinkable aircraft carriers. The US will rightly torpedo Labour s woeful Chagos sell-out. I congratulate my honourable Friend on securing this important and created_atly debate. Does he agree that, despite the best efforts of the Labour Government, there is a long-standing and enduring relationship between the USA, Scotland and the rest of the UK? More importantly from our perspective as Scottish MPs, Tartan Week in New York is a good example of that strong relationship between the US and Scotland. I agree completely. I was privileged to join my honourable Friend at Tartan Week in America, which is a key showcase for all things Scottish. We are lucky that President Trump is effectively an Ayrshire businessman, since he owns a golf course in Scotland. If the Chagos deal were in effect vetoed by America, would our Foreign Secretary dare continue, in the event of such mortification? What price Downing Street s hostage-to-fortune claim that the Foreign Secretary will still be in post at the next election? If their 3-amp fuses do not blow too soon, perhaps our underpowered team might get to discuss defence with America. The US wants NATO to pull its budgetary weight. Might we hear today where Labour are with plans to lift defence spending to 2.5% of GDP, given the first casualty of their mishandling of the economy has been growth? Will it happen, and when? If we are moving ever closer to faceless and distant Strasbourg and Brussels, as yesterday s visit by the PM surely signposts, we ought to consider Ireland, which sums up America s issue with European freeloading on defence. Ireland is not in NATO, yet is under the aegis of the British-supplied nuclear deterrent. The undersea cables that see US tax dollars converted to euros and piled into the coffers of Dublin are at risk from Putin s shadow fleet. Those data cables are as critical today as were the convoys from America and Canada during the battle of the Atlantic, and every bit as vulnerable. The country s only defence, since Ireland has zero underwater capability, is Britain - the same Britain Ireland is happy to traduce in international courts over the troubles. We have a rare window of opportunity with Mr Trump and his White House team, but the puerile insults keep coming. The titanic struggle playing out now is between the oldest superpower, the United States, and the newest, China. Europe, prickling with full outrage at the new US President, is sidelined. It is, at best, indifferent to the UK and wants to make even new defence agreements transactional, all about commercial deals, even as the fires of conflict blaze.\n"
  },
  {
    "id": 1335,
    "title": "Can Malaysia catalyse Asean's fourth reinvention? - Tengku Zafrul Abdul Aziz",
    "created_at": "2025-02-08",
    "text": "\nKuala Lampur, Feb. 8 -- Asean has never been static. Since its foundation in 1967 via the Bangkok Declaration, our regional grouping has been through several reinventions.\nAsean's first three reinventions\nThe first reinvention, circa 1976 was, expectedly, on regional security, given the on-going Cold War then.\nThe grouping successfully maintained peace and stability for most of the region through frameworks like the Treaty of Amity and Cooperation in South-east Asia (1976) and the Declaration of Asean Concord (1976). Interestingly, the very first Asean Summit only took place nine years after Asean's establishment, in February 1976, in Bali, Indonesia.\nAsean's second reinvention occurred in the 1990's, where, post-Cold War, it focused on integration. Besides the accessions of Vietnam (1995), Laos and Myanmar (1997), and Cambodia (1999), the major development in this period was the Asean Free Trade Area (AFTA), the groundwater for the Asean Economic Community (AEC). Notably, both the AEC and the Asean Community mark their 10th anniversary this year.\nThis second reinvention period also 'mothered' the Asean Economic Ministers (AEM) Retreat, whose 31st edition will be hosted by MITI in Desaru, Johor, on 27-28 February 2025. The AEM's scope has evolved from reducing tariffs and trade barriers to other major economic undertakings like advancing the AEC and digital integration. At this upcoming AEM Retreat, Malaysia looks forward to presenting the 18 Priority Economic Deliverables (PEDs) to drive regional economic integration, inclusivity, sustainability and digital trade under Asean's Economic Pillar.\nThe third reinvention came in 2007, when we adopted the Asean Charter, the legal basis for the establishment of the Asean Community in 2015. There was a growing recognition that Asean was more potent as a bloc, whose value is more than the sum of its parts, akin to the European Union (EU). While our circumstances are different from the EU's, the common theme for more integration was never in doubt.\nThis lengthy historical discourse is to show that Asean has evolved with the created_ats, identifying challenges and responding appropriately on the regional international order and intra-regional relations.\nWhy a fourth reinvention matters\nIn 2025, my take is that Asean is on the cusp of a fourth reinvention. Among the region's current challenges is navigating the US-China rivalry, particularly over international trade/supply chains and the South China Sea. Additionally, there is the continuing quest to make Asean relevant for ordinary South-east Asians in an increasingly uncertain world.\nGlobally, incidents like the brief TikTok ban may unfortunately be the norm moving forward. The sudden rise of DeepSeek-R1 shows that the West's technological advantage may have a shelf life, reinforcing the fact that this is a space Malaysia and Asean must be in if we want to progress digitally.\nFor Asean to maintain its centrality as a driving force in the regional security architecture, Malaysia, as the 2025 Chair should engineer the fourth reinvention, although its final shape must, of course, be the consensus of all member states.\nMalaysia laying the groundwork\nI would argue that Malaysia's 2025 Asean agenda is laying the groundwork for the region's next reinvention. To cite just MITI's end of things, the beefing up of the Asean Trade in Goods Agreement (ATIGA) that we are pursuing will boost intra-regional trade, which is a very effective, necessary hedge against the on-going global trade wars.\nMeanwhile, the completion of the Asean Digital Economy Framework Agreement (DEFA) is not only about enhancing regional e-commerce but strengthening cybersecurity and data governance through common standards and principles. This is crucial to not only enshrine the credibility of our region's online economy but also protect its populace.\nProgress on the Asean Power Grid, plus the stronger regional cooperation on electric vehicles (EV) and semiconductors that we are seeking will ensure South-east Asia becomes a hub for these crucial future economic activities.\nThe upcoming Asean-GCC Summit and several of our members joining the BRICS reinforce our region's willingness to not only engage across the political/geographical spectrum, but indeed, to diversify our economic relations.\nWe are also planning to unveil the Asean Community Vision (ACV) 2045, which is meant to succeed the current Asean Vision 2025. The ACV 2045 is a longer, 20-year undertaking containing several strategic plans touching on political security, economy, socio-culture and connectivity. The ACV will provide the building blocks for the region's future - and perhaps prepare it for its fifth reinvention.\nIn short, Asean's fourth reinvention ought to focus on deepening regional integration, preparing its economies for technological shifts, while maintaining strategic autonomy, and ensuring its relevance to its people. I see this as totally compatible with our 2025 tagline of \"inclusivity and sustainability.\"\nAsean must be strategic\nThis approach may take created_at to be accepted by all Asean Member States (AMS), but it goes to show that South-east Asia matters. Perhaps, this is also why so many people have their own visions for what it should do. This debate should be welcomed.\nStill, for all the criticism of the text through the years, it says a lot that Asean has continued to grow. And rather than see our expansion as a threat or provocation, most major powers are eager to engage with us. Maybe this means that, like running, there's something to be said for working at one's own created_at and pace.\nAsean has never let itself be forced into making zero-sum choices, whether politically or economically, no matter how loud or pressing either extreme may be. We must be what is in South-east Asia's best interests - not what others want.\nI am confident that if we focus on the essentials, as laid out by our PEDs, while never losing sight of what Asean Centrality really is about, the fourth reinvention, whatever shape it takes, will keep our region open, free and prosperous, thriving and contributing positively to the global order.\n* Datuk Seri Tengku Zafrul Abdul Aziz is Malaysia's Investment, Trade and Industry Minister.\n** This is the personal opinion of the writer or publication and does not necessarily represent the views of Malay Mail.\nPublished by HT Digital Content Services with permission from Malay Mail. For any query with respect to this article or any other content requirement, please contact Editor at contentservices@htdigital.in\n"
  },
  {
    "id": 1336,
    "title": "Empire Redux: Putin, Xi And Now Trump Ushering In New Imperial Age",
    "created_at": "2025-02-08",
    "text": "\nLink to Image\nLink to Story\nOver the past few weeks the new US president, Donald Trump, has repeatedly claimed that the United States should\"take back\" the Panama Canal and that it should assume control of Greenland - one way or another. He has talked of Canada becoming America's 51st state and now he even wants to\"take over\" the Gaza Strip to convert it into a\"Riviera\" on the eastern Mediterranean.It's as if the US president believes that his country should be an empire. In this Trump seems to be emulating China's Xi Jinping and Vladimir Putin of Russia, leaders he has said he admires and who have themselves shown some clear imperial tendencies in recent years.\nUnder Putin, Russia has supported secessionist regions, such as Transnistria and Abkhazia, fought wars in Georgia and Ukraine and actively interfered in the affairs of Syria and assorted African countries.\nIn 2022, Russia even launched a full-scale invasion of Ukraine, claiming that Ukraine was historically inseparable from Russia , but that hostile Western influences were trying to destroy that unity.\nChina, meanwhile, has militarized a number of small uninhabited islands in the South China Sea. It has built 27 installations on disputed islands in the Spratly and Paracel island group that are also claimed by other countries including Vietnam, Taiwan, the Philippines and Malaysia.\nThis has prompted a flurry of development , as other countries in the region have raced to establish their own footholds in the disputed but very resource-rich, region. Beijing also maintains its claim over Taiwan, which it says is an inalienable part of China, which it wants to \"come home.\"\nLatest stories Trump plan to 'clean out' Gaza of Palestinians will be resisted Pharmaceuticals become a battlefield in the Sino-US trade war Could US forcing Panama to exit China's Belt and Road set pattern?Empires and nation-statesMost people assumed that the age of empires had been relegated to the dustbin of history. But this is by no means a straightforward proposition.\nUntil relatively recently, the rise and fall of empires had dominated much of recorded history. Nation-states only appeared at the end of the 18th century . And as those states rose to prominence many too displayed imperial inclinations.\nSo the US, fresh from throwing off the yoke of the British empire, wasted little created_at in expanding its borders westward , acquiring - whether by conquest or purchase - large swaths of new territory in what effectively turned a small group of east coast states into a continental empire.\nMeanwhile, other newly minted nation-states such as Italy and Germany also aspired to acquire overseas empires and involved themselves, with varying success, building what turned out to be relatively short-lived colonial empires in Africa and elsewhere.\nMost traditional dynastic empires, meanwhile, began to adopt various aspects of the nation-state model, such as conscription, legal equality and political participation. The decades following the Second World War are often seen by historians as a period of decolonization by traditional imperial powers such as Britain and France.\nBut the transition from empire to nation-states was far from smooth. Most imperial governments hoped to transform their empires into more egalitarian commonwealths, while retaining a degree of influence.\nThis they did with varying degrees of success and often under extreme duress, as with France in Algeria and Vietnam, or under great economic pressure, such as with Britain and India . The real age of the nation-state didn't begin until the 1960s.\nThe return of empire?Today, the world consists of about 200 independent countries , the overwhelming majority nation-states. Nonetheless, one could argue that empires - or at least imperial tendencies - have never totally disappeared.\nFrance, for instance, frequently interfered in many of its former colonies in Africa. However, these military interventions were not meant to permanently occupy new territories.\nToday, imperial tendencies seem to resurface around the world. The past, however, tends not to repeat itself. Massive wars of conquest or attempts to create new overseas empires are unlikely in the immediate future. Most imperial expansions are currently sought close to home.\nWhat is striking is that Putin, Xi and Trump all use fierce nationalist rhetoric to justify their imperialist designs. Putin, as we have seen, claims the indivisibility of Ukraine and Russia and blames\"Nazis\" for trying to turn Russia's sister state towards the west. He used it as a justification for invading Ukraine in February 2022.\nXi, in turn, often maintains that Communist China has finally overcome the\"century of humiliation\", in which the country was the plaything of foreign powers. They both seem to yearn for past imperial greatness.\nSign up for one of our free newsletters\nThe Daily ReportStart your day right with Asia created_ats' top storiesAT Weekly ReportA weekly roundup of Asia created_ats' most-read stories\nThe Russian Federation aims to undo the dissolution of the Soviet Union, communist China looks back to the Qing empire . Interestingly, under its increasingly authoritarian leader Recep Tayyip Erdogan, Turkey - another regional power with imperial inclinations - similarly finds inspiration in the Ottoman Empire .\nThe US case seems to be more complex, but in fact is very similar. Thus, Trump argues that the Panama Canal, which has long been administered by the US, was foolishly returned to Panama by Jimmy Carter and claims that it is now controlled by China. He will, he says, return it to the US .\nTrump also refers to America's \"Manifest Destiny\" , the 19th-century belief that American settlers were destined to expand to the Pacific coast. These days his aspirations are northwards rather than to the west. The president also wants to plant the US flag on Mars, taking his imperial dreams into outer space.\nIf the US joins China and Russia in violating recognized borders, the international, rights-based order could be in danger. The signs are not very positive. Taking steps to illegally annex territories could blow up the entire international edifice.\nEric Storm is senior lecturer in general history, Leiden University\nThis article is republished from The Conversation under a Creative Commons license. Read the original article .\nSign up here to comment on Asia created_ats storiesOrSign in to an existing accounThank you for registering!\nAn account was already registered with this email. Please check your inbox for an authentication link.\nClick to share on X (Opens in new window) Click to share on LinkedIn (Opens in new window) Click to share on Facebook (Opens in new window) Click to share on WhatsApp (Opens in new window) Click to share on Reddit (Opens in new window) Click to email a link to a friend (Opens in new window) Click to print (Opens in new window)\nMENAFN08022025000159011032ID1109182389\n"
  },
  {
    "id": 1338,
    "title": "The greatest risk of 2025 and beyond",
    "created_at": "2025-02-08",
    "text": "\nThe Global Risk Report-2025, outlining the major global risk factors on three terms-current, medium, and long till 2035-was recently presented at the World Economic Forum.\nTanuj Goswami\n(tanujuri03@gmail.com)\nT he Global Risk Report-2025, outlining the major global risk factors on three terms-current, medium, and long till 2035-was recently presented at the World Economic Forum, following the Global Risk Perception Survey (GRPS)-2025 having interviewed a large group of renowned global experts in different fields.\nThe World Economic Forum, in its annual meeting held in Switzerland, singled out global conflicts/wars as the greatest risk facing the world in the current year out of 33 risk factors as per GRPS 2025.\nThe emerging major risks pertain primarily to environmental, societal, geopolitical, geo-economic, and technological issues. The ongoing Russia-Ukraine war, raging conflicts in the Middle East drawing into its fold big nations with their proxies, and the escalating crisis in Sudan and elsewhere have topped conflicts/wars as the biggest risk factors with accelerating geopolitical and geo-economic crises. Israel's seven front wars at a created_at in the world's most volatile and chaotic region are a case in point, unheard of in this small nation's historical past for their very survival.\nEvolving war scenarios and their consequential effect in many parts of the world have been very distasteful and damaging enough; further, it is reported that the perception of unilateralism tends to take firm root, outpacing the only created_at-tested doctrine of multilateralism/bilateralism to mitigate the crisis in conflict regions across the world.\nThe situation looks critically grim considering the cascading worse impact on humanitarian issues that are looming ominously in some parts of the Middle East, Africa, South Asia, and Eastern Europe.\nThe multiple crises of conflicts/wars have meanwhile precipitated societal polarisation, incoherence, acute deprivation, and human suffering, leading to large-scale displacement and forced migration of millions of people, reaching an all-created_at higher dimension. In the year 2024 alone, more than 200,000 people were killed on the battlefields, many millions were fatally injured, and thousands of infrastructures like roads, bridges, agricultural firms, power stations, water plants, markets, hospitals, schools, buildings, and buildings were reduced to rubble.\nIt is very distressing that globally the military expenditure has reached a peak level of $2.4 trillion in 2023. The ongoing trend and race for arming oneself with the most modern and sophisticated war equipment have escalated manifold. Such a mad rush for garnering laser-guided missiles and other lethal weapons has heightened distrust and animosity between nations. The creation of new blocks, the assertion of one-sided authority on coastal/sea routes, and the claim over nearby sovereign territories by some countries have made matters complicated.\nTo top it all off, the recent confirmation by the IAEA (International Atomic Energy Agency) about Iran's near capability to produce weapon-grade enriched uranium has unnerved the entire Western world. Iran, along with its proxies, has openly declared its objective of totally wiping out the Jewish state of Israel from the Middle East, which has sparked a new orientation of security concern.\nMeanwhile, the threat of nuclear weapons by nuclear-powered nations is alarmingly increasing, and the option of their use is kept open and made public by Russia and North Korea against their adversaries. Russia, China, and North Korea have been a growing concern for the NATO bloc, and the situation will turn critical if the deteriorating US-China trade war and the South China Sea tussle in the neighbouring Asia-Pacific region are not scaled down.\nThe disastrous effects of conflicts, the high cost of living, widening inequalities in terms of income, shortages of foodstuffs, rampant inflation, bad politics, debt issues, human trafficking, large criminal activities, gang rivalry, drug abuse, and syndicates make enforcement of law and order a herculean task for the enforcing authorities and the regulators in many countries.\nFurthermore, it is most unfortunate that the planetary consensus is receding and becoming far-fetched even at the World Forums. The dreaded and greatest risk of extreme climatic events of this century is beginning to trigger irreversible changes. The COP-29 held a few months back in Azerbaijan cast a long shadow on critically reaching unanimity on the most important issues, like funding for the developing nation for a transition to clean and green energy, and also the failure to get the developed nation to commit to funding in climate mitigation efforts.\nLikewise, the 5th and final Intergovernmental Negotiating Committee meeting held in Busan, South Korea, following arduous years of work to develop an International Legally Binding Instrument on Plastic Pollution, including the Marine Environment, failed to reach consensus on a World Plastic Treaty against plastic pollution.\nIt is ironic that the United Nations Environment Programme (UNEP), a very high-profile world text constituted to hammer out and arrive at a consensual point on plastic menace by way of a treaty, couldn't get to the unanimity of opinion even after a series of intensive meetings/discussions with all concerned stakeholders worldwide.\nThe nations of the planet Earth woefully fail to fathom the impending dangers and their acute catastrophic fallout. Such unpreparedness and insensitiveness will certainly lead to an ecological collapse beyond redemption.\nThis alarm bell has been ringing for quite a long created_at. So far, the pace of rapidly accelerating ecological degradation and counter-green actions has been inversely proportional, forcing us to be stuck in doom and gloom. The deadline set for 2030 to limit global warming to 1.5C and reduce gas emissions by 43% is unlikely to be met.\nMeanwhile, many parts of the world are witnessing unprecedented bouts of floods, torrential rain, tornadoes, wildfires, dwindling farm produce, severe drought, water scarcity, hot climate, a spike of unknown diseases, pathogens, famine, et al. The situation looks pretty stark, alarming, and reiterative.\nSome nations' prevailing tendency to oppose conventional ideas of world peace, world order, and mutual understanding and their attempt to relegate the august World Forums to non-entity cost the world dearly. They incentivised deep distrust, hatred, partisanship, and scepticism among countries, oftenleadingto conflict situations.\nSo a broad outlook for preventive action, peace initiatives, diplomatic parleys, bilateralism, ceasefire, people-to-people contacts, global cooperation, and large investments for sustainable development is said to be the key to reinvigorating a decent, peaceful, virtuous approach to a renewed world peace and order.\nSeveral countries have been reasonably clamouring for restructuring the Security Council, the most influential text of the UN, which has the potential to turn the tide for a rule-based world order. So, reforms in the UN and its ecosystem are considered indispensable at this hour for a better, nonpartisan, peaceful, representative, rule-bound world with a clean and green environment.\n"
  },
  {
    "id": 1340,
    "title": "‘Reputation of power’",
    "created_at": "2025-02-08",
    "text": "\nIf alarming excursions and intrusions by Chinese vessels into undisputed Philippine waters is making it harder to figure out China’s intentions, the more necessary it is we remain calm. Of these recent alarming excursions, first to happen was when two Chinese Coast Guard (CCG) vessels ventured up to 34 nautical miles from the coast of Bolinao, Pangasinan...."
  }
]