[
  {
    "id": 1359,
    "title": "A flurry of international naval drills prompts complaints from Beijing of collusion",
    "created_at": "2025-02-09",
    "text": "\nPhilippines\nA flurry of naval drills surrounding the Philippines involving the United States and its partners has prompted complaints from Beijing, which claims the entire South China Sea and accuses Manila of colluding with others to destabilise the region.\nThe US 7th Fleet based in Japan said forces from Australia, Japan, the Philippines, and the US conducted a \"multilateral Maricreated_at Co-operative Activity\" within the Philippines' Exclusive Economic Zone on Friday.\nSuch drills \"strengthen the interoperability of our defence/armed forces doctrines, tactics, techniques, and procedures,\" the fleet said in a news release. The manoeuvres were taking place within the Philippines' zone, but the fleet gave no details on the exact location.\nMore exercises involving the US, Japan and France were planned for later in the week in the Philippines Sea, which China does not claim.\nThat exercise \"is designed to advance co-ordination and co-operation between French, Japanese and US maricreated_at forces while simultaneously demonstrating capabilities in multi-domain operations\", the fleet said.\nThe US aircraft carrier Carl Vinson, French carrier Charles De Gaulle and Japan's Izumo-class multi-functional destroyer Kaga will take part in the drill starting today, along with their escorts and air wings, the fleet said.\nFrance's participation is especially significant because of the distance from its home base, 6000km away in Toulouse, commander of the Carrier Strike Group Rear Admiral Jacques Mallard was quoted as saying.\nMeanwhile, Tian Junli, spokesperson for China's Southern Theatre Command, accused the Philippines of \"colluding with outside countries to organise 'so-called joint patrols',\" which he said \"destabilise the region,\" Chinese state media said on Friday.\nTian said the Philippines' actions were \"an attempt to endorse its 'illegal claims' in the South China Sea and \"undermine China's maricreated_at rights and interests.\" He specifically pointed to US-Philippines joint patrols on Thursday and said China had carried out its own patrols in the region that day.\nChina is one of six regional powers that claims the strategic South China Sea in part or in whole, ignoring a ruling by a United Nations-backed court that tossed out most of its claims and building human-made islands equipped with airstrips and other infrastructure of military use. China's coast guard and maricreated_at militia frequently clash with ships from fellow claimants Vietnam and the Philippines.\nThough it claims not to disrupt shipping or overflights in the sea, through which an estimated US$5 trillion (NZ$8.8 trillion) in global trade transits each year, China is adamantly opposed to foreign military shipping in the area. The waterway is also believed to be sitting atop vast undersea deposits of oil and gas and while China says it wants to come to a negotiated agreement about the use of the sea, such efforts have made little progress.\nChina says the US and other countries that don't border on the sea should have no say in affairs concerning it, although the US - which takes no formal stand on sovereignty issues involving the sea - has maintained bases and alliances in the region long before China made its formal claim to sovereignty using the so-called \"eight dash line.\" - AP\n--------------------\nCAPTION:\nTwo Philippine Air Force FA-50 fighter jets alongside two US Air Force B-1 bombers during a joint patrol and training mission over the South China Sea. AP\n"
  },
  {
    "id": 1360,
    "title": "Philippines may buy more Korean jets",
    "created_at": "2025-02-09",
    "text": "\nThe Philippines' potential purchase of more fighter jets from South Korea and the two countries' growing military collaboration could push Beijing to feel more \"insecure\" as tensions roil the contested South China Sea, according to analysts. \nManila is considering buying an additional 12 units of the FA-50 Fighting Eagle Block 20, South Korea's supersonic combat aircraft, the Inquirer, a Philippine news outlet, reported in January, citing defence department procurement data. \nThe Fighting Eagle is a variant of the FA-50 with an improved capability for beyond-visual-range air-to-air missions. \nThe potential 40 billion Philippine peso (HK$5.37 billion) deal was expected to be finalised by the middle of the year and would double Manila's export-variant FA-50PH fleet, according to the report.  \nThe Philippine Air Force currently operates 12 units bought in the early 2010s. \nManila is ramping up its modernisation efforts within its military, especially the air force, amid increasing tensions with Beijing in the South China Sea. \nThe Philippines is one of the oldest US defence allies in the Asia-Pacific, and US Secretary of State Marco Rubio has reaffirmed Washington's commitment to Manila as \"ironclad\" under their mutual defence treaty.  \nTensions with China in the resource-rich waters have escalated since Philippine President Ferdinand Marcos Jnr took office in 2022. Marcos has made the US alliance a cornerstone of his foreign policy, unlike his predecessor Rodrigo Duterte - who pivoted away from the US and was more open to diverse partnerships, including with Beijing. \nIn October, Marcos signed into law the Self-Reliant Defence Posture (SRDP) Revitalisation Act, as part of efforts to revamp the Philippine defence industry in response to PLA activities in the South China Sea.  \nThe act, initiated by his father, Ferdinand Marcos Snr, aims to \"bolster the country's defence strategies through the strength of its own resources and capabilities\", according to the Philippine presidential office.  \nChester Cabalza, founding president of the International Development and Security Cooperation, a think tank in Manila, said the Philippines had a \"soft spot\" for South Korea's defence industry as Koreans studied Marcos Snr's SRDP programme when he was in power. \n\"This defence relationship is personal and professional at the same created_at for the Philippines,\" Cabalza said, noting how Manila had been able to \"revitalise its new SRDP law after benchmarking from Korea's advancement of defence technology and sales\".  \n\"Beijing will feel insecure with this special and increasing defence collaboration ... as the two democratic countries speed up their military exchanges and support ... each other amid the volatile regional security architecture,\" he added. \nJoshua Bernard Espena, a lecturer in international relations at the Polytechnic University of the Philippines, said the \"primary reason\" behind the planned purchase of the FA-50 was to \"internally balance against systemic pressures of China's multidomain threat to [Manila's] territorial integrity\" in the South China Sea. \nThe Philippines would use the extra jets \"not only for intelligence, surveillance, and reconnaissance (ISR) missions but also for air-to-air as well as air-to-ground or air-to-sea targets\", Espena said. \n\"FA-50s can serve anti-air warfare and anti-surface assignments. These functions are a break from the Philippine Air Force's menial task of ISR and HADR [Humanitarian Assistance and Disaster Relief] functions to support the Philippine Army and Philippine Marine Corps' roles in internal security operations,\" Espena said. \nThe FA-50 is manufactured by Korea Aerospace Industries. The design is based on South Korea's first supersonic advanced jet trainer and light attack aircraft, the T-50 Golden Eagle. \nThe FA-50 fighters were described as \"game changers\" by the Philippine armed forces in 2017, when they played a crucial role in helping government forces retake Marawi City on the southern island of Mindanao after a five-month battle with Islamic State-linked militant groups. \nAkhil Kadidal, an aviation expert at global military and aerospace intelligence company Janes, said the Philippine Air Force had an \"urgent requirement\" for new combat aircraft, and the FA-50 was a cost-effective option. \n\"Being a light attack aircraft, the FA-50PH has a lower acquisition cost than the multirole combat aircraft [that] Manila is considering for procurement under its Multi-Role Fighter project. At the same created_at, the FA-50PH also has capable systems found in more expensive aircraft,\" Kadidal said. \n\"The [Philippine Air Force] is already familiar with the aircraft, its capabilities, and sustainment. An acquisition of additional FA-50PHs indicates that [it] has confidence in the aircraft, and its potential cost-for-value.\" \n\"Anything that allows the Philippines' defence capability to get better will earn the ire of China, [which knows that Manila] will do what it can to convince others to join its side by making its geostrategic location more relevant than ever,\" Espena said.\n"
  },
  {
    "id": 1361,
    "title": "'Ghost particle' detectors added to observation network",
    "created_at": "2025-02-09",
    "text": "\nPrototype detectors have been sent deep into the South China Sea by Chinese scientists to test the possibility of building a ­massive underwater observatory that would be used to search for neutrinos - tiny, elusive sub­atomic particles from deep space. \nIf it all goes as planned, it could take scientists a step closer to uncovering the mysterious origin of cosmic rays. \nEquipment, including self- developed, highly sensitive detector units and an LED light source for calibration, was placed at a depth of precisely 1,600 metres last month with the help of the submersible Shenhai Yongshi, or Deep-Sea Warrior, according to the Institute of High Energy Physics in Beijing, which is leading the project. \nNow connected to China's national underwater scientific observation network for power and data transmission, the detectors were waiting in the darkness to capture faint flashes of light when neutrinos passed through, the institute said via WeChat. \nIt is all part of a bid to build the High-energy Underwater Neutrino Telescope (HUNT), which will be the world's largest underwater neutrino observatory with more than 55,000 detectors suspended along thousands of strings, covering 30 cubic km of ocean. \"The stable operation of the prototype detectors marks a ­significant step forward in our preliminary research for the HUNT project,\" the institute said.  \n\"Once complete, it will ­position China at the forefront of neutrino astronomy.\" \nThe South China Sea is not the only candidate site for HUNT.  \nLast spring, researchers deployed prototype detectors at a depth of 1,300 metres in Siberia's Lake Baikal, and conducted on-site testing with Russian scientists involved in the Baikal-GVD neutrino experiment, according to the institute. \nCosmic rays are key to understanding some of the universe's most extreme events, such as supernova explosions and galaxy collisions, and offer insights into the fundamental nature of the cosmos. However, most cosmic rays are electrically charged atomic nuclei, which get deflected by magnetic fields as they speed through space. Only a small fraction - photons and neutral particles such as neutrinos - can travel in a straight line and be used as probes to locate the sources of cosmic radiation.  \nSince neutrinos rarely interact with matter, the best way to detect them is building large detectors in clean water or transparent ice.  \nWhen neutrinos, or \"ghost particles\", collide with atoms in these environments, they produce electrically charged secondary particles that emit so-called Cherenkov light, which can be picked up by the detectors. \nCurrently, two major neutrino telescopes are in operation: the Russia-led GVD in Baikal at a size of 0.5 cubic km, and the United States-led IceCube in Antarctica at 1 cubic km.  \nA third is under construction in the Mediterranean Sea. \nWhile both IceCube and Baikal-GVD are planned to expand to about 8 cubic km, Chinese researchers have ­estimated a minimum of 30 cubic km is needed to reliably observe and confirm the sources of cosmic neutrinos. \nMore than a dozen Chinese universities and institutes are involved in the feasibility study for HUNT.\n"
  }
]